// Class /Script/FortniteGame.AthenaCapturePoint
// Size: 0xe60
class AAthenaCapturePoint : public ABuildingGameplayActor
{
	class UMaterialInstanceDynamic* HUDIndicatorMID; // 0x9d8 (0x8)
	struct FSlateBrush IndicatorBrush; // 0x9e0 (0xc0)
	struct FSlateBrush MapIconBrush; // 0xaa0 (0xc0)
	struct FSlateBrush CompassIconBrush; // 0xb60 (0xc0)
	int IconMaterialIndexParameter; // 0xc20 (0x4)
	bool bPermanentShutdown; // 0xc24 (0x1)
	unsigned char unreflected_c25[0x3]; // 0xc25 (0x3) 
	float ShutdownTime; // 0xc28 (0x4)
	unsigned char unreflected_c2c[0x4]; // 0xc2c (0x4) 
	class UFortSlateHUDIndicator* HUDIndicatorRef; // 0xc30 (0x8)
	struct FVector2D CurrHUDIndicatorSize; // 0xc38 (0x10)
	class UMaterialInstanceDynamic* CapturePointMIDNeutral; // 0xc48 (0x8)
	class UMaterialInstanceDynamic* CapturePointMIDAllyCaptured; // 0xc50 (0x8)
	class UMaterialInstanceDynamic* CapturePointMIDAllyCapping; // 0xc58 (0x8)
	class UMaterialInstanceDynamic* CapturePointMIDEnemyCaptured; // 0xc60 (0x8)
	class UMaterialInstanceDynamic* CapturePointMIDEnemyCapping; // 0xc68 (0x8)
	unsigned char bUseHUDIndicator; // 0xc70 (0x1)
	unsigned char unreflected_c71[0x3]; // 0xc71 (0x3) 
	struct FName HUDStyle; // 0xc74 (0x4)
	struct FVector HUDOffset; // 0xc78 (0x18)
	unsigned char bHUDClampToScreenEdge; // 0xc90 (0x1)
	unsigned char unreflected_c91[0x7]; // 0xc91 (0x7) 
	struct FVector2D MinHUDIndicatorSize; // 0xc98 (0x10)
	struct FVector2D MaxHUDIndicatorSize; // 0xca8 (0x10)
	float DistanceForMinHUDSize; // 0xcb8 (0x4)
	unsigned char unreflected_cbc[0x4]; // 0xcbc (0x4) 
	class UMaterialInstance* CapturePointMatNeutral; // 0xcc0 (0x8)
	class UMaterialInstance* CapturePointMatAllyCaptured; // 0xcc8 (0x8)
	class UMaterialInstance* CapturePointMatAllyCapping; // 0xcd0 (0x8)
	class UMaterialInstance* CapturePointMatEnemyCaptured; // 0xcd8 (0x8)
	class UMaterialInstance* CapturePointMatEnemyCapping; // 0xce0 (0x8)
	unsigned char unreflected_ce8[0x8]; // 0xce8 (0x8) 
	class UBoxComponent* StructuralComponent; // 0xcf0 (0x8)
	class UBoxComponent* CaptureComponent; // 0xcf8 (0x8)
	struct TArray<class AFortPlayerPawnAthena*> OverlappedAthenaPawns; // 0xd00 (0x10)
	unsigned char bActivated; // 0xd10 (0x1)
	unsigned char unreflected_d11[0x3]; // 0xd11 (0x3) 
	enum EContentionRuleType ContentionRules; // 0xd14 (0x1)
	unsigned char unreflected_d15[0x3]; // 0xd15 (0x3) 
	struct TArray<struct TEnumAsByte<EFortTeam>> TeamsBarredFromCapture; // 0xd18 (0x10)
	bool bSupportsPerPlayerCapturing; // 0xd28 (0x1)
	unsigned char unreflected_d29[0x7]; // 0xd29 (0x7) 
	struct FScalableFloat PercentIncreasePerPlayerCaptor; // 0xd30 (0x28)
	struct FScalableFloat BonusPercentIncreasePerPlayerCaptor; // 0xd58 (0x28)
	struct TArray<struct FScalableFloat> CaptureSpeedPerPlayerList; // 0xd80 (0x10)
	struct FScalableFloat PercentDecreaseNoCaptor; // 0xd90 (0x28)
	float CachedPercentIncreasePerPlayerCaptor; // 0xdb8 (0x4)
	float CachedBonusPercentIncreasePerPlayerCaptor; // 0xdbc (0x4)
	float CachedPercentDecreaseNoCaptor; // 0xdc0 (0x4)
	unsigned char unreflected_dc4[0x4]; // 0xdc4 (0x4) 
	struct TArray<float> CachedCaptureSpeedPerPlayerList; // 0xdc8 (0x10)
	unsigned char bLocked; // 0xdd8 (0x1)
	unsigned char unreflected_dd9[0x3]; // 0xdd9 (0x3) 
	float UnlockInterval; // 0xddc (0x4)
	enum ECapturePointUnlockRules UnlockRules; // 0xde0 (0x1)
	unsigned char unreflected_de1[0x3]; // 0xde1 (0x3) 
	int NumCapturingPoint; // 0xde4 (0x4)
	unsigned char TeamCapturingPoint; // 0xde8 (0x1)
	unsigned char TeamControllingPoint; // 0xde9 (0x1)
	unsigned char unreflected_dea[0x6]; // 0xdea (0x6) 
	class AFortTeamInfoAthena* TeamInfoControllingPoint; // 0xdf0 (0x8)
	unsigned char TeamOwningPoint; // 0xdf8 (0x1)
	enum ECapturePointState CaptureState; // 0xdf9 (0x1)
	unsigned char unreflected_dfa[0x2]; // 0xdfa (0x2) 
	float CapturePercentage; // 0xdfc (0x4)
	float ReplicatedCapturePercentage; // 0xe00 (0x4)
	unsigned char unreflected_e04[0x4]; // 0xe04 (0x4) 
	struct FMulticastInlineDelegate OnCapturePointStateChanged; // 0xe08 (0x10)
	struct FMulticastInlineDelegate OnTeamOwningPointChanges; // 0xe18 (0x10)
	struct FMulticastInlineDelegate OnCaptureLockEvent; // 0xe28 (0x10)
	struct FMulticastInlineDelegate OnCaptureLockBrokenEvent; // 0xe38 (0x10)
	unsigned char padding_e48[0x18]; // 0xe48 (0x18)

	/* Functions */

	// Function /Script/FortniteGame.AthenaCapturePoint.SetActivatedState (Underlying native function: SetActivatedState 0x8266e20)
	void SetActivatedState(bool& bInActivated); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnRep_ReplicatedCapturePercentage (Underlying native function: OnRep_ReplicatedCapturePercentage 0x82669d4)
	void OnRepReplicatedCapturePercentage(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnRep_IconMaterialIndexParameter (Underlying native function: OnRep_IconMaterialIndexParameter 0x8266894)
	void OnRepIconMaterialIndexParameter(); // (Final | Native | Public)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnRep_CaptureState (Underlying native function: OnRep_CaptureState 0x8266664)
	void OnRepCaptureState(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnRep_bPermanentShutdown (Underlying native function: OnRep_bPermanentShutdown 0x8266be8)
	void OnRepbPermanentShutdown(); // (Final | Native | Public)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnRep_bLocked (Underlying native function: OnRep_bLocked 0x8266bd4)
	void OnRepbLocked(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnRep_bActivated (Underlying native function: OnRep_bActivated 0x8266b80)
	void OnRepbActivated(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnLeaveCapturePoint (Underlying native function: OnLeaveCapturePoint 0x82662f8)
	void OnLeaveCapturePoint(class UPrimitiveComponent*& OverlappedComp, class AActor*& OtherActor, class UPrimitiveComponent*& OtherComp, int& OtherBodyIndex); // (Final | Native | Protected)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnEnterCapturePoint (Underlying native function: OnEnterCapturePoint 0x8266084)
	void OnEnterCapturePoint(class UPrimitiveComponent*& OverlappedComp, class AActor*& OtherActor, class UPrimitiveComponent*& OtherComp, int& OtherBodyIndex, bool& bFromSweep, struct FHitResult& SweepResult); // (Final | Native | Protected | HasOutParms)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnCapturePointStateChange (Underlying native function: OnCapturePointStateChange 0x8265fbc)
	void OnCapturePointStateChange(enum ECapturePointState& InState, unsigned char& InTeam); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnCapturePointLockStateChange (Underlying native function: OnCapturePointLockStateChange 0x8265f38)
	void OnCapturePointLockStateChange(bool& bInLocked); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.AthenaCapturePoint.OnCapturePointActiveStateChange (Underlying native function: OnCapturePointActiveStateChange 0x8265eb4)
	void OnCapturePointActiveStateChange(bool& bInActive); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.AthenaCapturePoint.HasDancingPlayer (Underlying native function: HasDancingPlayer 0x8265a00)
	bool HasDancingPlayer(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.AthenaCapturePoint.GetNumDancingPlayers (Underlying native function: GetNumDancingPlayers 0x82653dc)
	int GetNumDancingPlayers(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.AthenaCapturePoint.GetCaptureState (Underlying native function: GetCaptureState 0x8265278)
	enum ECapturePointState GetCaptureState(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)
};

