// BlueprintGeneratedClass /Game/Athena/Items/EnvironmentalItems/HidingProps/B_HidingProp.B_HidingProp_C
// Size: 0x13c3
class AB_HidingProp_C : public AFortHidingProp
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0xf40 (0x8)
	class USceneComponent* ProjectileLocationForwardVector; // 0xf48 (0x8)
	class UStaticMeshComponent* LandedOnCollisionMesh; // 0xf50 (0x8)
	class USphereComponent* Sphere; // 0xf58 (0x8)
	class USceneComponent* HideLocationForwardVector; // 0xf60 (0x8)
	float LootMovementTimelineForward0FC694AE4A45D691CB6BD5A8CD00E521; // 0xf68 (0x4)
	float LootMovementTimelineZ0FC694AE4A45D691CB6BD5A8CD00E521; // 0xf6c (0x4)
	struct TEnumAsByte<ETimelineDirection> LootMovementTimelineDirection0FC694AE4A45D691CB6BD5A8CD00E521; // 0xf70 (0x1)
	unsigned char unreflected_f71[0x7]; // 0xf71 (0x7) 
	class UTimelineComponent* LootMovementTimeline; // 0xf78 (0x8)
	struct FScalableFloat Enabled; // 0xf80 (0x28)
	struct FScalableFloat HidingEnabled; // 0xfa8 (0x28)
	struct FScalableFloat PlayerLimit; // 0xfd0 (0x28)
	struct FScalableFloat TeleportEnabled; // 0xff8 (0x28)
	struct FScalableFloat CanTeleport; // 0x1020 (0x28)
	struct TArray<class AFortPawn*> HidingPlayers; // 0x1048 (0x10)
	struct FGameplayTag EnterGameplayCue; // 0x1058 (0x4)
	struct FGameplayTag ExitGameplayCue; // 0x105c (0x4)
	struct FGameplayTag LandedOnGameplayCue; // 0x1060 (0x4)
	unsigned char unreflected_1064[0x4]; // 0x1064 (0x4) 
	class UMaterialInstanceDynamic* Mid; // 0x1068 (0x8)
	struct FGameplayTag RustleGameplayCue; // 0x1070 (0x4)
	struct FGameplayTag ExitGameplayCuePlayer; // 0x1074 (0x4)
	struct FGameplayTag WhileEnteringGameplayCue; // 0x1078 (0x4)
	unsigned char unreflected_107c[0x4]; // 0x107c (0x4) 
	double ObstructionTraceLength; // 0x1080 (0x8)
	struct TArray<struct TEnumAsByte<EObjectTypeQuery>> DestroyObjectTypes; // 0x1088 (0x10)
	struct TArray<class AFortPawn*> Array; // 0x1098 (0x10)
	int Int; // 0x10a8 (0x4)
	unsigned char unreflected_10ac[0x4]; // 0x10ac (0x4) 
	struct FVector DeimosPropSpawnerOffset; // 0x10b0 (0x18)
	bool FixedEntranceDirection; // 0x10c8 (0x1)
	unsigned char unreflected_10c9[0x7]; // 0x10c9 (0x7) 
	double MaxInteractAngle; // 0x10d0 (0x8)
	struct FVector WobbleLocationOffset; // 0x10d8 (0x18)
	double InteractBelowPropDistance; // 0x10f0 (0x8)
	struct TMap<class AFortPawn*, double> HiddenPlayersAndEnterTimes; // 0x10f8 (0x50)
	class AFortPawn* LastPawnToInteract; // 0x1148 (0x8)
	class AB_HidingProp_C* TargetTeleporter; // 0x1150 (0x8)
	struct FGameplayTag TeleporterEnterGameplayCue; // 0x1158 (0x4)
	struct FGameplayTag TeleporterExitGameplayCue; // 0x115c (0x4)
	struct FGameplayTag LoopingTeleportingCue; // 0x1160 (0x4)
	struct FGameplayTag GCWobble; // 0x1164 (0x4)
	struct FTimerHandle* WobbleTimerHandle; // 0x1168 (0x8)
	struct TArray<struct FGameplayTag> BlockEntranceTags; // 0x1170 (0x10)
	struct TArray<struct FGameplayTag> BlockExitTags; // 0x1180 (0x10)
	class UAnimMontage* EnterAnimMontage; // 0x1190 (0x8)
	class UAnimMontage* ExitAnimMontage; // 0x1198 (0x8)
	class AFortPawn* LastPawnToHide; // 0x11a0 (0x8)
	struct FGameplayTag TeleportingStateGC; // 0x11a8 (0x4)
	bool RandomWobbleNormal; // 0x11ac (0x1)
	bool SingleOccupant; // 0x11ad (0x1)
	bool Teleporting; // 0x11ae (0x1)
	bool JumpOut; // 0x11af (0x1)
	class UClass* GEOnExitingPropNoJumpBlockActions; // 0x11b0 (0x8)
	bool DestroyInNonSpyLTM; // 0x11b8 (0x1)
	bool ActiveInSpyLTM; // 0x11b9 (0x1)
	unsigned char unreflected_11ba[0x6]; // 0x11ba (0x6) 
	struct TArray<struct FGameplayTag> ForceAllowInteractTags; // 0x11c0 (0x10)
	struct FGameplayTag IsTeleporter; // 0x11d0 (0x4)
	struct FGameplayTag ContainsPlayerRepNof; // 0x11d4 (0x4)
	struct FVector ObstructionTraceExtents; // 0x11d8 (0x18)
	struct FVector ObstructionTraceStartOffSet; // 0x11f0 (0x18)
	double ExitLaunchVelocity; // 0x1208 (0x8)
	struct FVector AdditionalLaunchVelocity; // 0x1210 (0x18)
	struct FVector FixedEntraceObstructionTraceEndOffset; // 0x1228 (0x18)
	bool isActiveTeleportExit; // 0x1240 (0x1)
	unsigned char unreflected_1241[0x7]; // 0x1241 (0x7) 
	class UClass* GETeleportAbilityGranted; // 0x1248 (0x8)
	bool DisableWhenSubmergedInWater; // 0x1250 (0x1)
	unsigned char unreflected_1251[0x7]; // 0x1251 (0x7) 
	struct FGameplayTagContainer DisableWhenSubmergedExceptionTags; // 0x1258 (0x20)
	struct TArray<class AFortPawn*> NonCosmeticPawns; // 0x1278 (0x10)
	class UClass* CameraModifier; // 0x1288 (0x8)
	struct FVector NewVar0; // 0x1290 (0x18)
	class AActor* Pawn; // 0x12a8 (0x8)
	struct FVector LootCachedActorForward; // 0x12b0 (0x18)
	struct TArray<struct FVector> LootVectorOffsets; // 0x12c8 (0x10)
	bool SpawnedLoot; // 0x12d8 (0x1)
	unsigned char unreflected_12d9[0x7]; // 0x12d9 (0x7) 
	double LootMoveForwardDistance; // 0x12e0 (0x8)
	double LootMoveUpDistance; // 0x12e8 (0x8)
	double LootSpawnRadius; // 0x12f0 (0x8)
	struct FVector LootSpawnOffset; // 0x12f8 (0x18)
	bool ShouldSpawnLoot; // 0x1310 (0x1)
	unsigned char unreflected_1311[0x7]; // 0x1311 (0x7) 
	struct FString LootTierGroup; // 0x1318 (0x10)
	bool SetEntranceRotation; // 0x1328 (0x1)
	unsigned char unreflected_1329[0x7]; // 0x1329 (0x7) 
	class UClass* PropSpecificEffectToApplyToHiders; // 0x1330 (0x8)
	struct FScalableFloat RustlesPerWobble; // 0x1338 (0x28)
	struct FScalableFloat RustleWobbleRadius; // 0x1360 (0x28)
	struct FScalableFloat EnterWobbleRadius; // 0x1388 (0x28)
	double NonJumpExitDistance; // 0x13b0 (0x8)
	class UClass* CameraMode; // 0x13b8 (0x8)
	bool MoveToActorOnEnter; // 0x13c0 (0x1)
	bool IgnorePhysicsBodyCollisionOnEnter; // 0x13c1 (0x1)
	bool bCanRustleAndWobble; // 0x13c2 (0x1)

	/* Functions */

	// Function /Game/Athena/Items/EnvironmentalItems/HidingProps/B_HidingProp.B_HidingProp_C.Can Hide by Falling (Has no native function)
