// BlueprintGeneratedClass /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C
// Size: 0x18a0
class AB_Ranged_Generic_C : public AFortWeaponRanged
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x1560 (0x8)
	class UNiagaraComponent* ReloadNiagaraEmpty; // 0x1568 (0x8)
	class UParticleSystemComponent* ReloadEmpty; // 0x1570 (0x8)
	class UParticleSystemComponent* MuzzleEmpty; // 0x1578 (0x8)
	float AnimateScopePostProcessDownSightPostProcessAmount393D8BA5486879173797EF8C9B8D4642; // 0x1580 (0x4)
	struct TEnumAsByte<ETimelineDirection> AnimateScopePostProcessDirection393D8BA5486879173797EF8C9B8D4642; // 0x1584 (0x1)
	unsigned char unreflected_1585[0x3]; // 0x1585 (0x3) 
	class UTimelineComponent* AnimateScopePostProcess; // 0x1588 (0x8)
	class UParticleSystem* MuzzleParticleSystem; // 0x1590 (0x8)
	class UParticleSystem* WeaponDurabilityDestroyEffect; // 0x1598 (0x8)
	class UParticleSystem* WeaponDurabilityDestroyEffectIcon; // 0x15a0 (0x8)
	bool UseDestroyEffect; // 0x15a8 (0x1)
	bool UseReloadParticles; // 0x15a9 (0x1)
	unsigned char unreflected_15aa[0x6]; // 0x15aa (0x6) 
	class UParticleSystem* ReloadParticleSystem; // 0x15b0 (0x8)
	double LastPlayFXTime; // 0x15b8 (0x8)
	double MinPlayFXTime; // 0x15c0 (0x8)
	bool UseShellsOnFire; // 0x15c8 (0x1)
	bool UseShellsOnReload; // 0x15c9 (0x1)
	bool UseShellsOnPump; // 0x15ca (0x1)
	unsigned char unreflected_15cb[0x1]; // 0x15cb (0x1) 
	struct FName ReloadSocketName; // 0x15cc (0x4)
	struct TArray<class AFortAIPawn*> ArrayOfActiveEnemyAI; // 0x15d0 (0x10)
	bool ScopeRenderEnemiesToCustomDepthBuffer; // 0x15e0 (0x1)
	unsigned char unreflected_15e1[0x3]; // 0x15e1 (0x3) 
	struct FName ShellsSocketName; // 0x15e4 (0x4)
	struct TEnumAsByte<En_ShellTypes_01> ShellTypeSelect; // 0x15e8 (0x1)
	unsigned char unreflected_15e9[0x7]; // 0x15e9 (0x7) 
	double ShellsSpawnRateScale; // 0x15f0 (0x8)
	struct FVector ShellsRotationRate; // 0x15f8 (0x18)
	struct FVector ShellsVelocity; // 0x1610 (0x18)
	struct FVector ShellsGravity; // 0x1628 (0x18)
	struct FVector ShellsSize; // 0x1640 (0x18)
	double TargetScopeVignetteBlurScreenPercentage; // 0x1658 (0x8)
	double ScopeCameraOffsetX; // 0x1660 (0x8)
	double ScopeCameraOffsetY; // 0x1668 (0x8)
	double ScopeCameraOffsetAmount; // 0x1670 (0x8)
	double InheritParentVelocity; // 0x1678 (0x8)
	double CylindricalRadius; // 0x1680 (0x8)
	double CylindricalHeight; // 0x1688 (0x8)
	struct FLinearColor ShellColor; // 0x1690 (0x10)
	class UNiagaraComponent* SpawnedShells; // 0x16a0 (0x8)
	bool DebugShellsSocket; // 0x16a8 (0x1)
	unsigned char unreflected_16a9[0x7]; // 0x16a9 (0x7) 
	class USoundBase* SoundScopeZoomIn; // 0x16b0 (0x8)
	class USoundBase* SoundScopeZoomOut; // 0x16b8 (0x8)
	class UParticleSystemComponent* AlterationAmbientPS; // 0x16c0 (0x8)
	struct FGameplayTagContainer ReticleHUDElementTags; // 0x16c8 (0x20)
	bool IsWindEnabled; // 0x16e8 (0x1)
	unsigned char unreflected_16e9[0x7]; // 0x16e9 (0x7) 
	class UParticleSystem* MuzzleWindParticleSystem; // 0x16f0 (0x8)
	class UParticleSystem* MuzzleParticleSystem1P; // 0x16f8 (0x8)
	bool ShouldHideReticleAfterDelay; // 0x1700 (0x1)
	unsigned char unreflected_1701[0x7]; // 0x1701 (0x7) 
	class UParticleSystemComponent* MuzzleWindParticleSpawned; // 0x1708 (0x8)
	int StencilBufferValue; // 0x1710 (0x4)
	unsigned char unreflected_1714[0x4]; // 0x1714 (0x4) 
	class UCurveFloat* CurvePitchOffset; // 0x1718 (0x8)
	class USoundBase* SoundScopedInLoop; // 0x1720 (0x8)
	class UAudioComponent* ScopeZoomInComp; // 0x1728 (0x8)
	class UAudioComponent* ScopedInLoopComp; // 0x1730 (0x8)
	class UAudioComponent* ScopeZoomOutComp; // 0x1738 (0x8)
	double AlterationAmbientPSMaxDrawDistance; // 0x1740 (0x8)
	double MuzzlePSMaxDrawDistance; // 0x1748 (0x8)
	double BeamPSMaxDrawDistance; // 0x1750 (0x8)
	double ReloadPSMaxDrawDistance; // 0x1758 (0x8)
	double ShellsPSMaxDrawDistance; // 0x1760 (0x8)
	struct FMulticastInlineDelegate onAimDownSightsChanged; // 0x1768 (0x10)
	bool IsMuzzleNiagara; // 0x1778 (0x1)
	unsigned char unreflected_1779[0x7]; // 0x1779 (0x7) 
	class UNiagaraSystem* MuzzleNiagaraSystemInstance; // 0x1780 (0x8)
	struct TWeakObjectPtr<class UNiagaraSystem> MuzzleNiagaraSystemAsset; // 0x1788 (0x28)
	class UNiagaraComponent* MuzzleNiagaraComponentInstance; // 0x17b0 (0x8)
	struct TArray<class UParticleSystemComponent*> MuzzleParticleSystemComponents; // 0x17b8 (0x10)
	double MuzzleChanceOfLargeFlash; // 0x17c8 (0x8)
	double MuzzleFlashLargeMinScale; // 0x17d0 (0x8)
	double MuzzleFlashLargeMaxScale; // 0x17d8 (0x8)
	double MuzzleFlashSmallMinScale; // 0x17e0 (0x8)
	double MuzzleFlashSmallMaxScale; // 0x17e8 (0x8)
	struct FTimerHandle* ScopeEffectDelay1Handle; // 0x17f0 (0x8)
	struct FTimerHandle* ScopeEffectDelay2Handle; // 0x17f8 (0x8)
	struct FScalableFloat UseNativeFX; // 0x1800 (0x28)
	bool IsReloadNiagara; // 0x1828 (0x1)
	unsigned char unreflected_1829[0x7]; // 0x1829 (0x7) 
	class UNiagaraSystem* ReloadNiagaraAsset; // 0x1830 (0x8)
	struct FScalableFloat UseUpdatedFeedback; // 0x1838 (0x28)
	struct FMulticastInlineDelegate OnStartFiring; // 0x1860 (0x10)
	struct FMulticastInlineDelegate OnPersistentFireStopped; // 0x1870 (0x10)
	class UStaticMesh* ScopeMesh; // 0x1880 (0x8)
	class UStaticMeshComponent* ScopeMesh1PSpawned; // 0x1888 (0x8)
	struct TArray<class UMaterialInterface*> ScopeMaterialOverrides; // 0x1890 (0x10)

	/* Functions */

	// Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C.StopLocalForceFeedback (Has no native function)
	void StopLocalForceFeedback(class UForceFeedbackEffect*& ForceFeedbackEffect, struct FName& tag, class AController*& CallFuncGetInstigatorControllerReturnValue, bool& CallFuncIsValidReturnValue, class APlayerController*& K2NodeDynamicCastAsPlayerController, bool& K2NodeDynamicCastbSuccess, bool& CallFuncIsLocalControllerReturnValue); // (Public | BlueprintCallable | BlueprintEvent)

	// Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C.PlayLocalForceFeedback (Has no native function)
