// BlueprintGeneratedClass /Game/Athena/AI/NPCs/Base/BP_PlayerPawn_NonParticipant.BP_PlayerPawn_NonParticipant_C
// Size: 0x60e8
class ABP_PlayerPawn_NonParticipant_C : public ABP_PlayerPawn_Athena_Phoebe_C
{
	unsigned char unreflected_5f24[0x4]; // 0x5f24 (0x4) 
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x5f28 (0x8)
	class UFortAthenaAlertStateComponent* FortAthenaAlertState; // 0x5f30 (0x8)
	class UAudioComponent* VOAudioComponent; // 0x5f38 (0x8)
	bool UseAlertness; // 0x5f40 (0x1)
	bool UseVO; // 0x5f41 (0x1)
	bool UseIdleVO; // 0x5f42 (0x1)
	bool UseDropExtraLootOnDeath; // 0x5f43 (0x1)
	bool UseFullBodyHitReact; // 0x5f44 (0x1)
	enum EAlertLevel AlertLevel; // 0x5f45 (0x1)
	enum EAlertLevel OldAlertLevel; // 0x5f46 (0x1)
	unsigned char unreflected_5f47[0x1]; // 0x5f47 (0x1) 
	struct FGameplayTag GameplayCueAlertState; // 0x5f48 (0x4)
	unsigned char unreflected_5f4c[0x4]; // 0x5f4c (0x4) 
	class UClass* GENPCStatusStressedInfinite; // 0x5f50 (0x8)
	class UClass* GENPCStatusStressedCooldown; // 0x5f58 (0x8)
	double MinDistanceToTargetToPlayCombatAlertAnimation; // 0x5f60 (0x8)
	struct FScalableFloat MinIdleVODelay; // 0x5f68 (0x28)
	struct FScalableFloat MaxIdleVODelay; // 0x5f90 (0x28)
	struct FName LootTierNameToSpawnWhenDead; // 0x5fb8 (0x4)
	struct FName LootTierMedium; // 0x5fbc (0x4)
	struct FName LootTierShell; // 0x5fc0 (0x4)
	struct FName LootTierHeavy; // 0x5fc4 (0x4)
	struct FName LootTierLight; // 0x5fc8 (0x4)
	struct FName LootTierRockets; // 0x5fcc (0x4)
	class UFortGameplayDataTrackerComponentManager* DataTrackerComponentManager; // 0x5fd0 (0x8)
	struct FGameplayTag AlertLevelUnawareTag; // 0x5fd8 (0x4)
	struct FGameplayTag AlertLevelAlertedTag; // 0x5fdc (0x4)
	struct FGameplayTag AlertLevelAggressiveTag; // 0x5fe0 (0x4)
	struct FGameplayTag TCDisguiseTag; // 0x5fe4 (0x4)
	class UClass* GERemoveDisguise; // 0x5fe8 (0x8)
	class UFortAbilitySet* HitReactAbilitySet; // 0x5ff0 (0x8)
	class UAnimMontage* DefaultFullbodyHitReactionMontage; // 0x5ff8 (0x8)
	class UFortPatrolAnimAsset* CurrentPatrolAnimAsset; // 0x6000 (0x8)
	class UClass* PatrolLayerAnimBP; // 0x6008 (0x8)
	struct TArray<struct FFortPatrolAnimSetWeaponPair> PatrolAnimSetPairs; // 0x6010 (0x10)
	bool bShouldDoFullAnimationUpdate; // 0x6020 (0x1)
	unsigned char unreflected_6021[0x3]; // 0x6021 (0x3) 
	struct FActiveGameplayEffectHandle* GEDuelHandle; // 0x6024 (0x8)
	unsigned char unreflected_602c[0x4]; // 0x602c (0x4) 
	class UClass* GEDuelTag; // 0x6030 (0x8)
	class AFortPlayerPawn* Challenger; // 0x6038 (0x8)
	class UClass* OverrideLayerAnimBP; // 0x6040 (0x8)
	class UFortPatrolAnimAsset* FallbackPatrolAnimAsset; // 0x6048 (0x8)
	bool QuantizeVOToMusic; // 0x6050 (0x1)
	unsigned char unreflected_6051[0x7]; // 0x6051 (0x7) 
	struct FQuartzQuantizationBoundary QuantizationBoundary; // 0x6058 (0x20)
	struct FName VOQuantizationClockName; // 0x6078 (0x4)
	bool bIsInVehicleThatSupportsNoAlertState; // 0x607c (0x1)
	unsigned char unreflected_607d[0x3]; // 0x607d (0x3) 
	struct FActiveGameplayEffectHandle* GEQuestConvertedHandle; // 0x6080 (0x8)
	class UClass* GEQuestConvertedHireNPC; // 0x6088 (0x8)
	class USoundBase* DeathFXSound; // 0x6090 (0x8)
	class AFortPawn* PawnConverter; // 0x6098 (0x8)
	struct FGameplayTagContainer TagsToApplyOnConvertedPawn; // 0x60a0 (0x20)
	struct FGameplayTagContainer TagsToApplyOnConvertingPawn; // 0x60c0 (0x20)
	class USoundLibrary* PawnSoundLibrary; // 0x60e0 (0x8)

	/* Functions */

	// Function /Game/Athena/AI/NPCs/Base/BP_PlayerPawn_NonParticipant.BP_PlayerPawn_NonParticipant_C.SoundLibrarySetup (Has no native function)
	void SoundLibrarySetup(bool& IsAdding, class USoundLibrarySubsystem*& CallFuncGetWorldSubsystemReturnValue, bool& CallFuncIsValidReturnValue, bool& CallFuncIsValidReturnValue1, bool& CallFuncIsValidReturnValue2); // (Public | BlueprintCallable | BlueprintEvent)

	// Function /Game/Athena/AI/NPCs/Base/BP_PlayerPawn_NonParticipant.BP_PlayerPawn_NonParticipant_C.HandlePawnUnconverted (Has no native function)
