// BlueprintGeneratedClass /FortWater/FluidSimulation/Blueprints/BP_FluidSim_01.BP_FluidSim_01_C
// Size: 0x568
class ABP_FluidSim_01_C : public AActor
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x288 (0x8)
	class UStaticMeshComponent* DebugPlane; // 0x290 (0x8)
	class USceneComponent* DefaultSceneRoot; // 0x298 (0x8)
	class UMaterialInstanceDynamic* RippleSimMID; // 0x2a0 (0x8)
	class UMaterialInstanceDynamic* RenderNormalsMID; // 0x2a8 (0x8)
	class UMaterialInstanceDynamic* DisplayMID; // 0x2b0 (0x8)
	class UMaterialInstanceDynamic* DisplayBottomMID; // 0x2b8 (0x8)
	class UMaterialInstanceDynamic* CrossSectionMID; // 0x2c0 (0x8)
	struct TArray<class UTextureRenderTarget2D*> RippleRTs; // 0x2c8 (0x10)
	class UMaterialInterface* DisplayMaterial; // 0x2d8 (0x8)
	double VirtualFPS; // 0x2e0 (0x8)
	int Passes; // 0x2e8 (0x4)
	unsigned char unreflected_2ec[0x4]; // 0x2ec (0x4) 
	double TimeAccumulator; // 0x2f0 (0x8)
	double FixedStep; // 0x2f8 (0x8)
	bool Enabled; // 0x300 (0x1)
	unsigned char unreflected_301[0x7]; // 0x301 (0x7) 
	double FluidSize; // 0x308 (0x8)
	int Resolution; // 0x310 (0x4)
	struct TEnumAsByte<FluidBoundary> BoundaryCondition; // 0x314 (0x1)
	unsigned char unreflected_315[0x3]; // 0x315 (0x3) 
	double TravelSpeed; // 0x318 (0x8)
	double Damping; // 0x320 (0x8)
	class UTextureRenderTarget2D* NormalRT; // 0x328 (0x8)
	struct FVector CutPos; // 0x330 (0x18)
	struct FVector PrevLoc; // 0x348 (0x18)
	struct FVector PrecLoc2; // 0x360 (0x18)
	struct FVector PrevOffset; // 0x378 (0x18)
	struct FVector PrevOffset2; // 0x390 (0x18)
	struct FVector GridCenter; // 0x3a8 (0x18)
	class UTextureRenderTarget2D* TempRT; // 0x3c0 (0x8)
	class UTextureRenderTarget2D* ForcesRT; // 0x3c8 (0x8)
	double ApplyForces; // 0x3d0 (0x8)
	class ALandscapeWaterInfo_C* LandscapeWaterInfo; // 0x3d8 (0x8)
	int RendersPerFrame; // 0x3e0 (0x4)
	bool ShowCrossSection; // 0x3e4 (0x1)
	bool PerfTestMode; // 0x3e5 (0x1)
	unsigned char unreflected_3e6[0x2]; // 0x3e6 (0x2) 
	class UTextureRenderTarget2D* PerfRT; // 0x3e8 (0x8)
	struct TArray<struct FFluidForceImpulsePerInstanceData> ImpulseForces; // 0x3f0 (0x10)
	struct TMap<class UActorComponent*, struct FFluidForceDynamicPerInstanceData> DynamicForces; // 0x400 (0x50)
	struct TMap<class UMaterialInterface*, class UMaterialInstanceDynamic*> ForceParentAndMIDMap; // 0x450 (0x50)
	bool ShowSimulationMesh; // 0x4a0 (0x1)
	unsigned char unreflected_4a1[0x7]; // 0x4a1 (0x7) 
	class UStaticMeshComponent* FluidDisplayMesh; // 0x4a8 (0x8)
	class UStaticMeshComponent* CrossSectionMesh; // 0x4b0 (0x8)
	double FluidSizeSquared; // 0x4b8 (0x8)
	bool LocalPawnRef; // 0x4c0 (0x1)
	bool DebugText; // 0x4c1 (0x1)
	unsigned char unreflected_4c2[0x2]; // 0x4c2 (0x2) 
	int PawnCheckEveryNFrames; // 0x4c4 (0x4)
	struct TMap<class UActorComponent*, struct FFluidForceDynamicPerInstanceData> ProjectileForces; // 0x4c8 (0x50)
	bool FollowPlayer; // 0x518 (0x1)
	unsigned char unreflected_519[0x3]; // 0x519 (0x3) 
	int FramesSinceLastActiveForce; // 0x51c (0x4)
	bool UseTerrainWaterSystem; // 0x520 (0x1)
	unsigned char unreflected_521[0x7]; // 0x521 (0x7) 
	class UMaterialInstanceDynamic* PhysicsForceMID; // 0x528 (0x8)
	bool AddPhysicsForces; // 0x530 (0x1)
	unsigned char unreflected_531[0x7]; // 0x531 (0x7) 
	class UTexture* WaterVelocityTexture; // 0x538 (0x8)
	bool UpdateForcesInFixedTimeStep; // 0x540 (0x1)
	bool UpdateSimInFixedTimeStep; // 0x541 (0x1)
	bool UpdateNormalInFixedTimeStep; // 0x542 (0x1)
	bool ShowDebugWaterPlane; // 0x543 (0x1)
	unsigned char unreflected_544[0x4]; // 0x544 (0x4) 
	class UMaterialInstanceDynamic* DebugWaterPlaneMID; // 0x548 (0x8)
	class UTextureRenderTarget2D* DebugRippleRT1; // 0x550 (0x8)
	class UTextureRenderTarget2D* DebugRippleRT2; // 0x558 (0x8)
	class UTextureRenderTarget2D* DebugRippleRTCurrent; // 0x560 (0x8)

	/* Functions */

	// Function /FortWater/FluidSimulation/Blueprints/BP_FluidSim_01.BP_FluidSim_01_C.CycleDebugRenderTargets (Has no native function)
	void CycleDebugRenderTargets(int& CallFuncAddIntIntReturnValue, int& CallFuncPercentIntIntReturnValue, int& CallFuncPercentIntIntReturnValue1, class UTextureRenderTarget2D*& CallFuncArrayGetItem, class UTextureRenderTarget2D*& CallFuncArrayGetItem1, int& CallFuncAddIntIntReturnValue1, int& CallFuncPercentIntIntReturnValue2, class UTextureRenderTarget2D*& CallFuncArrayGetItem2); // (Public | BlueprintCallable | BlueprintEvent)

	// Function /FortWater/FluidSimulation/Blueprints/BP_FluidSim_01.BP_FluidSim_01_C.Get Frames Since Last Active Forces (Has no native function)
