// Class /Script/FortniteGame.BuildingSMActor
// Size: 0xdd0
class ABuildingSMActor : public ABuildingActor
{
	unsigned char unreflected_780[0x20]; // 0x780 (0x20) 
	class UBuildingTextureData* TextureData[0x4]; // 0x7a0 (0x8) (ARRAY) 
	class UStaticMesh* StaticMesh; // 0x7c0 (0x8)
	struct TArray<struct FTierMeshSets> AlternateMeshes; // 0x7c8 (0x10)
	unsigned char bForceReplicateSubObjects; // 0x7d8 (0x1)
	unsigned char bNoPhysicsCollision; // 0x7d8 (0x1)
	unsigned char bNoCameraCollision; // 0x7d8 (0x1)
	unsigned char bNoPawnCollision; // 0x7d8 (0x1)
	unsigned char bNoAIPawnCollision; // 0x7d8 (0x1)
	unsigned char bBlocksCeilingPlacement; // 0x7d8 (0x1)
	unsigned char bBlocksAttachmentPlacement; // 0x7d8 (0x1)
	unsigned char bUsePhysicalSurfaceForFootstep; // 0x7d8 (0x1)
	unsigned char bRandomYawOnPlacement; // 0x7d9 (0x1)
	unsigned char bRandomScaleOnPlacement; // 0x7d9 (0x1)
	unsigned char bClearMIDWhenReturningToUndamagedState; // 0x7d9 (0x1)
	unsigned char bUseDynamicDestructionMaterial; // 0x7d9 (0x1)
	unsigned char bUseDynamicDestructionNiagaraSystem; // 0x7d9 (0x1)
	unsigned char bUseSingleMeshCullDistance; // 0x7d9 (0x1)
	unsigned char NumFrameSubObjects; // 0x7da (0x1)
	struct TEnumAsByte<EFortResourceType> ResourceType; // 0x7db (0x1)
	int AltMeshIdx; // 0x7dc (0x4)
	struct FVector2D RandomScaleRange; // 0x7e0 (0x10)
	struct FName DestructionLootTierGroup; // 0x7f0 (0x4)
	unsigned char unreflected_7f4[0x4]; // 0x7f4 (0x4) 
	struct TWeakObjectPtr<class UCurveLinearColor> WindSpeedCurve; // 0x7f8 (0x28)
	struct TWeakObjectPtr<class UCurveLinearColor> WindPannerSpeedCurve; // 0x820 (0x28)
	struct TWeakObjectPtr<class USoundBase> WindAudio; // 0x848 (0x28)
	float ShieldBuffMaterialParamValue1; // 0x870 (0x4)
	float ShieldBuffMaterialParamValue2; // 0x874 (0x4)
	float AnimatingDistanceFieldSelfShadowBias; // 0x878 (0x4)
	float AnimatingSubObjects; // 0x87c (0x4)
	float PlayerGridSnapSize; // 0x880 (0x4)
	unsigned char unreflected_884[0x54]; // 0x884 (0x54) 
	unsigned char bAllowBuildingCheat; // 0x8d8 (0x1)
	unsigned char bMirrored; // 0x8d8 (0x1)
	unsigned char bNoCollision; // 0x8d8 (0x1)
	unsigned char bNoVisibilityCollision; // 0x8d8 (0x1)
	unsigned char bSupportsRepairing; // 0x8d8 (0x1)
	unsigned char bHiddenDueToTrapPlacement; // 0x8d8 (0x1)
	unsigned char bAttachmentPlacementBlockedFront; // 0x8d8 (0x1)
	unsigned char bAttachmentPlacementBlockedBack; // 0x8d8 (0x1)
	unsigned char bUnderConstruction; // 0x8d9 (0x1)
	unsigned char bUnderRepair; // 0x8d9 (0x1)
	unsigned char bIsInitiallyBuilding; // 0x8d9 (0x1)
	unsigned char bCameraOnlyCollision; // 0x8d9 (0x1)
	unsigned char bNoWeaponCollision; // 0x8d9 (0x1)
	unsigned char bNoRangedWeaponCollision; // 0x8d9 (0x1)
	unsigned char bNoProjectileCollision; // 0x8d9 (0x1)
	unsigned char bDoNotBlockInteract; // 0x8d9 (0x1)
	unsigned char bNeedsMIDsForCreative; // 0x8da (0x1)
	unsigned char bAllowResourceDrop; // 0x8da (0x1)
	unsigned char bHideOnDeath; // 0x8da (0x1)
	unsigned char bPlayDestructionEffects; // 0x8da (0x1)
	unsigned char bSkipConstructionSounds; // 0x8da (0x1)
	unsigned char bSupportedDirectly; // 0x8da (0x1)
	unsigned char bForciblyStructurallySupported; // 0x8db (0x1)
	unsigned char bRegisterWithStructuralGrid; // 0x8db (0x1)
	unsigned char bCurrentlyBeingEdited; // 0x8db (0x1)
	unsigned char bAllowWeakSpots; // 0x8db (0x1)
	unsigned char bUseComplexForWeakSpots; // 0x8db (0x1)
	unsigned char bCanSpawnAtLowerQuotaLevels; // 0x8db (0x1)
	unsigned char bNeedsWindMaterialParameters; // 0x8dc (0x1)
	unsigned char bPlayBounce; // 0x8dc (0x1)
	unsigned char bPropagateBounce; // 0x8dc (0x1)
	unsigned char bPropagatesBounceEffects; // 0x8dc (0x1)
	unsigned char bDeriveCurieIdentifierFromResourceType; // 0x8dc (0x1)
	unsigned char bAllowCustomMaterial; // 0x8dc (0x1)
	enum ESavedSupportStatus SavedDirectlySupportedStatus; // 0x8dd (0x1)
	struct TEnumAsByte<ELootQuotaLevel> MaximumQuotaLevelBound; // 0x8de (0x1)
	enum EBuildingAnim BuildingAnimation; // 0x8df (0x1)
	unsigned char CurAnimSubObjectNum; // 0x8e0 (0x1)
	unsigned char CurAnimSubObjectTargetNum; // 0x8e1 (0x1)
	uint16_t ActorIndexInFoundation; // 0x8e2 (0x2)
	struct FFortBounceData BounceData; // 0x8e4 (0x30)
	float DestroyedTime; // 0x914 (0x4)
	float InfluenceMapWeight; // 0x918 (0x4)
	unsigned char unreflected_91c[0x4]; // 0x91c (0x4) 
	class UStaticMeshComponent* BASEEffectMeshComponent; // 0x920 (0x8)
	class UNaniteDisplacedMesh* DisplacedMesh; // 0x928 (0x8)
	struct TArray<struct FBuildingNavObstacle> NavObstacles; // 0x930 (0x10)
	unsigned char unreflected_940[0x10]; // 0x940 (0x10) 
	struct FVector BuildingPlacementDistance; // 0x950 (0x18)
	struct FVector_NetQuantize100 ReplicatedDrawScale3D; // 0x968 (0x18)
	struct FEditorOnlyBuildingInstanceMaterialParameters EditorOnlyInstanceMaterialParameters; // 0x980 (0x40)
	class UStaticMeshComponent* StaticMeshComponent; // 0x9c0 (0x8)
	class UFortWeakPointComponent* WeakPointComponent; // 0x9c8 (0x8)
	class UMaterialInterface* BaseMaterial; // 0x9d0 (0x8)
	struct FMulticastInlineDelegate OnConstructionComplete; // 0x9d8 (0x10)
	struct FMulticastInlineDelegate OnMeshSetChanged; // 0x9e8 (0x10)
	struct FBuildingActorMinimalReplicationProxy MinimalReplicationProxy; // 0x9f8 (0x4)
	struct FChosenQuotaInfo* DestructionLootTierChosenQuotaInfo; // 0x9fc (0x8)
	struct FName DestructionLootTierKey; // 0xa04 (0x4)
	struct FCurveTableRowHandle BuildingResourceAmountOverride; // 0xa08 (0x10)
	int MaxResourcesToSpawn; // 0xa18 (0x4)
	unsigned char unreflected_a1c[0x1c]; // 0xa1c (0x1c) 
	class UParticleSystem* BreakEffect; // 0xa38 (0x8)
	struct TArray<struct TWeakObjectPtr<class UMaterialInterface>> IntenseWindMaterials; // 0xa40 (0x10)
	struct FLinearColor ColorOverrides[0x4]; // 0xa50 (0x10) (ARRAY) 
	class URuntimeVirtualTexture* RVTHeightOverride; // 0xa90 (0x8)
	class URuntimeVirtualTexture* RVTColorOverride; // 0xa98 (0x8)
	struct TWeakObjectPtr<class UFXSystemAsset> DeathParticles; // 0xaa0 (0x28)
	class UFXSystemAsset* DeathParticlesInst; // 0xac8 (0x8)
	struct FName DeathParticleSocketName; // 0xad0 (0x4)
	unsigned char unreflected_ad4[0x4]; // 0xad4 (0x4) 
	class USoundBase* DeathSound; // 0xad8 (0x8)
	class UParticleSystem* ConstructedEffect; // 0xae0 (0x8)
	struct TArray<struct FRandomDayphaseFX> RandomDayphaseFXList; // 0xae8 (0x10)
	class UAudioComponent* ConstructionAudioComponent; // 0xaf8 (0x8)
	class AFortPawn* CachedDestructionInstigator; // 0xb00 (0x8)
	float LastDamageAmount; // 0xb08 (0x4)
	unsigned char unreflected_b0c[0x4]; // 0xb0c (0x4) 
	struct FVector LastDamageHitImpulseDir; // 0xb10 (0x18)
	unsigned char unreflected_b28[0x8]; // 0xb28 (0x8) 
	struct TArray<struct FBuildingDamageHistoryEntry> DamageHistory; // 0xb30 (0x10)
	struct TArray<class UStaticMeshComponent*> CachedAnimatingStaticMeshes; // 0xb40 (0x10)
	unsigned char unreflected_b50[0x60]; // 0xb50 (0x60) 
	struct FMulticastInlineDelegate OnRepairBuildingStarted; // 0xbb0 (0x10)
	struct FMulticastInlineDelegate OnRepairBuildingFinished; // 0xbc0 (0x10)
	class UBuildingEditModeMetadata* EditModePatternData; // 0xbd0 (0x8)
	int UndermineGroup; // 0xbd8 (0x4)
	int LogicalBuildingIdx; // 0xbdc (0x4)
	struct TArray<struct FAnimatingMaterialPair> AnimatingMaterialMappings; // 0xbe0 (0x10)
	struct TArray<struct FAnimatingMaterialPair> DamagedButNotAnimatingMaterialMappings; // 0xbf0 (0x10)
	class UClass* EditModeSupportClass; // 0xc00 (0x8)
	class UBuildingEditModeSupport* EditModeSupport; // 0xc08 (0x8)
	float HealthToAutoBuild; // 0xc10 (0x4)
	float AccumulatedAutoBuildTime; // 0xc14 (0x4)
	struct TEnumAsByte<EBuildingReplacementType> BuildingReplacementType; // 0xc18 (0x1)
	struct TEnumAsByte<EBuildingReplacementType> ReplacementDestructionReason; // 0xc19 (0x1)
	enum EBuildingAnim CurBuildingAnimType; // 0xc1a (0x1)
	enum EFortDamageVisualsState DamageVisualsState; // 0xc1b (0x1)
	float CurBuildProgress; // 0xc1c (0x4)
	float OutwardMotionMagnitude; // 0xc20 (0x4)
	float CurBuildingAnimStartTime; // 0xc24 (0x4)
	struct TArray<class UMaterialInstanceConstant*> BlueprintMICs; // 0xc28 (0x10)
	struct TArray<class UMaterialInstanceDynamic*> BlueprintMIDs; // 0xc38 (0x10)
	class UStaticMeshComponent* BlueprintMeshComp; // 0xc48 (0x8)
	class AFortPlayerStateZone* EditingPlayer; // 0xc50 (0x8)
	unsigned char unreflected_c58[0x20]; // 0xc58 (0x20) 
	struct FVector BuildingAttachmentPointOffset; // 0xc78 (0x18)
	float BuildingAttachmentRadius; // 0xc90 (0x4)
	struct TEnumAsByte<EBuildingAttachmentSlot> BuildingAttachmentSlot; // 0xc94 (0x1)
	struct TEnumAsByte<EBuildingAttachmentType> BuildingAttachmentType; // 0xc95 (0x1)
	struct TEnumAsByte<EPlacementType> BuildingPlacementType; // 0xc96 (0x1)
	enum EStructuralSupportCheck LastStructuralCheck; // 0xc97 (0x1)
	class ABuildingSMActor* ParentActorToAttachTo; // 0xc98 (0x8)
	struct TArray<class ABuildingActor*> AttachedBuildingActors; // 0xca0 (0x10)
	struct TArray<class ABuildingActor*> BuildingActorsAttachedTo; // 0xcb0 (0x10)
	struct FGameplayTagQuery InvalidTrapTagQuery; // 0xcc0 (0x48)
	struct FMulticastInlineDelegate OnTrapPlacementChanged; // 0xd08 (0x10)
	struct FMulticastInlineDelegate OnReplacementDestruction; // 0xd18 (0x10)
	class ABuildingActor* AttachmentPlacementBlockingActors[0x2]; // 0xd28 (0x8) (ARRAY) 
	struct TWeakObjectPtr<class ABuildingFoundation> Foundation; // 0xd38 (0x8)
	unsigned char unreflected_d40[0x18]; // 0xd40 (0x18) 
	class ABuildingSMActor* DamagerOwner; // 0xd58 (0x8)
	class AFortConstructorBASE* RelevantBASE; // 0xd60 (0x8)
	unsigned char unreflected_d68[0x8]; // 0xd68 (0x8) 
	struct FWorldPartitionHLODDestructionTag HLODDestructionTag; // 0xd70 (0x10)
	class AFortConstructorBASE* LastRelevantBASE; // 0xd80 (0x8)
	unsigned char unreflected_d88[0x18]; // 0xd88 (0x18) 
	struct FProxyGameplayCueDamage ProxyGameplayCueDamage; // 0xda0 (0x20)
	unsigned char padding_dc0[0x10]; // 0xdc0 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.BuildingSMActor.WillRegisterWithStructuralGrid (Underlying native function: WillRegisterWithStructuralGrid 0x860df6c)
	bool WillRegisterWithStructuralGrid(); // (Final | BlueprintAuthorityOnly | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.BuildingSMActor.UpdateRepairMaterialAnim (Underlying native function: UpdateRepairMaterialAnim 0x860dee4)
	void UpdateRepairMaterialAnim(float& CurveValue); // (0x00000002 | Native | Protected)

	// Function /Script/FortniteGame.BuildingSMActor.UpdateLODOverrideEffect (Underlying native function: UpdateLODOverrideEffect 0x860de5c)
	void UpdateLODOverrideEffect(float& CurveValue); // (0x00000002 | Native | Protected)

	// Function /Script/FortniteGame.BuildingSMActor.UpdateDynamicShrinkAndDestroyEffect (Underlying native function: UpdateDynamicShrinkAndDestroyEffect 0x860ddd4)
