// Class /Script/FortniteGame.BuildingActor
// Size: 0x780
class ABuildingActor : public AActor
{
	unsigned char unreflected_288[0x128]; // 0x288 (0x128) 
	struct FGuid MyGuid; // 0x3b0 (0x10)
	float SavedHealthPct; // 0x3c0 (0x4)
	int16_t OwnerPersistentID; // 0x3c4 (0x2)
	unsigned char unreflected_3c6[0x2]; // 0x3c6 (0x2) 
	struct TWeakObjectPtr<class UClass> AreaClass; // 0x3c8 (0x28)
	class UClass* NavigationLinksClass; // 0x3f0 (0x8)
	unsigned char unreflected_3f8[0x10]; // 0x3f8 (0x10) 
	struct TArray<class AFortAthenaVehicle*> InitialOverlappingVehicles; // 0x408 (0x10)
	int CurrentBuildingLevel; // 0x418 (0x4)
	int MaximumBuildingLevel; // 0x41c (0x4)
	class UClass* BuildingAttributeSetClass; // 0x420 (0x8)
	class UFortBuildingActorSet* BuildingAttributeSet; // 0x428 (0x8)
	class UFortDamageSet* DamageAttributeSet; // 0x430 (0x8)
	class UFortBuildingActorSet* ReplicatedBuildingAttributeSet; // 0x438 (0x8)
	struct FFortAttributeInitializationKey* AttributeInitKeys[0x2]; // 0x440 (0x8) (ARRAY) 
	enum EAttributeInitLevelSource AttributeInitLevelSource; // 0x450 (0x1)
	enum EBuildingActorComponentCreationPolicy AbilitySystemComponentCreationPolicy; // 0x451 (0x1)
	struct TEnumAsByte<EPhysicalSurface> PrimarySurfaceType; // 0x452 (0x1)
	struct TEnumAsByte<EFortBaseWeaponDamage> WeaponResponseType; // 0x453 (0x1)
	float LifespanAfterDeath; // 0x454 (0x4)
	unsigned char unreflected_458[0x10]; // 0x458 (0x10) 
	struct FMulticastInlineDelegate OnAbilitySystemComponentInitialized; // 0x468 (0x10)
	class UFortAbilitySystemComponent* AbilitySystemComponent; // 0x478 (0x8)
	class UFortAbilitySystemComponent* ReplicatedAbilitySystemComponent; // 0x480 (0x8)
	struct TArray<struct FGameplayCueParameters> PendingDamageImpactCues; // 0x488 (0x10)
	float HealthBarIndicatorWidth; // 0x498 (0x4)
	float HealthBarIndicatorVerticalOffset; // 0x49c (0x4)
	struct FName HealthBarIndicatorSocketName; // 0x4a0 (0x4)
	int HealthBarIndicatorDifficultyRating; // 0x4a4 (0x4)
	class UFortHealthBarIndicator* HealthBarIndicator; // 0x4a8 (0x8)
	unsigned char ForceMetadataRelevant; // 0x4b0 (0x1)
	unsigned char LastMetadataRelevant; // 0x4b1 (0x1)
	struct TEnumAsByte<EDynamicBuildingPlacementType> DynamicBuildingPlacementType; // 0x4b2 (0x1)
	enum ENavigationObstacleOverride NavigationObstacleOverride; // 0x4b3 (0x1)
	float CullDistance; // 0x4b4 (0x4)
	struct FGameplayTagQuery IncomingDamageFilterQuery; // 0x4b8 (0x48)
	unsigned char bIsInvulnerable; // 0x500 (0x1)
	unsigned char bPreviewBuildingActor; // 0x500 (0x1)
	unsigned char bLockedFromGameEditing; // 0x500 (0x1)
	unsigned char bPlayedDying; // 0x500 (0x1)
	unsigned char bHasRegisteredActorStateAtLeastOnce; // 0x500 (0x1)
	unsigned char bDirtyForLevelRecordSave; // 0x500 (0x1)
	unsigned char bSavedMetaPropertiesProcessed; // 0x500 (0x1)
	unsigned char bUpgradeUsesSameClass; // 0x501 (0x1)
	unsigned char bDisplayLevelInInfoWidget; // 0x501 (0x1)
	unsigned char bAllowUpgradeRegardlessOfPlayerBuildLevel; // 0x501 (0x1)
	unsigned char bAlwaysExportNavRelevantComponent; // 0x501 (0x1)
	unsigned char bDisplayDamageNumbersInAthena; // 0x501 (0x1)
	unsigned char bUseFortHealthBarIndicator; // 0x501 (0x1)
	unsigned char bSurpressHealthBar; // 0x501 (0x1)
	unsigned char bCreateVerboseHealthLogs; // 0x501 (0x1)
	unsigned char bIsIndestructibleForTargetSelection; // 0x502 (0x1)
	unsigned char bPropagateDrawDistanceOnAdditionalComponent; // 0x502 (0x1)
	unsigned char bCreatePhysicsObjectComponent; // 0x502 (0x1)
	unsigned char bIsGameFrameworkComponentReceiver; // 0x502 (0x1)
	unsigned char bDestroyed; // 0x502 (0x1)
	unsigned char bPersistToWorld; // 0x502 (0x1)
	unsigned char bRefreshFullSaveDataBeforeZoneSave; // 0x502 (0x1)
	unsigned char bBeingDragged; // 0x502 (0x1)
	unsigned char bBeingLocallyMoved; // 0x503 (0x1)
	unsigned char bRotateInPlaceGame; // 0x503 (0x1)
	unsigned char bBeingOneHitDisassembled; // 0x503 (0x1)
	unsigned char bBoundsAreInvalidForMelee; // 0x503 (0x1)
	unsigned char bIsNavigationModifier; // 0x503 (0x1)
	unsigned char bBlockNavigationLinks; // 0x503 (0x1)
	unsigned char bCanExportNavigationCollisions; // 0x503 (0x1)
	unsigned char bCanExportNavigationObstacle; // 0x504 (0x1)
	unsigned char bCreateObstacleNavModifierForEachComponent; // 0x504 (0x1)
	unsigned char bMirrorNavLinksX; // 0x504 (0x1)
	unsigned char bMirrorNavLinksY; // 0x504 (0x1)
	unsigned char bIgnoreMoveGoalCollisionRadius; // 0x504 (0x1)
	unsigned char bForceDisableRootNavigationRelevance; // 0x504 (0x1)
	unsigned char bForceAutomationPass; // 0x504 (0x1)
	unsigned char bForceAutomationPassNavmeshOnTop; // 0x504 (0x1)
	unsigned char bForceAutomationPassSmashableFlat; // 0x505 (0x1)
	unsigned char bCanBeSavedInCreativeVolume; // 0x505 (0x1)
	unsigned char bIsNavigationRelevant; // 0x505 (0x1)
	unsigned char bIsNavigationIndestructible; // 0x505 (0x1)
	unsigned char bBlockNavLinksInCell; // 0x505 (0x1)
	unsigned char bUseHotSpotAsMoveGoalReplacement; // 0x505 (0x1)
	unsigned char bHasCustomAttackLocation; // 0x505 (0x1)
	unsigned char bWorldReadyCalled; // 0x505 (0x1)
	unsigned char bBeingTranslated; // 0x506 (0x1)
	unsigned char bBeingRotated; // 0x506 (0x1)
	unsigned char bBeingScaled; // 0x506 (0x1)
	unsigned char bRotateInPlaceEditor; // 0x506 (0x1)
	unsigned char bEditorPlaced; // 0x506 (0x1)
	unsigned char bPlayerPlaced; // 0x506 (0x1)
	unsigned char bShouldTick; // 0x506 (0x1)
	unsigned char bUsesDayPhaseChange; // 0x506 (0x1)
	unsigned char bIsDynamic; // 0x507 (0x1)
	unsigned char bIsDynamicOnDedicatedServer; // 0x507 (0x1)
	unsigned char bIsDedicatedServer; // 0x507 (0x1)
	unsigned char bIsTemporarilyTicking; // 0x507 (0x1)
	unsigned char bUseTickManager; // 0x507 (0x1)
	unsigned char bIsMovable; // 0x507 (0x1)
	unsigned char bRegisteredForDayPhaseChange; // 0x507 (0x1)
	unsigned char bForceDamagePing; // 0x507 (0x1)
	unsigned char bDestroyFoliageWhenPlaced; // 0x508 (0x1)
	unsigned char bObstructTrapTargeting; // 0x508 (0x1)
	unsigned char bInstantDeath; // 0x508 (0x1)
	unsigned char bDoNotBlockBuildings; // 0x508 (0x1)
	unsigned char bForceBlockBuildings; // 0x508 (0x1)
	unsigned char bDestroyOnPlayerBuildingPlacement; // 0x508 (0x1)
	unsigned char bUseCentroidForBlockBuildingsCheck; // 0x508 (0x1)
	unsigned char bPredictedBuildingActor; // 0x509 (0x1)
	unsigned char bIgnoreCollisionWithCriticalActors; // 0x509 (0x1)
	unsigned char bIsPlayerBuildable; // 0x509 (0x1)
	unsigned char bFireBuiltAndDestroyedEvents; // 0x509 (0x1)
	unsigned char bStructurallySupportOverlappingActors; // 0x509 (0x1)
	unsigned char bAllowInteract; // 0x509 (0x1)
	unsigned char bShowFirstInteractPrompt; // 0x509 (0x1)
	unsigned char bShowSecondInteractPrompt; // 0x509 (0x1)
	unsigned char bAllowHostileBlueprintInteraction; // 0x50a (0x1)
	unsigned char bEndAbilitiesOnDeath; // 0x50a (0x1)
	unsigned char bAlwaysUseNetCullDistanceSquaredForRelevancy; // 0x50a (0x1)
	unsigned char bHighlightDirty; // 0x50a (0x1)
	unsigned char bCollisionBlockedByPawns; // 0x50a (0x1)
	unsigned char bAllowTeamDamage; // 0x50a (0x1)
	unsigned char bShouldClearMarkerOnInteract; // 0x50a (0x1)
	unsigned char bIgnoreAffiliationInteractHighlight; // 0x50b (0x1)
	unsigned char bSuppressInteractionWidget; // 0x50b (0x1)
	unsigned char bAutoReleaseCurieContainerOnDestroyed; // 0x50b (0x1)
	unsigned char bSpawnIntoGridSublevel; // 0x50b (0x1)
	unsigned char bUseMinLifeSpan; // 0x50b (0x1)
	struct TEnumAsByte<EFortBuildingType> BuildingType; // 0x50c (0x1)
	struct TEnumAsByte<EFortTeam> Team; // 0x50d (0x1)
	unsigned char TeamIndex; // 0x50e (0x1)
	bool bIgnoreDeterminePhysicsObjectImpactDataAutomatically; // 0x50f (0x1)
	struct FGameplayTagContainer ConstTags; // 0x510 (0x20)
	struct FGameplayTagContainer StaticGameplayTags; // 0x530 (0x20)
	struct FText InteractionText; // 0x550 (0x18)
	struct FGameplayTag CanInteractPerformNativeActionTag; // 0x568 (0x4)
	int DeviceTrackingGUID; // 0x56c (0x4)
	int DeviceNameIndex; // 0x570 (0x4)
	unsigned char unreflected_574[0x4]; // 0x574 (0x4) 
	struct FMulticastInlineDelegate OnDied; // 0x578 (0x10)
	struct FMulticastInlineDelegate OnOutOfHealthNotDestroyed; // 0x588 (0x10)
	struct FMulticastInlineDelegate OnDamaged; // 0x598 (0x10)
	struct FMulticastInlineDelegate OnDeathPlayEffectsDelegate; // 0x5a8 (0x10)
	class AFortMission* AssociatedMissionParam; // 0x5b8 (0x8)
	class AFortPlacementActor* OriginatingPlacementActor; // 0x5c0 (0x8)
	float BRMinDrawDistance; // 0x5c8 (0x4)
	float BRMaxDrawDistance; // 0x5cc (0x4)
	float StWMinDrawDistance; // 0x5d0 (0x4)
	float StWMaxDrawDistance; // 0x5d4 (0x4)
	struct FMulticastInlineDelegate OnInteract; // 0x5d8 (0x10)
	struct FCurveTableRowHandle InteractionSpeed; // 0x5e8 (0x10)
	class UClass* InteractionOverrideWidget; // 0x5f8 (0x8)
	class UClass* SecondInteractionOverrideWidget; // 0x600 (0x8)
	unsigned char unreflected_608[0x48]; // 0x608 (0x48) 
	int DataVersion; // 0x650 (0x4)
	float LastTakeHitTimeTimeout; // 0x654 (0x4)
	class USoundBase* PlayHitSound; // 0x658 (0x8)
	float SnapGridSize; // 0x660 (0x4)
	float VertSnapGridSize; // 0x664 (0x4)
	struct FVector SnapOffset; // 0x668 (0x18)
	struct FVector CentroidOffset; // 0x680 (0x18)
	struct FVector BaseLocToPivotOffset; // 0x698 (0x18)
	struct FString CustomState; // 0x6b0 (0x10)
	struct TArray<class UClass*> ComponentTypesWhitelistedForReplication; // 0x6c0 (0x10)
	struct TArray<class UPrimitiveComponent*> OverridePrimitivesToExcludeFoliage; // 0x6d0 (0x10)
	class UBuildingActorHotSpotConfig* HotSpotConfig; // 0x6e0 (0x8)
	struct FMulticastInlineDelegate OnBuildingHealthChanged; // 0x6e8 (0x10)
	struct FMulticastInlineDelegate OnActorHealthChanged; // 0x6f8 (0x10)
	struct FGuid SavedActorGuid; // 0x708 (0x10)
	unsigned char unreflected_718[0x18]; // 0x718 (0x18) 
	float BaselineScale; // 0x730 (0x4)
	float AccumulatedDeltaSinceLastVisualsTick; // 0x734 (0x4)
	class UProjectileMovementComponent* ProjectileMovementComponent; // 0x738 (0x8)
	struct FMulticastInlineDelegate OnTeamIndexChangedDelegate; // 0x740 (0x10)
	struct FGameplayTag PhysicsObjectPresetTag; // 0x750 (0x4)
	struct FGameplayTag PhysicsObjectPhysicalDataTag; // 0x754 (0x4)
	struct FGameplayTag PhysicsObjectBuoyancyDataTag; // 0x758 (0x4)
	struct FGameplayTag PhysicsObjectImpactDamageDataTag; // 0x75c (0x4)
	class UFortPhysicsObjectComponent* PhysicsObjectComponent; // 0x760 (0x8)
	struct FName ActorTemplateID; // 0x768 (0x4)
	struct FName PlaysetPackagePathName; // 0x76c (0x4)
	struct FString LabelOverride; // 0x770 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.BuildingActor.UseDefaultHealthBar (Underlying native function: UseDefaultHealthBar 0x134a9ec)
	bool UseDefaultHealthBar(); // (0x00000002 | Native | Event | Public | BlueprintEvent | Const)

	// Function /Script/FortniteGame.BuildingActor.UpdateCullDistance (Underlying native function: UpdateCullDistance 0x5cd5560)
	void UpdateCullDistance(bool& bIgnoreLODParent); // (0x00000002 | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.BuildingActor.SnapDmgVisualsToCurrentHealth (Underlying native function: SnapDmgVisualsToCurrentHealth 0x240d908)
	void SnapDmgVisualsToCurrentHealth(); // (0x00000002 | Native | Protected | BlueprintCallable)

	// Function /Script/FortniteGame.BuildingActor.SilentDie (Underlying native function: SilentDie 0x85bf580)
	void SilentDie(bool& bPropagateSilentDeath); // (0x00000002 | BlueprintAuthorityOnly | Native | Public | BlueprintCallable)
