// Class /Script/FortniteGame.CustomItemWrapModifier_Banana_Base
// Size: 0x4a0
class ACustomItemWrapModifier_Banana_Base : public ACustomItemWrapModifier
{
	float FadeTime; // 0x480 (0x4)
	struct FName ConstrastParameterName; // 0x484 (0x4)
	struct FName OffsetParameterName; // 0x488 (0x4)
	float FrontendContrastValue; // 0x48c (0x4)
	float FrontendOffsetValue; // 0x490 (0x4)
	float MinOffsetValue; // 0x494 (0x4)
	float MaxOffsetValue; // 0x498 (0x4)
	unsigned char padding_49c[0x4]; // 0x49c (0x4)
};

