// Class /Script/FortniteGame.FortGameStateAthena
// Size: 0x3120
class AFortGameStateAthena : public AFortGameStateZone
{
	unsigned char unreflected_1000[0x98]; // 0x1000 (0x98) 
	bool bCanBuildOnWaterGlobal; // 0x1098 (0x1)
	bool bBlockBuildOnWaterGlobal; // 0x1099 (0x1)
	unsigned char unreflected_109a[0x36]; // 0x109a (0x36) 
	struct FMulticastInlineDelegate OnNewContentUpdateMessageRecieved; // 0x10d0 (0x10)
	struct FMulticastInlineDelegate OnNewScreenLogMessageReceived; // 0x10e0 (0x10)
	bool bIsGrassFireBoundsUpdateEnabled; // 0x10f0 (0x1)
	bool bCanSpawnLoot; // 0x10f1 (0x1)
	unsigned char unreflected_10f2[0x1e]; // 0x10f2 (0x1e) 
	class UCurveTable* AthenaGameDataTable; // 0x1110 (0x8)
	struct TArray<struct FName> AthenaGameDataResetRows; // 0x1118 (0x10)
	class UCurveTable* ResetAthenaGameDataTable; // 0x1128 (0x8)
	bool bIsUsingDownloadOnDemand; // 0x1130 (0x1)
	bool bWantsHoldoverPluginOnClient; // 0x1131 (0x1)
	unsigned char unreflected_1132[0x2e]; // 0x1132 (0x2e) 
	struct FMulticastInlineDelegate OnCurrentPlaylistLoaded; // 0x1160 (0x10)
	unsigned char unreflected_1170[0x48]; // 0x1170 (0x48) 
	bool bPlaylistDataIsLoaded; // 0x11b8 (0x1)
	unsigned char unreflected_11b9[0x1]; // 0x11b9 (0x1) 
	bool bPlaylistDataIsActivelyLoading; // 0x11ba (0x1)
	unsigned char unreflected_11bb[0x5]; // 0x11bb (0x5) 
	struct FMulticastInlineDelegate AllWinnersAnnounced; // 0x11c0 (0x10)
	struct FMulticastInlineDelegate WinnerInfoDisplayReadyCN; // 0x11d0 (0x10)
	struct FMulticastInlineDelegate CountdownTick; // 0x11e0 (0x10)
	struct FMulticastInlineDelegate CountdownStarted; // 0x11f0 (0x10)
	struct FMulticastInlineDelegate CountdownFinished; // 0x1200 (0x10)
	struct FMulticastInlineDelegate CountdownStopped; // 0x1210 (0x10)
	struct FMulticastInlineDelegate FinalCountdownTick; // 0x1220 (0x10)
	struct FMulticastInlineDelegate FinalCountdownStarted; // 0x1230 (0x10)
	struct FMulticastInlineDelegate FinalCountdownFinished; // 0x1240 (0x10)
	struct FMulticastInlineDelegate CurrentHighScoreUpdated; // 0x1250 (0x10)
	struct FMulticastInlineDelegate OnGoalScoreChanged; // 0x1260 (0x10)
	struct FMulticastInlineDelegate OnPickupSpawnedAndReady; // 0x1270 (0x10)
	struct FMulticastInlineDelegate OnPickupDestroy; // 0x1280 (0x10)
	struct FMulticastInlineDelegate GameModeMessageRequest; // 0x1290 (0x10)
	struct FMulticastInlineDelegate ContextTutorialGameModeMessageRequest; // 0x12a0 (0x10)
	struct FMulticastInlineDelegate HideGameModeMessageRequest; // 0x12b0 (0x10)
	struct FMulticastInlineDelegate GameModeMessageSuccess; // 0x12c0 (0x10)
	struct FMulticastInlineDelegate ShowGameModeMessage; // 0x12d0 (0x10)
	struct FMulticastInlineDelegate HideGameModeMessage; // 0x12e0 (0x10)
	struct FMulticastInlineDelegate ShowMarkerGameMode; // 0x12f0 (0x10)
	struct FMulticastInlineDelegate HideMarkerGameMode; // 0x1300 (0x10)
	struct FMulticastInlineDelegate RepositionGameModeMessage; // 0x1310 (0x10)
	struct FMulticastInlineDelegate SetDefaultPositionGameModeMessage; // 0x1320 (0x10)
	struct FMulticastInlineDelegate OnPlayerLeftCreativeIsland; // 0x1330 (0x10)
	struct FMulticastInlineDelegate OnPlayerJoinedCreativeIsland; // 0x1340 (0x10)
	struct FMulticastInlineDelegate MutatorGenericIntegerUpdated; // 0x1350 (0x10)
	struct FMulticastInlineDelegate MutatorGameplayEvent; // 0x1360 (0x10)
	struct FMulticastInlineDelegate OnSafeZoneIndicatorChanged; // 0x1370 (0x10)
	unsigned char unreflected_1380[0x48]; // 0x1380 (0x48) 
	float PlaylistEndTime; // 0x13c8 (0x4)
	unsigned char unreflected_13cc[0x4]; // 0x13cc (0x4) 
	float SafeZonePauseTime; // 0x13d0 (0x4)
	unsigned char unreflected_13d4[0x4]; // 0x13d4 (0x4) 
	int TotalFinalCountdownTime; // 0x13d8 (0x4)
	bool bForceTeamScorePlacementOnDeath; // 0x13dc (0x1)
	bool bPlaylistStoppedSafeZonePhases; // 0x13dd (0x1)
	bool bSkyTubesShuttingDown; // 0x13de (0x1)
	bool bSkyTubesDisabled; // 0x13df (0x1)
	unsigned char unreflected_13e0[0x8]; // 0x13e0 (0x8) 
	int ServerChangelistNumber; // 0x13e8 (0x4)
	unsigned char unreflected_13ec[0x4]; // 0x13ec (0x4) 
	class AFortSpecialActorReplicationInfo* SpecialActorData; // 0x13f0 (0x8)
	class AFortPropertyOverrideReplShared* ReplOverrideData; // 0x13f8 (0x8)
	struct TArray<class UClass*> BuildingActorClasses; // 0x1400 (0x10)
	struct FMulticastInlineDelegate WinnerAnnounced; // 0x1410 (0x10)
	struct FMulticastInlineDelegate WinningTeamAnnounced; // 0x1420 (0x10)
	struct FMulticastInlineDelegate GamePhaseChanged; // 0x1430 (0x10)
	struct FMulticastInlineDelegate WinningScoreDetermined; // 0x1440 (0x10)
	struct FMulticastInlineDelegate GamePhaseStepChanged; // 0x1450 (0x10)
	struct FMulticastInlineDelegate StormCapStateChanged; // 0x1460 (0x10)
	struct FMulticastInlineDelegate StormProgressStopped; // 0x1470 (0x10)
	struct FMulticastInlineDelegate ActiveTeamArrayBuiltEvent; // 0x1480 (0x10)
	struct FMulticastInlineDelegate OnPlayersLeftChanged; // 0x1490 (0x10)
	struct FMulticastInlineDelegate OnTeamsLeftChanged; // 0x14a0 (0x10)
	struct FMulticastInlineDelegate OnWinConditionMetCN; // 0x14b0 (0x10)
	struct FMulticastInlineDelegate UpdateNamedPoiColorDelegate; // 0x14c0 (0x10)
	struct FMulticastInlineDelegate OnWarmupCountdownEndTimeUpdated; // 0x14d0 (0x10)
	bool bSkipWinnerAnnounced; // 0x14e0 (0x1)
	bool bStopBuildingHealingOnDamage; // 0x14e1 (0x1)
	bool bIsInCountdown; // 0x14e2 (0x1)
	bool bIsInFinalCountdown; // 0x14e3 (0x1)
	float WarmupCountdownStartTime; // 0x14e4 (0x4)
	float WarmupCountdownEndTime; // 0x14e8 (0x4)
	float AircraftStartTime; // 0x14ec (0x4)
	float SafeZonesStartTime; // 0x14f0 (0x4)
	float EndGameStartTime; // 0x14f4 (0x4)
	float EndGameKickPlayerTime; // 0x14f8 (0x4)
	int TotalPlayers; // 0x14fc (0x4)
	int PlayersLeft; // 0x1500 (0x4)
	unsigned char unreflected_1504[0x4]; // 0x1504 (0x4) 
	struct TArray<> ClientVehicleClassesToLoad; // 0x1508 (0x10)
	struct TArray<class UFortItemDefinition*> ClientItemDefsToLoad; // 0x1518 (0x10)
	struct TArray<class AFortProjectileBase*> PredictedProjectiles; // 0x1528 (0x10)
	float RemainingFocalPointActorDuration; // 0x1538 (0x4)
	unsigned char unreflected_153c[0x4]; // 0x153c (0x4) 
	class AActor* FocalPointActor; // 0x1540 (0x8)
	float FocalPointRotationInterpSpeed; // 0x1548 (0x4)
	unsigned char unreflected_154c[0x4]; // 0x154c (0x4) 
	struct FVector_NetQuantize FocalPointOffset; // 0x1550 (0x18)
	float FocalPointFOV; // 0x1568 (0x4)
	unsigned char unreflected_156c[0xc0]; // 0x156c (0xc0) 
	bool bCheatRespawnEnabled; // 0x162c (0x1)
	enum EAthenaStormCapState StormCapState; // 0x162d (0x1)
	unsigned char unreflected_162e[0x2]; // 0x162e (0x2) 
	int CurrentPlayerCap; // 0x1630 (0x4)
	struct FStormCapDamageThresholdInfo* DamageForStormCapMarking; // 0x1634 (0x8)
	unsigned char unreflected_163c[0x4]; // 0x163c (0x4) 
	struct TArray<int> TeamXPlayersLeft; // 0x1640 (0x10)
	struct TArray<struct FFortWinnerPlayerData> WinningPlayerList; // 0x1650 (0x10)
	int TeamsLeft; // 0x1660 (0x4)
	unsigned char unreflected_1664[0x4]; // 0x1664 (0x4) 
	struct TArray<unsigned char> WinningTeamsCN; // 0x1668 (0x10)
	struct TArray<class UObject*> ServerToClientPreloadList; // 0x1678 (0x10)
	class UAthenaBattleBusItemDefinition* DefaultBattleBus; // 0x1688 (0x8)
	bool bAllowUserPickedCosmeticBattleBus; // 0x1690 (0x1)
	unsigned char unreflected_1691[0x7]; // 0x1691 (0x7) 
	struct TArray<struct FAircraftFlightInfo> TeamFlightPaths; // 0x1698 (0x10)
	struct FAircraftFlightInfo FlightPathMidLine; // 0x16a8 (0x48)
	struct FVector2D DropZoneCenter; // 0x16f0 (0x10)
	struct FVector2D FlightPathSelectionCenter; // 0x1700 (0x10)
	struct FDateTime* UtcTimeStartedMatch; // 0x1710 (0x8)
	bool bIsLargeTeamGame; // 0x1718 (0x1)
	unsigned char unreflected_1719[0x7]; // 0x1719 (0x7) 
	class APlayerState* WinningPlayerState; // 0x1720 (0x8)
	unsigned char unreflected_1728[0x10]; // 0x1728 (0x10) 
	int WinningTeam; // 0x1738 (0x4)
	int WinningScore; // 0x173c (0x4)
	int CurrentHighScore; // 0x1740 (0x4)
	int CurrentHighScoreTeam; // 0x1744 (0x4)
	class USoundCue* SupplyDropWaveStartedSoundCue; // 0x1748 (0x8)
	unsigned char unreflected_1750[0x20]; // 0x1750 (0x20) 
	struct TArray<struct FText> KillFeedEntry; // 0x1770 (0x10)
	unsigned char unreflected_1780[0x10]; // 0x1780 (0x10) 
	struct FMulticastInlineDelegate KillFeedUpdated; // 0x1790 (0x10)
	struct TArray<class AFortPlayerState*> SpectatorArray; // 0x17a0 (0x10)
	struct TArray<class AFortPlayerState*> PartyMemberSpectatorArray; // 0x17b0 (0x10)
	enum EAirCraftBehavior AirCraftBehavior; // 0x17c0 (0x1)
	unsigned char unreflected_17c1[0x1]; // 0x17c1 (0x1) 
	bool bStormReachedFinalPosition; // 0x17c2 (0x1)
	enum EFriendlyFireType FriendlyFireType; // 0x17c3 (0x1)
	unsigned char unreflected_17c4[0x1c]; // 0x17c4 (0x1c) 
	bool SpectateAPartyMemberAvailable; // 0x17e0 (0x1)
	unsigned char unreflected_17e1[0x117]; // 0x17e1 (0x117) 
	struct FGameMemberInfoArray GameMemberInfoArray; // 0x18f8 (0x120)
	unsigned char unreflected_1a18[0x78]; // 0x1a18 (0x78) 
	struct TArray<unsigned char> ActiveTeamNums; // 0x1a90 (0x10)
	int CurrentPlaylistId; // 0x1aa0 (0x4)
	unsigned char unreflected_1aa4[0x4]; // 0x1aa4 (0x4) 
	class AFortSafeZoneIndicator* SafeZoneIndicator; // 0x1aa8 (0x8)
	class UMaterialInstanceDynamic* MinimapBackgroundMID; // 0x1ab0 (0x8)
	class UMaterialInstanceDynamic* MinimapCircleMID; // 0x1ab8 (0x8)
	class UMaterialInstanceDynamic* MinimapNextCircleMID; // 0x1ac0 (0x8)
	class UMaterialInstanceDynamic* FullmapCircleMID; // 0x1ac8 (0x8)
	class UMaterialInstanceDynamic* FullmapNextCircleMID; // 0x1ad0 (0x8)
	unsigned char unreflected_1ad8[0x8]; // 0x1ad8 (0x8) 
	struct FSlateBrush MinimapSafeZoneBrush; // 0x1ae0 (0xc0)
	struct FSlateBrush MinimapCircleBrush; // 0x1ba0 (0xc0)
	struct FSlateBrush MinimapNextCircleBrush; // 0x1c60 (0xc0)
	struct FSlateBrush FullMapCircleBrush; // 0x1d20 (0xc0)
	struct FSlateBrush FullMapNextCircleBrush; // 0x1de0 (0xc0)
	struct FSlateBrush MinimapSafeZoneFinalPosBrush; // 0x1ea0 (0xc0)
	struct FSlateBrush AircraftPathBrush; // 0x1f60 (0xc0)
	struct FSlateBrush AircraftMidlinePathBrush; // 0x2020 (0xc0)
	struct FSlateBrush AircraftPathTeamIndicatorBrush; // 0x20e0 (0xc0)
	class UMaterialInterface* MiniMapBackgroundDrawingMaterial; // 0x21a0 (0x8)
	class UMaterialInterface* MiniMapCircleDrawingMaterial; // 0x21a8 (0x8)
	class UMaterialInterface* MiniMapNextCircleDrawingMaterial; // 0x21b0 (0x8)
	class UMaterialInterface* MiniMapRadiusTrackerCircleDrawingMaterial; // 0x21b8 (0x8)
	struct FName RadiusTrackerCircleCenterAndRadiusParameterName; // 0x21c0 (0x4)
	struct FName RadiusTrackerCircleColorParameterName; // 0x21c4 (0x4)
	struct TArray<struct FDynamicLandData> DynamicShadows; // 0x21c8 (0x10)
	struct TArray<struct FDynamicLandData> DynamicLands; // 0x21d8 (0x10)
	class AFortAthenaMapInfo* MapInfo; // 0x21e8 (0x8)
	class UMaterialParameterCollection* MinimapMPC; // 0x21f0 (0x8)
	class AFortBroadcastSpectatorInfo* BroadcastSpectatorInfo; // 0x21f8 (0x8)
	class USplatterGridSystem* SplatterGridSystem; // 0x2200 (0x8)
	class UFortCustomizationsPreloader* CustomizationsPreloader; // 0x2208 (0x8)
	struct TArray<struct FAICharacterPartsPreloadData> AICharacterPartsPreloadData; // 0x2210 (0x10)
	struct TArray<struct FAIPawnCustomizationPreloadData> AIPawnCustomizationPreloadData; // 0x2220 (0x10)
	unsigned char unreflected_2230[0x20]; // 0x2230 (0x20) 
	enum EAthenaGamePhase GamePhase; // 0x2250 (0x1)
	unsigned char unreflected_2251[0x7]; // 0x2251 (0x7) 
	struct FString ReasonWereInSetupPhase; // 0x2258 (0x10)
	enum EEventTournamentRound EventTournamentRound; // 0x2268 (0x1)
	bool bIsCustomMatch; // 0x2269 (0x1)
	unsigned char unreflected_226a[0x6]; // 0x226a (0x6) 
	struct FPlaylistPropertyArray CurrentPlaylistInfo; // 0x2270 (0x1e8)
	unsigned char unreflected_2458[0x28]; // 0x2458 (0x28) 
	bool bGameModeWillSkipAircraft; // 0x2480 (0x1)
	enum EAthenaGamePhaseStep GamePhaseStep; // 0x2481 (0x1)
	unsigned char unreflected_2482[0x2]; // 0x2482 (0x2) 
	float GamePhaseStepTimeRemaining; // 0x2484 (0x4)
	class USoundMix* LobbySoundMix; // 0x2488 (0x8)
	int TotalPlayersBots; // 0x2490 (0x4)
	int PlayerBotsLeft; // 0x2494 (0x4)
	unsigned char unreflected_2498[0x10]; // 0x2498 (0x10) 
	struct TArray<class AFortAthenaAircraft*> Aircrafts; // 0x24a8 (0x10)
	unsigned char bAircraftIsLocked; // 0x24b8 (0x1)
	unsigned char unreflected_24b9[0x3]; // 0x24b9 (0x3) 
	enum ESafeZoneStartUp CachedSafeZoneStartUp; // 0x24bc (0x1)
	unsigned char unreflected_24bd[0x3]; // 0x24bd (0x3) 
	int LobbyAction; // 0x24c0 (0x4)
	unsigned char unreflected_24c4[0x4]; // 0x24c4 (0x4) 
	struct FGameplayMutatorEventData MutatorEventData; // 0x24c8 (0x10)
	struct FGameplayMutatorObjectDataArray MutatorObjectDataArray; // 0x24d8 (0x118)
	int MutatorGenericInt0; // 0x25f0 (0x4)
	int MutatorGenericInt1; // 0x25f4 (0x4)
	int MutatorGenericInt2; // 0x25f8 (0x4)
	unsigned char unreflected_25fc[0x4]; // 0x25fc (0x4) 
	class AFortAthenaMutator_AI* GameplayMutatorAI; // 0x2600 (0x8)
	class UFortMutatorListComponent* MutatorListComponent; // 0x2608 (0x8)
	float DefaultGliderRedeployCanRedeploy; // 0x2610 (0x4)
	float DefaultRedeployGliderLateralVelocityMult; // 0x2614 (0x4)
	float DefaultRedeployGliderHeightLimit; // 0x2618 (0x4)
	float DefaultParachuteDeployTraceForGroundDistance; // 0x261c (0x4)
	float DefaultAllowNeutralWallEditing; // 0x2620 (0x4)
	float SignalInStormRegenSpeed; // 0x2624 (0x4)
	float SignalInStormLostSpeed; // 0x2628 (0x4)
	float StormCNDamageVulnerabilityLevel0; // 0x262c (0x4)
	float StormCNDamageVulnerabilityLevel1; // 0x2630 (0x4)
	float StormCNDamageVulnerabilityLevel2; // 0x2634 (0x4)
	float StormCNDamageVulnerabilityLevel3; // 0x2638 (0x4)
	struct FMeshNetworkStatus MeshNetworkStatus; // 0x263c (0x3)
	unsigned char unreflected_263f[0x1]; // 0x263f (0x1) 
	struct FMulticastInlineDelegate OnClientVolumeManagerReplicated; // 0x2640 (0x10)
	class UClass* VolumeManagerToUse; // 0x2650 (0x8)
	class UClass* PartyRiftPortalManagerToUse; // 0x2658 (0x8)
	unsigned char unreflected_2660[0x10]; // 0x2660 (0x10) 
	class AFortVolumeManager* VolumeManager; // 0x2670 (0x8)
	class AFortPartyRiftPortalManager* PartyRiftPortalManager; // 0x2678 (0x8)
	class AFortLocalizationService* LocalizationService; // 0x2680 (0x8)
	class UFortSanitizationService* SanitizationService; // 0x2688 (0x8)
	class UFortHermesLoadContext* HermesLoadContext; // 0x2690 (0x8)
	struct FScalableFloat ResurrectionEnabledRow; // 0x2698 (0x28)
	struct FSlateBrush SpawnMachineIconBrush; // 0x26c0 (0xc0)
	struct FSlateBrush SpawnCardIconBrush; // 0x2780 (0xc0)
	unsigned char unreflected_2840[0x10]; // 0x2840 (0x10) 
	struct FScalableFloat SafeZoneDamageAttribute; // 0x2850 (0x28)
	unsigned char unreflected_2878[0x8]; // 0x2878 (0x8) 
	struct FSlateBrush EliminationSelfIconBrush; // 0x2880 (0xc0)
	struct FSlateBrush EliminationSelfClampedIconBrush; // 0x2940 (0xc0)
	struct FSlateBrush EliminationSquadmateIconBrush; // 0x2a00 (0xc0)
	struct FSlateBrush EliminationSquadmateClampedIconBrush; // 0x2ac0 (0xc0)
	struct FSlateBrush EliminationTeammateIconBrush; // 0x2b80 (0xc0)
	struct FSlateBrush EliminationTeammateClampedIconBrush; // 0x2c40 (0xc0)
	struct FSlateBrush EliminationEnemyIconBrush; // 0x2d00 (0xc0)
	struct FSlateBrush EliminationEnemyClampedIconBrush; // 0x2dc0 (0xc0)
	struct TWeakObjectPtr<class UCurveFloat> EliminationFadeInCurve; // 0x2e80 (0x28)
	struct TWeakObjectPtr<class UCurveFloat> EliminationFadeOutCurve; // 0x2ea8 (0x28)
	struct TWeakObjectPtr<class UCurveVector> EliminationScaleInCurve; // 0x2ed0 (0x28)
	struct TWeakObjectPtr<class UCurveVector> EliminationScaleOutCurve; // 0x2ef8 (0x28)
	float EliminationMarkerHUDMaxDistance; // 0x2f20 (0x4)
	float EliminationMarkerHUDZOffset; // 0x2f24 (0x4)
	unsigned char unreflected_2f28[0x20]; // 0x2f28 (0x20) 
	struct FGameplayTagContainer GoldenPoiLocationTags; // 0x2f48 (0x20)
	unsigned char unreflected_2f68[0x90]; // 0x2f68 (0x90) 
	class AUnicornDriver* UnicornDriver; // 0x2ff8 (0x8)
	struct TArray<struct FString> ActiveEventNamesAtPlaylistLoad; // 0x3000 (0x10)
	struct FScalableFloat NewItemDuringWarmupWeightAddMod; // 0x3010 (0x28)
	float SmoothedWorldTimeSeconds; // 0x3038 (0x4)
	float SmoothedWorldTimeSecondsDrift; // 0x303c (0x4)
	struct FGameplayTagContainer RolledLootGroupTags; // 0x3040 (0x20)
	bool bEnvironmentDamageBlocked; // 0x3060 (0x1)
	unsigned char unreflected_3061[0x7]; // 0x3061 (0x7) 
	struct TArray<struct FString> ReticulatedSplineDefinitions; // 0x3068 (0x10)
	struct TArray<struct FAthenaStreamIdOverride> ReticulatedSplineIds; // 0x3078 (0x10)
	struct TArray<class AFortMissionStormShield*> StormShields; // 0x3088 (0x10)
	unsigned char unreflected_3098[0x10]; // 0x3098 (0x10) 
	bool bDamageComboHUDEnabled; // 0x30a8 (0x1)
	unsigned char unreflected_30a9[0x3]; // 0x30a9 (0x3) 
	int DamageComboHUDMinHits; // 0x30ac (0x4)
	bool bEnableMatchesProxy; // 0x30b0 (0x1)
	unsigned char unreflected_30b1[0x7]; // 0x30b1 (0x7) 
	struct FString MatchesProxyMatchId; // 0x30b8 (0x10)
	struct FMulticastInlineDelegate EndGameTimeDilationCompleteDelegate; // 0x30c8 (0x10)
	struct FScalableFloat DelayMovementInput; // 0x30d8 (0x28)
	float DelayMovementInputReplicated; // 0x3100 (0x4)
	bool bCraftingEnabled; // 0x3104 (0x1)
	unsigned char padding_3105[0x1b]; // 0x3105 (0x1b)

	/* Functions */

	// Function /Script/FortniteGame.FortGameStateAthena.UpdateAllGoldenPoiColor (Underlying native function: UpdateAllGoldenPoiColor 0x837534c)
	void UpdateAllGoldenPoiColor(struct FLinearColor& Color, struct FSlateFontInfo& Font); // (Final | BlueprintCosmetic | Native | Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameStateAthena.ShouldReturnToMatchmakingOriginOnMatchEnd (Underlying native function: ShouldReturnToMatchmakingOriginOnMatchEnd 0x8375310)
	bool ShouldReturnToMatchmakingOriginOnMatchEnd(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortGameStateAthena.ShouldPlayDeathSoundEffects (Underlying native function: ShouldPlayDeathSoundEffects 0x26fbf18)
	bool ShouldPlayDeathSoundEffects(class AActor*& Victim); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

