// Class /Script/FortniteGame.FortAIPawn
// Size: 0x3300
class AFortAIPawn : public AFortPawn
{
	unsigned char unreflected_1af0[0x38]; // 0x1af0 (0x38) 
	struct FGameplayCueParameters DeimosBatchedGameplayCueParameters; // 0x1b28 (0xd0)
	struct FFortAIAttributeReplicationProxy* AttributeReplicationProxy; // 0x1bf8 (0x8)
	struct FGameplayAbilityRepAnimMontage RepAnimMontageInfo; // 0x1c00 (0x38)
	struct FGameplayAbilityRepSharedAnim RepSharedAnimInfo; // 0x1c38 (0x10)
	unsigned char unreflected_1c48[0x8]; // 0x1c48 (0x8) 
	struct FMinimalGameplayCueReplicationProxy SimulatedProxyGameplayCues; // 0x1c50 (0x2d0)
	unsigned char bAttacking; // 0x1f20 (0x1)
	unsigned char bDied; // 0x1f20 (0x1)
	unsigned char bHitReact; // 0x1f20 (0x1)
	unsigned char bFullBodyHitReact; // 0x1f20 (0x1)
	unsigned char bDancing; // 0x1f20 (0x1)
	unsigned char bRangedAttacking; // 0x1f20 (0x1)
	unsigned char bHasGoalActor; // 0x1f20 (0x1)
	unsigned char bFrozen; // 0x1f20 (0x1)
	unsigned char unreflected_1f21[0x3]; // 0x1f21 (0x3) 
	unsigned char bUseSharedAnimation; // 0x1f24 (0x1)
	unsigned char bAnimateOnServer; // 0x1f24 (0x1)
	unsigned char bShouldUseRootComponentForTargetSelectionOverlap; // 0x1f24 (0x1)
	unsigned char bNeedsDeathNotification; // 0x1f24 (0x1)
	unsigned char bKilledOrDowned; // 0x1f24 (0x1)
	unsigned char bDespawnedDueToInactivity; // 0x1f24 (0x1)
	unsigned char bNotifySpawnRift; // 0x1f24 (0x1)
	unsigned char bUsesDBNO; // 0x1f24 (0x1)
	unsigned char bHasInventory; // 0x1f25 (0x1)
	unsigned char bShouldTossInventoryOnDeath; // 0x1f25 (0x1)
	unsigned char bUseDefenderInventoryManagement; // 0x1f25 (0x1)
	unsigned char bHasInstantReload; // 0x1f25 (0x1)
	unsigned char bHasInfiniteAmmo; // 0x1f25 (0x1)
	unsigned char bAttemptLootDropOnDeath; // 0x1f25 (0x1)
	unsigned char bIgnoreDefender; // 0x1f25 (0x1)
	unsigned char bCanUseWeapon; // 0x1f25 (0x1)
	unsigned char bTrackNearbyPickups; // 0x1f26 (0x1)
	unsigned char bIsCharging; // 0x1f26 (0x1)
	unsigned char bIsCowering; // 0x1f26 (0x1)
	unsigned char bCanShowMinimapIndicator; // 0x1f26 (0x1)
	unsigned char bShowMinimapFarOffDirectionArrow; // 0x1f26 (0x1)
	unsigned char bHasEngaged; // 0x1f26 (0x1)
	unsigned char bIsAlwaysGameplayRelevant; // 0x1f26 (0x1)
	unsigned char bShowCustomCSVRelevantKey; // 0x1f26 (0x1)
	unsigned char bIsDebugSpawnedAI; // 0x1f27 (0x1)
	unsigned char bEncounterExpectedLifespanExpired; // 0x1f27 (0x1)
	unsigned char bEnableBlockingCollisionWithOtherAI; // 0x1f27 (0x1)
	unsigned char bSetMiniMapIconRotation; // 0x1f27 (0x1)
	unsigned char bHasDroppedLoot; // 0x1f27 (0x1)
	unsigned char bUseFastAbilityReplication; // 0x1f27 (0x1)
	unsigned char bUseFastPreReplicationStep; // 0x1f27 (0x1)
	unsigned char bTurnOffOnMatchEnd; // 0x1f28 (0x1)
	unsigned char bUseAIGoalComponent; // 0x1f28 (0x1)
	unsigned char unreflected_1f29[0x7]; // 0x1f29 (0x7) 
	struct FMinimalReplicationTagCountMap FastReplicationMinimalReplicationTags; // 0x1f30 (0x60)
	struct FMinimalGameplayCueReplicationProxy FastReplicationMinimalGameplayCueProxy; // 0x1f90 (0x2d0)
	struct FMulticastInlineDelegate OnInventoryInitialized; // 0x2260 (0x10)
	struct FMulticastInlineDelegate OnInventoryUpdated; // 0x2270 (0x10)
	unsigned char unreflected_2280[0x30]; // 0x2280 (0x30) 
	float AIDifficultyLevel; // 0x22b0 (0x4)
	enum EFortAILevelRatingDisplayType LevelRatingDisplayType; // 0x22b4 (0x1)
	unsigned char unreflected_22b5[0x3]; // 0x22b5 (0x3) 
	class UFortAIEncounterInfo* EncounterInfo; // 0x22b8 (0x8)
	int SpawnSetIndex; // 0x22c0 (0x4)
	struct FGuid SpawnGroupGuid; // 0x22c4 (0x10)
	int EnemyIndexInSpawnGroup; // 0x22d4 (0x4)
	float FinishEncounterSpawnFallbackTime; // 0x22d8 (0x4)
	float EncounterSpawnDisableRangedAttackingTime; // 0x22dc (0x4)
	float EncounterSpawnDisableMeleeAttackingTime; // 0x22e0 (0x4)
	unsigned char unreflected_22e4[0x4]; // 0x22e4 (0x4) 
	struct FTimerHandle* EncounterExpectedLifespanTimerHandle; // 0x22e8 (0x8)
	class AActor* SpawnRift; // 0x22f0 (0x8)
	struct FVector SpawnRiftLocation; // 0x22f8 (0x18)
	class AActor* SpawnSourceActor; // 0x2310 (0x8)
	class UClass* AIGoalComponentClass; // 0x2318 (0x8)
	float MaxTimeAllowedOutsideTether; // 0x2320 (0x4)
	unsigned char unreflected_2324[0x4]; // 0x2324 (0x4) 
	class UBehaviorTree* BehaviorTree; // 0x2328 (0x8)
	class UClass* DefaultNavFilter; // 0x2330 (0x8)
	class UClass* HuntingNavFilter; // 0x2338 (0x8)
	unsigned char unreflected_2340[0x8]; // 0x2340 (0x8) 
	float DBNOInteractionDuration; // 0x2348 (0x4)
	unsigned char unreflected_234c[0x4]; // 0x234c (0x4) 
	struct FMulticastInlineDelegate OnDowned; // 0x2350 (0x10)
	struct TEnumAsByte<TInteractionType> DBNOInteractionType; // 0x2360 (0x1)
	struct TEnumAsByte<EFortMovementStyle> MovementStyles[0x4]; // 0x2361 (0x1) (ARRAY) 
	unsigned char unreflected_2365[0x3]; // 0x2365 (0x3) 
	float UpdateNearbyPickupFrequency; // 0x2368 (0x4)
	struct FGameplayTag RequiredWeaponPickupTag; // 0x236c (0x4)
	struct FGameplayTagQuery RequiredWeaponPickupTagQuery; // 0x2370 (0x48)
	bool bUsePickupDirectionOverride; // 0x23b8 (0x1)
	unsigned char unreflected_23b9[0x7]; // 0x23b9 (0x7) 
	struct FVector PickupDirectionOverride; // 0x23c0 (0x18)
	struct FName NoWeaponInCombatEventName; // 0x23d8 (0x4)
	struct FName NoWeaponOutOfCombatEventName; // 0x23dc (0x4)
	struct FVector CachedHitLocation; // 0x23e0 (0x18)
	struct FGameplayTagContainer TurnTransitionGameplayAbilityTag; // 0x23f8 (0x20)
	struct TWeakObjectPtr<class UParticleSystem> DeathParticles; // 0x2418 (0x28)
	int NumRunVariations; // 0x2440 (0x4)
	int CurrentRunVariationIndex; // 0x2444 (0x4)
	float RunVariationRadius; // 0x2448 (0x4)
	float LocomotionPlayRateScale; // 0x244c (0x4)
	int EyeIndex; // 0x2450 (0x4)
	int SkinIndex; // 0x2454 (0x4)
	struct FLinearColor DefaultEyeColor; // 0x2458 (0x10)
	float DefaultEyeBrightness; // 0x2468 (0x4)
	struct FLinearColor DefaultSkinColor; // 0x246c (0x10)
	float DefaultSkinGlow; // 0x247c (0x4)
	struct FLinearColor MinimapDefaultIconColor; // 0x2480 (0x10)
	struct FLinearColor PlayerManagerMinimapColor; // 0x2490 (0x10)
	unsigned char unreflected_24a0[0x10]; // 0x24a0 (0x10) 
	struct FSlateBrush MiniMapIconBrush; // 0x24b0 (0xc0)
	struct FSlateBrush MiniMapAboveBelowIconBrush; // 0x2570 (0xc0)
	struct TArray<struct FMinimapGoalByTagColorsData> MinimapGoalByTagColors; // 0x2630 (0x10)
	int8_t MinimapGoalByTagColorIndex; // 0x2640 (0x1)
	unsigned char unreflected_2641[0x3]; // 0x2641 (0x3) 
	struct FName AppearanceOverrideName; // 0x2644 (0x4)
	enum EFortAIPawnGender AppearanceOverrideGender; // 0x2648 (0x1)
	struct TEnumAsByte<EFortCombatEvents> FollowPlayerEvent; // 0x2649 (0x1)
	struct TEnumAsByte<EFortCombatEvents> InCombatNearPlayerEvent; // 0x264a (0x1)
	struct TEnumAsByte<TInteractionType> InteractionType; // 0x264b (0x1)
	float FollowPlayerRange; // 0x264c (0x4)
	float InteractionDuration; // 0x2650 (0x4)
	unsigned char unreflected_2654[0x4]; // 0x2654 (0x4) 
	struct FText InteractionText; // 0x2658 (0x18)
	unsigned char unreflected_2670[0x19]; // 0x2670 (0x19) 
	struct TEnumAsByte<TInteractionType> SecondInteractionType; // 0x2689 (0x1)
	unsigned char unreflected_268a[0x2]; // 0x268a (0x2) 
	float SecondInteractionDuration; // 0x268c (0x4)
	struct FText SecondInteractionText; // 0x2690 (0x18)
	struct FMulticastInlineDelegate OnInteraction; // 0x26a8 (0x10)
	class USoundBase* InteractionSound; // 0x26b8 (0x8)
	class ABuildingTrapDefender* DefenderTrap; // 0x26c0 (0x8)
	struct FMulticastInlineDelegate OnActorBeginCrowdOverlap; // 0x26c8 (0x10)
	bool bCollisionFreeBuildingOnlyAgainstPlayerBuilds; // 0x26d8 (0x1)
	unsigned char unreflected_26d9[0x3]; // 0x26d9 (0x3) 
	float DeepWaterImmersionDepth; // 0x26dc (0x4)
	unsigned char bDebugAI; // 0x26e0 (0x1)
	unsigned char bDebugAIAnim; // 0x26e0 (0x1)
	unsigned char bUseBuildingAttackingHotspots; // 0x26e0 (0x1)
	unsigned char bCanBeLaunched; // 0x26e0 (0x1)
	unsigned char bCanMoveThroughWalls; // 0x26e0 (0x1)
	unsigned char bCanUseNavWalking; // 0x26e0 (0x1)
	unsigned char bCanUseSimpleCollisions; // 0x26e0 (0x1)
	unsigned char bCanUseStepAside; // 0x26e1 (0x1)
	unsigned char bCanUseDoors; // 0x26e1 (0x1)
	unsigned char bCanUseOpenedDoors; // 0x26e1 (0x1)
	unsigned char bCanUseShootingHotspots; // 0x26e1 (0x1)
	unsigned char bCanSleep; // 0x26e1 (0x1)
	unsigned char bIsSleeping; // 0x26e1 (0x1)
	unsigned char bShouldStartSleeping; // 0x26e1 (0x1)
	unsigned char bCanLookAtGoal; // 0x26e1 (0x1)
	unsigned char bDespawnedDueToExpiration; // 0x26e2 (0x1)
	unsigned char bAllowServerCosmeticComponentOptimizations; // 0x26e2 (0x1)
	unsigned char bAllowCapsuleComponentsOnServer; // 0x26e2 (0x1)
	unsigned char bRootComponentIgnoreQueryPawnCapsule; // 0x26e2 (0x1)
	unsigned char bCanUseMeshPooling; // 0x26e2 (0x1)
	unsigned char bUseCrowdSimulation; // 0x26e2 (0x1)
	unsigned char bControlWalkingOffLedges; // 0x26e2 (0x1)
	unsigned char bCanBeBaseForOtherPawns; // 0x26e2 (0x1)
	unsigned char unreflected_26e3[0x1]; // 0x26e3 (0x1) 
	unsigned char bUseAppearanceOverride; // 0x26e4 (0x1)
	unsigned char bCanInteract; // 0x26e4 (0x1)
	unsigned char bHideHealthBar; // 0x26e4 (0x1)
	unsigned char bHasBuildingHitEffects; // 0x26e4 (0x1)
	unsigned char bReplicateGrantedTagsWithFastAbilityReplication; // 0x26e4 (0x1)
	unsigned char bReplicateGameplayCuesWithFastAbilityReplication; // 0x26e4 (0x1)
	unsigned char bOnlySkipAbilitySystemComponentWithFastAbilityReplication; // 0x26e4 (0x1)
	unsigned char bShouldIgnoreThisBaseRotation; // 0x26e5 (0x1)
	unsigned char unreflected_26e6[0x12]; // 0x26e6 (0x12) 
	struct TWeakObjectPtr<class AFortPlayerState> BeingControlledBy; // 0x26f8 (0x8)
	struct TEnumAsByte<EFortMovementUrgency> MovementUrgency; // 0x2700 (0x1)
	enum EFortressAIType AIType; // 0x2701 (0x1)
	unsigned char Team; // 0x2702 (0x1)
	unsigned char unreflected_2703[0x1]; // 0x2703 (0x1) 
	struct FName SimpleCollisionsProfileName; // 0x2704 (0x4)
	struct FFortAISpawnGroupUpgradeUIData UpgradeUIData; // 0x2708 (0x70)
	unsigned char unreflected_2778[0x8]; // 0x2778 (0x8) 
	struct FSlateBrush CachedUpgradeUIDataUpgradeIconBrush; // 0x2780 (0xc0)
	float ScoreMultiplier; // 0x2840 (0x4)
	int OverriddenScore; // 0x2844 (0x4)
	enum EScoreDistributionType OverriddenScoreDistribution; // 0x2848 (0x1)
	unsigned char unreflected_2849[0x3]; // 0x2849 (0x3) 
	float LootDropConeHalfAngle; // 0x284c (0x4)
	float LootDropSpeed; // 0x2850 (0x4)
	float MinItemTossDist; // 0x2854 (0x4)
	float MaxItemTossDist; // 0x2858 (0x4)
	float ItemTossDirectionConeHalfAngle; // 0x285c (0x4)
	enum EFortHotSpotSlot HotspotType; // 0x2860 (0x1)
	enum EFortPartialPathUsage PartialPathUsage; // 0x2861 (0x1)
	unsigned char unreflected_2862[0x6]; // 0x2862 (0x6) 
	class AFortPlayerStateZone* PlayerManager; // 0x2868 (0x8)
	struct FString DefenderItemInstanceId; // 0x2870 (0x10)
	struct FName DefenderSquadId; // 0x2880 (0x4)
	float DefenderPlacedTime; // 0x2884 (0x4)
	float RecentlySeenInterval; // 0x2888 (0x4)
	unsigned char unreflected_288c[0x4]; // 0x288c (0x4) 
	struct FRotator CurrentAIRotationRate; // 0x2890 (0x18)
	float MoveSoundStimulusBroadcastInterval; // 0x28a8 (0x4)
	float MoveSoundStimulusMaxRange; // 0x28ac (0x4)
	bool bGenerateMoveSoundInAllMovementModes; // 0x28b0 (0x1)
	unsigned char unreflected_28b1[0xf]; // 0x28b1 (0xf) 
	class UShapeComponent* WeaponCollisionComponent; // 0x28c0 (0x8)
	class AFortInventory* Inventory; // 0x28c8 (0x8)
	struct TArray<class AFortPickup*> NearbyPickups; // 0x28d0 (0x10)
	struct TMap<class AFortPickup*, float> UnreachablePickups; // 0x28e0 (0x50)
	unsigned char unreflected_2930[0x10]; // 0x2930 (0x10) 
	struct TArray<struct FFortAIAppearanceOverrideEntry> AppearanceOverrideEntries; // 0x2940 (0x10)
	int AppearanceOverrideEntryIndex; // 0x2950 (0x4)
	unsigned char unreflected_2954[0x4]; // 0x2954 (0x4) 
	struct FVector SpawnLocation; // 0x2958 (0x18)
	struct FRotator SpawnRotation; // 0x2970 (0x18)
	struct TWeakObjectPtr<class ABuildingActor> SleepingFloor; // 0x2988 (0x8)
	struct FName PelvisBoneName; // 0x2990 (0x4)
	struct FName HeadBoneName; // 0x2994 (0x4)
	unsigned char unreflected_2998[0xc]; // 0x2998 (0xc) 
	float MinimapIndicatorUpdateFrequency; // 0x29a4 (0x4)
	unsigned char unreflected_29a8[0x8]; // 0x29a8 (0x8) 
	float MiniMapViewableDistance; // 0x29b0 (0x4)
	float DistanceToPlayerManagerToShowHealthBar; // 0x29b4 (0x4)
	float DistanceToOtherPlayersToShowHealthBar; // 0x29b8 (0x4)
	unsigned char unreflected_29bc[0xc]; // 0x29bc (0xc) 
	class UFortAIAttributesSet* AttributesSet; // 0x29c8 (0x8)
	class UFortCharacterAttrSet* CharacterAttrSet; // 0x29d0 (0x8)
	class UFortWeaponAttrSet* WeaponAttrSet; // 0x29d8 (0x8)
	class USoundBase* ImpactPhysicalSurfaceSounds[0x1e]; // 0x29e0 (0x8) (ARRAY) 
	class UParticleSystem* ImpactPhysicalSurfaceEffects[0x1e]; // 0x2ad0 (0x8) (ARRAY) 
	struct FScalableFloat AthenaRVOWeightOverride; // 0x2bc0 (0x28)
	class UFortSimpleMiniMapIndicator* MiniMapIndicator; // 0x2be8 (0x8)
	struct FVector2D MiniMapScale; // 0x2bf0 (0x10)
	struct TArray<class UFortAbilitySet*> DefaultGameplayAbilitySets; // 0x2c00 (0x10)
	struct TArray<class UFortAbilitySet*> SpawnInheritedCharacterAbilitySets; // 0x2c10 (0x10)
	struct TArray<class UFortGameplayModifierItemDefinition*> SpawnModifierDefinitions; // 0x2c20 (0x10)
	class UFortAbilitySystemComponent* AIPawnAbilitySystemComponent; // 0x2c30 (0x8)
	struct FGameplayTagContainer WallAttackGameplayAbilityTags; // 0x2c38 (0x20)
	struct FGameplayTagContainer WallRangedAttackGameplayAbilityTags; // 0x2c58 (0x20)
	struct FGameplayTagContainer CeilingAttackGameplayAbilityTags; // 0x2c78 (0x20)
	struct FGameplayTagContainer FloorAttackGameplayAbilityTags; // 0x2c98 (0x20)
	struct TArray<struct FGameplayTagContainer> FailedAbilityQueryTags; // 0x2cb8 (0x10)
	class AActor* CurrentAimTarget; // 0x2cc8 (0x8)
	class UFortNavObstacleComponent* NavObstacleComponent; // 0x2cd0 (0x8)
	unsigned char unreflected_2cd8[0x10]; // 0x2cd8 (0x10) 
	float BuildingHitMaxDistanceToPlayer; // 0x2ce8 (0x4)
	float BuildingHitMaxDistanceToHitLocation; // 0x2cec (0x4)
	float HeadHeightPercent; // 0x2cf0 (0x4)
	unsigned char unreflected_2cf4[0x4]; // 0x2cf4 (0x4) 
	struct FMarkedActorDisplayInfo MarkerDisplay; // 0x2cf8 (0x98)
	bool bCanBeMarked; // 0x2d90 (0x1)
	unsigned char unreflected_2d91[0x7]; // 0x2d91 (0x7) 
	struct FScalableFloat IsBlockingBuilding; // 0x2d98 (0x28)
	unsigned char unreflected_2dc0[0x28]; // 0x2dc0 (0x28) 
	struct FScalableFloat NetUpdateFrequencyMin; // 0x2de8 (0x28)
	struct FScalableFloat NetUpdateFrequencyDormant; // 0x2e10 (0x28)
	struct FScalableFloat NetUpdateFrequencyBelowLower; // 0x2e38 (0x28)
	struct FScalableFloat NetUpdateFrequencyLower; // 0x2e60 (0x28)
	struct FScalableFloat NetUpdateFrequencyAboveLower; // 0x2e88 (0x28)
	struct FScalableFloat NetUpdateFrequencyBelowNormal; // 0x2eb0 (0x28)
	struct FScalableFloat NetUpdateFrequencyNormal; // 0x2ed8 (0x28)
	struct FScalableFloat NetUpdateFrequencyAboveNormal; // 0x2f00 (0x28)
	unsigned char unreflected_2f28[0x120]; // 0x2f28 (0x120) 
	class UFortAccountItem* DefenderItem; // 0x3048 (0x8)
	unsigned char unreflected_3050[0xb8]; // 0x3050 (0xb8) 
	class AFortPawn* TetheredFollower; // 0x3108 (0x8)
	unsigned char unreflected_3110[0x10]; // 0x3110 (0x10) 
	class UClass* TetheredCamera; // 0x3120 (0x8)
	class UClass* TetheredTargetingCamera; // 0x3128 (0x8)
	bool bIsTetheredBoosting; // 0x3130 (0x1)
	unsigned char unreflected_3131[0x3]; // 0x3131 (0x3) 
	float TetherBoostMultiplier; // 0x3134 (0x4)
	float TetherJumpServerCorrectionIgnoreTime; // 0x3138 (0x4)
	float TetherJumpLastTime; // 0x313c (0x4)
	class UClass* TetherBoundsXYSplineClass; // 0x3140 (0x8)
	class USplineComponent* TetherBoundsXYSplineComponent; // 0x3148 (0x8)
	struct FMulticastInlineDelegate OnUpdateFromVehicleInput; // 0x3150 (0x10)
	unsigned char unreflected_3160[0x8]; // 0x3160 (0x8) 
	class UFortAIPawnCustomizationDefinition* CustomizationsToLoad; // 0x3168 (0x8)
	bool bCanUnloadCustomization; // 0x3170 (0x1)
	unsigned char unreflected_3171[0x7]; // 0x3171 (0x7) 
	class UFortAIPawnCustomizationDefinition* UsedCustomization; // 0x3178 (0x8)
	struct FMulticastInlineDelegate OnCustomizationsLoadedEvent; // 0x3180 (0x10)
	struct FMulticastInlineDelegate OnCustomizationsUnloadedEvent; // 0x3190 (0x10)
	class UFortCharacterPartsComponent* CachedPartsComponent; // 0x31a0 (0x8)
	class UFortAIAssetLoader* AIAssetLoader; // 0x31a8 (0x8)
	unsigned char bReplicateInventory; // 0x31b0 (0x1)
	unsigned char unreflected_31b1[0x27]; // 0x31b1 (0x27) 
	struct FHitResult LastDamageHitResult; // 0x31d8 (0xe0)
	struct FVector CustomBounceVelocityForPickup; // 0x32b8 (0x18)
	struct FVector CustomBouncePawnOffsetForPickup; // 0x32d0 (0x18)
	bool bSupportsAdvancedMovementSet; // 0x32e8 (0x1)
	unsigned char padding_32e9[0x17]; // 0x32e9 (0x17)

	/* Functions */

	// Function /Script/FortniteGame.FortAIPawn.TurnOnSleepingOptimizations (Underlying native function: TurnOnSleepingOptimizations 0x8cf5308)
	void TurnOnSleepingOptimizations(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortAIPawn.TriggerNoWeaponSpeech (Underlying native function: TriggerNoWeaponSpeech 0x8cf52b8)
	void TriggerNoWeaponSpeech(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortAIPawn.SpawnPickupInWorldWithLootTierAsync (Underlying native function: SpawnPickupInWorldWithLootTierAsync 0x8cf47b0)
	void SpawnPickupInWorldWithLootTierAsync(struct FName& LootTierName, struct FVector& Position, int& OverrideMaxStackCount, bool& bToss, enum EFortPickupSourceTypeFlag& SourceType, enum EFortPickupSpawnSource& Source); // (Final | BlueprintAuthorityOnly | Native | Public | HasDefaults | BlueprintCallable)

