// Class /Script/FortniteGame.FortPawn
// Size: 0x1af0
class AFortPawn : public AFGF_Character
{
	unsigned char unreflected_680[0x88]; // 0x680 (0x88) 
	unsigned char bUseBaseChanged; // 0x708 (0x1)
	unsigned char bIgnoreNextFallingDamage; // 0x708 (0x1)
	unsigned char bAllowDeathFromFallingDamage; // 0x708 (0x1)
	unsigned char bIsDying; // 0x708 (0x1)
	unsigned char bPlayedDying; // 0x708 (0x1)
	unsigned char bIsHiddenForDeath; // 0x708 (0x1)
	unsigned char bIsKnockedback; // 0x708 (0x1)
	unsigned char bIsStaggered; // 0x709 (0x1)
	unsigned char bCanCapsuleBeUsedForTargeting; // 0x709 (0x1)
	unsigned char bUseLineTestForDamageZoneBoneDetection; // 0x709 (0x1)
	unsigned char bMovingEmote; // 0x709 (0x1)
	unsigned char bMovingEmoteForwardOnly; // 0x709 (0x1)
	unsigned char bMovingEmoteFollowingOnly; // 0x709 (0x1)
	unsigned char bMovingEmoteSkipLandingFX; // 0x70a (0x1)
	unsigned char bIsInvulnerable; // 0x70a (0x1)
	unsigned char bSpotted; // 0x70a (0x1)
	unsigned char bRegisterWithAISight; // 0x70a (0x1)
	unsigned char bRegisterWithAimAssist; // 0x70a (0x1)
	unsigned char bPrimaryInputHeld; // 0x70a (0x1)
	unsigned char bSecondaryInputHeld; // 0x70a (0x1)
	unsigned char bPrimaryInputQueued; // 0x70a (0x1)
	unsigned char bWeaponActivated; // 0x70b (0x1)
	unsigned char bIsInGoop; // 0x70b (0x1)
	unsigned char bReplicatedIsInGoop; // 0x70b (0x1)
	unsigned char bIsSliding; // 0x70b (0x1)
	unsigned char bIsSkating; // 0x70b (0x1)
	unsigned char unreflected_70c[0x4]; // 0x70c (0x4) 
	struct FGameplayTagContainer AdditionalPickupTags; // 0x710 (0x20)
	enum EFortPickupSpawnSource SpawnSourceOverride; // 0x730 (0x1)
	unsigned char bIsSwinging; // 0x731 (0x1)
	unsigned char bIsSynchedAction; // 0x731 (0x1)
	unsigned char bSwingingAttached; // 0x731 (0x1)
	unsigned char unreflected_732[0x6]; // 0x732 (0x6) 
	struct FVector SwingAttachLocation; // 0x738 (0x18)
	float SwingAttachLocationUpdateDistanceThreshold; // 0x750 (0x4)
	unsigned char unreflected_754[0xc]; // 0x754 (0xc) 
	struct FSynchedActionWarpPointInfo_Replicated ReplicatedSynchedActionWarpPointInfo; // 0x760 (0x50)
	unsigned char unreflected_7b0[0x61]; // 0x7b0 (0x61) 
	unsigned char bSkipAnalogJump; // 0x811 (0x1)
	struct TEnumAsByte<ETraceTypeQuery> FootstepTraceTypeQuery; // 0x812 (0x1)
	struct TEnumAsByte<EFortFootstepSurfaceType> FootstepSurfaceType; // 0x813 (0x1)
	unsigned char unreflected_814[0x4]; // 0x814 (0x4) 
	class UFortSoundIndicatorComponent* SoundIndicatorComponent; // 0x818 (0x8)
	unsigned char unreflected_820[0x10]; // 0x820 (0x10) 
	enum EUpdateRateShiftBucket UroShiftBucket; // 0x830 (0x1)
	unsigned char bUpdateMeshComponentUpdateFlagOnServer; // 0x831 (0x1)
	unsigned char bUROCanTieToLODs; // 0x831 (0x1)
	unsigned char bPostProcessNavLocation; // 0x831 (0x1)
	unsigned char bHealthSynced; // 0x831 (0x1)
	unsigned char bWeaponHolstered; // 0x831 (0x1)
	unsigned char bSkipReticleColorTrace; // 0x831 (0x1)
	unsigned char bPrioritizePawnCollisionsOnAbilityTargetSelectionVisibilityTest; // 0x831 (0x1)
	unsigned char bTreatAsPawnForHitMarkers; // 0x832 (0x1)
	unsigned char bDisplayPawnHitMarkersForChildActors; // 0x832 (0x1)
	unsigned char bUsesStats; // 0x832 (0x1)
	unsigned char bAllowBuildingActorTeleport; // 0x832 (0x1)
	unsigned char bIsDBNO; // 0x832 (0x1)
	unsigned char bWasDBNOOnDeath; // 0x832 (0x1)
	unsigned char bCachedIsInAthena; // 0x832 (0x1)
	unsigned char bShouldUseCharacterMovementIdleFastPath; // 0x832 (0x1)
	struct TEnumAsByte<EFortMovementStyle> CurrentMovementStyle; // 0x833 (0x1)
	enum EFortControlRecoveryBehavior ControlRecoveryBehavior; // 0x834 (0x1)
	unsigned char TeleportCounter; // 0x835 (0x1)
	unsigned char unreflected_836[0x2]; // 0x836 (0x2) 
	struct FDataTableRowHandle PawnStatHandle; // 0x838 (0x10)
	float SlidingFriction; // 0x848 (0x4)
	unsigned char bIsSlopeSliding; // 0x84c (0x1)
	unsigned char unreflected_84d[0x1]; // 0x84d (0x1) 
	uint16_t PackedReplicatedSlopeAngles; // 0x84e (0x2)
	float SlidingBrakingDeceleration; // 0x850 (0x4)
	unsigned char unreflected_854[0x4]; // 0x854 (0x4) 
	class UFortStormShieldComponent* StormShieldComponent; // 0x858 (0x8)
	struct FMulticastInlineDelegate OnStormShieldComponentCreated; // 0x860 (0x10)
	enum EFortPawnPushSize PushSize; // 0x870 (0x1)
	unsigned char unreflected_871[0xb]; // 0x871 (0xb) 
	float LastSurfaceTraceTime; // 0x87c (0x4)
	struct FVector LastSurfaceTraceLocation; // 0x880 (0x18)
	unsigned char unreflected_898[0x28]; // 0x898 (0x28) 
	struct FMulticastInlineDelegate OnPawnJumped; // 0x8c0 (0x10)
	unsigned char bIsJumping; // 0x8d0 (0x1)
	unsigned char unreflected_8d1[0x3]; // 0x8d1 (0x3) 
	int PawnUniqueID; // 0x8d4 (0x4)
	class AFortWeapon* CurrentWeapon; // 0x8d8 (0x8)
	class AFortWeapon* PreviousWeapon; // 0x8e0 (0x8)
	struct TArray<class AFortWeapon*> CurrentWeaponList; // 0x8e8 (0x10)
	struct FString PreviousAbilityWeaponNameForTelemetry; // 0x8f8 (0x10)
	unsigned char unreflected_908[0x60]; // 0x908 (0x60) 
	struct FName WeaponHandSocketName; // 0x968 (0x4)
	struct FName LeftHandWeaponHandSocketName; // 0x96c (0x4)
	class AActor* SpawnSpot; // 0x970 (0x8)
	struct FGameplayTagContainer DeathTags; // 0x978 (0x20)
	float SpawnImmunityTime; // 0x998 (0x4)
	unsigned char unreflected_99c[0x4]; // 0x99c (0x4) 
	class AFortWaterBodyActor* CurrentWaterBody; // 0x9a0 (0x8)
	bool bShouldSupportSurfaceSwimming; // 0x9a8 (0x1)
	unsigned char unreflected_9a9[0x7]; // 0x9a9 (0x7) 
	class AFortWaterBodyActor* ReplicatedWaterBody; // 0x9b0 (0x8)
	struct TArray<class AFortPickup*> IncomingPickups; // 0x9b8 (0x10)
	struct TArray<struct FFortPickupEntryData> PickupDirectionData; // 0x9c8 (0x10)
	bool bIsStunned; // 0x9d8 (0x1)
	unsigned char unreflected_9d9[0x7]; // 0x9d9 (0x7) 
	struct TArray<struct FWindVolumeData> WindVolumes; // 0x9e0 (0x10)
	struct FVortexParams VortexParams; // 0x9f0 (0x80)
	unsigned char bIsInVortex; // 0xa70 (0x1)
	unsigned char bReplicatedIsInVortex; // 0xa70 (0x1)
	unsigned char unreflected_a71[0x7]; // 0xa71 (0x7) 
	class AFortSkyTube* CurrentSkyTube; // 0xa78 (0x8)
	class AFortSkyTube* ReplicatedSkyTube; // 0xa80 (0x8)
	struct TArray<class AFortSkyTube*> OverlappedSkyTubes; // 0xa88 (0x10)
	struct FScalableFloat bPrioritizeEarlierTubes; // 0xa98 (0x28)
	struct FMulticastInlineDelegate OnSkyTubeChanged; // 0xac0 (0x10)
	struct FMulticastInlineDelegate OnSearchedContainer; // 0xad0 (0x10)
	int AdditiveCringeCount; // 0xae0 (0x4)
	float AdditiveCringeDuration; // 0xae4 (0x4)
	bool bSupportsDamageNumbersAtHitLocation; // 0xae8 (0x1)
	unsigned char unreflected_ae9[0x7]; // 0xae9 (0x7) 
	struct FVector_NetQuantize PushMomentum; // 0xaf0 (0x18)
	unsigned char unreflected_b08[0x4]; // 0xb08 (0x4) 
	float LocalSpin; // 0xb0c (0x4)
	unsigned char unreflected_b10[0x1]; // 0xb10 (0x1) 
	bool bTurnTransitionActiveAndControllingRotation; // 0xb11 (0x1)
	unsigned char unreflected_b12[0x72]; // 0xb12 (0x72) 
	struct FGameplayCueTag DeathCueTag; // 0xb84 (0x4)
	struct TArray<struct FFortStatManagerTag> DeathStatTags; // 0xb88 (0x10)
	class USkeletalMeshSocket* DeathHitSocket; // 0xb98 (0x8)
	struct FMulticastInlineDelegate OnPlayerStartDBNO; // 0xba0 (0x10)
	struct FMulticastInlineDelegate OnDBNOStateChanged; // 0xbb0 (0x10)
	float DefaultLifespanAfterDeath; // 0xbc0 (0x4)
	float TeamBeaconMaxDist; // 0xbc4 (0x4)
	struct FColor TeamBeaconTextColor; // 0xbc8 (0x4)
	float LastTakeHitTimeTimeout; // 0xbcc (0x4)
	float LastDamagedTime; // 0xbd0 (0x4)
	unsigned char unreflected_bd4[0x4]; // 0xbd4 (0x4) 
	class AFortWeapon* CurrentlyAttachedWeapon; // 0xbd8 (0x8)
	class UPrimitiveComponent* CachedNavFloor; // 0xbe0 (0x8)
	float MaxFootstepDistance; // 0xbe8 (0x4)
	unsigned char unreflected_bec[0x4]; // 0xbec (0x4) 
	class USoundBase* DBNOLandingSound; // 0xbf0 (0x8)
	class USoundBase* DefaultFootstepSound; // 0xbf8 (0x8)
	class USoundBase* DefaultFastFootstepSound; // 0xc00 (0x8)
	class USoundBase* DefaultLandingSound; // 0xc08 (0x8)
	class USoundBase* DefaultHardLandingSound; // 0xc10 (0x8)
	class USoundBase* DefaultJumpSound; // 0xc18 (0x8)
	class UWeaponHitNotifyAudioBank* DefaultHitNotifyAudioBank; // 0xc20 (0x8)
	class UFortSwimmingAudioBank* DefaultSwimmingAudioBank; // 0xc28 (0x8)
	float LineTestForDamageZoneBoneDetectionRadius; // 0xc30 (0x4)
	unsigned char unreflected_c34[0x4]; // 0xc34 (0x4) 
	struct FPawnDamageZones DamageZones[0x5]; // 0xc38 (0x18) (ARRAY) 
	unsigned char DamageZoneActiveBitMask; // 0xcb0 (0x1)
	unsigned char unreflected_cb1[0x3]; // 0xcb1 (0x3) 
	float TargettingZOffset; // 0xcb4 (0x4)
	unsigned char JumpFlashCountPacked; // 0xcb8 (0x1)
	unsigned char LandingFlashCountPacked; // 0xcb9 (0x1)
	unsigned char unreflected_cba[0x6]; // 0xcba (0x6) 
	struct TMap<struct FName, struct FEmoteAudioComponentData> EmoteAudioComps; // 0xcc0 (0x50)
	class USoundAttenuation* FrontEndEmoteAudioAttenuation; // 0xd10 (0x8)
	class USoundAttenuation* InGameEmoteAudioAttenuation; // 0xd18 (0x8)
	class USoundEffectSourcePresetChain* InGameEmoteSoundEffectSoundPresetChain; // 0xd20 (0x8)
	struct TMap<int, class UMeshComponent*> EmoteMeshComps; // 0xd28 (0x50)
	struct TMap<int, class AActor*> EmotePropActors; // 0xd78 (0x50)
	struct TMap<int, class UParticleSystemComponent*> EmoteParticleSystemComps; // 0xdc8 (0x50)
	int EmoteCount; // 0xe18 (0x4)
	float LastEmoteTime; // 0xe1c (0x4)
	float LastEmoteEndTime; // 0xe20 (0x4)
	unsigned char unreflected_e24[0x4]; // 0xe24 (0x4) 
	class UFortItemDefinition* LastEmoteItemDef; // 0xe28 (0x8)
	class UFortItemDefinition* LastReplicatedEmoteExecuted; // 0xe30 (0x8)
	bool bFireBlockedByEmoteCooldown; // 0xe38 (0x1)
	unsigned char unreflected_e39[0x3]; // 0xe39 (0x3) 
	float EmoteToFireCooldownTime; // 0xe3c (0x4)
	float EmoteWalkSpeed; // 0xe40 (0x4)
	unsigned char unreflected_e44[0x4]; // 0xe44 (0x4) 
	struct TArray<class UActorComponent*> DynamicComponents; // 0xe48 (0x10)
	struct TArray<class UFortGameplayModifierItemDefinition*> AdditionalModifierDefinitions; // 0xe58 (0x10)
	struct FMulticastInlineDelegate OnPawnTeleported; // 0xe68 (0x10)
	struct FMulticastInlineDelegate OnPawnLanded; // 0xe78 (0x10)
	struct FMulticastInlineDelegate OnPawnStartedEmote; // 0xe88 (0x10)
	struct FMulticastInlineDelegate OnPawnStoppedEmote; // 0xe98 (0x10)
	struct FMulticastInlineDelegate OnHitPawn; // 0xea8 (0x10)
	struct FMulticastInlineDelegate OnDied; // 0xeb8 (0x10)
	struct FMulticastInlineDelegate OnDeathEffects; // 0xec8 (0x10)
	unsigned char unreflected_ed8[0x30]; // 0xed8 (0x30) 
	struct FMulticastInlineDelegate OnDamaged; // 0xf08 (0x10)
	struct FMulticastInlineDelegate OnDidDamage; // 0xf18 (0x10)
	unsigned char unreflected_f28[0x10]; // 0xf28 (0x10) 
	class UFortEmoteComponent* EmoteComponent; // 0xf38 (0x8)
	class UFortFootstepAudioBank* FootstepBank; // 0xf40 (0x8)
	unsigned char unreflected_f48[0x20]; // 0xf48 (0x20) 
	struct FVector CachedStepSurfaceNormal; // 0xf68 (0x18)
	class UFortFoleyFootstepContext* FoleyFootstepContext; // 0xf80 (0x8)
	class UFortFoleyHitContext* FoleyHitContext; // 0xf88 (0x8)
	struct FMulticastInlineDelegate OnWeaponEquippedDelegate; // 0xf90 (0x10)
	struct FMulticastInlineDelegate OnWeaponUnEquippedDelegate; // 0xfa0 (0x10)
	struct FMulticastInlineDelegate OnWeaponAttachmentChangedDelegate; // 0xfb0 (0x10)
	class UClass* HealthRegenDelayGameplayEffect; // 0xfc0 (0x8)
	class UClass* HealthRegenGameplayEffect; // 0xfc8 (0x8)
	class UClass* ShieldRegenDelayGameplayEffect; // 0xfd0 (0x8)
	class UClass* ShieldRegenGameplayEffect; // 0xfd8 (0x8)
	class UClass* CurrentWeaponAnimLayerOverlayClass; // 0xfe0 (0x8)
	struct FMulticastInlineDelegate OnHolsteredEvent; // 0xfe8 (0x10)
	struct FMulticastInlineDelegate OnUnholsteredEvent; // 0xff8 (0x10)
	unsigned char unreflected_1008[0x18]; // 0x1008 (0x18) 
	int WeaponHolsterCounter; // 0x1020 (0x4)
	unsigned char unreflected_1024[0x4]; // 0x1024 (0x4) 
	struct TArray<struct FName> WeaponHolsterIds; // 0x1028 (0x10)
	float StaySpottedTime; // 0x1038 (0x4)
	struct FName SpottedEvent; // 0x103c (0x4)
	class UFortFeedbackBank* DefaultFeedback; // 0x1040 (0x8)
	struct TArray<class AFortEmitterCameraLensEffectDirectional*> ActiveSoundIndicators; // 0x1048 (0x10)
	class UClass* DefaultSoundTrackingVisual; // 0x1058 (0x8)
	struct FGameplayTagContainer SoundTrackingVisibilityTags; // 0x1060 (0x20)
	struct TMap<enum EFortSoundIndicatorTypes, float> PriorityModifiers; // 0x1080 (0x50)
	struct TArray<struct FFortPawnVocalChord> VocalChords; // 0x10d0 (0x10)
	unsigned char unreflected_10e0[0x58]; // 0x10e0 (0x58) 
	bool bIsDisconnectedPawn; // 0x1138 (0x1)
	unsigned char unreflected_1139[0x3]; // 0x1139 (0x3) 
	struct FActiveGameplayEffectHandle* MaxHealthApplicationHandle; // 0x113c (0x8)
	unsigned char unreflected_1144[0x4]; // 0x1144 (0x4) 
	class UClass* MaxHealthApplicationGameplayEffect; // 0x1148 (0x8)
	class UFortHealthSet* HealthSet; // 0x1150 (0x8)
	class UFortControlResistanceSet* ControlResistanceSet; // 0x1158 (0x8)
	class UFortDamageSet* DamageSet; // 0x1160 (0x8)
	class UFortMovementSet* MovementSet; // 0x1168 (0x8)
	class UFortAdvancedMovementSet* AdvancedMovementSet; // 0x1170 (0x8)
	unsigned char unreflected_1178[0x8]; // 0x1178 (0x8) 
	struct FMulticastInlineDelegate OnAbilityDecisionWindowStackUpdated; // 0x1180 (0x10)
	unsigned char unreflected_1190[0x30]; // 0x1190 (0x30) 
	struct FMulticastInlineDelegate OnAbilityTargetingBlocked; // 0x11c0 (0x10)
	class UFortAbilitySystemComponent* AbilitySystemComponent; // 0x11d0 (0x8)
	struct TArray<struct FFortActiveMontageDecisionWindow> DecisionWindowStack; // 0x11d8 (0x10)
	struct FGameplayTagContainer GameplayTags; // 0x11e8 (0x20)
	struct FText DisplayName; // 0x1208 (0x18)
	struct TArray<struct FDamagerInfo> Damagers; // 0x1220 (0x10)
	struct TArray<struct FDamageDoneSourceInfo> TotalDamageDoneTrackers; // 0x1230 (0x10)
	struct TArray<struct FDamageDoneTargetInfo> TargetDamageDoneTrackers; // 0x1240 (0x10)
	struct TArray<struct FDamageDoneSourceInfo> TotalDamageTakenTrackers; // 0x1250 (0x10)
	struct TArray<struct FDamageDoneTargetInfo> TargetDamageTakenTrackers; // 0x1260 (0x10)
	float DamageDoneLastAtTime; // 0x1270 (0x4)
	float DamageTakenLastAtTime; // 0x1274 (0x4)
	float LastHitTime; // 0x1278 (0x4)
	float TotalPlayerDamageDealt; // 0x127c (0x4)
	class UFortHealthBarIndicator* HealthBarIndicator; // 0x1280 (0x8)
	struct FGameplayTag CurrentCalloutTag; // 0x1288 (0x4)
	unsigned char unreflected_128c[0x4]; // 0x128c (0x4) 
	struct TArray<struct FCalloutEntry> CalloutEntries; // 0x1290 (0x10)
	float HealthBarWidth; // 0x12a0 (0x4)
	float HealthBarHeightMultiplier; // 0x12a4 (0x4)
	unsigned char unreflected_12a8[0x8]; // 0x12a8 (0x8) 
	struct FSlateBrush SpottedBrush; // 0x12b0 (0xc0)
	struct FVector SpottedIconOffset; // 0x1370 (0x18)
	int ClientNonRenderedAnimUpdateRate; // 0x1388 (0x4)
	int MaxEvalRateForInterpolation; // 0x138c (0x4)
	struct TArray<float> AnimUpdateRateVisibleMaxDistanceFactor; // 0x1390 (0x10)
	struct TMap<int, int> LODToFrameSkipMap; // 0x13a0 (0x50)
	unsigned char unreflected_13f0[0x10]; // 0x13f0 (0x10) 
	struct FFortConversationSentence CurrentSentence; // 0x1400 (0xc0)
	unsigned char unreflected_14c0[0x18]; // 0x14c0 (0x18) 
	struct FMulticastInlineDelegate OnPawnHealthChanged; // 0x14d8 (0x10)
	struct FMulticastInlineDelegate OnPawnMaxOvershieldChanged; // 0x14e8 (0x10)
	struct FAthenaBatchedDamageGameplayCues_Shared AccumulatedBatchDataShared; // 0x14f8 (0x78)
	struct FAthenaBatchedDamageGameplayCues_NonShared AccumulatedBatchDataNonShared; // 0x1570 (0x10)
	unsigned char unreflected_1580[0x8]; // 0x1580 (0x8) 
	struct FGameplayCueParameters BatchedGameplayCueParameters; // 0x1588 (0xd0)
	struct FGameplayTagContainer ReplayItemActions; // 0x1658 (0x20)
	unsigned char unreflected_1678[0x20]; // 0x1678 (0x20) 
	struct FGameplayTagContainer HidingVisibilityTags; // 0x1698 (0x20)
	struct FGameplayTagContainer HidingTransitionVisibilityTags; // 0x16b8 (0x20)
	class UPegasusGameEventCollector* PegasusTimelineCollector; // 0x16d8 (0x8)
	class UFortAthenaAILODComponent* AILODComponent; // 0x16e0 (0x8)
	unsigned char unreflected_16e8[0x20]; // 0x16e8 (0x20) 
	struct FClientAILODSettings ClientAILODSettings; // 0x1708 (0x2f0)
	struct FGameplayTag FallbackTag; // 0x19f8 (0x4)
	unsigned char unreflected_19fc[0x4]; // 0x19fc (0x4) 
	struct FString DebugType; // 0x1a00 (0x10)
	struct TMap<uint32_t, struct FRecordedGunshot> RecordedGunshots; // 0x1a10 (0x50)
	unsigned char unreflected_1a60[0x40]; // 0x1a60 (0x40) 
	struct FMulticastInlineDelegate OnPawnComponentAttachedEvent; // 0x1aa0 (0x10)
	unsigned char unreflected_1ab0[0x30]; // 0x1ab0 (0x30) 
	struct TArray<class ABuildingActor*> OverlappingBuildings; // 0x1ae0 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.FortPawn.WillFallFromHeightCauseDamage (Underlying native function: WillFallFromHeightCauseDamage 0x8cf53fc)
	bool WillFallFromHeightCauseDamage(float& FallDistance); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortPawn.WasDBNOOnDeath (Underlying native function: WasDBNOOnDeath 0x28071d4)
	bool WasDBNOOnDeath(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortPawn.UnlinkAnimLayer (Underlying native function: UnlinkAnimLayer 0x8cf535c)
	void UnlinkAnimLayer(class UClass*& AnimLayer); // (Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortPawn.TriggerFeedbackEvent (Underlying native function: TriggerFeedbackEvent 0x8cf5174)
