// Class /Script/FortniteGame.FortGameModeAthena
// Size: 0x17e0
class AFortGameModeAthena : public AFortGamePvPBase
{
	unsigned char unreflected_ba0[0x68]; // 0xba0 (0x68) 
	struct TArray<class AFortTeamPrivateInfo*> SortedStormCapPrivateTeams; // 0xc08 (0x10)
	float DelayForStormCapWarning; // 0xc18 (0x4)
	float DelayForStormCapDamage; // 0xc1c (0x4)
	unsigned char unreflected_c20[0x8]; // 0xc20 (0x8) 
	struct FScalableFloat TimeBetweenStormCapDamage; // 0xc28 (0x28)
	unsigned char unreflected_c50[0x8]; // 0xc50 (0x8) 
	struct FScalableFloat StormCapDamagePerTick; // 0xc58 (0x28)
	struct FMulticastInlineDelegate OnMapInfoInitialized; // 0xc80 (0x10)
	bool bMapInfoInitialized; // 0xc90 (0x1)
	unsigned char unreflected_c91[0x7]; // 0xc91 (0x7) 
	struct FMulticastInlineDelegate OnSafeZoneIndicatorSpawned; // 0xc98 (0x10)
	struct FMulticastInlineDelegate OnSafeZoneUpdated; // 0xca8 (0x10)
	unsigned char unreflected_cb8[0x10]; // 0xcb8 (0x10) 
	bool bAllGameplayModifiersRegistered; // 0xcc8 (0x1)
	unsigned char unreflected_cc9[0x1f]; // 0xcc9 (0x1f) 
	struct FMulticastInlineDelegate OnAIPawnKilled; // 0xce8 (0x10)
	bool bAlwaysDBNO; // 0xcf8 (0x1)
	unsigned char unreflected_cf9[0x7]; // 0xcf9 (0x7) 
	struct FScalableFloat KillStreakTime; // 0xd00 (0x28)
	unsigned char unreflected_d28[0x8]; // 0xd28 (0x8) 
	struct TArray<class ABuildingActor*> ActorsToClear; // 0xd30 (0x10)
	struct TArray<class AActor*> ClearAreaIgnoreActors; // 0xd40 (0x10)
	bool bEnableSendingIndividualTournamentScoresOnLogout; // 0xd50 (0x1)
	unsigned char unreflected_d51[0x17]; // 0xd51 (0x17) 
	bool bNeverSpawnPickupsOnPawnDeath; // 0xd68 (0x1)
	bool bLoadTestCosmetics; // 0xd69 (0x1)
	unsigned char unreflected_d6a[0xa]; // 0xd6a (0xa) 
	unsigned char bDisable3DVoiceChat; // 0xd74 (0x1)
	unsigned char bAllowDamageInWarmup; // 0xd74 (0x1)
	unsigned char unreflected_d75[0x3]; // 0xd75 (0x3) 
	struct TArray<struct FName> ExcludedDefaultSupplyDrops; // 0xd78 (0x10)
	struct TArray<struct FName> ExcludedLTMSupplyDrops; // 0xd88 (0x10)
	struct TArray<struct FName> ExcludedLTMSpawnActors; // 0xd98 (0x10)
	struct TArray<struct FTimeOfDayOverride> TimeOfDayOverrideList; // 0xda8 (0x10)
	bool bDisableGCOnServerDuringMatch; // 0xdb8 (0x1)
	unsigned char unreflected_db9[0x7]; // 0xdb9 (0x7) 
	struct TArray<struct FGCSettingsOverride> GCSettingsOverrideList; // 0xdc0 (0x10)
	bool bPlaylistHotfixChangedGCDisabling; // 0xdd0 (0x1)
	unsigned char unreflected_dd1[0x3]; // 0xdd1 (0x3) 
	float PlaylistHotfixOriginalGCFrequency; // 0xdd4 (0x4)
	bool bUseSkydiveLeader; // 0xdd8 (0x1)
	bool bUseSkydiveLeaderInSplitScreen; // 0xdd9 (0x1)
	unsigned char unreflected_dda[0x2]; // 0xdda (0x2) 
	float OverloadedInitialConnectTimeout; // 0xddc (0x4)
	float FailedToStartMatchTimeout; // 0xde0 (0x4)
	unsigned char unreflected_de4[0xc]; // 0xde4 (0xc) 
	float OrphanedServerCheckTime; // 0xdf0 (0x4)
	unsigned char unreflected_df4[0xc]; // 0xdf4 (0xc) 
	bool bEnableRecentPlayersUpdates; // 0xe00 (0x1)
	unsigned char unreflected_e01[0x3]; // 0xe01 (0x3) 
	float DefaultWarmupEarlyRequiredPlayerPercent; // 0xe04 (0x4)
	bool bDisableStormCapSystem; // 0xe08 (0x1)
	unsigned char unreflected_e09[0x7]; // 0xe09 (0x7) 
	struct FScalableFloat PlaylistSupportsStormCapSystem; // 0xe10 (0x28)
	bool bStormCapSystemEnabled; // 0xe38 (0x1)
	unsigned char unreflected_e39[0x7]; // 0xe39 (0x7) 
	struct FScalableFloat PlaylistEnableBots; // 0xe40 (0x28)
	struct FScalableFloat PlaylistEnableBotSpectate; // 0xe68 (0x28)
	struct FScalableFloat PlaylistEnableBotDynamicELO; // 0xe90 (0x28)
	struct TWeakObjectPtr<class UClass> BattleLabTeleporterManagerClass; // 0xeb8 (0x28)
	class AActor* BattleLabTeleporterManager; // 0xee0 (0x8)
	unsigned char unreflected_ee8[0xd0]; // 0xee8 (0xd0) 
	bool bAlwaysIncludeDisconnectedTeammates; // 0xfb8 (0x1)
	bool bIncludeDisconnectedTeammatesFromAircraftPhase; // 0xfb9 (0x1)
	unsigned char unreflected_fba[0x36]; // 0xfba (0x36) 
	enum EForceKickAfterDeathMode ForceKickAfterDeathMode; // 0xff0 (0x1)
	unsigned char unreflected_ff1[0x3]; // 0xff1 (0x3) 
	float ForceKickAfterDeathTime; // 0xff4 (0x4)
	bool bRemoveFromSquadOnLogout; // 0xff8 (0x1)
	bool bIgnoreCanSpectateAfterDeathToken; // 0xff9 (0x1)
	unsigned char unreflected_ffa[0x2]; // 0xffa (0x2) 
	int CreativeModeGracefulShutdownTime; // 0xffc (0x4)
	struct TArray<struct FHotfixVolumePlacement> HotfixKillVolumes; // 0x1000 (0x10)
	struct TArray<struct FHotfixVolumePlacement> HotfixBlockingVolumes; // 0x1010 (0x10)
	struct TArray<struct FHotfixVolumePlacement> HotfixUndergroundVolumes; // 0x1020 (0x10)
	struct TArray<struct FName> DisableMatchStatsReportingPlaylists; // 0x1030 (0x10)
	struct TArray<struct FName> DisableProgressionReportingPlaylists; // 0x1040 (0x10)
	unsigned char unreflected_1050[0x8]; // 0x1050 (0x8) 
	struct TArray<class AFortAthenaAircraft*> Aircrafts; // 0x1058 (0x10)
	unsigned char unreflected_1068[0x38]; // 0x1068 (0x38) 
	int MaxPlayerCount; // 0x10a0 (0x4)
	unsigned char unreflected_10a4[0x4]; // 0x10a4 (0x4) 
	struct TArray<class AFortPlayerControllerAthena*> AlivePlayers; // 0x10a8 (0x10)
	struct TArray<class AFortAthenaAIBotController*> AliveBots; // 0x10b8 (0x10)
	struct TArray<int> TeamAlivePlayers; // 0x10c8 (0x10)
	unsigned char unreflected_10d8[0x4]; // 0x10d8 (0x4) 
	int WarmupRequiredPlayerCount; // 0x10dc (0x4)
	float WarmupCountdownDuration; // 0x10e0 (0x4)
	unsigned char unreflected_10e4[0x4]; // 0x10e4 (0x4) 
	float WarmupEarlyCountdownDuration; // 0x10e8 (0x4)
	bool bSafeZoneActive; // 0x10ec (0x1)
	bool bSafeZonePaused; // 0x10ed (0x1)
	unsigned char unreflected_10ee[0x2]; // 0x10ee (0x2) 
	class UClass* GEOutsideSafeZone; // 0x10f0 (0x8)
	class UClass* GEOutsideSafeZoneCN; // 0x10f8 (0x8)
	class UClass* SafeZoneIndicatorClass; // 0x1100 (0x8)
	class UClass* MegaStormManagerClass; // 0x1108 (0x8)
	struct FScalableFloat SkyTubeDisablePhase; // 0x1110 (0x28)
	class AFortSafeZoneIndicator* SafeZoneIndicator; // 0x1138 (0x8)
	struct TArray<struct FVector> SafeZoneLocations; // 0x1140 (0x10)
	bool bSafeZoneLocationsInitialized; // 0x1150 (0x1)
	unsigned char unreflected_1151[0x3]; // 0x1151 (0x3) 
	float EndGameKickPlayersDelayNoIGMM; // 0x1154 (0x4)
	float EndGameKickPlayersDelayIGMM; // 0x1158 (0x4)
	int EventStatSubmitAttempts; // 0x115c (0x4)
	unsigned char unreflected_1160[0x8]; // 0x1160 (0x8) 
	class AMegaStormManager* MegaStormManager; // 0x1168 (0x8)
	struct FString VoiceChatChannelPositional; // 0x1170 (0x10)
	bool bUseRandomTimeOfDay; // 0x1180 (0x1)
	unsigned char unreflected_1181[0x7]; // 0x1181 (0x7) 
	class UAthenaAISettings* AISettings; // 0x1188 (0x8)
	struct TArray<class AFortPlayerControllerSpectating*> LiveSpectators; // 0x1190 (0x10)
	class UClass* SpectateAFriendPlayerControllerClass; // 0x11a0 (0x8)
	class UClass* LiveBroadcastPlayerControllerClass; // 0x11a8 (0x8)
	unsigned char unreflected_11b0[0x10]; // 0x11b0 (0x10) 
	struct TArray<struct FName> PlatformOSSNamesToUploadStatsV2; // 0x11c0 (0x10)
	struct TMap<struct FName, enum ECommonInputType> LeaderboardStatsDefaultOssInputTypes; // 0x11d0 (0x50)
	unsigned char unreflected_1220[0x40]; // 0x1220 (0x40) 
	struct TArray<struct FName> BlacklistedMatchmakingBackfillPlaylists; // 0x1260 (0x10)
	bool bEnableMatchmakingRatingUpdateV2; // 0x1270 (0x1)
	bool bFlightPathInitialized; // 0x1271 (0x1)
	unsigned char unreflected_1272[0x6]; // 0x1272 (0x6) 
	float ScorePerMinuteAlive; // 0x1278 (0x4)
	float ScoreMaxMinutesAliveCounted; // 0x127c (0x4)
	float ScoreForGettingAtLeastOneKill; // 0x1280 (0x4)
	float ScorePerScaledTeamKill; // 0x1284 (0x4)
	float ScoreForFirstRevive; // 0x1288 (0x4)
	float ScoreForSubsequentRevives; // 0x128c (0x4)
	int MaxAdditionalRevivesToScore; // 0x1290 (0x4)
	unsigned char unreflected_1294[0x4]; // 0x1294 (0x4) 
	struct FScorePlacementTable ScorePlacementTables; // 0x1298 (0xe0)
	float ScoreMultiplier; // 0x1378 (0x4)
	int MaxActiveAIActors; // 0x137c (0x4)
	bool bLockMobilePlayersToTouchInSwitchPool; // 0x1380 (0x1)
	unsigned char unreflected_1381[0x7]; // 0x1381 (0x7) 
	bool bAllCosmeticsLoaded; // 0x1388 (0x1)
	unsigned char unreflected_1389[0x7]; // 0x1389 (0x7) 
	struct TArray<class UAthenaCosmeticItemDefinition*> SkyDiveContrailCosmetics; // 0x1390 (0x10)
	int SkyDiveContrailLoadTestIndex; // 0x13a0 (0x4)
	unsigned char unreflected_13a4[0x4]; // 0x13a4 (0x4) 
	struct TArray<class UAthenaCosmeticItemDefinition*> GliderCosmetics; // 0x13a8 (0x10)
	int GliderLoadTestIndex; // 0x13b8 (0x4)
	unsigned char unreflected_13bc[0x4]; // 0x13bc (0x4) 
	struct TArray<class UAthenaCosmeticItemDefinition*> PickaxeCosmetics; // 0x13c0 (0x10)
	int PickaxeLoadTestIndex; // 0x13d0 (0x4)
	unsigned char unreflected_13d4[0x4]; // 0x13d4 (0x4) 
	struct TArray<class UAthenaCosmeticItemDefinition*> CharacterCosmetics; // 0x13d8 (0x10)
	int CharacterLoadTestIndex; // 0x13e8 (0x4)
	unsigned char unreflected_13ec[0x4]; // 0x13ec (0x4) 
	struct TArray<class UAthenaCosmeticItemDefinition*> HatCosmetics; // 0x13f0 (0x10)
	int HatLoadTestIndex; // 0x1400 (0x4)
	unsigned char unreflected_1404[0x4]; // 0x1404 (0x4) 
	struct TArray<class UAthenaCosmeticItemDefinition*> BackpackCosmetics; // 0x1408 (0x10)
	int BackpackLoadTestIndex; // 0x1418 (0x4)
	unsigned char unreflected_141c[0x4]; // 0x141c (0x4) 
	struct TArray<class UAthenaCosmeticItemDefinition*> DanceCosmetics; // 0x1420 (0x10)
	int DanceLoadTestIndex; // 0x1430 (0x4)
	unsigned char unreflected_1434[0x4]; // 0x1434 (0x4) 
	struct TArray<class UAthenaCosmeticItemDefinition*> VictoryPoseCosmetics; // 0x1438 (0x10)
	int VictoryPoseLoadTestIndex; // 0x1448 (0x4)
	unsigned char unreflected_144c[0x4]; // 0x144c (0x4) 
	struct TArray<class UAthenaCosmeticItemDefinition*> MapMarkerCosmetics; // 0x1450 (0x10)
	int MapMarkerLoadTestIndex; // 0x1460 (0x4)
	int PetLoadTestIndex; // 0x1464 (0x4)
	struct TArray<class UAthenaCosmeticItemDefinition*> ConsumableEmoteCosmetics; // 0x1468 (0x10)
	struct TArray<class UAthenaCosmeticItemDefinition*> LoadingScreenCosmetics; // 0x1478 (0x10)
	struct TArray<class UAthenaCosmeticItemDefinition*> BattleBusCosmetics; // 0x1488 (0x10)
	struct TArray<struct FSupplyDropSpawnData> SupplyDropSpawnDataList; // 0x1498 (0x10)
	struct TArray<struct FBuildingGameplayActorSpawnData> BuildingGameplayActorSpawnData; // 0x14a8 (0x10)
	struct FExitCraftSpawnData* ExitCraftSpawnData; // 0x14b8 (0x8)
	int LastSpawnedSupplyDropType; // 0x14c0 (0x4)
	unsigned char unreflected_14c4[0x4]; // 0x14c4 (0x4) 
	class AFortAthenaSpawningPolicyManager* SpawningPolicyManager; // 0x14c8 (0x8)
	struct TArray<struct FAthenaVehicleOverride> AthenaVehicleOverrides; // 0x14d0 (0x10)
	struct TArray<class UAthenaCosmeticItemDefinition*> ItemWrapCosmetics; // 0x14e0 (0x10)
	struct TArray<class UAthenaCosmeticItemDefinition*> MusicPacks; // 0x14f0 (0x10)
	struct TArray<class UAthenaCosmeticItemDefinition*> CharmCosmetics; // 0x1500 (0x10)
	class UClass* TimeOfDayManagerGameplayOverride; // 0x1510 (0x8)
	struct TArray<struct FFortSpawnActorData> SpawnActorDataList; // 0x1518 (0x10)
	unsigned char unreflected_1528[0x18]; // 0x1528 (0x18) 
	class UFortMutatorListComponent* MutatorListComponent; // 0x1540 (0x8)
	struct TArray<class UFortGameplayModifierItemDefinition*> CoreGameModeModifiers; // 0x1548 (0x10)
	unsigned char unreflected_1558[0xc0]; // 0x1558 (0xc0) 
	struct TArray<struct FName> SupportedAthenaLootTierGroups; // 0x1618 (0x10)
	struct TMap<struct FName, struct FName> RedirectAthenaLootTierGroups; // 0x1628 (0x50)
	unsigned char unreflected_1678[0x10]; // 0x1678 (0x10) 
	struct FScalableFloat StormCampingInitialDelayTime; // 0x1688 (0x28)
	struct FScalableFloat StormCampingIncrementTimeAfterDelay; // 0x16b0 (0x28)
	struct FScalableFloat StormCampingDamageMultiplier; // 0x16d8 (0x28)
	unsigned char unreflected_1700[0x18]; // 0x1700 (0x18) 
	bool bIsSpawningNewLootSync; // 0x1718 (0x1)
	bool bEnableCompetitiveMissingPlayerMatchInvalidation; // 0x1719 (0x1)
	unsigned char unreflected_171a[0x2]; // 0x171a (0x2) 
	float StartAircraftPhaseRequiredAlivePlayersPercent; // 0x171c (0x4)
	float EndAircraftPhaseRequiredAlivePlayersPercent; // 0x1720 (0x4)
	bool bEnableCompetitiveDDoSDetectionMatchInvalidation; // 0x1724 (0x1)
	unsigned char unreflected_1725[0x3]; // 0x1725 (0x3) 
	struct FString DDoSDetectionMatchInvalidationSeverity; // 0x1728 (0x10)
	int DDoSDetectionMatchInvalidationCount; // 0x1738 (0x4)
	float DDoSDetectionMatchInvalidationEvalDurationSeconds; // 0x173c (0x4)
	unsigned char unreflected_1740[0x20]; // 0x1740 (0x20) 
	struct TArray<struct FString> ReticulatedSplineDefinitions; // 0x1760 (0x10)
	bool bReticulateSplineKeysOnStart; // 0x1770 (0x1)
	unsigned char unreflected_1771[0x7]; // 0x1771 (0x7) 
	struct TArray<struct FAthenaStreamIdOverride> ReticulatedSplineIds; // 0x1778 (0x10)
	struct TArray<struct TWeakObjectPtr<class UDataTable>> GameFeatureLootTierData; // 0x1788 (0x10)
	struct TArray<struct TWeakObjectPtr<class UDataTable>> GameFeatureLootPackageData; // 0x1798 (0x10)
	struct TArray<struct TWeakObjectPtr<class UFortGameFeatureData>> GameFeaturesStreamingRangedWeaponData; // 0x17a8 (0x10)
	unsigned char padding_17b8[0x28]; // 0x17b8 (0x28)

	/* Functions */

	// Function /Script/FortniteGame.FortGameModeAthena.UpdateToNewLootTablesAsync (Underlying native function: UpdateToNewLootTablesAsync 0x8352ba4)
	void UpdateToNewLootTablesAsync(); // (Final | BlueprintAuthorityOnly | Native | Protected | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.UpdateToNewLootTables (Underlying native function: UpdateToNewLootTables 0x8352b90)
	void UpdateToNewLootTables(); // (Final | BlueprintAuthorityOnly | Native | Protected | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.UpdateLootForBuildingContainers (Underlying native function: UpdateLootForBuildingContainers 0x8352b7c)
	void UpdateLootForBuildingContainers(); // (Final | BlueprintAuthorityOnly | Native | Protected | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.StopRemovingAllLoot (Underlying native function: StopRemovingAllLoot 0x8352aa0)
	static void StopRemovingAllLoot(class UObject*& WorldContext, bool& bImmediateCleanup); // (Final | BlueprintAuthorityOnly | Native | Static | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.ShouldForceSpawnInsideOfVolume (Underlying native function: ShouldForceSpawnInsideOfVolume 0x8352a7c)
	bool ShouldForceSpawnInsideOfVolume(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortGameModeAthena.SetTimeOfDayManagerGameplayOverride (Underlying native function: SetTimeOfDayManagerGameplayOverride 0x83529fc)
	void SetTimeOfDayManagerGameplayOverride(class UClass*& TimeOfDayManagerClass); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.SetStormDamagePaused (Underlying native function: SetStormDamagePaused 0x835297c)
	void SetStormDamagePaused(bool& bPause); // (Final | 0x00000002 | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.SafeZoneInsideChecks (Underlying native function: SafeZoneInsideChecks 0x8352968)
	void SafeZoneInsideChecks(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortGameModeAthena.RemoveMutatorFromList (Underlying native function: RemoveMutatorFromList 0x83528e4)
	void RemoveMutatorFromList(class AFortGameplayMutator*& Mutator); // (Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.RemoveAllLootFromWorld (Underlying native function: RemoveAllLootFromWorld 0x8352728)
	static void RemoveAllLootFromWorld(class UObject*& WorldContext, int& ContainersPerIteration, int& PickupsPerIteration, float& TimeBetweenIterations, bool& bProcessContainersAndPickupsConcurrently); // (Final | BlueprintAuthorityOnly | Native | Static | Public | BlueprintCallable)

	// DelegateFunction /Script/FortniteGame.FortGameModeAthena.OnMapInfoInitialized__DelegateSignature (Has no native function)
	void OnMapInfoInitializedDelegateSignature(); // (MulticastDelegate | Public | Delegate)

	// Function /Script/FortniteGame.FortGameModeAthena.OnGamePhaseStepChanged (Underlying native function: OnGamePhaseStepChanged 0x8352648)
	void OnGamePhaseStepChanged(struct TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum EAthenaGamePhaseStep& GamePhaseStep); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortGameModeAthena.OnEndGameKickPlayers (Underlying native function: OnEndGameKickPlayers 0x8352634)
	void OnEndGameKickPlayers(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortGameModeAthena.OnCheckForOrphanedServer (Underlying native function: OnCheckForOrphanedServer 0x83525b4)
	void OnCheckForOrphanedServer(bool& bFromPlayerLogout); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortGameModeAthena.OnAircraftFlightEnded (Underlying native function: OnAircraftFlightEnded 0x8352370)
	void OnAircraftFlightEnded(class AFortAthenaAircraft*& FortAthenaAircraft); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortGameModeAthena.OnAircraftExitedDropZone (Underlying native function: OnAircraftExitedDropZone 0x83522f0)
	void OnAircraftExitedDropZone(class AFortAthenaAircraft*& FortAthenaAircraft); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortGameModeAthena.OnAircraftEnteredDropZone (Underlying native function: OnAircraftEnteredDropZone 0x8352270)
	void OnAircraftEnteredDropZone(class AFortAthenaAircraft*& FortAthenaAircraft); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortGameModeAthena.JumpToSafeZonePhase (Underlying native function: JumpToSafeZonePhase 0x835225c)
	void JumpToSafeZonePhase(); // (Final | 0x00000002 | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.IsMapInfoInitialized (Underlying native function: IsMapInfoInitialized 0x835213c)
	bool IsMapInfoInitialized(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortGameModeAthena.IsInCurrentSafeZone (Underlying native function: IsInCurrentSafeZone 0x8352054)
	bool IsInCurrentSafeZone(struct FVector& TestLocation, bool& bClassicSafeZoneOnly); // (Final | 0x00000002 | Native | Public | HasDefaults | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortGameModeAthena.InitializeSafeZoneLocations (Underlying native function: InitializeSafeZoneLocations 0x8352040)
	void InitializeSafeZoneLocations(); // (Final | 0x00000002 | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.HandlePostSafeZonePhaseChanged (Underlying native function: HandlePostSafeZonePhaseChanged 0x835202c)
	void HandlePostSafeZonePhaseChanged(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortGameModeAthena.HandleAllPlaylistLevelsVisible (Underlying native function: HandleAllPlaylistLevelsVisible 0x8352018)
	void HandleAllPlaylistLevelsVisible(); // (Final | Native | Public)

	// Function /Script/FortniteGame.FortGameModeAthena.GetVehicleClassOverride (Underlying native function: GetVehicleClassOverride 0x8351f90)
	class UClass* GetVehicleClassOverride(class UClass*& DefaultVehicleClass); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortGameModeAthena.GetSquadMembers (Underlying native function: GetSquadMembers 0x8351eac)
	void GetSquadMembers(unsigned char& SquadId, struct TArray<class AFortPlayerStateAthena*>& SquadMembers); // (Final | 0x00000002 | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.GetSquadIdsOfNonSolos (Underlying native function: GetSquadIdsOfNonSolos 0x8351e10)
	void GetSquadIdsOfNonSolos(struct TArray<unsigned char>& SquadsWithNonSolos); // (Final | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.GetSquadIds (Underlying native function: GetSquadIds 0x8351d74)
	void GetSquadIds(struct TArray<unsigned char>& SquadIds); // (Final | 0x00000002 | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.GetSafeZonePhase (Underlying native function: GetSafeZonePhase 0x8351d54)
	int GetSafeZonePhase(); // (Final | 0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortGameModeAthena.GetSafeZoneIndicator (Underlying native function: GetSafeZoneIndicator 0x8351d3c)
	class AFortSafeZoneIndicator* GetSafeZoneIndicator(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortGameModeAthena.GetPlaylistEnableBots (Underlying native function: GetPlaylistEnableBots 0x8351d00)
	bool GetPlaylistEnableBots(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortGameModeAthena.GetMutatorByClass (Underlying native function: GetMutatorByClass 0x8351c34)
	class AFortGameplayMutator* GetMutatorByClass(class AActor*& ContextActor, class UClass*& MutatorClass); // (0x00000002 | Native | Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortGameModeAthena.GetGameplayMutator (Underlying native function: GetGameplayMutator 0x8351af0)
	class AFortGameplayMutator* GetGameplayMutator(struct FGameplayTag& MutatorTag); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.GetBattleLabTeleporterManager (Underlying native function: GetBattleLabTeleporterManager 0x8351ad8)
	class AActor* GetBattleLabTeleporterManager(); // (Final | BlueprintAuthorityOnly | Native | Public | BlueprintCallable | BlueprintPure)

	// Function /Script/FortniteGame.FortGameModeAthena.FireServerPerformanceEvent (Underlying native function: FireServerPerformanceEvent 0x26daa0c)
	void FireServerPerformanceEvent(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortGameModeAthena.EndGamePhaseStarted (Has no native function)
	void EndGamePhaseStarted(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortGameModeAthena.EnableGameplayMutator (Underlying native function: EnableGameplayMutator 0x8351a14)
	void EnableGameplayMutator(struct FGameplayTag& MutatorTag, bool& bEnable); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.AddMutatorToList (Underlying native function: AddMutatorToList 0x8351990)
	void AddMutatorToList(class AFortGameplayMutator*& Mutator); // (Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.AddContentKeysToGameState (Underlying native function: AddContentKeysToGameState 0x26daa0c)
	void AddContentKeysToGameState(); // (Final | 0x00000002 | BlueprintAuthorityOnly | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortGameModeAthena.AddAIClassToReplicationGraph (Underlying native function: AddAIClassToReplicationGraph 0x8351920)
	void AddAIClassToReplicationGraph(class UClass*& NewAIClass); // (Final | Native | Public | BlueprintCallable | Const)
};

