// Class /Script/FortniteGame.FortAthenaMutator_Mash
// Size: 0x21d0
class AFortAthenaMutator_Mash : public AFortAthenaMutator
{
	struct FMulticastInlineDelegate OnTeamScoreMultiplierChanged; // 0x330 (0x10)
	struct FMulticastInlineDelegate OnPlayerDataChanged; // 0x340 (0x10)
	struct FMulticastInlineDelegate OnScoresFinalized; // 0x350 (0x10)
	struct FMulticastInlineDelegate OnPhaseChanged; // 0x360 (0x10)
	struct FMulticastInlineDelegate OnMashVictory; // 0x370 (0x10)
	struct FMulticastInlineDelegate OnPlayerFriendLeaderboardUpdated; // 0x380 (0x10)
	struct FMulticastInlineDelegate OnBossPawnChanged; // 0x390 (0x10)
	struct FMulticastInlineDelegate OnBossHealthShieldChanged; // 0x3a0 (0x10)
	class UDataTable* PoiRoutesDataTable; // 0x3b0 (0x8)
	struct FName DebugPoiRouteName; // 0x3b8 (0x4)
	unsigned char unreflected_3bc[0x54]; // 0x3bc (0x54) 
	bool bCheatMakeFirstPhaseTheFinalPhase; // 0x410 (0x1)
	unsigned char unreflected_411[0x7]; // 0x411 (0x7) 
	struct TArray<struct FString> DebugObjectiveActorNameOverrides; // 0x418 (0x10)
	bool bOverrideReplicationSettingsDebug; // 0x428 (0x1)
	unsigned char unreflected_429[0x7]; // 0x429 (0x7) 
	struct FScalableFloat MaxAIPerClient; // 0x430 (0x28)
	struct FScalableFloat ReplicateGameplayCues; // 0x458 (0x28)
	enum EMashDifficulty CurrentDifficulty; // 0x480 (0x1)
	unsigned char unreflected_481[0x7]; // 0x481 (0x7) 
	struct TArray<class UMaterialInterface*> StormMaterialOverrides; // 0x488 (0x10)
	class UClass* ObjectiveObjectClass; // 0x498 (0x8)
	class UClass* FinalPhaseObjectiveObjectClass; // 0x4a0 (0x8)
	struct FGameplayTag StartingAreaTag; // 0x4a8 (0x4)
	struct FGameplayTag ObjectiveAreaTag; // 0x4ac (0x4)
	struct FScalableFloat IsPreparationPhase; // 0x4b0 (0x28)
	struct FScalableFloat IsSurvivePhase; // 0x4d8 (0x28)
	struct FScalableFloat IsMovingPhase; // 0x500 (0x28)
	struct FScalableFloat IsAftermathPhase; // 0x528 (0x28)
	struct FScalableFloat IsFinalPhase; // 0x550 (0x28)
	struct FScalableFloat RefillPlayerHealth; // 0x578 (0x28)
	struct FScalableFloat RefillPlayerShield; // 0x5a0 (0x28)
	struct FScalableFloat OnlyRespawnAtNewPhase; // 0x5c8 (0x28)
	struct FScalableFloat ShouldRespawnDeadPlayers; // 0x5f0 (0x28)
	float SpawnScoreMultiplierTraceStartHeight; // 0x618 (0x4)
	float SpawnSscoreMultiplierTraceEndHeight; // 0x61c (0x4)
	struct FMashAreaSpecialActorData AreaSpecialActorData; // 0x620 (0x1c0)
	struct FMashScoreMultiplierSpawnData ScoreMutliplierSpawnData; // 0x7e0 (0x300)
	class UFortDifficultyEncounterSettings* DifficultyEncounterSettingsStatic; // 0xae0 (0x8)
	class UFortDifficultyEncounterSettings* DifficultyEncounterSettingsDynamic; // 0xae8 (0x8)
	struct TMap<int, struct FMashAIEncounterWeights> AISpecialEncountersBySafeZoneIndexMap; // 0xaf0 (0x50)
	struct TMap<struct FName, struct FMashAISpecialEncounterData> AISpecialEncounterOptionsMap; // 0xb40 (0x50)
	struct FText BossEncounterDisplayName; // 0xb90 (0x18)
	struct FText FinalBossEncounterDisplayName; // 0xba8 (0x18)
	struct FScalableFloat OverrideBossPhaseSafeZoneRadius; // 0xbc0 (0x28)
	struct FScalableFloat DisplayIntroGameMsg; // 0xbe8 (0x28)
	struct FAthenaGameMessageData GameMsgIntro; // 0xc10 (0x50)
	struct FScalableFloat DisplayOnTeamMultiplierIncreasedGameMsg; // 0xc60 (0x28)
	struct FAthenaGameMessageData GameMsgOnTeamMultiplierIncreased; // 0xc88 (0x50)
	struct FMashDifficultySettings DifficultySettings; // 0xcd8 (0xa8)
	bool bUseLootTierOverrides; // 0xd80 (0x1)
	unsigned char unreflected_d81[0x7]; // 0xd81 (0x7) 
	struct TArray<struct FMashLootTierOverrideAssetData*> LootTierOverrides; // 0xd88 (0x10)
	struct FGameplayTag HeadshotGameplayTag; // 0xd98 (0x4)
	unsigned char unreflected_d9c[0x4]; // 0xd9c (0x4) 
	struct FMashScoreData ScoreEventList[0x11]; // 0xda0 (0xd8) (ARRAY) 
	struct FScalableFloat ObjectiveAreaCompletedScoreMultiplierBonus; // 0x1bf8 (0x28)
	struct FScalableFloat RiftDestroyedScoreMultiplierBonus; // 0x1c20 (0x28)
	struct FScalableFloat StreakScoreMultiplierUseSpecialMechanicToActivate; // 0x1c48 (0x28)
	struct FScalableFloat StreakScoreMultiplierResetTime; // 0x1c70 (0x28)
	struct FScalableFloat StreakScoreMultiplierKillThreshold; // 0x1c98 (0x28)
	struct FScalableFloat StreakScoreMultiplierTimeThresholdToActivate; // 0x1cc0 (0x28)
	struct FScalableFloat StreakScoreMultiplierMaxLevel; // 0x1ce8 (0x28)
	struct FScalableFloat StreakScoreMultiplierValue; // 0x1d10 (0x28)
	struct TArray<struct TEnumAsByte<EMashScoreEvent>> SafeDetonationScoreEventTypes; // 0x1d38 (0x10)
	struct FScalableFloat SafeDetonationKillDistance; // 0x1d48 (0x28)
	struct FString TeamScoreTournamentStatName; // 0x1d70 (0x10)
	struct FGameplayTag VictoryQuestTag; // 0x1d80 (0x4)
	struct FGameplayTag StreakMultiplierKillCountQuestTag; // 0x1d84 (0x4)
	struct TMap<uint32_t, struct FGameplayTag> StreakMultiplierKillCountQuestTagMap; // 0x1d88 (0x50)
	struct FGameplayTag RiftDamageDealtByPickaxeQuestTag; // 0x1dd8 (0x4)
	unsigned char unreflected_1ddc[0x4]; // 0x1ddc (0x4) 
	struct FScalableFloat ReportTeamScoreInterval; // 0x1de0 (0x28)
	struct FGameplayTag ReportTeamScoreTag; // 0x1e08 (0x4)
	struct FGameplayTag ReportTeamScoreChangesTag; // 0x1e0c (0x4)
	unsigned char unreflected_1e10[0x8]; // 0x1e10 (0x8) 
	struct TArray<struct FString> PlayerStatsNames; // 0x1e18 (0x10)
	struct FScalableFloat FriendsLeaderboardDisplayedNumber; // 0x1e28 (0x28)
	struct FScalableFloat MinNumberOfScoresToDisplay; // 0x1e50 (0x28)
	float TimeSecRetreiveLeaderboardTimeOut; // 0x1e78 (0x4)
	unsigned char unreflected_1e7c[0x4]; // 0x1e7c (0x4) 
	struct FScalableFloat MaxTotalNumFriendsForLeaderboardQuery; // 0x1e80 (0x28)
	struct FScalableFloat MaxNumFriendsForSingleLeaderboardQuery; // 0x1ea8 (0x28)
	bool bIsGameOver; // 0x1ed0 (0x1)
	bool bIsRespawningAllowed; // 0x1ed1 (0x1)
	unsigned char CurrentObjectiveAreaIndex; // 0x1ed2 (0x1)
	unsigned char TotalObjectiveAreaCount; // 0x1ed3 (0x1)
	unsigned char unreflected_1ed4[0x4]; // 0x1ed4 (0x4) 
	struct TArray<struct FMashObjectiveAreaInstanceData> ObjectiveAreas; // 0x1ed8 (0x10)
	unsigned char unreflected_1ee8[0x10]; // 0x1ee8 (0x10) 
	class UFortAIEncounterInfo* CurrentEncounter; // 0x1ef8 (0x8)
	class UFortAIEncounterInfo* AISpecialEncounter; // 0x1f00 (0x8)
	unsigned char unreflected_1f08[0x58]; // 0x1f08 (0x58) 
	struct FName CurrentLootTierGroupOverride; // 0x1f60 (0x4)
	unsigned char TeamScoreMultiplier; // 0x1f64 (0x1)
	unsigned char unreflected_1f65[0x3]; // 0x1f65 (0x3) 
	struct FMashPlayerDataArray PlayerDataArray; // 0x1f68 (0x118)
	bool bScoresAreFinal; // 0x2080 (0x1)
	struct TEnumAsByte<EMashPhase> CurrentPhase; // 0x2081 (0x1)
	unsigned char unreflected_2082[0x6]; // 0x2082 (0x6) 
	class AFortPlayerStart* RespawnLocationActor; // 0x2088 (0x8)
	struct TArray<struct FRiftDamagerInfo> RiftDamagerInfo; // 0x2090 (0x10)
	class AFortPawn* BossPawn; // 0x20a0 (0x8)
	class AFortPawn* SpecialEncounterPawn; // 0x20a8 (0x8)
	bool bFinalBossEncounterSpawned; // 0x20b0 (0x1)
	unsigned char unreflected_20b1[0x3]; // 0x20b1 (0x3) 
	struct FMashBossHealthShieldData BossHealthShieldData; // 0x20b4 (0x10)
	unsigned char unreflected_20c4[0x4]; // 0x20c4 (0x4) 
	struct FMashFriendsLeaderboard LocalPlayerFriendsLeaderboard; // 0x20c8 (0x20)
	struct FMashLeaderboardQuery LocalPlayerFriendsLeaderboardQuery; // 0x20e8 (0x90)
	unsigned char padding_2178[0x58]; // 0x2178 (0x58)

	/* Functions */

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.SpawnObjectiveAreaObjects (Underlying native function: SpawnObjectiveAreaObjects 0x84d0e4c)
	void SpawnObjectiveAreaObjects(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.ScheduleMarkPlayerScoresAsFinal (Underlying native function: ScheduleMarkPlayerScoresAsFinal 0x26daa0c)
	void ScheduleMarkPlayerScoresAsFinal(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.RetrievePlayerFriendsLeaderBoard (Underlying native function: RetrievePlayerFriendsLeaderBoard 0x84d0c40)
	void RetrievePlayerFriendsLeaderBoard(class AFortPlayerControllerAthena*& AthenaPC); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.ResetStreakScoreMultiplier (Underlying native function: ResetStreakScoreMultiplier 0x84d0abc)
	void ResetStreakScoreMultiplier(class AFortPlayerStateAthena*& PlayerState); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OverrideStormMaterial (Underlying native function: OverrideStormMaterial 0x84d0998)
	void OverrideStormMaterial(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OnScoreMultiplierInteractionCompleted (Underlying native function: OnScoreMultiplierInteractionCompleted 0x84d0528)
	void OnScoreMultiplierInteractionCompleted(class ABuildingActor*& SelfActor, class AFortPawn*& InteractingPawn); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OnSafeZoneUpdated (Underlying native function: OnSafeZoneUpdated 0x84d0514)
	void OnSafeZoneUpdated(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OnRep_TeamScoreMultiplier (Underlying native function: OnRep_TeamScoreMultiplier 0x84d0364)
	void OnRepTeamScoreMultiplier(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OnRep_PlayerData (Underlying native function: OnRep_PlayerData 0x84d02fc)
	void OnRepPlayerData(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OnRep_CurrentPhase (Underlying native function: OnRep_CurrentPhase 0x84d01fc)
	void OnRepCurrentPhase(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OnRep_bScoresAreFinal (Underlying native function: OnRep_bScoresAreFinal 0x84d042c)
	void OnRepbScoresAreFinal(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OnRep_BossPawn (Underlying native function: OnRep_BossPawn 0x84d01b4)
	void OnRepBossPawn(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OnRep_BossHealthShieldData (Underlying native function: OnRep_BossHealthShieldData 0x84d0180)
	void OnRepBossHealthShieldData(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.OnGamePhaseStepChanged (Underlying native function: OnGamePhaseStepChanged 0x84cfdf8)
	void OnGamePhaseStepChanged(struct TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum EAthenaGamePhaseStep& GamePhaseStep); // (Final | Native | Protected | HasOutParms)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.MaybeSpawnAISpecialEncounterForSafeZone (Underlying native function: MaybeSpawnAISpecialEncounterForSafeZone 0x7239740)
	void MaybeSpawnAISpecialEncounterForSafeZone(int& InSafeZoneIndex); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.HandleRiftSpawned (Underlying native function: HandleRiftSpawned 0x84ceeac)
	void HandleRiftSpawned(class UFortAIEncounterInfo*& Encounter, class ABuildingRift*& Rift); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.HandleRiftDying (Underlying native function: HandleRiftDying 0x84cebf8)
	void HandleRiftDying(class UFortAIEncounterInfo*& Encounter, class ABuildingRift*& Rift, class AController*& Controller, class AActor*& DamageActor); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.HandleRiftDamaged (Underlying native function: HandleRiftDamaged 0x84ce97c)
	void HandleRiftDamaged(class AActor*& DamagedRiftActor, float& Damage, class AController*& InstigatedBy, class AActor*& DamageCauser, struct FVector& HitLocation, class UPrimitiveComponent*& FHitComponent, struct FName& BoneName, struct FVector& Momentum); // (Final | Native | Protected | HasDefaults)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.HandleBossPawnHealthShieldChanged (Underlying native function: HandleBossPawnHealthShieldChanged 0x26daa0c)
	void HandleBossPawnHealthShieldChanged(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.HandleBossAIDied (Underlying native function: HandleBossAIDied 0x84ce748)
	void HandleBossAIDied(class AActor*& DamagedActor, float& Damage, class AController*& InstigatedBy, class AActor*& DamageCauser, struct FVector& HitLocation, class UPrimitiveComponent*& FHitComponent, struct FName& BoneName, struct FVector& Momentum); // (Final | Native | Protected | HasDefaults)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.HandleAISpecialEncounterAISpawned (Underlying native function: HandleAISpecialEncounterAISpawned 0x84ce670)
	void HandleAISpecialEncounterAISpawned(class UFortAIEncounterInfo*& Encounter, class AFortAIPawn*& SpawnedEnemy); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.HandleAISpawned (Underlying native function: HandleAISpawned 0x84ce5ac)
	void HandleAISpawned(class UFortAIEncounterInfo*& Encounter, class AFortAIPawn*& SpawnedEnemy); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.HandleAIDied (Underlying native function: HandleAIDied 0x84ce01c)
	void HandleAIDied(class AActor*& DamagedActor, float& Damage, class AController*& InstigatedBy, class AActor*& DamageCauser, struct FVector& HitLocation, class UPrimitiveComponent*& FHitComponent, struct FName& BoneName, struct FVector& Momentum); // (Final | Native | Protected | HasDefaults)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.GetTeamScore (Underlying native function: GetTeamScore 0x84cdf90)
	int GetTeamScore(unsigned char& TeamId); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.GetStreakScoreMultiplierResetTime (Underlying native function: GetStreakScoreMultiplierResetTime 0x84cdf5c)
	float GetStreakScoreMultiplierResetTime(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.GetPlayerScoreFromPlayerState (Underlying native function: GetPlayerScoreFromPlayerState 0x84cde50)
	bool GetPlayerScoreFromPlayerState(class AFortPlayerStateAthena*& AthenaPlayerState, int& OutScore); // (Final | Native | Public | HasOutParms | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.GetPlayerScore (Underlying native function: GetPlayerScore 0x84cdd24)
	bool GetPlayerScore(class AFortPlayerControllerAthena*& AthenaPlayerController, int& OutScore); // (Final | Native | Public | HasOutParms | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.GetPlayerBestScore (Underlying native function: GetPlayerBestScore 0x84cdae4)
	bool GetPlayerBestScore(class AFortPlayerControllerAthena*& AthenaPC, int& OutStatValue); // (Final | Native | Public | HasOutParms | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.GetBossHealthShieldData (Underlying native function: GetBossHealthShieldData 0x84cd8f4)
	struct FMashBossHealthShieldData GetBossHealthShieldData(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.GetBossDisplayName (Underlying native function: GetBossDisplayName 0x84cd858)
	struct FText GetBossDisplayName(); // (Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.BuildAndReportPlayersScores_PostMatch (Underlying native function: BuildAndReportPlayersScores_PostMatch 0x26daa0c)
	void BuildAndReportPlayersScoresPostMatch(); // (Final | Native | Private | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Mash.ArePlayerScoresFinal (Underlying native function: ArePlayerScoresFinal 0x84cd72c)
	bool ArePlayerScoresFinal(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)
};

