// Class /Script/FortniteGame.FortDamageNumbersActor
// Size: 0x578
class AFortDamageNumbersActor : public AFortClientOnlyActor
{
	float ComponentLifespan; // 0x290 (0x4)
	unsigned char unreflected_294[0x4]; // 0x294 (0x4) 
	class UStaticMesh* MeshesByElement[0x5]; // 0x298 (0x8) (ARRAY) 
	class UStaticMesh* CritBuildingImpactMesh; // 0x2c0 (0x8)
	class UStaticMesh* MeshesByScoreCategory[0x3]; // 0x2c8 (0x8) (ARRAY) 
	struct FName PlayerMaterialParameterName; // 0x2e0 (0x4)
	float PlayerMaterialParameterValue; // 0x2e4 (0x4)
	struct FName ColorParameterName; // 0x2e8 (0x4)
	struct FLinearColor HitPlayerColor; // 0x2ec (0x10)
	struct FLinearColor CriticalHitPlayerColor; // 0x2fc (0x10)
	struct FLinearColor HitEnemyColor; // 0x30c (0x10)
	struct FLinearColor CriticalHitEnemyColor; // 0x31c (0x10)
	struct FLinearColor HitBuildingColor; // 0x32c (0x10)
	struct FLinearColor CriticalHitBuildingColor; // 0x33c (0x10)
	struct FLinearColor ShieldHitColor; // 0x34c (0x10)
	struct FLinearColor CriticalHitShieldColor; // 0x35c (0x10)
	unsigned char unreflected_36c[0x4]; // 0x36c (0x4) 
	struct TArray<struct FFortDamageNumberColorInfo> DamageNumberColorInfos; // 0x370 (0x10)
	struct FName AnimationLifespanParameterName; // 0x380 (0x4)
	struct FName IsCriticalHitParameterName; // 0x384 (0x4)
	float SpacingPercentageForOnes; // 0x388 (0x4)
	unsigned char unreflected_38c[0x4]; // 0x38c (0x4) 
	struct TArray<struct FName> PositionParameterNames; // 0x390 (0x10)
	float DistanceFromCameraBeforeDoublingSize; // 0x3a0 (0x4)
	float CriticalHitSizeMultiplier; // 0x3a4 (0x4)
	float FontXSize; // 0x3a8 (0x4)
	float FontYSize; // 0x3ac (0x4)
	struct FVector WorldLocationOffset; // 0x3b0 (0x18)
	float NumberOfNumberRotations; // 0x3c8 (0x4)
	unsigned char unreflected_3cc[0x4]; // 0x3cc (0x4) 
	struct TArray<struct FName> ScaleRotationAngleParameterNames; // 0x3d0 (0x10)
	struct TArray<struct FName> DurationParameterNames; // 0x3e0 (0x10)
	float MaxScoreNumberDistance; // 0x3f0 (0x4)
	struct FName MoveToCameraParameterName; // 0x3f4 (0x4)
	struct TArray<struct FLinearColor> PercentDamageColors; // 0x3f8 (0x10)
	struct TArray<int> PercentDamageThresholds; // 0x408 (0x10)
	int CustomStencilDepthValue; // 0x418 (0x4)
	float CustomBoundsScale; // 0x41c (0x4)
	struct TMap<enum EFortDamageNumberType, float> OffsetScales; // 0x420 (0x50)
	struct TMap<enum EFortDamageNumberType, struct FVector2D> OffsetVector2Ds; // 0x470 (0x50)
	struct FVector2D RandomOffsetVector; // 0x4c0 (0x10)
	struct FPooledDamageNumberComponents PooledComponentsByElement[0x5]; // 0x4d0 (0x10) (ARRAY) 
	struct FPooledDamageNumberComponents PooledComponentsCritBuildingImpact; // 0x520 (0x10)
	struct FPooledDamageNumberComponents PooledComponentsByScoreCategory[0x3]; // 0x530 (0x10) (ARRAY) 
	struct TArray<struct FLiveDamageNumberComponent> LiveComponents; // 0x560 (0x10)
	unsigned char padding_570[0x8]; // 0x570 (0x8)

	/* Functions */

	// Function /Script/FortniteGame.FortDamageNumbersActor.SetMaterialParameters (Underlying native function: SetMaterialParameters 0x88c1980)
	void SetMaterialParameters(struct FFortDamageNumberInfo& NewDamageNumberInfo, struct FTransform& CameraTransform, struct FVector& NumberLocation); // (Final | Native | Protected | HasOutParms | HasDefaults | BlueprintCallable)
};

