// Class /Script/FortniteGame.FortCreativeMoveTool
// Size: 0x1870
class AFortCreativeMoveTool : public AFortWeapon
{
	class UFortObjectMoverInputComponent* CreativeMoveToolInputComponent; // 0x1040 (0x8)
	unsigned char unreflected_1048[0x78]; // 0x1048 (0x78) 
	struct FMulticastInlineDelegate OnFinishedSpawningDelegate; // 0x10c0 (0x10)
	struct TMap<class AActor*, class AActor*> PreviewToOriginalActors; // 0x10d0 (0x50)
	unsigned char unreflected_1120[0x8]; // 0x1120 (0x8) 
	struct TArray<struct FOriginalAndSpawnedPair> SpawnHelperNewlyPlacedActors; // 0x1128 (0x10)
	struct TArray<struct FActorAndTransformPair> ToDuplicateActors; // 0x1138 (0x10)
	unsigned char unreflected_1148[0x8]; // 0x1148 (0x8) 
	struct FMulticastInlineDelegate OnFinishedSpawningSelectedActors; // 0x1150 (0x10)
	struct FMulticastInlineDelegate OnFinishedSpawningPreviewActors; // 0x1160 (0x10)
	struct FMulticastInlineDelegate OnFinishedSpawningForCut; // 0x1170 (0x10)
	struct TArray<struct FCreativeSelectedActorInfo> SelectedActorsReplicateToRemoteClients; // 0x1180 (0x10)
	class UObjectInteractionBehavior* ActiveMovementModeReplicateToRemoteClients; // 0x1190 (0x8)
	float MaxRange; // 0x1198 (0x4)
	unsigned char unreflected_119c[0x4]; // 0x119c (0x4) 
	class UObjectInteractionBehavior* ActiveMovementMode; // 0x11a0 (0x8)
	bool bIsPreviewingMove; // 0x11a8 (0x1)
	unsigned char unreflected_11a9[0x7]; // 0x11a9 (0x7) 
	struct TArray<class UObjectInteractionBehavior*> InteractionBehaviors; // 0x11b0 (0x10)
	unsigned char unreflected_11c0[0x10]; // 0x11c0 (0x10) 
	class UDeleteObjects* DeleteObjectsInteractionBehavior; // 0x11d0 (0x8)
	class UPlaysetPreview* PlaysetPreviewInteractionBehavior; // 0x11d8 (0x8)
	unsigned char unreflected_11e0[0x10]; // 0x11e0 (0x10) 
	struct FMulticastInlineDelegate OnMoveToolInteractionStarted; // 0x11f0 (0x10)
	struct FMulticastInlineDelegate OnMoveToolInteractionStopped; // 0x1200 (0x10)
	struct FMulticastInlineDelegate OnMoveToolRotationAxisChanged; // 0x1210 (0x10)
	struct FMulticastInlineDelegate OnMoveToolScaleAxisChanged; // 0x1220 (0x10)
	struct FMulticastInlineDelegate OnMoveToolLineOfSightBlockingChanged; // 0x1230 (0x10)
	struct FMulticastInlineDelegate OnMoveToolDropToFloorChanged; // 0x1240 (0x10)
	struct FMulticastInlineDelegate OnMoveToolPrecisionChanged; // 0x1250 (0x10)
	struct FMulticastInlineDelegate OnMoveToolTransformationModeChanged; // 0x1260 (0x10)
	struct FMulticastInlineDelegate OnMoveToolScaleInsteadOfRotateChanged; // 0x1270 (0x10)
	struct FMulticastInlineDelegate OnAddedSelectedActor; // 0x1280 (0x10)
	struct FMulticastInlineDelegate OnCouldNotAddReachedSelectionLimit; // 0x1290 (0x10)
	struct FMulticastInlineDelegate OnRemovedSelectedActor; // 0x12a0 (0x10)
	struct FMulticastInlineDelegate OnSelectedActorsCleared; // 0x12b0 (0x10)
	struct FMulticastInlineDelegate OnSelectionPropertyChanged; // 0x12c0 (0x10)
	struct FMulticastInlineDelegate OnMoveToolScaleModified; // 0x12d0 (0x10)
	struct FMulticastInlineDelegate OnMoveToolRotationModified; // 0x12e0 (0x10)
	struct FMulticastInlineDelegate OnMoveToolBuildingAsPropSettingChanged; // 0x12f0 (0x10)
	struct FMulticastInlineDelegate OnMoveToolFocusChanged; // 0x1300 (0x10)
	unsigned char unreflected_1310[0x59]; // 0x1310 (0x59) 
	enum ETransformationType CurrentTransformationType; // 0x1369 (0x1)
	unsigned char unreflected_136a[0x6]; // 0x136a (0x6) 
	struct TArray<struct FCreativeSelectedActorInfo> SelectedActors; // 0x1370 (0x10)
	struct TArray<struct FLogicalConnectionChain> ServerSelectedActorLogicalConnections; // 0x1380 (0x10)
	struct TArray<struct FValidPlacementPair> ConnectedActorStates; // 0x1390 (0x10)
	struct FVector ScaleModifier; // 0x13a0 (0x18)
	unsigned char unreflected_13b8[0x8]; // 0x13b8 (0x8) 
	struct FTransform SelectionToWorld; // 0x13c0 (0x60)
	struct FBox SelectionSpaceActorsBounds; // 0x1420 (0x38)
	unsigned char unreflected_1458[0xc8]; // 0x1458 (0xc8) 
	bool bIsScaleUpPressed; // 0x1520 (0x1)
	unsigned char unreflected_1521[0x2f]; // 0x1521 (0x2f) 
	bool bIsMultiselectEnabled; // 0x1550 (0x1)
	bool bIsQuickbarSupported; // 0x1551 (0x1)
	bool bIsImmersiveEditModeEnabled; // 0x1552 (0x1)
	enum ESelectionProperty SelectionProperty; // 0x1553 (0x1)
	unsigned char unreflected_1554[0x2]; // 0x1554 (0x2) 
	bool bIsScaleDownPressed; // 0x1556 (0x1)
	bool bIsPushPressed; // 0x1557 (0x1)
	bool bIsPullPressed; // 0x1558 (0x1)
	bool bIsAutoTractorBeamRunning; // 0x1559 (0x1)
	unsigned char unreflected_155a[0xa]; // 0x155a (0xa) 
	bool bIsRotateClockwisePressed; // 0x1564 (0x1)
	bool bIsRotateCounterclockwisePressed; // 0x1565 (0x1)
	bool bIsScalingInsteadOfRotating; // 0x1566 (0x1)
	unsigned char unreflected_1567[0x9]; // 0x1567 (0x9) 
	struct FQuat TargetRotationOffset; // 0x1570 (0x20)
	struct FQuat RotationOffset; // 0x1590 (0x20)
	struct TArray<struct FRotator> RotationAxes; // 0x15b0 (0x10)
	unsigned char RotationAxisIndex; // 0x15c0 (0x1)
	enum EScaleAxis SelectedScaleAxis; // 0x15c1 (0x1)
	unsigned char unreflected_15c2[0x6]; // 0x15c2 (0x6) 
	struct TSet<class UMeshComponent*> HoveredComponents; // 0x15c8 (0x50)
	struct TMap<class UMeshComponent*, float> ComponentsToReclaimMIDsFrom; // 0x1618 (0x50)
	struct TArray<struct FCreativePooledMID> AllMIDs; // 0x1668 (0x10)
	unsigned char unreflected_1678[0x50]; // 0x1678 (0x50) 
	float MaxUnhoverAnimationTime; // 0x16c8 (0x4)
	unsigned char unreflected_16cc[0x4]; // 0x16cc (0x4) 
	struct TArray<struct FOriginalAndSpawnedPair> NewlyPlacedActors; // 0x16d0 (0x10)
	struct FFlashCountedActorInfo CutActors; // 0x16e0 (0x18)
	struct TArray<struct FCreativeSelectedActorInfo> CutActorsPrereplication; // 0x16f8 (0x10)
	struct TArray<class AActor*> DisableCollisionActors; // 0x1708 (0x10)
	struct TArray<class AActor*> DisableCollisionActorsPrereplication; // 0x1718 (0x10)
	struct TSet<class AActor*> AlreadyProcessedNewlyPlacedActorsOnClient; // 0x1728 (0x50)
	struct FAgingActorArray RecentlyPlacedAgingActors; // 0x1778 (0x10)
	bool bShouldDestroyPropsWhenPlacing; // 0x1788 (0x1)
	bool bAllowGravityOnPlace; // 0x1789 (0x1)
	unsigned char unreflected_178a[0x2]; // 0x178a (0x2) 
	struct FCreativeOptionVariableBase* WantsGravityOnPlace; // 0x178c (0x8)
	bool bShouldUsePrecisionGridSnapping; // 0x1794 (0x1)
	unsigned char GridSnapIndex; // 0x1795 (0x1)
	unsigned char unreflected_1796[0x2]; // 0x1796 (0x2) 
	struct FCreativeOptionVariableBase* WantsPrecisionGridSnapping; // 0x1798 (0x8)
	struct TArray<struct FVector> GridSnapRatios; // 0x17a0 (0x10)
	bool bDoesRequireCreatePermission; // 0x17b0 (0x1)
	enum EHitTraceType TraceType; // 0x17b1 (0x1)
	bool bClientNeedsToProcessNewlyPlacedActors; // 0x17b2 (0x1)
	unsigned char unreflected_17b3[0x1]; // 0x17b3 (0x1) 
	struct FCreativeOptionVariableBase* WantedHitTraceRule; // 0x17b4 (0x8)
	unsigned char unreflected_17bc[0x4]; // 0x17bc (0x4) 
	struct FGameplayTagContainer MoveToolActivatedTags; // 0x17c0 (0x20)
	struct FGameplayTag ProgressTimerCueTag; // 0x17e0 (0x4)
	unsigned char unreflected_17e4[0x4]; // 0x17e4 (0x4) 
	class ULevelRecordSpawner* ActiveRecordSpawner; // 0x17e8 (0x8)
	class UClass* VolumeClassToSpawn; // 0x17f0 (0x8)
	struct FCreativeOptionVariableBase* WantedIgnoreRecentlyPlacedTime; // 0x17f8 (0x8)
	bool bAlwaysMoveFreely; // 0x1800 (0x1)
	unsigned char unreflected_1801[0x7]; // 0x1801 (0x7) 
	bool bBuildingsAsPropsSnapToCenter; // 0x1808 (0x1)
	unsigned char unreflected_1809[0x3]; // 0x1809 (0x3) 
	struct FCreativeOptionVariableBase* WantedAlwaysMoveFreely; // 0x180c (0x8)
	struct FCreativeOptionVariableBase* WantedCameraSpacePositioning; // 0x1814 (0x8)
	struct FCreativeOptionVariableBase* WantsAutoTractorBeam; // 0x181c (0x8)
	unsigned char unreflected_1824[0x4]; // 0x1824 (0x4) 
	class AActor* HoveredActor; // 0x1828 (0x8)
	class AFortCreativeHeatmapThermometerPreview* CreativeHeatmapThermometerPreview; // 0x1830 (0x8)
	struct FGameplayTagContainer WeaponEquipContextTags; // 0x1838 (0x20)
	struct FString PlacementLocale; // 0x1858 (0x10)
	unsigned char padding_1868[0x8]; // 0x1868 (0x8)

	/* Functions */

	// Function /Script/FortniteGame.FortCreativeMoveTool.UnholsterWeapon (Underlying native function: UnholsterWeapon 0x90127d4)
	void UnholsterWeapon(); // (Final | Native | Protected | BlueprintCallable)

	// Function /Script/FortniteGame.FortCreativeMoveTool.TurboBuildAttemptToPlace (Underlying native function: TurboBuildAttemptToPlace 0x90127c0)
	void TurboBuildAttemptToPlace(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortCreativeMoveTool.SpawnPlaysetVolumeOnServer (Underlying native function: SpawnPlaysetVolumeOnServer 0x9012678)
	void SpawnPlaysetVolumeOnServer(class UFortPlaysetItemDefinition*& Playset, struct FVector& SpawnLocation, struct FRotator& SpawnRotation); // (Net | NetReliable | Native | Event | Protected | NetServer | HasDefaults | 0x80000000)

