// Class /Script/FortniteGame.FortAthenaMutator_Uranium
// Size: 0xdf8
class AFortAthenaMutator_Uranium : public AFortAthenaMutator_GameModeBase
{
	unsigned char unreflected_450[0x28]; // 0x450 (0x28) 
	struct FMulticastInlineDelegate OnInitialized; // 0x478 (0x10)
	struct FMulticastInlineDelegate OnTeleportOutComplete; // 0x488 (0x10)
	unsigned char unreflected_498[0x8]; // 0x498 (0x8) 
	struct FMulticastInlineDelegate OnUraniumChangeRoundEndVisibility; // 0x4a0 (0x10)
	struct FMulticastInlineDelegate OnShowRoundIntro; // 0x4b0 (0x10)
	struct FMulticastInlineDelegate OnUraniumChangeRoundProgressVisibility; // 0x4c0 (0x10)
	struct FScalableFloat bPerkSelectBeforePOICamera; // 0x4d0 (0x28)
	struct FText RoundResultsTextAttackersWin; // 0x4f8 (0x18)
	struct FText RoundResultsTextAttackersLost; // 0x510 (0x18)
	struct FText RoundResultsTextDefendersWin; // 0x528 (0x18)
	struct FText RoundResultsTextDefendersLost; // 0x540 (0x18)
	struct FText RoundIntroTextAttacking; // 0x558 (0x18)
	struct FText RoundIntroTextDefending; // 0x570 (0x18)
	class USoundBase* RoundIntroFactionSoundAttacking; // 0x588 (0x8)
	class USoundBase* RoundIntroFactionSoundDefending; // 0x590 (0x8)
	class USoundBase* MatchEndSoundWinAttackers; // 0x598 (0x8)
	class USoundBase* MatchEndSoundWinDefenders; // 0x5a0 (0x8)
	class USoundBase* MatchEndSoundLoseAttackers; // 0x5a8 (0x8)
	class USoundBase* MatchEndSoundLoseDefenders; // 0x5b0 (0x8)
	class UClass* PushCartClass; // 0x5b8 (0x8)
	struct TWeakObjectPtr<class AFortPlayerPushableCart> PushCart; // 0x5c0 (0x8)
	unsigned char unreflected_5c8[0x60]; // 0x5c8 (0x60) 
	class UClass* StormShieldClass; // 0x628 (0x8)
	class AFortMissionStormShield* StormShield; // 0x630 (0x8)
	float RespawnRadius; // 0x638 (0x4)
	unsigned char unreflected_63c[0x4]; // 0x63c (0x4) 
	struct FScalableFloat RespawnLocationOffsetPusherTeam; // 0x640 (0x28)
	struct FScalableFloat RespawnLocationOffsetDefenderTeam; // 0x668 (0x28)
	struct FScalableFloat StartMovingRespawnCheckPointPctPusherTeam; // 0x690 (0x28)
	struct FScalableFloat StartMovingRespawnCheckPointPctDefenderTeam; // 0x6b8 (0x28)
	struct FScalableFloat StopMovingRespawnCheckPointPctPusherTeam; // 0x6e0 (0x28)
	struct FScalableFloat StopMovingRespawnCheckPointPctDefenderTeam; // 0x708 (0x28)
	struct FScalableFloat MovingRespawnOffsetMultiplierPusherTeam; // 0x730 (0x28)
	struct FScalableFloat MovingRespawnOffsetMultiplierDefenderTeam; // 0x758 (0x28)
	struct FScalableFloat PercentToMoveRespawnTowardCartViaTeamSizePusherTeam; // 0x780 (0x28)
	struct FScalableFloat PercentToMoveRespawnTowardCartViaTeamSizeDefenderTeam; // 0x7a8 (0x28)
	struct FScalableFloat bAlignMovingRespawnToCart; // 0x7d0 (0x28)
	struct FScalableFloat MinRespawnHeightAboveGround; // 0x7f8 (0x28)
	float CurrentMovingRespawnOffsetPusherTeam; // 0x820 (0x4)
	float CurrentMovingRespawnOffsetDefenderTeam; // 0x824 (0x4)
	struct FVector RespawnLocationPusherTeam; // 0x828 (0x18)
	struct FVector RespawnLocationDefenderTeam; // 0x840 (0x18)
	struct FUraniumPOIData CurrentPOI; // 0x858 (0x14)
	unsigned char unreflected_86c[0x4]; // 0x86c (0x4) 
	struct FScalableFloat SafeZoneRadius; // 0x870 (0x28)
	struct FScalableFloat AircraftOffsetFromRadius; // 0x898 (0x28)
	struct FScalableFloat SupplyDropRadius; // 0x8c0 (0x28)
	int NumberOfRounds; // 0x8e8 (0x4)
	enum EUraniumRoundEndCondition RoundEndCondition; // 0x8ec (0x1)
	enum EUraniumCartMovementRuleOnNewRound CartMovementRuleOnNewRound; // 0x8ed (0x1)
	unsigned char unreflected_8ee[0x2]; // 0x8ee (0x2) 
	struct FScalableFloat bOnRoundEndSwitchTeamRoles; // 0x8f0 (0x28)
	struct FScalableFloat bOnRoundSetUpResetPlayerAbilities; // 0x918 (0x28)
	float RoundPhaseDurations[0xf]; // 0x940 (0x4) (ARRAY) 
	float EndOfRoundCameraFadeOutTime; // 0x97c (0x4)
	float EndOfRoundCameraFadeInTime; // 0x980 (0x4)
	float EndOfRoundStasisDelay; // 0x984 (0x4)
	struct FUraniumRoundData RoundData; // 0x988 (0x18)
	struct FScalableFloat EarlyEndGameBlowOutRoundNumberMin; // 0x9a0 (0x28)
	struct FScalableFloat EarlyEndGameBlowOutPointSpread; // 0x9c8 (0x28)
	struct FScalableFloat EarlyEndGameOutNumberedPercent; // 0x9f0 (0x28)
	enum EUraniumRoundPhase CurrentRoundPhase; // 0xa18 (0x1)
	unsigned char unreflected_a19[0x17]; // 0xa19 (0x17) 
	bool bRoundTimerStarted; // 0xa30 (0x1)
	unsigned char unreflected_a31[0x7]; // 0xa31 (0x7) 
	struct FScalableFloat MatchTimeAtStart; // 0xa38 (0x28)
	struct FScalableFloat MatchTimeAddedPerCheckpoint; // 0xa60 (0x28)
	struct FScalableFloat PushersAbandonedCartOvertime; // 0xa88 (0x28)
	int PushersAbandonedCartOvertimeInterval; // 0xab0 (0x4)
	unsigned char unreflected_ab4[0x4]; // 0xab4 (0x4) 
	struct FScalableFloat PushersAbandonedCartOvertimeDuration; // 0xab8 (0x28)
	bool bPushCartIsPushableAtStart; // 0xae0 (0x1)
	unsigned char unreflected_ae1[0x3]; // 0xae1 (0x3) 
	float PushersAbandonedCartStartTime; // 0xae4 (0x4)
	unsigned char unreflected_ae8[0x8]; // 0xae8 (0x8) 
	float PushersAbandonedCartDuration; // 0xaf0 (0x4)
	unsigned char unreflected_af4[0x1c]; // 0xaf4 (0x1c) 
	unsigned char bInOvertime; // 0xb10 (0x1)
	unsigned char bPerkModeOn; // 0xb10 (0x1)
	unsigned char bShouldPlayFactionIntro; // 0xb10 (0x1)
	unsigned char unreflected_b11[0x7]; // 0xb11 (0x7) 
	struct FScalableFloat DestroyActorsOnNewRound; // 0xb18 (0x28)
	struct TArray<class UClass*> ActorClassesToDestroy; // 0xb40 (0x10)
	struct FScalableFloat PlayersImmediatelyReenterGameplayAfterSelectingAPerk; // 0xb50 (0x28)
	class UMaterialParameterCollection* MinimapMaterialParameterCollection; // 0xb78 (0x8)
	struct FMulticastInlineDelegate OnOvertimeChanged; // 0xb80 (0x10)
	struct FMulticastInlineDelegate OnRoundDataUpdated; // 0xb90 (0x10)
	struct FMulticastInlineDelegate OnRoundCompleted; // 0xba0 (0x10)
	struct FMulticastInlineDelegate OnTeamsRolesChanged; // 0xbb0 (0x10)
	struct FGameplayTag RoundCompleteAccoladeTag; // 0xbc0 (0x4)
	struct FGameplayTag RoundWinAccoladeTag; // 0xbc4 (0x4)
	struct FGameplayTag MatchWinAccoladeTag; // 0xbc8 (0x4)
	unsigned char unreflected_bcc[0x16]; // 0xbcc (0x16) 
	bool bShowFullSplineOnMapUI; // 0xbe2 (0x1)
	unsigned char unreflected_be3[0x5]; // 0xbe3 (0x5) 
	class UClass* CheckPointMarkerClass; // 0xbe8 (0x8)
	unsigned char unreflected_bf0[0x10]; // 0xbf0 (0x10) 
	struct FGameplayTag SplineGameplayTag; // 0xc00 (0x4)
	struct FGameplayTag CameraGameplayTag; // 0xc04 (0x4)
	struct FGameplayTagContainer POIParentGameplayTags; // 0xc08 (0x20)
	unsigned char unreflected_c28[0x1]; // 0xc28 (0x1) 
	bool bIsSafeToTurnOnCameraAfterRespawn; // 0xc29 (0x1)
	unsigned char unreflected_c2a[0x6]; // 0xc2a (0x6) 
	struct TMap<enum EUraniumEventId, struct FAthenaGameMessageData> GameMessagesPushers; // 0xc30 (0x50)
	struct TMap<enum EUraniumEventId, struct FAthenaGameMessageData> GameMessagesDefenders; // 0xc80 (0x50)
	struct FScalableFloat EventTrackingTimeBetweenTicks; // 0xcd0 (0x28)
	struct FScalableFloat EventTrackingTimeIsLowTime; // 0xcf8 (0x28)
	struct FScalableFloat EventTrackingTimeIsExtraLowTime; // 0xd20 (0x28)
	struct FScalableFloat EventTrackingCheckPointIsNearDistance; // 0xd48 (0x28)
	struct FText TeleportingPlayersOutText; // 0xd70 (0x18)
	bool bForcePerkPickerOnCheckpoint; // 0xd88 (0x1)
	unsigned char unreflected_d89[0x17]; // 0xd89 (0x17) 
	class AFortAthenaMutator_SynchronizedTeleport* TeleportMutator; // 0xda0 (0x8)
	class AFortAthenaMutator_InventoryOverride* InventoryOverrideMutator; // 0xda8 (0x8)
	class AFortAthenaMutator_RespawnWave* RespawnWaveMutator; // 0xdb0 (0x8)
	unsigned char CheckpointTeleportPlayersReleased; // 0xdb8 (0x1)
	unsigned char CheckpointTeleportComplete; // 0xdb9 (0x1)
	unsigned char unreflected_dba[0x6]; // 0xdba (0x6) 
	struct FScalableFloat TeleportHeight; // 0xdc0 (0x28)
	unsigned char unreflected_de8[0x8]; // 0xde8 (0x8) 
	bool bCheatDrawRespawnLocations; // 0xdf0 (0x1)
	unsigned char padding_df1[0x7]; // 0xdf1 (0x7)

	/* Functions */

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.TickUraniumEvents (Underlying native function: TickUraniumEvents 0x26daa0c)
	void TickUraniumEvents(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.TeleportPlayerLoadComplete (Underlying native function: TeleportPlayerLoadComplete 0x71a663c)
	void TeleportPlayerLoadComplete(class AFortPlayerStateAthena*& PlayerState); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.StartEndOfRoundStasis (Underlying native function: StartEndOfRoundStasis 0x852506c)
	void StartEndOfRoundStasis(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnRep_TeleportComplete (Underlying native function: OnRep_TeleportComplete 0x85246a0)
	void OnRepTeleportComplete(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnRep_RoundData (Underlying native function: OnRep_RoundData 0x8524684)
	void OnRepRoundData(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnRep_PushCart (Underlying native function: OnRep_PushCart 0x8524670)
	void OnRepPushCart(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnRep_CurrentRoundPhase (Underlying native function: OnRep_CurrentRoundPhase 0x8524634)
	void OnRepCurrentRoundPhase(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnRep_CurrentPOI (Underlying native function: OnRep_CurrentPOI 0x8524598)
	void OnRepCurrentPOI(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnRep_bInOvertime (Underlying native function: OnRep_bInOvertime 0x85246d0)
	void OnRepbInOvertime(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnPushCartTeamsRolesChanged (Underlying native function: OnPushCartTeamsRolesChanged 0x85244d4)
	void OnPushCartTeamsRolesChanged(unsigned char& NewPusherTeam, unsigned char& NewDefenerTeam); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnPushCartReachedCheckPoint (Underlying native function: OnPushCartReachedCheckPoint 0x8524454)
	void OnPushCartReachedCheckPoint(int& CheckPointIndex); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnPushCartPushersOrDefendersChanged (Underlying native function: OnPushCartPushersOrDefendersChanged 0x26daa0c)
	void OnPushCartPushersOrDefendersChanged(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.OnPlaylistDataLoaded (Underlying native function: OnPlaylistDataLoaded 0x71a6dd0)
	void OnPlaylistDataLoaded(struct FName& PlaylistName, struct FGameplayTagContainer& PlaylistContainerTags); // (Final | Native | Private | HasOutParms)

	// DelegateFunction /Script/FortniteGame.FortAthenaMutator_Uranium.OnInitialized__DelegateSignature (Has no native function)
	void OnInitializedDelegateSignature(); // (MulticastDelegate | Public | Delegate)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.MulticastSetWinningTeams (Underlying native function: MulticastSetWinningTeams 0x852432c)
	void MulticastSetWinningTeams(struct TArray<unsigned char>& InWinningTeams); // (Net | NetReliable | Native | Event | NetMulticast | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.HandleTeleportComplete (Underlying native function: HandleTeleportComplete 0x26daa0c)
	void HandleTeleportComplete(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.HandleRoundPhase (Underlying native function: HandleRoundPhase 0x72ab98c)
	void HandleRoundPhase(enum EUraniumRoundPhase& NewRoundPhase); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.GetWinningTeamForRound (Underlying native function: GetWinningTeamForRound 0x8523e0c)
	unsigned char GetWinningTeamForRound(int& RoundNumber); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.GetRoundTeamWinners (Underlying native function: GetRoundTeamWinners 0x85239b4)
	void GetRoundTeamWinners(struct TArray<unsigned char>& TeamWinnersEachRound); // (Final | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.GetPushCart (Underlying native function: GetPushCart 0x85238b0)
	class AFortPlayerPushableCart* GetPushCart(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.GetCurrentRoundNumber (Underlying native function: GetCurrentRoundNumber 0x8523400)
	int GetCurrentRoundNumber(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaMutator_Uranium.GetCurrentRoundCheckPoint (Underlying native function: GetCurrentRoundCheckPoint 0x85233e8)
	int GetCurrentRoundCheckPoint(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)
};

