// Class /Script/FortniteGame.FortAthenaMutator_AutoPickup
// Size: 0x338
class AFortAthenaMutator_AutoPickup : public AFortAthenaMutator
{
	enum EFortCreativeAutoPickupSetting AutoPickupDefaultItems; // 0x330 (0x1)
	enum EFortCreativeAutoPickupSetting AutoPickupAmmoItems; // 0x331 (0x1)
	enum EFortCreativeAutoPickupSetting AutoPickupConsumableItems; // 0x332 (0x1)
	enum EFortCreativeAutoPickupSetting AutoPickupGadgetItems; // 0x333 (0x1)
	enum EFortCreativeAutoPickupSetting AutoPickupTrapItems; // 0x334 (0x1)
	enum EFortCreativeAutoPickupSetting AutoPickupWeaponItems; // 0x335 (0x1)
	enum EFortCreativeAutoPickupSetting AutoPickupWorldResourceItems; // 0x336 (0x1)
	unsigned char padding_337[0x1]; // 0x337 (0x1)
};

