// Class /Script/FortniteGame.FortEmitterCameraLensEffectDirectional
// Size: 0x3b0
class AFortEmitterCameraLensEffectDirectional : public AEmitterCameraLensEffectBase
{
	unsigned char unreflected_370[0x8]; // 0x370 (0x8) 
	class AActor* DamageDealer; // 0x378 (0x8)
	struct FVector DamageDealerLocation; // 0x380 (0x18)
	struct FName RotationParameterName; // 0x398 (0x4)
	unsigned char bRotateActor; // 0x39c (0x1)
	unsigned char unreflected_39d[0x3]; // 0x39d (0x3) 
	float Strength; // 0x3a0 (0x4)
	unsigned char padding_3a4[0xc]; // 0x3a4 (0xc)
};

