// Class /Script/FortniteGame.FortWorldSettings
// Size: 0x9e0
class AFortWorldSettings : public AWorldSettings
{
	struct TArray<struct TWeakObjectPtr<class AActor>> ActorsNeedingWorldReady; // 0x4a8 (0x10)
	struct TArray<int> WorldCells; // 0x4b8 (0x10)
	struct FVector WorldCellsOrigin; // 0x4c8 (0x18)
	int WorldCellsFlags; // 0x4e0 (0x4)
	unsigned char bGenerateTestLevelSaves; // 0x4e4 (0x1)
	unsigned char bDisableCullDistance; // 0x4e4 (0x1)
	unsigned char bUseWorldSpecificCullDistanceOverride; // 0x4e4 (0x1)
	unsigned char bOverrideMainMapSettings; // 0x4e4 (0x1)
	unsigned char bValidateNavGraphConnectivity; // 0x4e4 (0x1)
	unsigned char bLimitNavGraphSkyCells; // 0x4e4 (0x1)
	unsigned char bUseProceduralFoliage; // 0x4e4 (0x1)
	unsigned char bUseConditionalBuildingFoundations; // 0x4e4 (0x1)
	unsigned char bAllowBuildingStreamingData; // 0x4e5 (0x1)
	unsigned char unreflected_4e6[0x2]; // 0x4e6 (0x2) 
	int SplineHLODIndex; // 0x4e8 (0x4)
	unsigned char bShowTimeOfDayManager; // 0x4ec (0x1)
	unsigned char bEditableTimeOfDayManager; // 0x4ec (0x1)
	unsigned char unreflected_4ed[0x3]; // 0x4ed (0x3) 
	float MinCullObjectSize; // 0x4f0 (0x4)
	float MinCullDistance; // 0x4f4 (0x4)
	float MaxCullObjectSize; // 0x4f8 (0x4)
	float MaxCullDistance; // 0x4fc (0x4)
	class UMaterialInterface* OverrideMinimapMaterial; // 0x500 (0x8)
	struct FVector2D PvPMapWorldCenter; // 0x508 (0x10)
	float MapZOffset; // 0x518 (0x4)
	unsigned char unreflected_51c[0x4]; // 0x51c (0x4) 
	struct FRotator MapRotation; // 0x520 (0x18)
	class UTexture2D* MapInitialMask; // 0x538 (0x8)
	unsigned char bSpawnVehicleManager; // 0x540 (0x1)
	unsigned char bSpawnPhysicsObjectManager; // 0x540 (0x1)
	unsigned char bSpawnAsyncObjectManager; // 0x540 (0x1)
	unsigned char unreflected_541[0x3]; // 0x541 (0x3) 
	float MapWorldScale; // 0x544 (0x4)
	float MiniMapZoom; // 0x548 (0x4)
	unsigned char unreflected_54c[0x4]; // 0x54c (0x4) 
	struct FSlateBrush AircraftPathBrush; // 0x550 (0xc0)
	struct FSlateBrush AircraftMidlinePathBrush; // 0x610 (0xc0)
	struct FSlateBrush AircraftPathTeamIndicatorBrush; // 0x6d0 (0xc0)
	struct FSlateBrush SafeZoneFinalPosBrush; // 0x790 (0xc0)
	struct TArray<struct FIntPoint*> NavGraphSkyCells; // 0x850 (0x10)
	class UCurveTable* SearchSpeedOverride; // 0x860 (0x8)
	class UCurveTable* ResourceRateOverride; // 0x868 (0x8)
	class USoundBase* SoundBodyHeadshotRequired; // 0x870 (0x8)
	unsigned char bSpawnTimeOfDayManager; // 0x878 (0x1)
	unsigned char bDisableAllTimeOfDayManagers; // 0x878 (0x1)
	unsigned char bDisableGlobalWeatherEvents; // 0x878 (0x1)
	unsigned char unreflected_879[0x7]; // 0x879 (0x7) 
	struct TWeakObjectPtr<class UClass> WorldTimeOfDayManager; // 0x880 (0x28)
	struct TWeakObjectPtr<class UClass> WorldMusicManager; // 0x8a8 (0x28)
	class UFortMusicManagerBank* WorldMusicManagerBank; // 0x8d0 (0x8)
	struct TWeakObjectPtr<class UClass> DefaultWorldTimeOfDayManager; // 0x8d8 (0x28)
	struct TWeakObjectPtr<class UClass> ZoneThemeTimeOfDayManager; // 0x900 (0x28)
	struct TWeakObjectPtr<class UClass> MissionTimeOfDayManager; // 0x928 (0x28)
	struct TWeakObjectPtr<class UClass> ZoneThemeMusicManager; // 0x950 (0x28)
	class UFortMusicManagerBank* ZoneThemeMusicManagerBank; // 0x978 (0x8)
	struct TArray<struct FBuildingFoundationStreamingData> BuildingFoundationStreamingData; // 0x980 (0x10)
	struct TScriptInterface<class IFortTimeOfDayManagerInterface> TimeOfDayManager; // 0x990 (0x10)
	class AFortVehicleManager* VehicleManager; // 0x9a0 (0x8)
	class AFortPhysicsObjectManager* PhysicsObjectManager; // 0x9a8 (0x8)
	class AFortAsyncObjectManager* AsyncObjectManager; // 0x9b0 (0x8)
	class UFortLevelOverlayManager* LevelOverlayManager; // 0x9b8 (0x8)
	unsigned char padding_9c0[0x20]; // 0x9c0 (0x20)
};

