// Class /Script/FortniteGame.FortWorldManager
// Size: 0x9a0
class AFortWorldManager : public AInfo
{
	unsigned char unreflected_288[0x70]; // 0x288 (0x70) 
	struct TArray<struct FFortLevelStreamingInfo*> StreamedLevels; // 0x2f8 (0x10)
	struct TArray<struct FFortPlacementLocationTagHandler> PlacementLocationTagHandlers; // 0x308 (0x10)
	unsigned char bSavingEnabled; // 0x318 (0x1)
	unsigned char unreflected_319[0x3]; // 0x319 (0x3) 
	uint32_t SaveFrequencySeconds; // 0x31c (0x4)
	unsigned char bStreamInBuildings; // 0x320 (0x1)
	unsigned char bConstructTileWorld; // 0x320 (0x1)
	unsigned char bUseSimMaps; // 0x320 (0x1)
	unsigned char unreflected_321[0x3]; // 0x321 (0x3) 
	int NumNonAutoconstructedTiles; // 0x324 (0x4)
	struct FDataTableRowHandle GameDifficultyRowPIEOverride; // 0x328 (0x10)
	class UClass* ZoneThemeForPIE; // 0x338 (0x8)
	struct FFortWindIntensityAndDirection* InitialGlobalWind; // 0x340 (0x8)
	struct TEnumAsByte<EFortWorldManagerState> WorldManagerState; // 0x348 (0x1)
	unsigned char unreflected_349[0x7]; // 0x349 (0x7) 
	class UWorldTileManager* TileManager; // 0x350 (0x8)
	int XSize; // 0x358 (0x4)
	int YSize; // 0x35c (0x4)
	int ZStructuralGridSize; // 0x360 (0x4)
	int VerticalCellNumOffsetFromOrigin; // 0x364 (0x4)
	int TileEdgeSize; // 0x368 (0x4)
	unsigned char unreflected_36c[0x4]; // 0x36c (0x4) 
	class UWorldTheme* Theme; // 0x370 (0x8)
	struct FName DefaultLootQuotaCategory; // 0x378 (0x4)
	unsigned char unreflected_37c[0x4]; // 0x37c (0x4) 
	struct FFortTileLootData LootData; // 0x380 (0x318)
	int MaxTiles; // 0x698 (0x4)
	bool bUseFixedSeed; // 0x69c (0x1)
	unsigned char unreflected_69d[0x3]; // 0x69d (0x3) 
	int FixedSeed; // 0x6a0 (0x4)
	unsigned char unreflected_6a4[0x4]; // 0x6a4 (0x4) 
	struct TArray<struct FWorldTileSubArray> Y; // 0x6a8 (0x10)
	struct FVector FriendlyPlayerSpawnExtent; // 0x6b8 (0x18)
	struct FVector PadPlayerSpawnExtent; // 0x6d0 (0x18)
	float DangerPlayerSpawnExclusionRadius; // 0x6e8 (0x4)
	float ObjectivePlayerSpawnExclusionRadius; // 0x6ec (0x4)
	struct FGameplayTagContainer OverrideInitialPlayerSpawnTags; // 0x6f0 (0x20)
	struct FGameplayTagContainer OverrideBackupPlayerSpawnTags; // 0x710 (0x20)
	struct FFortStartingMissionInfo StartingMissionInfo; // 0x730 (0x18)
	class UFortWorldRecord* CurrentWorldRecord; // 0x748 (0x8)
	class UFortZoneRecord* CurrentZoneRecord; // 0x750 (0x8)
	unsigned char unreflected_758[0x20]; // 0x758 (0x20) 
	class UFortUserCloudHelperComponent* CloudHelper; // 0x778 (0x8)
	int CurrentZoneIndex; // 0x780 (0x4)
	bool bHasCreatedMissions; // 0x784 (0x1)
	bool bHasCreatedPrimaryAdditionalFoundations; // 0x785 (0x1)
	bool bHasSpawnedActorsForMissions; // 0x786 (0x1)
	bool bZoneCompleted; // 0x787 (0x1)
	bool bZoneFinished; // 0x788 (0x1)
	bool bCreatedMissionRecord; // 0x789 (0x1)
	unsigned char unreflected_78a[0x6]; // 0x78a (0x6) 
	struct FFortMissionManagerRecord MissionManagerRecord; // 0x790 (0x38)
	struct TArray<struct FFortMissionEntry> ReactiveMissionsToAdd; // 0x7c8 (0x10)
	struct TArray<struct FFortDeferredNewActorData> DeferredActors; // 0x7d8 (0x10)
	unsigned char unreflected_7e8[0x180]; // 0x7e8 (0x180) 
	int FinalNumChosenBuildingFoundations; // 0x968 (0x4)
	unsigned char unreflected_96c[0x4]; // 0x96c (0x4) 
	struct TArray<class ABuildingFoundation*> ChosenBuildingFoundations; // 0x970 (0x10)
	int MaxConsecutiveFails; // 0x980 (0x4)
	bool bClearOutpostMapStats; // 0x984 (0x1)
	unsigned char unreflected_985[0xb]; // 0x985 (0xb) 
	struct TArray<struct FFortPlayerEarnedItemCaches> UnsavedPlayerEarnedItemCaches; // 0x990 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.FortWorldManager.OnRep_InitialGlobalWind (Underlying native function: OnRep_InitialGlobalWind 0x89ea924)
	void OnRepInitialGlobalWind(); // (Final | Native | Public)
};

