// Class /Script/FortniteGame.FortMinigame
// Size: 0x1200
class AFortMinigame : public AInfo
{
	unsigned char unreflected_288[0x70]; // 0x288 (0x70) 
	struct TSet<struct FUniqueNetIdRepl> PendingPlayers; // 0x2f8 (0x50)
	unsigned char unreflected_348[0x10]; // 0x348 (0x10) 
	struct FMulticastInlineDelegate StateChangedDelegate; // 0x358 (0x10)
	struct FMulticastInlineDelegate MinigameHideHUDDelegate; // 0x368 (0x10)
	struct FMulticastInlineDelegate StatChangedDelegate; // 0x378 (0x10)
	struct FMulticastInlineDelegate OnPostGameResetUI; // 0x388 (0x10)
	struct FMulticastInlineDelegate FullStatChangedDelegate; // 0x398 (0x10)
	struct FMulticastInlineDelegate OnMinigamePlayerSpawned; // 0x3a8 (0x10)
	struct FMulticastInlineDelegate OnMinigamePlayerOrBotSpawned; // 0x3b8 (0x10)
	struct FMulticastInlineDelegate MinigameEndGameDelegate; // 0x3c8 (0x10)
	struct FMulticastInlineDelegate PlayerAddedDelegate; // 0x3d8 (0x10)
	struct FMulticastInlineDelegate OnPrePlayerJoinInProgress; // 0x3e8 (0x10)
	struct FMulticastInlineDelegate PlayerAddedPostResetDelegate; // 0x3f8 (0x10)
	struct FMulticastInlineDelegate PlayerLastChanceToSave; // 0x408 (0x10)
	struct FMulticastInlineDelegate PlayerPreRemovedDelegate; // 0x418 (0x10)
	struct FMulticastInlineDelegate PlayerRemovedDelegate; // 0x428 (0x10)
	struct FMulticastInlineDelegate PlayerChangedTeamDelegate; // 0x438 (0x10)
	struct FMulticastInlineDelegate OnPlayerClassApplied; // 0x448 (0x10)
	struct FMulticastInlineDelegate OnRefreshIndicatorPlayersCache; // 0x458 (0x10)
	struct FMulticastInlineDelegate OnPlayerClassRemoved; // 0x468 (0x10)
	struct FMulticastInlineDelegate OnPlayerJoinInProgress; // 0x478 (0x10)
	struct FMulticastInlineDelegate OnCreativePlayerIndicatorRulesChanged; // 0x488 (0x10)
	struct FMulticastInlineDelegate OnCreativeBossInfoRulesChanged; // 0x498 (0x10)
	struct FMulticastInlineDelegate MinigameStartedDelegate; // 0x4a8 (0x10)
	struct FMulticastInlineDelegate PostMinigameStartedDelegate; // 0x4b8 (0x10)
	struct FMulticastInlineDelegate MinigameEndedDelegate; // 0x4c8 (0x10)
	unsigned char unreflected_4d8[0x60]; // 0x4d8 (0x60) 
	struct FMulticastInlineDelegate MinigameTeamConfigUpdated; // 0x538 (0x10)
	struct FMulticastInlineDelegate MinigameClassConfigUpdated; // 0x548 (0x10)
	struct FMulticastInlineDelegate OnPawnTeleportedForMinigame; // 0x558 (0x10)
	struct FMulticastInlineDelegate OnUIExtensionsChanged; // 0x568 (0x10)
	struct FMulticastInlineDelegate OnPlayModeChangedDelegate; // 0x578 (0x10)
	struct FMulticastInlineDelegate OnCurrentRoundChangedDelegate; // 0x588 (0x10)
	struct TArray<struct FUIExtension> UIExtensions; // 0x598 (0x10)
	struct FGameplayTagContainer UIExtensionTags; // 0x5a8 (0x20)
	unsigned char unreflected_5c8[0x10]; // 0x5c8 (0x10) 
	float TimeLimit; // 0x5d8 (0x4)
	int CurrentRound; // 0x5dc (0x4)
	int TotalRounds; // 0x5e0 (0x4)
	unsigned char unreflected_5e4[0x4]; // 0x5e4 (0x4) 
	struct FMinigamePlayers PlayerArray; // 0x5e8 (0x120)
	struct FMinigamePlayers InactivePlayerArray; // 0x708 (0x120)
	unsigned char unreflected_828[0x58]; // 0x828 (0x58) 
	struct FMinigamePlayers SpectatingPlayerArray; // 0x880 (0x120)
	struct TArray<struct FMinigameEndCondition> EndConditionArray; // 0x9a0 (0x10)
	bool bRemovePawnOnDeath; // 0x9b0 (0x1)
	unsigned char unreflected_9b1[0x7]; // 0x9b1 (0x7) 
	class UClass* PlayerDeathsStatFilter; // 0x9b8 (0x8)
	unsigned char unreflected_9c0[0x78]; // 0x9c0 (0x78) 
	bool bKeepItemsBetweenRounds; // 0xa38 (0x1)
	unsigned char unreflected_a39[0x3]; // 0xa39 (0x3) 
	float PercentageOfResourcesKeptBetweenRounds; // 0xa3c (0x4)
	bool bReloadAndRestockWeaponsEachRound; // 0xa40 (0x1)
	unsigned char unreflected_a41[0x7]; // 0xa41 (0x7) 
	struct TMap<class UFortWorldItemDefinition*, int> RestockAmmoAmounts; // 0xa48 (0x50)
	int DefaultRestockAmmoAmount; // 0xa98 (0x4)
	bool bLastTeamStandingWins; // 0xa9c (0x1)
	bool bAllowStandardEndGameConditions; // 0xa9d (0x1)
	bool bEndGameOnMatchPointWin; // 0xa9e (0x1)
	bool bIncludePlayersWhoLeftGameInScoreboard; // 0xa9f (0x1)
	unsigned char unreflected_aa0[0x8]; // 0xaa0 (0x8) 
	struct FMulticastInlineDelegate OnPlayerSpawnOverrideDevicesUpdated; // 0xaa8 (0x10)
	unsigned char unreflected_ab8[0x54]; // 0xab8 (0x54) 
	bool bKeepPlayersInStasisOnRoundStart; // 0xb0c (0x1)
	unsigned char unreflected_b0d[0x3]; // 0xb0d (0x3) 
	struct TArray<struct FFireVolumesForMinigame> FireVolumeArray; // 0xb10 (0x10)
	struct TArray<class AActor*> BuildingsWithCurieFXToDestroy; // 0xb20 (0x10)
	struct FMulticastInlineDelegate ServerTimeReplicatedDelegate; // 0xb30 (0x10)
	unsigned char unreflected_b40[0x8]; // 0xb40 (0x8) 
	struct TArray<class AActor*> PlayerSpawnOverrideDevices; // 0xb48 (0x10)
	struct FText DisplayName; // 0xb58 (0x18)
	int AutoStartDelay; // 0xb70 (0x4)
	enum EFortMinigamePlayerSpawnLocationSetting SpawnLocationSetting; // 0xb74 (0x1)
	enum EFortMinigamePostGameSpawnLocationSetting PostGameSpawnLocationSetting; // 0xb75 (0x1)
	enum EFortMinigameSpawnPadSelection SpawnPadSelection; // 0xb76 (0x1)
	unsigned char unreflected_b77[0x1]; // 0xb77 (0x1) 
	float WarmupDuration; // 0xb78 (0x4)
	float PostGameResetDelay; // 0xb7c (0x4)
	float GameWinnerDisplayTime; // 0xb80 (0x4)
	float GameScoreDisplayTime; // 0xb84 (0x4)
	float RoundWinnerDisplayTime; // 0xb88 (0x4)
	float RoundScoreDisplayTime; // 0xb8c (0x4)
	float ServerEndgameDelay; // 0xb90 (0x4)
	bool bTimerCountsDown; // 0xb94 (0x1)
	unsigned char unreflected_b95[0x3]; // 0xb95 (0x3) 
	struct TArray<struct FMinigameTeam> TeamArray; // 0xb98 (0x10)
	struct TArray<struct FMinigameClassSlot> ClassSlotArray; // 0xba8 (0x10)
	struct TArray<struct FFortMinigameStatQuery> BaseEndConditionArray; // 0xbb8 (0x10)
	enum EFortMinigameState CurrentState; // 0xbc8 (0x1)
	bool bRequestPostGameResetUI; // 0xbc9 (0x1)
	enum EFortMinigameState PreviousState; // 0xbca (0x1)
	unsigned char unreflected_bcb[0x5]; // 0xbcb (0x5) 
	class UClass* CompletionTimeStatFilter; // 0xbd0 (0x8)
	class UClass* ScoreStatFilter; // 0xbd8 (0x8)
	class UClass* RaceProgressStatFilter; // 0xbe0 (0x8)
	class UClass* LapTimeStatFilter; // 0xbe8 (0x8)
	class UClass* RaceTimeStatFilter; // 0xbf0 (0x8)
	class UClass* TimeAliveStatFilter; // 0xbf8 (0x8)
	class UClass* RoundWinsStatFilter; // 0xc00 (0x8)
	class UClass* PlayerLivesLeftStatFilter; // 0xc08 (0x8)
	unsigned char DefaultClassSlot; // 0xc10 (0x1)
	enum EFortMinigameClassResetType ClassResetType; // 0xc11 (0x1)
	unsigned char unreflected_c12[0x2]; // 0xc12 (0x2) 
	int MaxLivesForPlayer; // 0xc14 (0x4)
	unsigned char TeamToSwapToWhenOutOfSpawns; // 0xc18 (0x1)
	unsigned char unreflected_c19[0x3]; // 0xc19 (0x3) 
	int AutoEndTeamThreshold; // 0xc1c (0x4)
	struct FFortMinigameTimes ServerTime; // 0xc20 (0x14)
	struct FFortMinigameTimes CachedTime; // 0xc34 (0x14)
	bool bStopwatchMode; // 0xc48 (0x1)
	unsigned char unreflected_c49[0x3]; // 0xc49 (0x3) 
	float LastRoundDuration; // 0xc4c (0x4)
	struct TArray<class UFortMinigameLogicComponent*> MinigameComponents; // 0xc50 (0x10)
	struct TArray<class UFortMinigamePlayerStartComponent*> PlayerStartComponents; // 0xc60 (0x10)
	struct TArray<class UFortMinigamePlayerStartComponent*> CheckpointPlayerStartComponent; // 0xc70 (0x10)
	class UFortCreativeCreatureManagerComponent* CreatureManagerComponent; // 0xc80 (0x8)
	class UFortCreativeTeleporterManagerComponent* TeleporterManagerComponent; // 0xc88 (0x8)
	class UFortAIManagerMinigameComponent* AIManagerComponent; // 0xc90 (0x8)
	class UCreativePlayerHealthInfoComponent* CreativePlayerHealthComponent; // 0xc98 (0x8)
	class AActor* Volume; // 0xca0 (0x8)
	unsigned char unreflected_ca8[0x1]; // 0xca8 (0x1) 
	bool bSortScoreboardEntries; // 0xca9 (0x1)
	bool bTeamMinigame; // 0xcaa (0x1)
	bool bTeamsAreStable; // 0xcab (0x1)
	int NumTeams; // 0xcac (0x4)
	bool bAllowJoinInProgress; // 0xcb0 (0x1)
	enum EMinigamePlayerPersistence PlayerPersistence; // 0xcb1 (0x1)
	unsigned char unreflected_cb2[0x6]; // 0xcb2 (0x6) 
	class AFortPlayerState* MinigameStarter; // 0xcb8 (0x8)
	unsigned char unreflected_cc0[0x4]; // 0xcc0 (0x4) 
	int TeamRotationSetting; // 0xcc4 (0x4)
	int TeamRotationCount; // 0xcc8 (0x4)
	bool bStableTeamCosmetics; // 0xccc (0x1)
	enum EMinigameFullscreenMapWidgetType MinigameMapWidget; // 0xccd (0x1)
	bool bShowMapWidget; // 0xcce (0x1)
	bool bShowScoreboardMapWidget; // 0xccf (0x1)
	struct TWeakObjectPtr<class UClass> ScoreboardMapWidgetClass; // 0xcd0 (0x28)
	unsigned char unreflected_cf8[0x1]; // 0xcf8 (0x1) 
	bool bShowCareerScoreboardMapWidget; // 0xcf9 (0x1)
	unsigned char unreflected_cfa[0x6]; // 0xcfa (0x6) 
	struct TWeakObjectPtr<class UClass> CareerMapWidgetClass; // 0xd00 (0x28)
	unsigned char unreflected_d28[0x1]; // 0xd28 (0x1) 
	bool bShowPreGameCountdownBars; // 0xd29 (0x1)
	enum EMinigameWinCondition WinCondition; // 0xd2a (0x1)
	bool bAllTeamsMustMatchEndConditions; // 0xd2b (0x1)
	bool bOnlyAllowRespawningIfPlayerStartPadsFound; // 0xd2c (0x1)
	enum EMinigameGameEndCallout GameEndCallout; // 0xd2d (0x1)
	unsigned char unreflected_d2e[0x2]; // 0xd2e (0x2) 
	int VictoryAudioIndex; // 0xd30 (0x4)
	int DrawAudioIndex; // 0xd34 (0x4)
	int DefeatAudioIndex; // 0xd38 (0x4)
	bool bShowCumulativeScoreboard; // 0xd3c (0x1)
	unsigned char unreflected_d3d[0x3]; // 0xd3d (0x3) 
	struct FMinigamePostGameSettings PostGameSettings; // 0xd40 (0xb8)
	unsigned char unreflected_df8[0x58]; // 0xdf8 (0x58) 
	struct FGameplayTagContainer ActionsAllowedInStasis; // 0xe50 (0x20)
	unsigned char unreflected_e70[0xcc]; // 0xe70 (0xcc) 
	struct FName MinigameStartCameraBehavior; // 0xf3c (0x4)
	struct FText ClientMinigameStartedText; // 0xf40 (0x18)
	struct FName MinigameEndCameraBehavior; // 0xf58 (0x4)
	unsigned char unreflected_f5c[0x4]; // 0xf5c (0x4) 
	struct FText ClientMinigameEndedText; // 0xf60 (0x18)
	struct TMap<struct FGameplayTag, struct FUIExtension> AllowedUIExtensions; // 0xf78 (0x50)
	unsigned char unreflected_fc8[0x8]; // 0xfc8 (0x8) 
	struct TSet<enum EFortMinigameState> MinigameEditModeStates; // 0xfd0 (0x50)
	unsigned char unreflected_1020[0x8]; // 0x1020 (0x8) 
	struct TSet<struct FUIExtension> AdditionalUIExtensions; // 0x1028 (0x50)
	bool bAllowFriendlyFire; // 0x1078 (0x1)
	bool bForceIndividualScoresInTeamGame; // 0x1079 (0x1)
	bool bVehiclesDamageObjectsMinigame; // 0x107a (0x1)
	bool bVehiclesDamageVehiclesMinigame; // 0x107b (0x1)
	unsigned char unreflected_107c[0x4]; // 0x107c (0x4) 
	struct FMulticastInlineDelegate OnAnyLocalPlayerChangedClass; // 0x1080 (0x10)
	int NumMinigameComponentsServer; // 0x1090 (0x4)
	unsigned char unreflected_1094[0x24]; // 0x1094 (0x24) 
	bool bVolumeNavigationHasBuilt; // 0x10b8 (0x1)
	unsigned char unreflected_10b9[0x7]; // 0x10b9 (0x7) 
	struct TArray<int> RoundWinHistory; // 0x10c0 (0x10)
	struct TArray<struct FMinigamePlayerBucket> PlayerBuckets; // 0x10d0 (0x10)
	struct FGameplayTagContainer OldUIExtensionTags; // 0x10e0 (0x20)
	unsigned char unreflected_1100[0xa0]; // 0x1100 (0xa0) 
	bool bPipHudAdEnabled; // 0x11a0 (0x1)
	unsigned char unreflected_11a1[0x1f]; // 0x11a1 (0x1f) 
	struct TArray<struct FMinigamePlayerPersistentStartPoint> PlayerPersistentStartPoints; // 0x11c0 (0x10)
	int PersistenceRequiredDevices; // 0x11d0 (0x4)
	unsigned char padding_11d4[0x2c]; // 0x11d4 (0x2c)

	/* Functions */

	// Function /Script/FortniteGame.FortMinigame.WasInProgress (Underlying native function: WasInProgress 0x8adfb94)
	bool WasInProgress(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortMinigame.WarmupCountdownEndTimeUpdated (Underlying native function: WarmupCountdownEndTimeUpdated 0x8adfb10)
	void WarmupCountdownEndTimeUpdated(float& NewCountdownEndTime); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortMinigame.UseTeamScoring (Underlying native function: UseTeamScoring 0x8adfaf0)
	bool UseTeamScoring(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortMinigame.UseTeamScore (Underlying native function: UseTeamScore 0x8adfa54)
	bool UseTeamScore(unsigned char& TeamIndex); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

