// Class /Script/FortniteGame.FortNiagaraCameraLensEffectDirectional
// Size: 0x360
class AFortNiagaraCameraLensEffectDirectional : public ANiagaraLensEffectBase
{
	unsigned char unreflected_320[0x8]; // 0x320 (0x8) 
	class AActor* DamageDealer; // 0x328 (0x8)
	struct FVector DamageDealerLocation; // 0x330 (0x18)
	struct FName RotationParameterName; // 0x348 (0x4)
	unsigned char bRotateActor; // 0x34c (0x1)
	unsigned char unreflected_34d[0x3]; // 0x34d (0x3) 
	float Strength; // 0x350 (0x4)
	unsigned char padding_354[0xc]; // 0x354 (0xc)
};

