// Class /Script/ValetRuntime.FortValetAudioController
// Size: 0x3d8
class AFortValetAudioController : public AActor
{
	struct FMulticastInlineDelegate OnEngineLoadChanged; // 0x288 (0x10)
	struct FMulticastInlineDelegate OnShiftGearCompleted; // 0x298 (0x10)
	struct FMulticastInlineDelegate OnShiftGearDelegate; // 0x2a8 (0x10)
	float RPMResetTimeNative; // 0x2b8 (0x4)
	float JitterAmountNative; // 0x2bc (0x4)
	float ShiftTimeThresholdNative; // 0x2c0 (0x4)
	float TimeSinceShiftNative; // 0x2c4 (0x4)
	float EngineRPMInterpNative; // 0x2c8 (0x4)
	float EngineRPMLinearNative; // 0x2cc (0x4)
	float MinRPMRangeNative; // 0x2d0 (0x4)
	float MaxRPMRangeNative; // 0x2d4 (0x4)
	bool bCurrentlyShiftingNative; // 0x2d8 (0x1)
	unsigned char unreflected_2d9[0x3]; // 0x2d9 (0x3) 
	float CurrentAccelRateGearModifierNative; // 0x2dc (0x4)
	float CurrentAccelRateNative; // 0x2e0 (0x4)
	int CurrentGearNative; // 0x2e4 (0x4)
	int MaxGearNative; // 0x2e8 (0x4)
	float DefaultAccelRateScalarNative; // 0x2ec (0x4)
	float GearAttackInterpSpeedNative; // 0x2f0 (0x4)
	float GearReleaseInterpSpeedNative; // 0x2f4 (0x4)
	float AccelRateScalarFirstGearNative; // 0x2f8 (0x4)
	float AccelRateScalarMinGearNative; // 0x2fc (0x4)
	float AccelRateScalarMaxGearNative; // 0x300 (0x4)
	float ShiftToRPMStartNative; // 0x304 (0x4)
	float ShiftToRPMEndNative; // 0x308 (0x4)
	float ShiftFromRPMStartNative; // 0x30c (0x4)
	float ShiftFromRPMEndNative; // 0x310 (0x4)
	float MaxRPMSawtoothDecrementNative; // 0x314 (0x4)
	float MaxRPMSawtoothRepeatTimeNative; // 0x318 (0x4)
	float DownhillAccelScalarNative; // 0x31c (0x4)
	float UphillAccelScalarNative; // 0x320 (0x4)
	unsigned char unreflected_324[0x4]; // 0x324 (0x4) 
	class UCurveFloat* RPMFloatCurveMapping; // 0x328 (0x8)
	float NormalizedSpeedNative; // 0x330 (0x4)
	float SuspValueNative; // 0x334 (0x4)
	bool bIsHandbrakingNative; // 0x338 (0x1)
	unsigned char unreflected_339[0x3]; // 0x339 (0x3) 
	float MotoSynthVolumeNative; // 0x33c (0x4)
	float MotoSynthInitialFadeInTimeNative; // 0x340 (0x4)
	unsigned char unreflected_344[0x4]; // 0x344 (0x4) 
	float MotoSynthLogRPMNative; // 0x348 (0x4)
	bool bHasFuelNative; // 0x34c (0x1)
	bool bIsInWaterNative; // 0x34d (0x1)
	bool bLocalPlayerInVehicleNative; // 0x34e (0x1)
	unsigned char unreflected_34f[0x1]; // 0x34f (0x1) 
	float TimeLocalPlayerEnteredVehicleNative; // 0x350 (0x4)
	bool bAttemptingDirectionChangeNative; // 0x354 (0x1)
	bool bPreDestroyNative; // 0x355 (0x1)
	bool bEngineLoadNative; // 0x356 (0x1)
	unsigned char unreflected_357[0x1]; // 0x357 (0x1) 
	float SkidAmountNative; // 0x358 (0x4)
	float TimeSinceAwokenNative; // 0x35c (0x4)
	bool bDestroyedNative; // 0x360 (0x1)
	unsigned char unreflected_361[0x3]; // 0x361 (0x3) 
	float TimeSinceSurfaceChangeNative; // 0x364 (0x4)
	class USoundBase* OnInitialSuspensionSound; // 0x368 (0x8)
	float AngleForSkiddingNative; // 0x370 (0x4)
	float SpringCompressionMultiplier; // 0x374 (0x4)
	float MotoSynthMaxVolumeNative; // 0x378 (0x4)
	unsigned char unreflected_37c[0x4]; // 0x37c (0x4) 
	struct FVector2D MotoSynthTimeInVehicleTimeRange; // 0x380 (0x10)
	struct FVector2D MotoSynthTimeInVehicleVolumeRange; // 0x390 (0x10)
	struct TWeakObjectPtr<class AFortDagwoodVehicle> ValetVehicle; // 0x3a0 (0x8)
	class UFortLayeredAudioComponent* EngineNative; // 0x3a8 (0x8)
	class UAudioComponent* BoostAudioComponentNative; // 0x3b0 (0x8)
	class USynthComponentMoto* SynthComponentMotoNative; // 0x3b8 (0x8)
	class UFortCollisionAudioComponent* SuspensionCollisionComponentNative; // 0x3c0 (0x8)
	unsigned char padding_3c8[0x10]; // 0x3c8 (0x10)

	/* Functions */

	// Function /Script/ValetRuntime.FortValetAudioController.Update_Native (Underlying native function: Update_Native 0x145f79c)
	void UpdateNative(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/ValetRuntime.FortValetAudioController.OnTireModApplied (Has no native function)
	void OnTireModApplied(struct FTireInfo& AppliedTireMod); // (Event | Public | HasOutParms | BlueprintEvent)

	// Function /Script/ValetRuntime.FortValetAudioController.OnSuspensionCollision_Native (Underlying native function: OnSuspensionCollision_Native 0x1ebf6ac)
	void OnSuspensionCollisionNative(bool& outResult, float& OutMagnitude); // (Final | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/ValetRuntime.FortValetAudioController.CacheValetVehicle (Underlying native function: CacheValetVehicle 0x26eec20)
	void CacheValetVehicle(class AFortDagwoodVehicle*& InVehicle); // (Final | Native | Public | BlueprintCallable)
};

