// Class /Script/FortniteGame.FortMission
// Size: 0x6e0
class AFortMission : public AFortMissionState
{
	unsigned char unreflected_2c0[0x10]; // 0x2c0 (0x10) 
	class UFortMissionInfo* MissionInfo; // 0x2d0 (0x8)
	class UClass* BotLogicClass; // 0x2d8 (0x8)
	class UFortBotMissionLogic* BotLogic; // 0x2e0 (0x8)
	struct TArray<struct TWeakObjectPtr<class UFortItemDefinition>> MissionPreloadAssets; // 0x2e8 (0x10)
	class UClass* AnnouncementClassOverride; // 0x2f8 (0x8)
	class UFortMissionGenerator* MissionGenerator; // 0x300 (0x8)
	struct TEnumAsByte<EMissionGenerationCategory> MissionCategory; // 0x308 (0x1)
	unsigned char unreflected_309[0x3]; // 0x309 (0x3) 
	int UIIndex; // 0x30c (0x4)
	struct FUniqueNetIdRepl QuestOwnerAccount; // 0x310 (0x30)
	struct TArray<struct FFortMissionEventName*> MissionEventNames; // 0x340 (0x10)
	unsigned char unreflected_350[0x18]; // 0x350 (0x18) 
	struct FMulticastInlineDelegate OnObjectivesUpdated; // 0x368 (0x10)
	struct FMulticastInlineDelegate OnMissionInfoSet; // 0x378 (0x10)
	struct TArray<struct FFortMissionPlacementActorPreferredTagInfo> PlacementActorPreferredTagData; // 0x388 (0x10)
	bool bLoadedFromRecord; // 0x398 (0x1)
	bool bFiredParTimeEvent; // 0x399 (0x1)
	bool bAreNonpublicMatchesLeecherExempt; // 0x39a (0x1)
	unsigned char unreflected_39b[0x1]; // 0x39b (0x1) 
	float LeecherPity; // 0x39c (0x4)
	float LeecherMinMultiplier; // 0x3a0 (0x4)
	float LeecherCutoff; // 0x3a4 (0x4)
	float LeecherTimeScalingCutoff; // 0x3a8 (0x4)
	float LeecherTimeScalingPenaltyMultipler; // 0x3ac (0x4)
	float LeecherCombatScoreMultiplier; // 0x3b0 (0x4)
	float LeecherBuildingScoreMultiplier; // 0x3b4 (0x4)
	float LeecherUtilityScoreMultiplier; // 0x3b8 (0x4)
	int LeecherCombatLowBar; // 0x3bc (0x4)
	int LeecherBuildingLowBar; // 0x3c0 (0x4)
	int LeecherUtilityLowBar; // 0x3c4 (0x4)
	float MissionActivationTime; // 0x3c8 (0x4)
	unsigned char unreflected_3cc[0x4]; // 0x3cc (0x4) 
	struct FFortMissionFocusDisplayData CurrentFocusData; // 0x3d0 (0x20)
	bool bSilentDestroyNextFrame; // 0x3f0 (0x1)
	unsigned char unreflected_3f1[0x7]; // 0x3f1 (0x7) 
	struct TArray<class AFortObjectiveBase*> ActiveObjectives; // 0x3f8 (0x10)
	struct TArray<struct FUniqueNetIdRepl> ParticipatingAccounts; // 0x408 (0x10)
	struct TArray<struct FUniqueNetIdRepl> ParticipatingButDisconnectedAccounts; // 0x418 (0x10)
	enum EFortMissionStatus MissionStatus; // 0x428 (0x1)
	unsigned char unreflected_429[0x7]; // 0x429 (0x7) 
	struct FGameplayTagContainer MissionCompletionTags; // 0x430 (0x20)
	bool bIsMissionVisible; // 0x450 (0x1)
	enum EFortMissionAudibility MissionAudibility; // 0x451 (0x1)
	unsigned char unreflected_452[0x2]; // 0x452 (0x2) 
	int CurrentObjectiveBlockIndex; // 0x454 (0x4)
	bool bIsMissionVisibleOverride; // 0x458 (0x1)
	unsigned char unreflected_459[0x3]; // 0x459 (0x3) 
	struct FGuid MissionGuid; // 0x45c (0x10)
	int StartingDay; // 0x46c (0x4)
	class UFortMissionTimerComponent* TimerComponent; // 0x470 (0x8)
	class UFortMissionTimerComponent* TimerElapsedComponent; // 0x478 (0x8)
	bool bObjectiveTimerExpireShouldFailObjectives; // 0x480 (0x1)
	bool bMissionTimerExpireShouldFailMission; // 0x481 (0x1)
	unsigned char unreflected_482[0x1]; // 0x482 (0x1) 
	bool bNeedsEnemyKilledEventForAllPawns; // 0x483 (0x1)
	int ChosenRewardIdx; // 0x484 (0x4)
	struct FFortBadgeCountArray PotentialBadgesArray; // 0x488 (0x118)
	unsigned char unreflected_5a0[0xb8]; // 0x5a0 (0xb8) 
	struct FFortGeneratedDifficultyOptions GeneratedMissionOptions; // 0x658 (0x40)
	class UAudioComponent* MissionCompletionStinger; // 0x698 (0x8)
	struct FFortMissionInstancedConfigData ConfigData; // 0x6a0 (0x10)
	unsigned char padding_6b0[0x30]; // 0x6b0 (0x30)

	/* Functions */

	// Function /Script/FortniteGame.FortMission.StopMissionAIEncounter (Underlying native function: StopMissionAIEncounter 0x8b10478)
	void StopMissionAIEncounter(class UFortAIEncounterInfo*& EncounterToStop); // (Final | BlueprintAuthorityOnly | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortMission.StopEncounterSequence (Underlying native function: StopEncounterSequence 0x8b103fc)
	void StopEncounterSequence(class UFortAIEncounterSequence*& SequenceToStop); // (Final | BlueprintAuthorityOnly | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortMission.StartMissionAIEncounterFromGeneratedProfile (Underlying native function: StartMissionAIEncounterFromGeneratedProfile 0x8b0fe1c)
