// Class /Script/FortniteGame.FortAthenaVehicle
// Size: 0x1950
class AFortAthenaVehicle : public AFortPhysicsPawn
{
	unsigned char unreflected_480[0x68]; // 0x480 (0x68) 
	struct FPredictionReplicationProxy_AP NetPredictionProxyAP; // 0x4e8 (0x18)
	struct FPredictionReplicationProxy_SP NetPredictionProxySP; // 0x500 (0x18)
	struct TWeakObjectPtr<class UAthenaItemWrapDefinition> SoftOverrideItemWrap; // 0x518 (0x28)
	class UAthenaItemWrapDefinition* OverrideItemWrap; // 0x540 (0x8)
	struct FMulticastInlineDelegate OnSpringCompressionDelegate; // 0x548 (0x10)
	struct TSet<class AFortPlayerPawnAthena*> PlayersBasedOnVehicle; // 0x558 (0x50)
	unsigned char unreflected_5a8[0x20]; // 0x5a8 (0x20) 
	struct FMulticastInlineDelegate OnSleepStateChangedDelegate; // 0x5c8 (0x10)
	struct FWaterSurfaceInfo WaterSurfaceDataCache; // 0x5d8 (0x68)
	unsigned char unreflected_640[0x10]; // 0x640 (0x10) 
	struct TWeakObjectPtr<class AController> LastDamageInstigator; // 0x650 (0x8)
	struct TWeakObjectPtr<class AController> LastOutOfHealthInstigator; // 0x658 (0x8)
	struct TWeakObjectPtr<class AActor> LastOutOfHealthDamageCauser; // 0x660 (0x8)
	class USplineComponent* BoundsXYSplineComponent; // 0x668 (0x8)
	class USkeletalMeshComponentBudgeted* SkeletalMesh; // 0x670 (0x8)
	unsigned char unreflected_678[0x28]; // 0x678 (0x28) 
	int CustomDepthStencilValue; // 0x6a0 (0x4)
	int CustomDepthStencilValueForHighlightedVehicle; // 0x6a4 (0x4)
	unsigned char SquadId; // 0x6a8 (0x1)
	unsigned char TeamId; // 0x6a9 (0x1)
	struct TEnumAsByte<EVehicleInitialOverlapBehavior> InitialOverlapBehavior; // 0x6aa (0x1)
	unsigned char bDisableUpdateForcedDebugInput; // 0x6ab (0x1)
	unsigned char bDisableUpdateAutoRun; // 0x6ab (0x1)
	unsigned char bDisableUpdateHonk; // 0x6ab (0x1)
	unsigned char bDisableUpdateIgnoredBuildingActors; // 0x6ab (0x1)
	unsigned char bDisableUpdateIngoredPawnsForDamage; // 0x6ab (0x1)
	unsigned char bDisableUpdateSafeTeleport; // 0x6ab (0x1)
	unsigned char bUseForceHeading; // 0x6ab (0x1)
	unsigned char bDestroyOnLastExit; // 0x6ac (0x1)
	unsigned char bShowDamageNumbers; // 0x6ac (0x1)
	unsigned char bShowDamageNumbersAtImpactLocation; // 0x6ac (0x1)
	unsigned char bPlayDamageAudio; // 0x6ac (0x1)
	unsigned char bShowVehicleHealthBarOnPlayerHUD; // 0x6ac (0x1)
	unsigned char bDestroyBuildingSMActorOnForceExit; // 0x6ac (0x1)
	unsigned char bIgnoreAllFallingDamage; // 0x6ac (0x1)
	unsigned char bIgnoreNextFallingDamage; // 0x6ac (0x1)
	unsigned char bShouldClearFallDamageImmunityForPawnsOnExit; // 0x6ad (0x1)
	unsigned char bIsBraking; // 0x6ad (0x1)
	unsigned char bPlayedDying; // 0x6ad (0x1)
	unsigned char bForceDeath; // 0x6ad (0x1)
	unsigned char bPlayInstantDeathEffects; // 0x6ad (0x1)
	unsigned char bHasDriver; // 0x6ad (0x1)
	unsigned char bHasPassengers; // 0x6ad (0x1)
	unsigned char bCanSleepWhileNotTouchingAnything; // 0x6ad (0x1)
	unsigned char bIsTouchingAnything; // 0x6ae (0x1)
	unsigned char bIsInWater; // 0x6ae (0x1)
	unsigned char bIsInWaterBody; // 0x6ae (0x1)
	unsigned char bIsOverlappingWaterBody; // 0x6ae (0x1)
	unsigned char bIsFullyInWaterBody; // 0x6ae (0x1)
	unsigned char bCanDriveOnIncline; // 0x6ae (0x1)
	unsigned char bCanCoastOnIncline; // 0x6ae (0x1)
	unsigned char bWheelsOnGround; // 0x6ae (0x1)
	unsigned char bAnyWheelsOnGround; // 0x6af (0x1)
	unsigned char bIsTouchingDrivableGround; // 0x6af (0x1)
	unsigned char bIsTouchingGroundWithoutWheels; // 0x6af (0x1)
	unsigned char bPossiblyTouchingTop; // 0x6af (0x1)
	unsigned char unreflected_6b0[0x2]; // 0x6b0 (0x2) 
	unsigned char bUseGravity; // 0x6b2 (0x1)
	unsigned char bAllowInteractBetweenFortVolumes; // 0x6b2 (0x1)
	unsigned char bCanPassengerPawnsTakeDamage; // 0x6b2 (0x1)
	unsigned char bServerIsInUndergroundVolume; // 0x6b3 (0x1)
	unsigned char bEnableCurieMaterial; // 0x6b3 (0x1)
	unsigned char bEnforceTeamRestrictionForMiniGame; // 0x6b3 (0x1)
	unsigned char bEnforceMinigameClassRestriction; // 0x6b3 (0x1)
	unsigned char bUseCustomDepthStencilValue; // 0x6b3 (0x1)
	unsigned char bStencilEnabled; // 0x6b3 (0x1)
	unsigned char bCachedSquadRestrictionEnabled; // 0x6b3 (0x1)
	unsigned char bEnforceTeamRestriction; // 0x6b4 (0x1)
	unsigned char unreflected_6b5[0x3]; // 0x6b5 (0x3) 
	int MinigameClassID; // 0x6b8 (0x4)
	unsigned char unreflected_6bc[0x4]; // 0x6bc (0x4) 
	struct FMulticastInlineDelegate OnPawnEnteredVehicleAtSeat; // 0x6c0 (0x10)
	struct FMulticastInlineDelegate OnPawnEnteredVehicleSeat; // 0x6d0 (0x10)
	struct FMulticastInlineDelegate OnPawnExitedVehicleSeat; // 0x6e0 (0x10)
	struct FMulticastInlineDelegate OnPawnExitedVehicleFromSeat; // 0x6f0 (0x10)
	struct FMulticastInlineDelegate OnPawnFinishEnteringVehicle; // 0x700 (0x10)
	struct FMulticastInlineDelegate OnVehicleHornEvent; // 0x710 (0x10)
	struct FMulticastInlineDelegate OnVehicleOwnerChanged; // 0x720 (0x10)
	unsigned char bWaitingForSleep; // 0x730 (0x1)
	unsigned char bAttemptAsyncOrientationCorrection; // 0x730 (0x1)
	unsigned char bIsAsyncCorrectingOrientation; // 0x730 (0x1)
	unsigned char bAlwaysCreateNavComponent; // 0x731 (0x1)
	unsigned char bAllowInteractBetweenFortVolumesRuntime; // 0x731 (0x1)
	unsigned char bTricksEnabled; // 0x731 (0x1)
	unsigned char unreflected_732[0x6]; // 0x732 (0x6) 
	float FireDamageTickTimer; // 0x738 (0x4)
	float CurrentFOV; // 0x73c (0x4)
	struct FGameplayTagContainer FireEnvDamageTags; // 0x740 (0x20)
	struct FGameplayTagContainer PawnIgnoreBumpTags; // 0x760 (0x20)
	class USlateBrushAsset* DriverReticleBrush; // 0x780 (0x8)
	struct FGameplayTagContainer AppliedVehicleModTags; // 0x788 (0x20)
	class UFortVehicleModCollectedData* CollectedVehicleModData; // 0x7a8 (0x8)
	unsigned char unreflected_7b0[0x4]; // 0x7b0 (0x4) 
	float WaterEffectsVehicleMaxSpeedKmh; // 0x7b4 (0x4)
	class UNiagaraSystem* WaterEffectsAsset; // 0x7b8 (0x8)
	class UNiagaraComponent* WaterEffectsComponent; // 0x7c0 (0x8)
	unsigned char unreflected_7c8[0x8]; // 0x7c8 (0x8) 
	struct FGameplayTagContainer GameplayTags; // 0x7d0 (0x20)
	struct TSet<struct FIgnoredPawn> PawnsToIgnoreForDamge; // 0x7f0 (0x50)
	struct TArray<class AFortPawn*> PawnsToIgnoreForCollision; // 0x840 (0x10)
	struct TArray<class AFortPawn*> IgnoredPawnsPendingTeleport; // 0x850 (0x10)
	float LastPropImpactImpulseTime; // 0x860 (0x4)
	unsigned char unreflected_864[0x4]; // 0x864 (0x4) 
	struct TArray<struct FPredictedDestroyedBuilding> PredictedDestroyedBuildings; // 0x868 (0x10)
	struct TArray<class UBuildingEditModeMetadata*> WallsVehicleCanDestroy; // 0x878 (0x10)
	struct TArray<class UBuildingEditModeMetadata*> WallsVehicleCannotDestroyWhenBoosting; // 0x888 (0x10)
	struct TArray<class UClass*> BuildingPropClassesVehicleCanDestroy; // 0x898 (0x10)
	struct TArray<class UClass*> BuildingPropClassesVehicleCannotDestroyWhenBoosting; // 0x8a8 (0x10)
	struct TArray<struct TScriptInterface<class IVehicleSeatInputHookProvider>> SeatInputProviders; // 0x8b8 (0x10)
	struct FFortAthenaVehicleInputState EmptyDriverInputState; // 0x8c8 (0x40)
	struct FVector AverageSpringNormal; // 0x908 (0x18)
	float TopSpeedCurrentMultiplier; // 0x920 (0x4)
	float PushForceCurrentMultiplier; // 0x924 (0x4)
	struct FVector2D LastStickInput; // 0x928 (0x10)
	unsigned char unreflected_938[0x10]; // 0x938 (0x10) 
	float SteeringAngle; // 0x948 (0x4)
	unsigned char unreflected_94c[0x24]; // 0x94c (0x24) 
	float FrontLateralFrictionRuntimeMultiplier; // 0x970 (0x4)
	float RearLateralFrictionRuntimeMultiplier; // 0x974 (0x4)
	struct FVector LocalRearFrictionPt; // 0x978 (0x18)
	struct FVector LocalFrontFrictionPt; // 0x990 (0x18)
	float FrontMassRatio; // 0x9a8 (0x4)
	float RearMassRatio; // 0x9ac (0x4)
	unsigned char unreflected_9b0[0x20]; // 0x9b0 (0x20) 
	float TotalBrakingDelta; // 0x9d0 (0x4)
	unsigned char unreflected_9d4[0x69]; // 0x9d4 (0x69) 
	struct TEnumAsByte<EPhysicalSurface> PrimarySurfaceType; // 0xa3d (0x1)
	struct TEnumAsByte<EFortBaseWeaponDamage> WeaponResponseType; // 0xa3e (0x1)
	unsigned char VTDMode; // 0xa3f (0x1)
	unsigned char unreflected_a40[0x3]; // 0xa40 (0x3) 
	struct TEnumAsByte<EPhysicalSurface> SurfaceTypeVehicleOn; // 0xa43 (0x1)
	unsigned char unreflected_a44[0x14]; // 0xa44 (0x14) 
	int ForcedMaterialVariantIndex; // 0xa58 (0x4)
	unsigned char unreflected_a5c[0x4]; // 0xa5c (0x4) 
	struct FFortRechargingActionTimer FuelCharge; // 0xa60 (0xd8)
	struct FMulticastInlineDelegate OnRechargeableFuelAboveThreshold; // 0xb38 (0x10)
	struct FMulticastInlineDelegate OnRechargeableFuelBelowThreshold; // 0xb48 (0x10)
	struct FMulticastInlineDelegate OnOutOfRechargeableFuel; // 0xb58 (0x10)
	struct FMulticastInlineDelegate OnNotOutOfRechargeableFuel; // 0xb68 (0x10)
	struct FMulticastInlineDelegate OnMountedWeaponFiredEvent; // 0xb78 (0x10)
	unsigned char unreflected_b88[0x4]; // 0xb88 (0x4) 
	float SeatSwitchCooldown; // 0xb8c (0x4)
	struct FGameplayTagContainer VehicleTags; // 0xb90 (0x20)
	struct TArray<struct FVehicleSpringInfo> Springs; // 0xbb0 (0x10)
	struct FSpringGroundTriangle GroundTriangle; // 0xbc0 (0xc)
	unsigned char unreflected_bcc[0x4]; // 0xbcc (0x4) 
	struct TArray<struct FSMVehicleGear> Gears; // 0xbd0 (0x10)
	struct TArray<struct FSMVehicleGear> SprintGears; // 0xbe0 (0x10)
	struct TArray<struct FSMVehicleGear> ReverseGears; // 0xbf0 (0x10)
	float ForwardDrivingAntiGravityScaler; // 0xc00 (0x4)
	float CameraSpaceForwardDistanceOffset; // 0xc04 (0x4)
	unsigned char unreflected_c08[0x4]; // 0xc08 (0x4) 
	float CameraAssistStrength; // 0xc0c (0x4)
	float CameraAssistRampUp; // 0xc10 (0x4)
	bool bAllowAutoCamera; // 0xc14 (0x1)
	unsigned char unreflected_c15[0x3]; // 0xc15 (0x3) 
	float TimeToAutoCamera; // 0xc18 (0x4)
	float MinSpeedForAutoCamera; // 0xc1c (0x4)
	float CameraAssistBaseHeight; // 0xc20 (0x4)
	float CameraAssistUpHillScaler; // 0xc24 (0x4)
	float CameraAssistSteerScaler; // 0xc28 (0x4)
	float CameraAssistForwardScale; // 0xc2c (0x4)
	float AngleDegreesThresholdFromCurrentCameraToTarget; // 0xc30 (0x4)
	float CameraFOVOffset; // 0xc34 (0x4)
	class UClass* TetheredCamera; // 0xc38 (0x8)
	unsigned char unreflected_c40[0x30]; // 0xc40 (0x30) 
	class UClass* PlayerCollisionGameplayEffect; // 0xc70 (0x8)
	class UPrimitiveComponent* OverlapComponent; // 0xc78 (0x8)
	class UPrimitiveComponent* WaterOverlapComponent; // 0xc80 (0x8)
	unsigned char unreflected_c88[0x4]; // 0xc88 (0x4) 
	float WaterLevel; // 0xc8c (0x4)
	int WaterOverlapCount; // 0xc90 (0x4)
	float VehicleMinHorSpeedToDamage; // 0xc94 (0x4)
	float VehicleMaxHorSpeedToDamage; // 0xc98 (0x4)
	float VehicleMinHorSpeedDamage; // 0xc9c (0x4)
	float VehicleMaxHorSpeedDamage; // 0xca0 (0x4)
	float TargetingZOffset; // 0xca4 (0x4)
	float BrakeAboveTopSpeedDelta; // 0xca8 (0x4)
	float TimeToIdleBrake; // 0xcac (0x4)
	float DragCoefficient; // 0xcb0 (0x4)
	float PrimaryCameraPitchConstraint; // 0xcb4 (0x4)
	float PrimaryCameraYawConstraint; // 0xcb8 (0x4)
	float CachedSpeed; // 0xcbc (0x4)
	struct FName MainBodyCollision; // 0xcc0 (0x4)
	unsigned char unreflected_cc4[0x4]; // 0xcc4 (0x4) 
	struct FVector TestInitialLinearVelocity; // 0xcc8 (0x18)
	struct FVector TestInitialAngularVelocity; // 0xce0 (0x18)
	struct FHitResult LookAheadHit; // 0xcf8 (0xe0)
	class UFortVehicleTrickSet* TrickSet; // 0xdd8 (0x8)
	struct FName PushForceSocket; // 0xde0 (0x4)
	struct FName FrontWheelsSocket; // 0xde4 (0x4)
	struct FName RearWheelSockets; // 0xde8 (0x4)
	unsigned char unreflected_dec[0x4]; // 0xdec (0x4) 
	class UWeaponHitNotifyAudioBank* DefaultHitNotifyAudioBank; // 0xdf0 (0x8)
	struct FMulticastInlineDelegate OnHandleOutOfHealthDelegate; // 0xdf8 (0x10)
	struct FMulticastInlineDelegate OnHealthChanged; // 0xe08 (0x10)
	unsigned char unreflected_e18[0x18]; // 0xe18 (0x18) 
	struct FMulticastInlineDelegate OnDamageablePartHealthChanged; // 0xe30 (0x10)
	struct FName BulletCollisionComponentTag; // 0xe40 (0x4)
	unsigned char unreflected_e44[0x4]; // 0xe44 (0x4) 
	class UClass* GEDamagePassengersOnDeath; // 0xe48 (0x8)
	struct FMulticastInlineDelegate OnVehicleSquadChanged; // 0xe50 (0x10)
	float LifespanAfterDeath; // 0xe60 (0x4)
	float LastDamagedTime; // 0xe64 (0x4)
	struct TArray<struct FSeatTransitionMontage> SeatTransitions; // 0xe68 (0x10)
	unsigned char unreflected_e78[0x30]; // 0xe78 (0x30) 
	struct FMulticastInlineDelegate OnVehicleEnteredWaterBody; // 0xea8 (0x10)
	struct FMulticastInlineDelegate OnVehicleExitedWaterBody; // 0xeb8 (0x10)
	struct FVehicleRuntimeModifiers RuntimeModifiedProperties; // 0xec8 (0x18)
	struct TArray<class ABuildingActor*> LocallyIgnoredBuildingActors; // 0xee0 (0x10)
	struct FVector PreviousBuildingQueryPosition; // 0xef0 (0x18)
	float ImpulseResponseMultiplier; // 0xf08 (0x4)
	float ImpulseResponseZBias; // 0xf0c (0x4)
	unsigned char unreflected_f10[0x28]; // 0xf10 (0x28) 
	struct FTimerHandle* WaterSubmergedTimerHandle; // 0xf38 (0x8)
	unsigned char unreflected_f40[0x20]; // 0xf40 (0x20) 
	class USoundEffectSourcePresetChain* EmoteAudioSourcePresetChain; // 0xf60 (0x8)
	class USoundAttenuation* EmoteAudioAttenuation; // 0xf68 (0x8)
	struct FMarkedActorDisplayInfo MarkerDisplay; // 0xf70 (0x98)
	struct FMulticastInlineDelegate OnSurfaceTypeVehicleIsOnChangedDelegate; // 0x1008 (0x10)
	class UFortAbilitySet* StartupAbilitySet; // 0x1018 (0x8)
	class UFortVehicleSeatComponent* VehicleSeatComponent; // 0x1020 (0x8)
	class UFortVehicleInteractionOverrideComponent* VehicleInteractionOverrideComponent; // 0x1028 (0x8)
	class UFortSkyTubePhysicsComponent* SkyTubePhysicsComponent; // 0x1030 (0x8)
	class UFortVehiclePontoonsComponent* PontoonsComponent; // 0x1038 (0x8)
	class UFortAthenaTrackableAIObjectComponent* TrackableAIObjectComponent; // 0x1040 (0x8)
	struct TArray<struct FAthenaCarPlayerSlot> PlayerSlots; // 0x1048 (0x10)
	struct TArray<struct FAthenaCarPlayerSlot> PlayerSlotsBackup; // 0x1058 (0x10)
	struct TArray<struct FAthenaCarPlayerSlotUnreplicated*> PlayerSlotsUnreplicated; // 0x1068 (0x10)
	class UFortVehicleMovementSet* VehicleMovementSet; // 0x1078 (0x8)
	struct FReplicatedAthenaVehicleAttributes VehicleAttributes; // 0x1080 (0x20)
	class UFortVehiclePhysicsCollisionDamageComponent* CachedVehiclePhysicsCollisionDamageComponent; // 0x10a0 (0x8)
	class UFortVehicleFuelComponent* CachedFuelComponent; // 0x10a8 (0x8)
	struct TArray<struct FText> ReasonsWhyCantContainPlayers; // 0x10b0 (0x10)
	struct TArray<class ABuildingActor*> IgnoredBuildingActors; // 0x10c0 (0x10)
	struct TArray<struct FVehicleDamageablePart> DamageableParts; // 0x10d0 (0x10)
	struct TArray<struct FVehicleToggleablePart*> ToggledParts; // 0x10e0 (0x10)
	unsigned char unreflected_10f0[0x268]; // 0x10f0 (0x268) 
	struct FVehicleTargetOrientation CorrectTargetOrientation; // 0x1358 (0x48)
	class UClass* CameraModeClass; // 0x13a0 (0x8)
	class UClass* DrivingAnimClass; // 0x13a8 (0x8)
	class UClass* DriverAnimLayerOverlayClass; // 0x13b0 (0x8)
	class UClass* PassengerAnimLayerOverlayClass; // 0x13b8 (0x8)
	class UFortVehicleAnimSet* AnimSet; // 0x13c0 (0x8)
	unsigned char unreflected_13c8[0x138]; // 0x13c8 (0x138) 
	struct FFortAttributeInitializationKey* AttributeInitKey; // 0x1500 (0x8)
	class UFortAbilitySystemComponent* AbilitySystemComponent; // 0x1508 (0x8)
	class UFortHealthSet* HealthSet; // 0x1510 (0x8)
	class UFortAthenaImpulseResponseSet* ImpulseResponseSet; // 0x1518 (0x8)
	class UFortDamageSet* DamageSet; // 0x1520 (0x8)
	class UFortHealthBarIndicator* HealthBarIndicator; // 0x1528 (0x8)
	struct FVehicleCosmeticInfo VehicleCosmeticInfo; // 0x1530 (0x38)
	unsigned char unreflected_1568[0x18]; // 0x1568 (0x18) 
	class UFortVehicleNavModifierComponent* NavModifierComponent; // 0x1580 (0x8)
	bool bShouldSleepAtSpawn; // 0x1588 (0x1)
	bool bSpawnedSleepLockActive; // 0x1589 (0x1)
	unsigned char unreflected_158a[0x2]; // 0x158a (0x2) 
	uint32_t ForceKinematicOnClientCount; // 0x158c (0x4)
	class AActor* ImpactInstigator; // 0x1590 (0x8)
	unsigned char unreflected_1598[0x58]; // 0x1598 (0x58) 
	float NormalizedRPM; // 0x15f0 (0x4)
	unsigned char unreflected_15f4[0x4]; // 0x15f4 (0x4) 
	struct TArray<struct FVehicleSpecificUIDetails> CustomUI; // 0x15f8 (0x10)
	struct TArray<struct FActiveVehicleUI> ActiveCustomUI; // 0x1608 (0x10)
	struct TArray<struct FVehicleSpecificUIDetails> MobileCustomUI; // 0x1618 (0x10)
	unsigned char unreflected_1628[0x8]; // 0x1628 (0x8) 
	struct FMulticastInlineDelegate OnModAppliedOnClientDelegate; // 0x1630 (0x10)
	struct FGameplayTag AlwaysDamageVehiclesWithTag; // 0x1640 (0x4)
	unsigned char unreflected_1644[0x4]; // 0x1644 (0x4) 
	struct FTireInfo BaseTireInfo; // 0x1648 (0x1d0)
	class UPrimitiveComponent* CurrentOverlapComponent; // 0x1818 (0x8)
	class UClass* VehicleConfigsClass; // 0x1820 (0x8)
	class UFortPhysicsVehicleConfigs* FortPhysicsVehicleConfigs; // 0x1828 (0x8)
	unsigned char unreflected_1830[0x4]; // 0x1830 (0x4) 
	bool bBoosting; // 0x1834 (0x1)
	unsigned char unreflected_1835[0x3]; // 0x1835 (0x3) 
	float BoostEndTime; // 0x1838 (0x4)
	unsigned char unreflected_183c[0x4]; // 0x183c (0x4) 
	struct FMulticastInlineDelegate OnBoostStartedDelegate; // 0x1840 (0x10)
	struct FMulticastInlineDelegate OnBoostFinishedDelegate; // 0x1850 (0x10)
	class UFortSoundIndicatorComponent* SoundIndicatorComponent; // 0x1860 (0x8)
	bool bShouldDealDamage; // 0x1868 (0x1)
	unsigned char unreflected_1869[0x7]; // 0x1869 (0x7) 
	class UNiagaraComponent* NativeCompLowFuelSputter; // 0x1870 (0x8)
	class UNiagaraSystem* NativeSysLowFuelSputter; // 0x1878 (0x8)
	struct FMulticastInlineDelegate OnOutOfFuelDelegate; // 0x1880 (0x10)
	struct FMulticastInlineDelegate OnGainedFuelDelegate; // 0x1890 (0x10)
	struct FMulticastInlineDelegate OnLowFuelDelegate; // 0x18a0 (0x10)
	int DebugDestroyLogCount; // 0x18b0 (0x4)
	float ServerCriticalHealth; // 0x18b4 (0x4)
	float HealthZeroTime; // 0x18b8 (0x4)
	unsigned char bExploded; // 0x18bc (0x1)
	unsigned char bPendingDeath; // 0x18bc (0x1)
	unsigned char bOnFire; // 0x18bc (0x1)
	unsigned char unreflected_18bd[0x3]; // 0x18bd (0x3) 
	struct FMulticastInlineDelegate OnStartCriticalHealth; // 0x18c0 (0x10)
	struct FMulticastInlineDelegate OnExplode; // 0x18d0 (0x10)
	unsigned char unreflected_18e0[0x18]; // 0x18e0 (0x18) 
	bool bOnRoad; // 0x18f8 (0x1)
	bool bOnLandscape; // 0x18f9 (0x1)
	bool bOnDirt; // 0x18fa (0x1)
	bool bOnGrass; // 0x18fb (0x1)
	bool bOnIce; // 0x18fc (0x1)
	bool bOnSnow; // 0x18fd (0x1)
	bool bOnVehicle; // 0x18fe (0x1)
	unsigned char unreflected_18ff[0x1]; // 0x18ff (0x1) 
	struct TArray<enum ETireSurfaces> TireSurfaces; // 0x1900 (0x10)
	struct FMulticastInlineDelegate OnTirePoppedDelegate; // 0x1910 (0x10)
	float LastPopTireTime; // 0x1920 (0x4)
	unsigned char unreflected_1924[0x4]; // 0x1924 (0x4) 
	struct TArray<enum ETireStates> TireStates; // 0x1928 (0x10)
	float RimScrapeDamageTimer; // 0x1938 (0x4)
	unsigned char padding_193c[0x14]; // 0x193c (0x14)

	/* Functions */

	// Function /Script/FortniteGame.FortAthenaVehicle.WheelsOnGround (Underlying native function: WheelsOnGround 0x2f5d83c)
	bool WheelsOnGround(); // (0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaVehicle.WeaponFired (Has no native function)
	void WeaponFired(class UFortVehicleSeatWeaponComponent*& WeaponComponent, float& Overheat); // (0x00000002 | Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortAthenaVehicle.WakeUpOnGroundDied (Underlying native function: WakeUpOnGroundDied 0x830b500)
	void WakeUpOnGroundDied(class AActor*& DamagedActor, float& Damage, class AController*& InstigatedBy, class AActor*& DamageCauser, struct FVector& HitLocation, class UPrimitiveComponent*& FHitComponent, struct FName& BoneName, struct FVector& Momentum); // (Final | Native | Public | HasDefaults)

