// Class /Script/FortniteGame.FortStaticMeshActor
// Size: 0x2e0
class AFortStaticMeshActor : public AStaticMeshActor
{
	unsigned char unreflected_298[0x10]; // 0x298 (0x10) 
	int LinkCompCount; // 0x2a8 (0x4)
	bool bUseAutoNavmeshFlags; // 0x2ac (0x1)
	unsigned char unreflected_2ad[0x3]; // 0x2ad (0x3) 
	struct FGuid SavedActorGuid; // 0x2b0 (0x10)
	unsigned char unreflected_2c0[0x18]; // 0x2c0 (0x18) 
	struct FName ActorTemplateID; // 0x2d8 (0x4)
	unsigned char padding_2dc[0x4]; // 0x2dc (0x4)
};

