// Class /Script/FortniteGame.FortSplineGroundPath
// Size: 0xc90
class AFortSplineGroundPath : public ABuildingGameplayActor
{
	float MaxDistanceBetweenPathwayPoints; // 0x9d8 (0x4)
	float EvenlySpacedPointsDistance; // 0x9dc (0x4)
	float TangentDistance; // 0x9e0 (0x4)
	float PathUpdateSecondIntervals; // 0x9e4 (0x4)
	float PathTestRadius; // 0x9e8 (0x4)
	float MinDistanceForAddingRawPoint; // 0x9ec (0x4)
	unsigned char bDrawDebugRawPoints; // 0x9f0 (0x1)
	unsigned char bDrawDebugRawEnd; // 0x9f0 (0x1)
	unsigned char bDrawDebugReppedPoints; // 0x9f0 (0x1)
	unsigned char bDrawDebugEvenlySizedSegments; // 0x9f0 (0x1)
	unsigned char bDrawDebugTangents; // 0x9f0 (0x1)
	unsigned char bDrawDebugCollision; // 0x9f0 (0x1)
	unsigned char bDrawDebugSplineEnd; // 0x9f0 (0x1)
	unsigned char unreflected_9f1[0x3]; // 0x9f1 (0x3) 
	float CleanupTime; // 0x9f4 (0x4)
	struct FVector PathwayPointOffset; // 0x9f8 (0x18)
	float LerpScaleRate; // 0xa10 (0x4)
	float GrowthSmoothingStrength; // 0xa14 (0x4)
	struct FVector MostRecentlyAddedLocation; // 0xa18 (0x18)
	float MostRecentlyAddedTime; // 0xa30 (0x4)
	unsigned char unreflected_a34[0x4]; // 0xa34 (0x4) 
	struct FFortReppedPointList FortReppedPointList; // 0xa38 (0x120)
	struct TArray<struct FVector> RawPoints; // 0xb58 (0x10)
	int ServerIndexToAssign; // 0xb68 (0x4)
	unsigned char unreflected_b6c[0x4]; // 0xb6c (0x4) 
	struct TArray<struct FFortEvenlySizedSegment> EvenlySizedSegments; // 0xb70 (0x10)
	struct FVector2D FrontEndCurrentScale; // 0xb80 (0x10)
	struct FVector2D FrontEndDestScale; // 0xb90 (0x10)
	struct TArray<struct FReppedLastServerIndexToIndex> ReppedLastServerIndexToReppedPointIndices; // 0xba0 (0x10)
	struct TArray<struct FRawPointToLastServerIndexPlusAlpha> RawPointsToLastServerIndicesPlusAlpha; // 0xbb0 (0x10)
	class UStaticMesh* StaticMesh; // 0xbc0 (0x8)
	class UMaterial* Material; // 0xbc8 (0x8)
	struct FVector2D StaticMeshScaleStart; // 0xbd0 (0x10)
	struct FVector2D StaticMeshScaleTarget; // 0xbe0 (0x10)
	struct TEnumAsByte<ESplineMeshAxis> ForwardAxis; // 0xbf0 (0x1)
	unsigned char unreflected_bf1[0x3]; // 0xbf1 (0x3) 
	float LerpLocationRate; // 0xbf4 (0x4)
	bool bMostRecentLocationHasBeenSet; // 0xbf8 (0x1)
	bool bHasWarnedOfArrayOverfill; // 0xbf9 (0x1)
	bool bHasWarnedOfUnableToRepDestroy; // 0xbfa (0x1)
	unsigned char unreflected_bfb[0x1]; // 0xbfb (0x1) 
	int FirstActiveEvenlySizedSegmentIndex; // 0xbfc (0x4)
	int MaxReppedPointsBeforeOverfill; // 0xc00 (0x4)
	unsigned char unreflected_c04[0x4]; // 0xc04 (0x4) 
	struct FVector LerpedMostRecentLocation; // 0xc08 (0x18)
	unsigned char unreflected_c20[0x10]; // 0xc20 (0x10) 
	float DistanceRemainingToNextEvenlySpacedPoint; // 0xc30 (0x4)
	struct FName PositionFinalizedParameterName; // 0xc34 (0x4)
	struct FName GrowthParameterName; // 0xc38 (0x4)
	struct FName ShrinkParameterName; // 0xc3c (0x4)
	struct FName OpacityParameterName; // 0xc40 (0x4)
	float TotalFadeInTime; // 0xc44 (0x4)
	float TotalFadeOutTime; // 0xc48 (0x4)
	float SectionsLifeTime; // 0xc4c (0x4)
	float ShrinkTimeMultWhenFading; // 0xc50 (0x4)
	float ShrinkTimeMultWhenBurning; // 0xc54 (0x4)
	float GrowthTimeMult; // 0xc58 (0x4)
	float LocationLerpTimeMult; // 0xc5c (0x4)
	float CurrentFadeInTime; // 0xc60 (0x4)
	float CurrentFadeOutTime; // 0xc64 (0x4)
	int TotalSplineMeshesToFadeIn; // 0xc68 (0x4)
	int LowestUninitializedRawLastServerIndex; // 0xc6c (0x4)
	int LowestUninitializedReppedIndex; // 0xc70 (0x4)
	unsigned char unreflected_c74[0x14]; // 0xc74 (0x14) 
	int NumIgnitedSections; // 0xc88 (0x4)
	bool bSomeSectionsAreFadingOut; // 0xc8c (0x1)
	unsigned char padding_c8d[0x3]; // 0xc8d (0x3)

	/* Functions */

	// Function /Script/FortniteGame.FortSplineGroundPath.StartNextSectionTimedOut (Underlying native function: StartNextSectionTimedOut 0x8866504)
	void StartNextSectionTimedOut(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortSplineGroundPath.OnRep_MostRecentlyAddedLocation (Underlying native function: OnRep_MostRecentlyAddedLocation 0x8862d94)
	void OnRepMostRecentlyAddedLocation(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortSplineGroundPath.OnAddedEvenlySizedSegment (Has no native function)
	void OnAddedEvenlySizedSegment(int& ArrayIndex); // (Event | Protected | BlueprintEvent)

	// Function /Script/FortniteGame.FortSplineGroundPath.DebugDisplayPathPoints (Underlying native function: DebugDisplayPathPoints 0x26daa0c)
	void DebugDisplayPathPoints(); // (Final | Native | Protected | Const)
};

