// Class /Script/FortniteGame.FortPlayerPawn
// Size: 0x4360
class AFortPlayerPawn : public AFortPawn
{
	unsigned char unreflected_1af0[0x40]; // 0x1af0 (0x40) 
	struct FFortAthenaVehicleInputStateReliable VehicleInputStateReliable; // 0x1b30 (0x2)
	unsigned char bIsNearSafeZoneEdge; // 0x1b32 (0x1)
	unsigned char bPlayingSafeZoneEffects; // 0x1b32 (0x1)
	unsigned char bDoSafeZoneCleanup; // 0x1b32 (0x1)
	unsigned char bIsSwimmingAnimLayerLinked; // 0x1b32 (0x1)
	unsigned char bIsSwimmingAnimLayerPendingRemove; // 0x1b32 (0x1)
	unsigned char bIsSprintJump; // 0x1b32 (0x1)
	unsigned char bHasDisableSprintTag; // 0x1b32 (0x1)
	unsigned char bIsTacticalSprinting; // 0x1b32 (0x1)
	unsigned char bDisableSwimSprintCancel; // 0x1b33 (0x1)
	unsigned char bIsWaterJump; // 0x1b33 (0x1)
	unsigned char bIsWaterSprintBoost; // 0x1b33 (0x1)
	unsigned char bIsWaterSprintBoostPending; // 0x1b33 (0x1)
	unsigned char bPlayingPassengerToPassengerAnimation; // 0x1b33 (0x1)
	unsigned char bPlayingDriverToPassengerAnimation; // 0x1b33 (0x1)
	unsigned char bIsTargeting; // 0x1b34 (0x1)
	unsigned char bIsTargetingConsumableThrow; // 0x1b34 (0x1)
	unsigned char bIsSwappingCharacterParts; // 0x1b34 (0x1)
	unsigned char bBalloonMovementActivated; // 0x1b34 (0x1)
	unsigned char bIsScriptedBot; // 0x1b34 (0x1)
	unsigned char bBuildHotfix; // 0x1b34 (0x1)
	unsigned char unreflected_1b35[0x1]; // 0x1b35 (0x1) 
	struct FLightingChannels FortPlayerPawnLightingChannels; // 0x1b36 (0x1)
	unsigned char unreflected_1b37[0x1]; // 0x1b37 (0x1) 
	enum EFortPawnStasisMode StasisMode; // 0x1b38 (0x1)
	unsigned char unreflected_1b39[0x7]; // 0x1b39 (0x7) 
	struct TArray<enum EFortPawnStasisMode> StasisModes; // 0x1b40 (0x10)
	unsigned char unreflected_1b50[0x1]; // 0x1b50 (0x1) 
	struct TEnumAsByte<EFortBuildingState> BuildingState; // 0x1b51 (0x1)
	int8_t AccelerationZPack; // 0x1b52 (0x1)
	unsigned char unreflected_1b53[0x1d]; // 0x1b53 (0x1d) 
	class UCurveFloat* ParachuteDirectionalSpeedMultiplierCurve; // 0x1b70 (0x8)
	class UCurveFloat* SkydivingDirectionalSpeedMultiplierCurve; // 0x1b78 (0x8)
	class UCurveFloat* BallooningDirectionalSpeedMultiplierCurve; // 0x1b80 (0x8)
	class UCurveFloat* DirectionalSpeedMultiplierCurve; // 0x1b88 (0x8)
	float LastCustomizationTimestamp; // 0x1b90 (0x4)
	float MinimumTimeBetweenSteps; // 0x1b94 (0x4)
	float LastStepTime; // 0x1b98 (0x4)
	unsigned char unreflected_1b9c[0x4]; // 0x1b9c (0x4) 
	struct FMulticastInlineDelegate OnFootstepEvent; // 0x1ba0 (0x10)
	struct FMulticastInlineDelegate OnPawnEnterWater; // 0x1bb0 (0x10)
	struct FMulticastInlineDelegate OnPawnExitWater; // 0x1bc0 (0x10)
	unsigned char unreflected_1bd0[0x18]; // 0x1bd0 (0x18) 
	struct FMulticastInlineDelegate OnPawnExitSwinging; // 0x1be8 (0x10)
	float CurrentPawnSquaredSpeedXY; // 0x1bf8 (0x4)
	unsigned char unreflected_1bfc[0x4]; // 0x1bfc (0x4) 
	struct FRotator CurrentPawnVelXYRot; // 0x1c00 (0x18)
	float CurrentPawnSquaredSpeed; // 0x1c18 (0x4)
	bool bIsInWaterVolume; // 0x1c1c (0x1)
	bool bNotifyBlueprintWhenLandscapeTeleporting; // 0x1c1d (0x1)
	unsigned char unreflected_1c1e[0x6]; // 0x1c1e (0x6) 
	unsigned char CachedTeamControllingRC; // 0x1c24 (0x1)
	unsigned char BalloonActiveCount; // 0x1c25 (0x1)
	unsigned char bParachuteDeployFixedVerticalDistance; // 0x1c26 (0x1)
	bool bIsSkydiving; // 0x1c27 (0x1)
	bool bIsParachuteOpen; // 0x1c28 (0x1)
	unsigned char bLocalIsSkydiving; // 0x1c29 (0x1)
	unsigned char bLocalIsParachuteForcedOpen; // 0x1c29 (0x1)
	unsigned char bIsParachuteForcedOpen; // 0x1c29 (0x1)
	unsigned char bIsSkydivingFromBus; // 0x1c29 (0x1)
	unsigned char bIsSkydivingFromLaunchPad; // 0x1c29 (0x1)
	unsigned char bPendingSkydiveLaunch; // 0x1c29 (0x1)
	unsigned char bIsInSlipperyMovement; // 0x1c29 (0x1)
	unsigned char bReplicatedIsInSlipperyMovement; // 0x1c2a (0x1)
	unsigned char bIsBelowAutoDeployTestHeight; // 0x1c2a (0x1)
	unsigned char bIsProxySimulationTimedOut; // 0x1c2a (0x1)
	unsigned char bIsPedestalHero; // 0x1c2a (0x1)
	unsigned char bInGliderRedeploy; // 0x1c2a (0x1)
	unsigned char bLocalInGliderRedeploy; // 0x1c2a (0x1)
	unsigned char bBeingRepossessed; // 0x1c2a (0x1)
	unsigned char bInitAbilitySystemComponentFromPlayerState; // 0x1c2b (0x1)
	unsigned char bStartedInteractSearch; // 0x1c2b (0x1)
	unsigned char bSignificanceLODDirty; // 0x1c2b (0x1)
	unsigned char bIsUsingJetpack; // 0x1c2b (0x1)
	unsigned char bIsPlayingEmote; // 0x1c2b (0x1)
	unsigned char bShowingOverdriveEffect; // 0x1c2b (0x1)
	unsigned char bIsRespawning; // 0x1c2b (0x1)
	unsigned char bIsRespawningInAir; // 0x1c2b (0x1)
	unsigned char bInitializedPostRepPlayerState; // 0x1c2c (0x1)
	unsigned char bHasWaterParticleSystem; // 0x1c2c (0x1)
	unsigned char bCanShowDefaultSkin; // 0x1c2c (0x1)
	unsigned char bDisabledTetheringSupport; // 0x1c2c (0x1)
	unsigned char bIsInFrontEndHologram; // 0x1c2c (0x1)
	unsigned char unreflected_1c2d[0x4f]; // 0x1c2d (0x4f) 
	struct TWeakObjectPtr<class AActor> HeldObject; // 0x1c7c (0x8)
	unsigned char unreflected_1c84[0x14]; // 0x1c84 (0x14) 
	unsigned char bForceMoveRelativeToCameraRotation; // 0x1c98 (0x1)
	unsigned char bIsWaitingForEmoteInteraction; // 0x1c98 (0x1)
	unsigned char bIsEmoteLeader; // 0x1c98 (0x1)
	unsigned char bShouldSyncAnimationWithEmoteLeader; // 0x1c98 (0x1)
	unsigned char bShouldJitterAnimationSyncWithEmoteLeader; // 0x1c98 (0x1)
	unsigned char bDoubleFileEmoteSecondLine; // 0x1c98 (0x1)
	unsigned char bEmoteUsesSecondaryFire; // 0x1c98 (0x1)
	unsigned char bLockGroupEmoteLeaderRotation; // 0x1c98 (0x1)
	unsigned char unreflected_1c99[0x7]; // 0x1c99 (0x7) 
	int EmoteBandLeaderIndex; // 0x1ca0 (0x4)
	unsigned char unreflected_1ca4[0x4]; // 0x1ca4 (0x4) 
	class AFortPlayerPawn* GroupEmoteLookTarget; // 0x1ca8 (0x8)
	class AFortPlayerPawn* GroupEmoteTailTarget; // 0x1cb0 (0x8)
	struct TArray<class AFortPlayerPawn*> GroupEmoteFollowers; // 0x1cb8 (0x10)
	unsigned char unreflected_1cc8[0x5c]; // 0x1cc8 (0x5c) 
	float GroupEmoteAnimOffset; // 0x1d24 (0x4)
	float GroupEmoteLeaderRotationYawOffset; // 0x1d28 (0x4)
	unsigned char unreflected_1d2c[0x4]; // 0x1d2c (0x4) 
	struct FRotator GroupEmoteLookTargetRotationLeader; // 0x1d30 (0x18)
	unsigned char unreflected_1d48[0x18]; // 0x1d48 (0x18) 
	float GroupEmoteMaximumZDifference; // 0x1d60 (0x4)
	unsigned char unreflected_1d64[0x4]; // 0x1d64 (0x4) 
	struct FMulticastInlineDelegate OnGroupEmoteSyncValueChanged; // 0x1d68 (0x10)
	struct FMulticastInlineDelegate OnGroupEmoteFollowerJoined; // 0x1d78 (0x10)
	struct FMulticastInlineDelegate OnGroupEmoteFollowerLeft; // 0x1d88 (0x10)
	struct FMulticastInlineDelegate OnGroupEmoteSecondaryFirePressed; // 0x1d98 (0x10)
	unsigned char GroupEmoteSyncValue; // 0x1da8 (0x1)
	unsigned char GroupEmoteSoundValue; // 0x1da9 (0x1)
	unsigned char GroupEmoteParticleValue; // 0x1daa (0x1)
	unsigned char unreflected_1dab[0x5]; // 0x1dab (0x5) 
	class UAnimMontage* TransformationMontage; // 0x1db0 (0x8)
	float TransformationMontageStartTime; // 0x1db8 (0x4)
	unsigned char unreflected_1dbc[0x5c]; // 0x1dbc (0x5c) 
	class UAnimMontage* CurrentMontagerLeader; // 0x1e18 (0x8)
	class UAnimMontage* CurrentSyncedMontage; // 0x1e20 (0x8)
	unsigned char bCharacterPartsCastIndirectShadows; // 0x1e28 (0x1)
	unsigned char unreflected_1e29[0x1]; // 0x1e29 (0x1) 
	struct TEnumAsByte<EFortCustomGender> CharacterGender; // 0x1e2a (0x1)
	struct TEnumAsByte<EFortCustomBodyType> CharacterBodyType; // 0x1e2b (0x1)
	unsigned char unreflected_1e2c[0x10]; // 0x1e2c (0x10) 
	float JumpLastActivatedTime; // 0x1e3c (0x4)
	struct FVector PreviousPosition; // 0x1e40 (0x18)
	struct FVector PreviousVelocity; // 0x1e58 (0x18)
	unsigned char unreflected_1e70[0x48]; // 0x1e70 (0x48) 
	uint16_t ReplicatedCustomMeshHeightAdjustTarget; // 0x1eb8 (0x2)
	unsigned char unreflected_1eba[0x2]; // 0x1eba (0x2) 
	float UnburrowLaunchXYSpeed; // 0x1ebc (0x4)
	float UnburrowLaunchZSpeed; // 0x1ec0 (0x4)
	unsigned char unreflected_1ec4[0x8c]; // 0x1ec4 (0x8c) 
	unsigned char bIsInAnyStorm; // 0x1f50 (0x1)
	unsigned char bIsInsideSafeZone; // 0x1f50 (0x1)
	unsigned char unreflected_1f51[0xf]; // 0x1f51 (0xf) 
	class UClass* SafeZoneAppliedGE; // 0x1f60 (0x8)
	unsigned char unreflected_1f68[0x28]; // 0x1f68 (0x28) 
	class UClass* DisableSlideGameplayEffectClass; // 0x1f90 (0x8)
	class UClass* SelfReviveGameplayEffect; // 0x1f98 (0x8)
	class UClass* TeammateReviveGameplayEffect; // 0x1fa0 (0x8)
	struct FScalableFloat SetByCallerReviveHealth; // 0x1fa8 (0x28)
	struct FName DBNOInteractionCollisionProfile; // 0x1fd0 (0x4)
	unsigned char unreflected_1fd4[0x4]; // 0x1fd4 (0x4) 
	struct FVector DBNOInteractionBoxExtent; // 0x1fd8 (0x18)
	float DBNODeferTime; // 0x1ff0 (0x4)
	unsigned char unreflected_1ff4[0x4]; // 0x1ff4 (0x4) 
	class UBoxComponent* DBNOInteractCollisionComponent; // 0x1ff8 (0x8)
	struct FGameplayTag EventReviveTag; // 0x2000 (0x4)
	float AggroRangeOverride; // 0x2004 (0x4)
	float SetByCallerReviveSignalInStorm; // 0x2008 (0x4)
	unsigned char unreflected_200c[0x54]; // 0x200c (0x54) 
	struct TArray<struct FGameplayAbilitySpecHandle> StasisAbilityHandles; // 0x2060 (0x10)
	struct TScriptInterface<class IFortArmoredInterface> ArmoredInterface; // 0x2070 (0x10)
	class UBuildingEditModeMetadata* LastBuildingMetadata; // 0x2080 (0x8)
	unsigned char unreflected_2088[0x18]; // 0x2088 (0x18) 
	float SprintCancelTime; // 0x20a0 (0x4)
	unsigned char unreflected_20a4[0x4]; // 0x20a4 (0x4) 
	float WaterSprintBoostAllowedTimer; // 0x20a8 (0x4)
	unsigned char unreflected_20ac[0x88]; // 0x20ac (0x88) 
	bool bHasStartedFloating; // 0x2134 (0x1)
	unsigned char unreflected_2135[0x3]; // 0x2135 (0x3) 
	struct FZiplinePawnState ZiplineState; // 0x2138 (0x48)
	struct FCurveTableRowHandle ZiplineJumpDampening; // 0x2180 (0x10)
	struct FCurveTableRowHandle ZiplineJumpStrength; // 0x2190 (0x10)
	struct FScalableFloat ZiplineJumpActivateDelay; // 0x21a0 (0x28)
	struct FScalableFloat ZiplineRentryProtectionDelay; // 0x21c8 (0x28)
	float ZiplineSocketZOffset; // 0x21f0 (0x4)
	unsigned char unreflected_21f4[0x4]; // 0x21f4 (0x4) 
	struct FMulticastInlineDelegate ZiplineStateChanged; // 0x21f8 (0x10)
	float ZiplineSpeedFactorTarget; // 0x2208 (0x4)
	float ZiplineSpeedFactor; // 0x220c (0x4)
	unsigned char unreflected_2210[0x8]; // 0x2210 (0x8) 
	struct FScalableFloat EnableSwimSprintDiveCooldown; // 0x2218 (0x28)
	struct FScalableFloat SwimSprintDiveCooldown; // 0x2240 (0x28)
	struct FScalableFloat SwimDiveBoostTimeThreshold; // 0x2268 (0x28)
	float ClientSwimDiveInputTime; // 0x2290 (0x4)
	bool bCanPredictJumpApex; // 0x2294 (0x1)
	unsigned char unreflected_2295[0x33]; // 0x2295 (0x33) 
	class UAnimMontage* UnableToPerformActionMontage; // 0x22c8 (0x8)
	class USoundBase* UnableToPerformActionSound; // 0x22d0 (0x8)
	float MoveSoundStimulusBroadcastInterval; // 0x22d8 (0x4)
	unsigned char unreflected_22dc[0xe0]; // 0x22dc (0xe0) 
	float EmoteStartTime; // 0x23bc (0x4)
	float EmoteRandomNum; // 0x23c0 (0x4)
	unsigned char unreflected_23c4[0x14]; // 0x23c4 (0x14) 
	bool bPlayingPassengerToDriverAnimation; // 0x23d8 (0x1)
	unsigned char unreflected_23d9[0x17]; // 0x23d9 (0x17) 
	float VehicleSpeedAtTimeOfJump; // 0x23f0 (0x4)
	unsigned char unreflected_23f4[0x4]; // 0x23f4 (0x4) 
	class AActor* CurrentVehicle; // 0x23f8 (0x8)
	class AFortPlayerControllerGameplay* InteractingPCRep; // 0x2400 (0x8)
	class AActor* VehicleLastTick; // 0x2408 (0x8)
	unsigned char unreflected_2410[0x18]; // 0x2410 (0x18) 
	struct FMulticastInlineDelegate OnVehicleStateChangedEvent; // 0x2428 (0x10)
	struct FMulticastInlineDelegate OnUIGameplayCue; // 0x2438 (0x10)
	struct FMulticastInlineDelegate OnPetAddedOrRemoved; // 0x2448 (0x10)
	class UFortPawnComponent_Tether* TetherComponent; // 0x2458 (0x8)
	float PendingTetherLaunch; // 0x2460 (0x4)
	unsigned char unreflected_2464[0x4c]; // 0x2464 (0x4c) 
	float TetherJumpLastTime; // 0x24b0 (0x4)
	bool bSupportsTetheredMovement; // 0x24b4 (0x1)
	unsigned char unreflected_24b5[0x3]; // 0x24b5 (0x3) 
	class ABuildingGameplayActor* BalloonRope; // 0x24b8 (0x8)
	struct FMulticastInlineDelegate OnPossessedProp; // 0x24c0 (0x10)
	class ABuildingGameplayActorPlayerPropAttachment* PossessedProp; // 0x24d0 (0x8)
	unsigned char unreflected_24d8[0x30]; // 0x24d8 (0x30) 
	int64_t SlopeCameraOffsetFrameCounter; // 0x2508 (0x8)
	struct FVectorRK4SpringInterpolator* SlopeCameraOffsetInterpolator; // 0x2510 (0x8)
	unsigned char unreflected_2518[0x58]; // 0x2518 (0x58) 
	struct FVector LargeBodyTypeTargetingOffset; // 0x2570 (0x18)
	unsigned char unreflected_2588[0xe8]; // 0x2588 (0xe8) 
	class UInputComponent* VehicleInputComponent; // 0x2670 (0x8)
	unsigned char unreflected_2678[0x8]; // 0x2678 (0x8) 
	class UAnimMontage* BluePrintPlaceAnimation; // 0x2680 (0x8)
	class UAnimMontage* BluePrintEditAnimation; // 0x2688 (0x8)
	unsigned char unreflected_2690[0x8]; // 0x2690 (0x8) 
	struct FMulticastInlineDelegate OnStartedInteractSearch; // 0x2698 (0x10)
	struct FMulticastInlineDelegate OnEndedInteractSearch; // 0x26a8 (0x10)
	struct FMulticastInlineDelegate OnAttemptedInstantInteractSearch; // 0x26b8 (0x10)
	struct FName EmoteInteractionCollisionProfile; // 0x26c8 (0x4)
	unsigned char unreflected_26cc[0x4]; // 0x26cc (0x4) 
	struct FVector EmoteInteractionBoxExtent; // 0x26d0 (0x18)
	class UBoxComponent* EmoteInteractCollisionComponent; // 0x26e8 (0x8)
	struct FMulticastInlineDelegate OnPartChanged; // 0x26f0 (0x10)
	unsigned char unreflected_2700[0x30]; // 0x2700 (0x30) 
	class UMaterialInstanceDynamic* BlueprintPaperMID; // 0x2730 (0x8)
	struct FTimeline BlueprintPaperPulseTimeline; // 0x2738 (0x90)
	class UCustomColorComponent* AccessoryColorSwatchHandler[0x7]; // 0x27c8 (0x8) (ARRAY) 
	class UFortHero* Hero; // 0x2800 (0x8)
	struct TWeakObjectPtr<class UFortHeroType> OvrHeroType; // 0x2808 (0x8)
	enum EFortPawnDisplayContext DisplayContext; // 0x2810 (0x1)
	unsigned char unreflected_2811[0x1f]; // 0x2811 (0x1f) 
	class UCustomPlayerComponent* HACKCustomPRIComponent; // 0x2830 (0x8)
	class UCustomCharacterPart* CharacterParts[0x7]; // 0x2838 (0x8) (ARRAY) 
	class UCustomColorSwatch* CharacterColorSwatches[0x2]; // 0x2870 (0x8) (ARRAY) 
	class UCustomColorSwatch* CharacterPartColorSwatches[0x7]; // 0x2880 (0x8) (ARRAY) 
	class UAthenaCharmItemDefinition* CharacterCharms[0x4]; // 0x28b8 (0x8) (ARRAY) 
	struct TArray<class UCustomCharacterPart*> RequiredVariantParts; // 0x28d8 (0x10)
	unsigned char unreflected_28e8[0x8]; // 0x28e8 (0x8) 
	class USkeletalMeshComponentBudgeted* CharacterPartSkeletalMeshComponents[0x7]; // 0x28f0 (0x8) (ARRAY) 
	struct TArray<class AFortPlayerCharm*> CharacterCharmActors; // 0x2928 (0x10)
	int8_t CharacterPartSMHiddenRefCount[0x7]; // 0x2938 (0x1) (ARRAY) 
	unsigned char unreflected_293f[0x9]; // 0x293f (0x9) 
	struct FFortAthenaLoadout BaseCosmeticLoadout; // 0x2948 (0x178)
	struct FFortAthenaLoadout AppliedCosmeticLoadout; // 0x2ac0 (0x178)
	struct TArray<struct FFortAppliedSwapItemAndVariantData> AppliedSwaps; // 0x2c38 (0x10)
	unsigned char unreflected_2c48[0x50]; // 0x2c48 (0x50) 
	struct FFortAthenaLoadout CosmeticLoadout; // 0x2c98 (0x178)
	uint32_t ServerLoadoutChangeSync; // 0x2e10 (0x4)
	unsigned char unreflected_2e14[0x4]; // 0x2e14 (0x4) 
	bool bAllowClientLoadoutChangeSync; // 0x2e18 (0x1)
	unsigned char unreflected_2e19[0x27]; // 0x2e19 (0x27) 
	struct FMulticastInlineDelegate OnMaterialOverrideApplied; // 0x2e40 (0x10)
	struct FMulticastInlineDelegate OnMaterialOverrideCleared; // 0x2e50 (0x10)
	unsigned char unreflected_2e60[0x8]; // 0x2e60 (0x8) 
	struct TArray<struct FFortPawnMaterialOverride> MaterialOverrides; // 0x2e68 (0x10)
	struct TArray<struct FFortPawnMaterialOverride> LocalMaterialOverrides; // 0x2e78 (0x10)
	unsigned char unreflected_2e88[0x10]; // 0x2e88 (0x10) 
	struct TMap<class USceneComponent*, struct FFortPawnMaterialOverrideState> MaterialOverrideStateMap; // 0x2e98 (0x50)
	class UCustomCharacterPart* PreviousCharacterParts[0x7]; // 0x2ee8 (0x8) (ARRAY) 
	class ACustomCharacterPartModifier* CharacterPartModifiers[0x7]; // 0x2f20 (0x8) (ARRAY) 
	struct FFortCharacterPartsRepMontageInfo RepCharPartAnimMontageInfo; // 0x2f58 (0x20)
	struct FFortClientObservedStatArray ClientObservedStats; // 0x2f78 (0x138)
	class UFortPawnSkeletalMeshContext* SkeletalMeshContext; // 0x30b0 (0x8)
	unsigned char unreflected_30b8[0x18]; // 0x30b8 (0x18) 
	class UClass* AnimBPOverride; // 0x30d0 (0x8)
	class UClass* OriginalAnimBP; // 0x30d8 (0x8)
	class USoundBase* OnCrouchStartSound; // 0x30e0 (0x8)
	class USoundBase* OnCrouchEndSound; // 0x30e8 (0x8)
	class UFortFootstepAudioBank* FootstepBankOverride; // 0x30f0 (0x8)
	class UFortFootstepAudioBank* OriginalFootstepBank; // 0x30f8 (0x8)
	int CachedFootStepIndex; // 0x3100 (0x4)
	unsigned char unreflected_3104[0x4]; // 0x3104 (0x4) 
	class UFortWeaponAnimSet* WeaponAnimSetOverride; // 0x3108 (0x8)
	class UFortAnimAssetLocomotion* LocomotionAnimAssetOverride; // 0x3110 (0x8)
	struct TArray<class UClass*> AnimLayersOverride; // 0x3118 (0x10)
	struct TArray<class UClass*> PreviousAnimLayersOverride; // 0x3128 (0x10)
	struct TArray<class AFortPickup*> QueuedAutoPickups; // 0x3138 (0x10)
	struct TArray<struct FIgnoreCollisionActor> IgnoreActors; // 0x3148 (0x10)
	unsigned char unreflected_3158[0x8]; // 0x3158 (0x8) 
	struct FScalableFloat AutoPickupDropRepickupDelay; // 0x3160 (0x28)
	unsigned char unreflected_3188[0x10]; // 0x3188 (0x10) 
	struct FName CarriedObjectAttachmentSocket; // 0x3198 (0x4)
	float PickupSpeedMultiplier; // 0x319c (0x4)
	struct FSlateBrush MiniMapIconBrush; // 0x31a0 (0xc0)
	struct FSlateBrush AboveBelowMiniMapIconBrush; // 0x3260 (0xc0)
	struct FSlateBrush FarOffMiniMapIconBrush; // 0x3320 (0xc0)
	struct FSlateBrush DBNOMiniMapIconBrush; // 0x33e0 (0xc0)
	struct FLinearColor MinimapIconColorSelf; // 0x34a0 (0x10)
	struct FLinearColor MinimapIconColorTeammate; // 0x34b0 (0x10)
	struct FLinearColor MinimapIconColorEnemy; // 0x34c0 (0x10)
	float MaxIndicatorVisibilityDistForEnemies; // 0x34d0 (0x4)
	float MaxIndicatorVisibilityDistForAllies; // 0x34d4 (0x4)
	unsigned char unreflected_34d8[0x80]; // 0x34d8 (0x80) 
	struct FFortDBNOCarryHoisterData DBNOHoisterData; // 0x3558 (0x10)
	class AFortPlayerPawn* DBNOHoistee; // 0x3568 (0x8)
	class UFortWeaponAnimSet* DBNOHoisterAnimSet; // 0x3570 (0x8)
	float ThrowCarriedPlayerStrengthXY; // 0x3578 (0x4)
	float ThrowCarriedPlayerStrengthZ; // 0x357c (0x4)
	float DropCarriedPlayerForwardOffset; // 0x3580 (0x4)
	float DropCarriedPlayerHeightOffset; // 0x3584 (0x4)
	float DropCarriedPlayerTraceHeight; // 0x3588 (0x4)
	bool bAllowDBNOCarry; // 0x358c (0x1)
	bool bAllowDBNOCarryEnemies; // 0x358d (0x1)
	bool bIsBeingDBNOCarried; // 0x358e (0x1)
	bool bIsDBNOCarrying; // 0x358f (0x1)
	bool bRequestedThrowCarriedPlayer; // 0x3590 (0x1)
	unsigned char unreflected_3591[0xf]; // 0x3591 (0xf) 
	struct FMulticastInlineDelegate OnDBNOHoisterChangedDelegate; // 0x35a0 (0x10)
	struct FMulticastInlineDelegate OnRevivedFromDBNODelegate; // 0x35b0 (0x10)
	struct FMulticastInlineDelegate OnNewPlayerState; // 0x35c0 (0x10)
	struct FMulticastInlineDelegate OnAbilitySystemComponentInitialized; // 0x35d0 (0x10)
	struct FMulticastInlineDelegate OnPreInvalidateAbilitySystemComponent; // 0x35e0 (0x10)
	unsigned char unreflected_35f0[0x60]; // 0x35f0 (0x60) 
	struct FMulticastInlineDelegate OnFinishedCharacterCustomization; // 0x3650 (0x10)
	struct FMulticastInlineDelegate OnCrouchInputJustPressed; // 0x3660 (0x10)
	class UFortCustomizationAssetLoader* CustomizationAssetLoader; // 0x3670 (0x8)
	unsigned char unreflected_3678[0x110]; // 0x3678 (0x110) 
	bool bEnableUpdateCharacterCustomizationPostLoad; // 0x3788 (0x1)
	bool bHasCharacterCustomizationPostLoadedOnce; // 0x3789 (0x1)
	bool bHiddenAtStartup; // 0x378a (0x1)
	unsigned char unreflected_378b[0xd]; // 0x378b (0xd) 
	class UParticleSystem* SpawnParticles; // 0x3798 (0x8)
	class USoundBase* SpawnSound; // 0x37a0 (0x8)
	unsigned char unreflected_37a8[0x4]; // 0x37a8 (0x4) 
	unsigned char bIsLocalPlayer; // 0x37ac (0x1)
	unsigned char bDamagedEnemy; // 0x37ac (0x1)
	unsigned char unreflected_37ad[0x1b]; // 0x37ad (0x1b) 
	struct FMulticastInlineDelegate OnDamageComboIncrement; // 0x37c8 (0x10)
	struct FMulticastInlineDelegate OnDamageComboReset; // 0x37d8 (0x10)
	unsigned char unreflected_37e8[0x8]; // 0x37e8 (0x8) 
	uint32_t PlayerStatus; // 0x37f0 (0x4)
	uint16_t AccelerationPack; // 0x37f4 (0x2)
	unsigned char unreflected_37f6[0x2]; // 0x37f6 (0x2) 
	struct FGameplayAbilityRepAnimMontage RepAnimMontageInfo; // 0x37f8 (0x38)
	int RepAnimMontageStartSection; // 0x3830 (0x4)
	unsigned char bNetMovementPrioritized; // 0x3834 (0x1)
	unsigned char unreflected_3835[0x3]; // 0x3835 (0x3) 
	struct FReplicatedMontagePair LandingMontagePair; // 0x3838 (0x20)
	struct FPreviouslyAppliedVariantData PriorVariantData; // 0x3858 (0x88)
	struct TArray<class UFortWorldItemDefinition*> TempWeaponsStack; // 0x38e0 (0x10)
	struct TArray<class UFortAnimNotifyState_RootMotionInterrupt*> RootMotionInterruptNotifyStack; // 0x38f0 (0x10)
	struct TArray<class UAnimMontage*> RootMotionInterruptMontageStack; // 0x3900 (0x10)
	unsigned char unreflected_3910[0x38]; // 0x3910 (0x38) 
	class UFortVisibilityComponent* VisibilityComponent; // 0x3948 (0x8)
	class UPostProcessComponent* BlendablesPostProcessComp; // 0x3950 (0x8)
	unsigned char unreflected_3958[0x4]; // 0x3958 (0x4) 
	unsigned char bUseControllerRotationYawToRestore; // 0x395c (0x1)
	unsigned char unreflected_395d[0x3]; // 0x395d (0x3) 
	struct FMulticastInlineDelegate OnBeginSkydivingEvent; // 0x3960 (0x10)
	struct FMulticastInlineDelegate OnEndSkydivingEvent; // 0x3970 (0x10)
	struct FMulticastInlineDelegate OnBeginParachuteMovementEvent; // 0x3980 (0x10)
	struct FMulticastInlineDelegate OnParachuteSpawned; // 0x3990 (0x10)
	struct FMulticastInlineDelegate OnEndParachuteMovementEvent; // 0x39a0 (0x10)
	struct FMulticastInlineDelegate OnBallooningGravityCeilingChanged; // 0x39b0 (0x10)
	struct FMulticastInlineDelegate OnEnteredAircraft; // 0x39c0 (0x10)
	struct FMulticastInlineDelegate OnStopSliding; // 0x39d0 (0x10)
	struct FMulticastInlineDelegate OnPawnPossessed; // 0x39e0 (0x10)
	struct FMulticastInlineDelegate OnPawnUnpossessed; // 0x39f0 (0x10)
	struct FMulticastInlineDelegate OnEmoteInteracted; // 0x3a00 (0x10)
	struct FMulticastInlineDelegate OnSafeZoneOccupancyChangedEvent; // 0x3a10 (0x10)
	struct FMulticastInlineDelegate OnHeldObjectPickedUp; // 0x3a20 (0x10)
	struct FMulticastInlineDelegate OnHeldObjectDropped; // 0x3a30 (0x10)
	struct TMap<struct TEnumAsByte<EFortCustomMovement>, class UTexture*> CustomMovementIndicators; // 0x3a40 (0x50)
	unsigned char unreflected_3a90[0x10]; // 0x3a90 (0x10) 
	class USoundBase* CurrentGliderOpenSound; // 0x3aa0 (0x8)
	struct TWeakObjectPtr<class UAudioComponent> CurrentGliderOpenAudioComponent; // 0x3aa8 (0x8)
	class USoundBase* CurrentGliderCloseSound; // 0x3ab0 (0x8)
	struct TWeakObjectPtr<class UAudioComponent> CurrentGliderCloseAudioComponent; // 0x3ab8 (0x8)
	unsigned char unreflected_3ac0[0xc]; // 0x3ac0 (0xc) 
	bool bParachuteLockedOpen; // 0x3acc (0x1)
	bool bLocalParachuteLockedOpen; // 0x3acd (0x1)
	unsigned char unreflected_3ace[0x2]; // 0x3ace (0x2) 
	struct FRepFortMeshAttachment AttachmentMesh; // 0x3ad0 (0x10)
	class USkeletalMeshComponentBudgeted* AttachmentMeshComponent; // 0x3ae0 (0x8)
	class UFortPawnScriptedBehavior* BotScriptedBehavior; // 0x3ae8 (0x8)
	unsigned char unreflected_3af0[0x18]; // 0x3af0 (0x18) 
	struct TArray<class AFortWaterBodyActor*> IgnoredWaterBodies; // 0x3b08 (0x10)
	class UFortUnderwaterDamageComponent* UnderwaterDamageComponent; // 0x3b18 (0x8)
	struct FSlipperySlopeParams SlipperySlopeParams; // 0x3b20 (0x230)
	class UAthenaGliderItemDefinition* GliderClass; // 0x3d50 (0x8)
	unsigned char unreflected_3d58[0x10]; // 0x3d58 (0x10) 
	class AFortPlayerPetRepState* PetState; // 0x3d68 (0x8)
	class AFortPlayerPet* CosmeticPetInstance; // 0x3d70 (0x8)
	unsigned char unreflected_3d78[0x10]; // 0x3d78 (0x10) 
	class UFortGliderSpawnComponent* GliderSpawnComponent; // 0x3d88 (0x8)
	class AFortPlayerParachute* ParachuteAttachment; // 0x3d90 (0x8)
	unsigned char unreflected_3d98[0x8]; // 0x3d98 (0x8) 
	struct TArray<class UAthenaGliderItemDefinition*> GliderOverrideStack; // 0x3da0 (0x10)
	unsigned char unreflected_3db0[0x10]; // 0x3db0 (0x10) 
	bool bResetGliderOverrideOnLanding; // 0x3dc0 (0x1)
	unsigned char unreflected_3dc1[0x7]; // 0x3dc1 (0x7) 
	struct FScalableFloat ParachuteDeployTraceForGroundDistance; // 0x3dc8 (0x28)
	struct FScalableFloat LaunchPadParachuteDeployTraceForGroundDistance; // 0x3df0 (0x28)
	struct FScalableFloat LaunchPadParachuteDeployTraceForDownwardSpeed; // 0x3e18 (0x28)
	struct FScalableFloat ParachuteDeployVelocityBlend; // 0x3e40 (0x28)
	float ParachuteCooldownToOpen; // 0x3e68 (0x4)
	float ParachuteCooldownToClose; // 0x3e6c (0x4)
	struct FScalableFloat GliderRedeployAllowedRow; // 0x3e70 (0x28)
	struct FScalableFloat GliderRedeployLateralVelocityMultiplierRow; // 0x3e98 (0x28)
	struct FScalableFloat GliderRedeployHeighLimitRow; // 0x3ec0 (0x28)
	struct FScalableFloat BalloonFallDamageThresholdVelocityZ; // 0x3ee8 (0x28)
	class UClass* PreDrivingAnimBP; // 0x3f10 (0x8)
	class UClass* CurrentVehicleAnimLayerOverlayClass; // 0x3f18 (0x8)
	class UClass* CurrentSwimmingAnimLayerOverlayClass; // 0x3f20 (0x8)
	class UClass* DefaultSwimmingAnimLayerOverlayClass; // 0x3f28 (0x8)
	unsigned char unreflected_3f30[0x8]; // 0x3f30 (0x8) 
	float TimeBeforeSwimmingLayerDeactivated; // 0x3f38 (0x4)
	unsigned char unreflected_3f3c[0x4]; // 0x3f3c (0x4) 
	class UFortLinkedAnimGraphComponent* LinkedAnimGraphComponent; // 0x3f40 (0x8)
	class UFortPlayerAnimationComponent* AnimationComponent; // 0x3f48 (0x8)
	class UAudioComponent* ParachuteAudioLoop; // 0x3f50 (0x8)
	float ParachuteAndSkydiveAudioFadeInTime; // 0x3f58 (0x4)
	float ParachuteAndSkydiveAudioFadeOutTime; // 0x3f5c (0x4)
	class UAudioComponent* SkydiveAudioLoop; // 0x3f60 (0x8)
	class USoundBase* SoundOnParachuteForcedOpen; // 0x3f68 (0x8)
	class USoundBase* SkydivingLoop1P; // 0x3f70 (0x8)
	class USoundBase* SkydivingLoop1PMetaSound; // 0x3f78 (0x8)
	class USoundBase* SkydivingLoop3P; // 0x3f80 (0x8)
	class USoundBase* ParachuteOpenLoop1P; // 0x3f88 (0x8)
	class USoundBase* ParachuteOpenLoop1PMetaSound; // 0x3f90 (0x8)
	class USoundBase* ParachuteOpenLoop3P; // 0x3f98 (0x8)
	class UAudioComponent* SwimmingAudioLoop; // 0x3fa0 (0x8)
	float SwimmingAudioFadeOutTime; // 0x3fa8 (0x4)
	float SwimmingAudioInterpSpeed; // 0x3fac (0x4)
	class USoundBase* SoundOnSwimmingLoop; // 0x3fb0 (0x8)
	unsigned char unreflected_3fb8[0x50]; // 0x3fb8 (0x50) 
	uint32_t RemoteViewData32; // 0x4008 (0x4)
	unsigned char unreflected_400c[0x14]; // 0x400c (0x14) 
	float LastQuickBarSwitchRequestTime; // 0x4020 (0x4)
	float CrouchStartTime; // 0x4024 (0x4)
	float CrouchEndTime; // 0x4028 (0x4)
	float CrouchLerpTime; // 0x402c (0x4)
	float MeleeAbilityCooldown; // 0x4030 (0x4)
	bool bDisallowInterrogation; // 0x4034 (0x1)
	bool bDisallowInterrogationOnNPC; // 0x4035 (0x1)
	bool bDisallowInterrogationCreative; // 0x4036 (0x1)
	unsigned char bHideBodyOnDeathRequested; // 0x4037 (0x1)
	struct TWeakObjectPtr<class AFortRemoteControlledPawnAthena> ControlledRCPawn; // 0x4038 (0x8)
	struct FRotator StoredControlRotation; // 0x4040 (0x18)
	unsigned char unreflected_4058[0x4]; // 0x4058 (0x4) 
	enum EFortFacialAnimTypes FacialTypeOverride; // 0x405c (0x1)
	unsigned char unreflected_405d[0x3]; // 0x405d (0x3) 
	float GhostModeExitStartTime; // 0x4060 (0x4)
	float GhostModeExitDuration; // 0x4064 (0x4)
	unsigned char unreflected_4068[0x138]; // 0x4068 (0x138) 
	struct TMap<struct FName, struct FFortPlayerPawnObjectReference> CachedReferencesByName; // 0x41a0 (0x50)
	bool bFXPlayDustOnMovement; // 0x41f0 (0x1)
	unsigned char unreflected_41f1[0x7]; // 0x41f1 (0x7) 
	class UParticleSystemComponent* PSCPlayerInWater; // 0x41f8 (0x8)
	class UParticleSystemComponent* PSCPlayerInWaterSurfaceSwimming; // 0x4200 (0x8)
	class UNiagaraSystem* NiagaraPlayerInWaterBasicAsset; // 0x4208 (0x8)
	class UNiagaraSystem* NiagaraPlayerInWaterSwimmingAsset; // 0x4210 (0x8)
	class UNiagaraSystem* NiagaraPlayerWaterHandSplashAsset; // 0x4218 (0x8)
	class UNiagaraSystem* NiagaraPlayerWaterFootSplashAsset; // 0x4220 (0x8)
	class UNiagaraSystem* NiagaraPlayerWaterLargePlayerSplashAsset; // 0x4228 (0x8)
	class UNiagaraSystem* NiagaraPlayerWaterBoostAsset; // 0x4230 (0x8)
	struct FName FootSplashLeftSocketName; // 0x4238 (0x4)
	struct FName FootSplashRightSocketName; // 0x423c (0x4)
	class UFXSystemComponent* NiagaraPlayerStandingInWater; // 0x4240 (0x8)
	class UFXSystemComponent* NiagaraPlayerSwimmingInWater; // 0x4248 (0x8)
	class UFXSystemComponent* NiagaraPlayerHandSplashInWater; // 0x4250 (0x8)
	class UFXSystemComponent* NiagaraPlayerFootSplashInWaterLeft; // 0x4258 (0x8)
	class UFXSystemComponent* NiagaraPlayerFootSplashInWaterRight; // 0x4260 (0x8)
	class UFXSystemComponent* NiagaraPlayerJumpSplashInWater; // 0x4268 (0x8)
	class UFXSystemComponent* NiagaraPlayerWaterBoost; // 0x4270 (0x8)
	unsigned char bWaterFootSplashActive; // 0x4278 (0x1)
	unsigned char bEnableWaterInteractionEffects; // 0x4278 (0x1)
	unsigned char unreflected_4279[0x7]; // 0x4279 (0x7) 
	class UAudioComponent* SlidingAudioComp; // 0x4280 (0x8)
	class USoundBase* SlidingIntensitySound3P; // 0x4288 (0x8)
	class USoundBase* SlidingIntensitySound1P; // 0x4290 (0x8)
	float SlideAudioIntensity; // 0x4298 (0x4)
	unsigned char unreflected_429c[0x4]; // 0x429c (0x4) 
	class UParticleSystemComponent* PSCPlayerSlideLand; // 0x42a0 (0x8)
	struct FMulticastInlineDelegate OnActivateAbility; // 0x42a8 (0x10)
	struct FMulticastInlineDelegate OnFiringRangedWeapon; // 0x42b8 (0x10)
	struct FScalableFloat ConsecutiveWeakSpotResourceBonus; // 0x42c8 (0x28)
	struct FScalableFloat LastHitWeakSpotResourceBonus; // 0x42f0 (0x28)
	unsigned char unreflected_4318[0x8]; // 0x4318 (0x8) 
	class UWidget* CustomInteractionWidget; // 0x4320 (0x8)
	unsigned char unreflected_4328[0x18]; // 0x4328 (0x18) 
	class UFortPawnComponent_Convert* ConvertComponent; // 0x4340 (0x8)
	class UFortActorComponent_Affiliation* AffiliationComponent; // 0x4348 (0x8)
	unsigned char unreflected_4350[0x1]; // 0x4350 (0x1) 
	unsigned char bUseViewRotationForCameraOrigin; // 0x4351 (0x1)
	unsigned char bCanUseDefaultPartsOnLateLoad; // 0x4351 (0x1)
	unsigned char padding_4352[0xe]; // 0x4352 (0xe)

	/* Functions */

	// Function /Script/FortniteGame.FortPlayerPawn.WhenCosmeticSpecificPartAppliedWithAnyStruct (Underlying native function: WhenCosmeticSpecificPartAppliedWithAnyStruct 0x5e4a5e0)
	void WhenCosmeticSpecificPartAppliedWithAnyStruct(struct FDelegate& Delegate, bool& SkipNullMesh, struct TEnumAsByte<EFortCustomPartType>& PartType, struct FDelegateHandleController& DelegateHandleControllerOut, struct FInstancedStruct& AnyStruct); // (Final | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortPlayerPawn.WhenCosmeticSpecificPartApplied (Underlying native function: WhenCosmeticSpecificPartApplied 0x11127b0)
	void WhenCosmeticSpecificPartApplied(struct FDelegate& Delegate, bool& SkipNullMesh, struct TEnumAsByte<EFortCustomPartType>& PartType, struct FDelegateHandleController& DelegateHandleControllerOut); // (Final | Native | Public | HasOutParms | BlueprintCallable)

