// Class /Script/FortniteGame.FortGameMode
// Size: 0x758
class AFortGameMode : public AFortGameModeBase
{
	unsigned char bDisableCloudStorage; // 0x3c8 (0x1)
	unsigned char bTravelInitiated; // 0x3c8 (0x1)
	unsigned char unreflected_3c9[0x7]; // 0x3c9 (0x7) 
	struct FString CurrentWUID; // 0x3d0 (0x10)
	struct FString CurrentBucketId; // 0x3e0 (0x10)
	int CurrentPlaylistId; // 0x3f0 (0x4)
	struct FName CurrentPlaylistName; // 0x3f4 (0x4)
	struct FString MatchmakingLinkCode; // 0x3f8 (0x10)
	struct FString MatchmakingLinkType; // 0x408 (0x10)
	unsigned char unreflected_418[0x10]; // 0x418 (0x10) 
	struct FString MatchmakingRegionId; // 0x428 (0x10)
	bool bUseLinkCodeHistory; // 0x438 (0x1)
	unsigned char unreflected_439[0x7]; // 0x439 (0x7) 
	struct FString CurrentZoneInstanceId; // 0x440 (0x10)
	unsigned char unreflected_450[0x4]; // 0x450 (0x4) 
	int ZoneIndex; // 0x454 (0x4)
	unsigned char bPlayersInvincible; // 0x458 (0x1)
	unsigned char unreflected_459[0x3]; // 0x459 (0x3) 
	bool bKickIdlers; // 0x45c (0x1)
	unsigned char unreflected_45d[0x3]; // 0x45d (0x3) 
	float MaxIdleTime; // 0x460 (0x4)
	float NoScoreKickTime; // 0x464 (0x4)
	bool bEnableNotifications; // 0x468 (0x1)
	bool bEnableReplicationGraph; // 0x469 (0x1)
	unsigned char unreflected_46a[0x6]; // 0x46a (0x6) 
	struct TWeakObjectPtr<class UFortGameDeathPenalty> DefaultDeathPenaltyData; // 0x470 (0x28)
	class UFortGameDeathPenalty* DeathPenaltyData; // 0x498 (0x8)
	class UFortGameDeathPenalty* DeathPenaltyDataOverride; // 0x4a0 (0x8)
	class AFortGameSession* FortGameSession; // 0x4a8 (0x8)
	struct FString GameModeSessionString; // 0x4b0 (0x10)
	unsigned char bIsAutomatedTest; // 0x4c0 (0x1)
	unsigned char unreflected_4c1[0x7]; // 0x4c1 (0x7) 
	struct TWeakObjectPtr<class UClass> DefaultPawnClassStringRef; // 0x4c8 (0x28)
	class UClass* MissionManagerClass; // 0x4f0 (0x8)
	struct FGameplayTagContainer GameModeGameplayTags; // 0x4f8 (0x20)
	unsigned char unreflected_518[0x18]; // 0x518 (0x18) 
	bool bContainersForceTossLoot; // 0x530 (0x1)
	unsigned char unreflected_531[0x17]; // 0x531 (0x17) 
	bool bOverrideRotationOnRestartPlayer; // 0x548 (0x1)
	struct TEnumAsByte<EFortGameplayState> PendingTimerState; // 0x549 (0x1)
	unsigned char unreflected_54a[0x6]; // 0x54a (0x6) 
	bool bDBNOEnabled; // 0x550 (0x1)
	unsigned char unreflected_551[0x3]; // 0x551 (0x3) 
	unsigned char bWorldIsReady; // 0x554 (0x1)
	unsigned char bTheaterDataIsReady; // 0x554 (0x1)
	unsigned char unreflected_555[0x3]; // 0x555 (0x3) 
	int TheaterSlot; // 0x558 (0x4)
	float GameplayServerHitchThreshold; // 0x55c (0x4)
	float MovementTimeDiscrepancyHitchCooldown; // 0x560 (0x4)
	float AbilityRefireHitchCooldown; // 0x564 (0x4)
	bool bCheckWeaponTracesForPlayerBuiltWalls; // 0x568 (0x1)
	unsigned char unreflected_569[0x7]; // 0x569 (0x7) 
	class UMatchHeartbeatManager* MatchHeartbeatManager; // 0x570 (0x8)
	unsigned char unreflected_578[0x10]; // 0x578 (0x10) 
	struct FGameplayTagContainer GameContextTags; // 0x588 (0x20)
	class UFortSharedMissionLists* SharedMissionLists; // 0x5a8 (0x8)
	unsigned char unreflected_5b0[0x18]; // 0x5b0 (0x18) 
	class UClass* TeamInfoClass; // 0x5c8 (0x8)
	struct TArray<double> FrameTimeWithoutSleepHistogramBucketsMs; // 0x5d0 (0x10)
	struct TArray<struct FCumulativeFrameTimeWithoutSleepLimits> CumulativeFrameTimeWithoutSleepLimits; // 0x5e0 (0x10)
	struct TArray<double> GameNetDriverTickFlushCostPerClientBucketsMicroSec; // 0x5f0 (0x10)
	struct TArray<double> DemoNetDriverTickFlushTimeHistogramBucketsMs; // 0x600 (0x10)
	struct TArray<double> CPUTimeBuckets; // 0x610 (0x10)
	struct TArray<double> CPUPercentPerCoreBuckets; // 0x620 (0x10)
	struct TArray<double> ActorsStarvedByClassTimeHistogramBuckets; // 0x630 (0x10)
	struct TArray<struct FString> StarvedActorClassList; // 0x640 (0x10)
	unsigned char unreflected_650[0x18]; // 0x650 (0x18) 
	class AFortMissionGenerationManager* MissionGenerationManager; // 0x668 (0x8)
	class UBuildingFlushManager* FlushManager; // 0x670 (0x8)
	unsigned char unreflected_678[0x38]; // 0x678 (0x38) 
	bool bAlwaysFlushMMREndZoneEvents; // 0x6b0 (0x1)
	bool bOverrideQuickBars; // 0x6b1 (0x1)
	unsigned char unreflected_6b2[0x6]; // 0x6b2 (0x6) 
	struct FQuickBarData QuickBarDefinitions[0x3]; // 0x6b8 (0x10) (ARRAY) 
	unsigned char unreflected_6e8[0x58]; // 0x6e8 (0x58) 
	struct TArray<class AFortPlayerControllerGameplay*> ConnectedPlayerControllers; // 0x740 (0x10)
	unsigned char padding_750[0x8]; // 0x750 (0x8)

	/* Functions */

	// Function /Script/FortniteGame.FortGameMode.OnEndOfDay (Underlying native function: OnEndOfDay 0x88dfc44)
	void OnEndOfDay(); // (Native | Public)

	// Function /Script/FortniteGame.FortGameMode.DumpReservations (Underlying native function: DumpReservations 0x88df018)
	void DumpReservations(); // (Exec | Native | Public | Const)
};

