// Class /Script/FortniteGame.FortWeapon
// Size: 0x1040
class AFortWeapon : public AActor
{
	unsigned char unreflected_288[0x28]; // 0x288 (0x28) 
	struct FMulticastInlineDelegate OnWeaponRateOfFireChanged; // 0x2b0 (0x10)
	unsigned char unreflected_2c0[0x18]; // 0x2c0 (0x18) 
	struct FMulticastInlineDelegate OnPressTrigger; // 0x2d8 (0x10)
	struct FMulticastInlineDelegate OnReleaseTrigger; // 0x2e8 (0x10)
	unsigned char unreflected_2f8[0x20]; // 0x2f8 (0x20) 
	float TimeToEquip; // 0x318 (0x4)
	unsigned char unreflected_31c[0xc]; // 0x31c (0xc) 
	bool bIsEquippingWeapon; // 0x328 (0x1)
	bool bIsReloadingWeapon; // 0x329 (0x1)
	bool bIsChargingWeapon; // 0x32a (0x1)
	bool bDisableEquipAnimation; // 0x32b (0x1)
	unsigned char unreflected_32c[0x1]; // 0x32c (0x1) 
	bool bIsAimingConsumable; // 0x32d (0x1)
	unsigned char unreflected_32e[0x22]; // 0x32e (0x22) 
	struct FMulticastInlineDelegate OnLocalAmmoChanged; // 0x350 (0x10)
	struct FMulticastInlineDelegate OnLocalReloadStarted; // 0x360 (0x10)
	struct FMulticastInlineDelegate OnLocalReloadCancelled; // 0x370 (0x10)
	struct FMulticastInlineDelegate OnLocalTargetingChanged; // 0x380 (0x10)
	struct FMulticastInlineDelegate OnSecondaryAbilityToggled; // 0x390 (0x10)
	struct FMulticastInlineDelegate OnWeaponFireAudioVisuals; // 0x3a0 (0x10)
	unsigned char unreflected_3b0[0x8]; // 0x3b0 (0x8) 
	struct FMulticastInlineDelegate OnConsumeAmmo; // 0x3b8 (0x10)
	struct FMulticastInlineDelegate OnReticleColorChanged; // 0x3c8 (0x10)
	unsigned char unreflected_3d8[0x14]; // 0x3d8 (0x14) 
	bool bUseAttributeCaching; // 0x3ec (0x1)
	unsigned char unreflected_3ed[0x3]; // 0x3ed (0x3) 
	class UFortWeaponItemDefinition* WeaponData; // 0x3f0 (0x8)
	class UFortWeaponItemDefinition* CosmeticOverrideWeaponData; // 0x3f8 (0x8)
	bool bImpactFXAttachedToHitActor; // 0x400 (0x1)
	unsigned char unreflected_401[0x7]; // 0x401 (0x7) 
	struct TArray<struct FFortGameplayAbilityBehaviorDistanceData> GameplayAbilityBehaviorDistanceData; // 0x408 (0x10)
	class UWeaponHitNotifyAudioBank* HitNotifyAudioBank; // 0x418 (0x8)
	unsigned char unreflected_420[0x18]; // 0x420 (0x18) 
	bool bRemoveAbilitiesWhenRemovedFromInventory; // 0x438 (0x1)
	enum EFortWeaponAbilityRemovalPolicy GrantedAbilityRemovalPolicy[0x3]; // 0x439 (0x1) (ARRAY) 
	unsigned char unreflected_43c[0x44]; // 0x43c (0x44) 
	unsigned char EquippedWeaponDestroyWrapperRepCounter; // 0x480 (0x1)
	unsigned char unreflected_481[0x37]; // 0x481 (0x37) 
	struct FMulticastInlineDelegate OnPlayImpactFXDelegate; // 0x4b8 (0x10)
	unsigned char unreflected_4c8[0x98]; // 0x4c8 (0x98) 
	float PersistentFXStartTime; // 0x560 (0x4)
	float MinimumTimeForPersistentFX; // 0x564 (0x4)
	struct TWeakObjectPtr<class UAthenaItemWrapDefinition> OverrideItemWrapSoftPtr; // 0x568 (0x28)
	unsigned char unreflected_590[0x10]; // 0x590 (0x10) 
	enum EFortWeaponReduceMeshWorkSetting WeaponReduceMeshWorkSetting; // 0x5a0 (0x1)
	bool bWeaponSupportsQuartzGunfire; // 0x5a1 (0x1)
	unsigned char unreflected_5a2[0x6]; // 0x5a2 (0x6) 
	class UFortQuartzGunfireComponent* QuartzGunfireComp; // 0x5a8 (0x8)
	bool bShouldDrawNativeReticle; // 0x5b0 (0x1)
	bool bShouldForceCheckCollisions; // 0x5b1 (0x1)
	unsigned char unreflected_5b2[0x6]; // 0x5b2 (0x6) 
	class UTexture2D* ReticleImage; // 0x5b8 (0x8)
	class UTexture2D* AutoFireReticleImage; // 0x5c0 (0x8)
	struct FColor ReticleDefaultColor; // 0x5c8 (0x4)
	struct FColor ReticleEnemyColor; // 0x5cc (0x4)
	struct FColor ReticleBuildingColor; // 0x5d0 (0x4)
	struct FColor ReticleNoTargetColor; // 0x5d4 (0x4)
	class UTexture2D* HitNotifyReticleImage; // 0x5d8 (0x8)
	class UTexture2D* HitNotifyLocationReticleImage; // 0x5e0 (0x8)
	class UTexture2D* CriticalHitNotifyLocationReticleImage; // 0x5e8 (0x8)
	class UTexture2D* ReticleCenterImage; // 0x5f0 (0x8)
	class UTexture2D* ReticleCenterPerfectAimImage; // 0x5f8 (0x8)
	class UTexture2D* ReticleInvalidTargetImage; // 0x600 (0x8)
	class UTexture2D* MuzzleBlockedReticleImage; // 0x608 (0x8)
	class UTexture2D* ReticleAltCenterImage; // 0x610 (0x8)
	class UTexture2D* ReticleOuterImage; // 0x618 (0x8)
	class UTexture2D* ReticleAltOuterImage; // 0x620 (0x8)
	float ReticleDefaultPrimaryStrikeAngle; // 0x628 (0x4)
	float ReticleDefaultSecondaryStrikeAngle; // 0x62c (0x4)
	bool bSupportsAutofireAtReticleTarget; // 0x630 (0x1)
	bool bSupportsTapToFireMode; // 0x631 (0x1)
	unsigned char unreflected_632[0x6]; // 0x632 (0x6) 
	class UClass* CameraBase3PClass; // 0x638 (0x8)
	class UClass* CameraTargeting3PClass; // 0x640 (0x8)
	class UClass* CameraTargeting3PReloadClass; // 0x648 (0x8)
	class UClass* CameraBase1PClass; // 0x650 (0x8)
	class UClass* CameraTargeting1PClass; // 0x658 (0x8)
	class USoundBase* DestroyedSound; // 0x660 (0x8)
	class USoundBase* OutOfAmmoSound; // 0x668 (0x8)
	class USoundBase* ReloadSounds[0x3]; // 0x670 (0x8) (ARRAY) 
	class USoundBase* PrimaryFireSound1P; // 0x688 (0x8)
	class USoundBase* PrimaryFireSound[0x3]; // 0x690 (0x8) (ARRAY) 
	class USoundBase* PrimaryFireStopSound1P; // 0x6a8 (0x8)
	class USoundBase* PrimaryFireStopSound[0x3]; // 0x6b0 (0x8) (ARRAY) 
	class USoundBase* SecondaryFireSound[0x3]; // 0x6c8 (0x8) (ARRAY) 
	class USoundBase* SecondaryFireStopSound[0x3]; // 0x6e0 (0x8) (ARRAY) 
	class USoundBase* ChargeFireSound1P[0x3]; // 0x6f8 (0x8) (ARRAY) 
	class USoundBase* ChargeFireSound[0x3]; // 0x710 (0x8) (ARRAY) 
	class USoundBase* TargetingStartSound; // 0x728 (0x8)
	class USoundBase* TargetingEndSound; // 0x730 (0x8)
	float PrimaryFireSoundFadeOutTime; // 0x738 (0x4)
	unsigned char unreflected_73c[0x4]; // 0x73c (0x4) 
	class USoundBase* ImpactPhysicalSurfaceSounds[0x1e]; // 0x740 (0x8) (ARRAY) 
	unsigned char unreflected_830[0x8]; // 0x830 (0x8) 
	class UParticleSystem* ImpactPhysicalSurfaceEffects[0x1e]; // 0x838 (0x8) (ARRAY) 
	struct TArray<class UNiagaraSystem*> ImpactNiagaraPhysicalSurfaceEffectAssets; // 0x928 (0x10)
	class UClass* ImpactCameraShake; // 0x938 (0x8)
	class UForceFeedbackEffect* PrimaryForceFeedbackEffect; // 0x940 (0x8)
	class UForceFeedbackEffect* SecondaryForceFeedbackEffect; // 0x948 (0x8)
	class UForceFeedbackEffect* PrimaryImpactForceFeedbackEffect; // 0x950 (0x8)
	class UForceFeedbackEffect* SecondaryImpactForceFeedbackEffect; // 0x958 (0x8)
	struct TArray<class UNiagaraSystem*> ImpactNiagaraPhysicalSurfaceEffectInstances; // 0x960 (0x10)
	class UFortGenericDataStoreManagerComponent* DataStoreManager; // 0x970 (0x8)
	class UAudioComponent* FireAudioChannels[0x4]; // 0x978 (0x8) (ARRAY) 
	class UAudioComponent* ReloadAudioChannels[0x3]; // 0x998 (0x8) (ARRAY) 
	class UAudioComponent* TargetingAudioChannels[0x2]; // 0x9b0 (0x8) (ARRAY) 
	class UFortSoundIndicatorComponent* SoundIndicatorComponent; // 0x9c0 (0x8)
	int CurrentGunFireIndex; // 0x9c8 (0x4)
	unsigned char unreflected_9cc[0x4]; // 0x9cc (0x4) 
	class USkeletalMeshComponentBudgeted* WeaponMesh; // 0x9d0 (0x8)
	struct TArray<class USkeletalMeshComponentBudgeted*> AllWeaponMeshes; // 0x9d8 (0x10)
	struct TArray<class UMaterialInterface*> DefaultWeaponMaterials; // 0x9e8 (0x10)
	struct TMap<class USkeletalMeshComponentBudgeted*, struct FMaterialInterfaceArray> OriginalMaterialMap; // 0x9f8 (0x50)
	int FireAudioChannelWantsToPlay[0x4]; // 0xa48 (0x4) (ARRAY) 
	int WrapSectionMask; // 0xa58 (0x4)
	bool bUsingSecondaryFireAudio; // 0xa5c (0x1)
	bool bHasCachedAdditionalMeshes; // 0xa5d (0x1)
	unsigned char unreflected_a5e[0x2]; // 0xa5e (0x2) 
	struct FColor CurrentReticleColor; // 0xa60 (0x4)
	unsigned char unreflected_a64[0x4]; // 0xa64 (0x4) 
	struct FVector CurrentDamageStartLocation; // 0xa68 (0x18)
	struct FVector CurrentAdjustedAimDirection; // 0xa80 (0x18)
	struct FFortEffectDistanceQuality FireFXSignificance; // 0xa98 (0x18)
	float LastFireTime; // 0xab0 (0x4)
	float LastFireTimeVerified; // 0xab4 (0x4)
	bool bIsPlayingFireFX; // 0xab8 (0x1)
	bool bFireFXTriggered; // 0xab9 (0x1)
	bool bWeaponFireCustomAudioTriggered; // 0xaba (0x1)
	unsigned char unreflected_abb[0x1]; // 0xabb (0x1) 
	float TimerIntervalAdjustment; // 0xabc (0x4)
	float InputQueueTimePercent; // 0xac0 (0x4)
	bool bAllowTargeting; // 0xac4 (0x1)
	bool bIsTargeting; // 0xac5 (0x1)
	unsigned char unreflected_ac6[0x2]; // 0xac6 (0x2) 
	float LastTargetingTransitionTime; // 0xac8 (0x4)
	unsigned char unreflected_acc[0x4]; // 0xacc (0x4) 
	struct FVector TargetSourceOffset; // 0xad0 (0x18)
	struct FVector TargetSourceOffsetWhileCrouched; // 0xae8 (0x18)
	struct FVector TargetSourceOffsetWhileTargeting; // 0xb00 (0x18)
	bool bTraceThroughPawns; // 0xb18 (0x1)
	bool bTraceThroughWorld; // 0xb19 (0x1)
	unsigned char unreflected_b1a[0x2]; // 0xb1a (0x2) 
	int TraceThroughPawnsLimit; // 0xb1c (0x4)
	int TraceThroughBuildingsLimit; // 0xb20 (0x4)
	int TraceThroughLandscapeLimit; // 0xb24 (0x4)
	bool bUseProjectileTrace; // 0xb28 (0x1)
	bool bUseVariableFocalDistanceTargeting; // 0xb29 (0x1)
	bool bUseWeaponTraceForReticle; // 0xb2a (0x1)
	unsigned char unreflected_b2b[0x1]; // 0xb2b (0x1) 
	float ProjectilePitchOffset; // 0xb2c (0x4)
	float LastReloadTime; // 0xb30 (0x4)
	float LastSuccessfulReloadTime; // 0xb34 (0x4)
	float CurrentReloadDuration; // 0xb38 (0x4)
	unsigned char unreflected_b3c[0x4]; // 0xb3c (0x4) 
	struct FGuid ItemEntryGuid; // 0xb40 (0x10)
	struct FGuid TrackerGuid; // 0xb50 (0x10)
	int WeaponLevel; // 0xb60 (0x4)
	int AmmoCount; // 0xb64 (0x4)
	int PhantomReserveAmmo; // 0xb68 (0x4)
	unsigned char unreflected_b6c[0x8]; // 0xb6c (0x8) 
	int BurstFireCounter; // 0xb74 (0x4)
	float ChargeTime; // 0xb78 (0x4)
	float AccumulatedChargeTime; // 0xb7c (0x4)
	float LastChargeTime; // 0xb80 (0x4)
	struct FGameplayTag StartChargeGameplayCue; // 0xb84 (0x4)
	struct FGameplayTag MaxChargeGameplayCue; // 0xb88 (0x4)
	struct FGameplayTag OutOfAmmoTextOverrideFailTag; // 0xb8c (0x4)
	struct FGameplayTag NoSpareAmmoToReloadTextOverrideFailTag; // 0xb90 (0x4)
	unsigned char unreflected_b94[0x4]; // 0xb94 (0x4) 
	struct FGameplayTagQuery FireCanInterruptEquipQuery; // 0xb98 (0x48)
	int CurrentShotLogIndex; // 0xbe0 (0x4)
	unsigned char unreflected_be4[0x4]; // 0xbe4 (0x4) 
	struct TArray<uint32_t> ShotLogFlags; // 0xbe8 (0x10)
	unsigned char bInitializedWeaponItem; // 0xbf8 (0x1)
	unsigned char bPendingDestroyDueToDurabilityOrStackCount; // 0xbf8 (0x1)
	unsigned char bCompletedAppliedAlterationsLoad; // 0xbf9 (0x1)
	unsigned char bCompletedWeaponLoad; // 0xbf9 (0x1)
	unsigned char bIsCosmeticLimited; // 0xbf9 (0x1)
	unsigned char bReplicatedAppliedAlterationsWithNoInstigator; // 0xbf9 (0x1)
	unsigned char bShouldFullyApplyVariantsOnEquip; // 0xbf9 (0x1)
	unsigned char bSecondaryFireAlwaysCancelSwimSprint; // 0xbf9 (0x1)
	unsigned char bEnableNativeChargeUp; // 0xbfa (0x1)
	unsigned char bShowWhenHolstered; // 0xbfa (0x1)
	unsigned char unreflected_bfb[0x1]; // 0xbfb (0x1) 
	int16_t ChargeStatusPack; // 0xbfc (0x2)
	unsigned char unreflected_bfe[0xe]; // 0xbfe (0xe) 
	struct TWeakObjectPtr<class AFortProjectileTrajectory> AttachedTrajectoryIndicator; // 0xc0c (0x8)
	unsigned char unreflected_c14[0x4]; // 0xc14 (0x4) 
	class UFortGameplayAbility* ActiveAbility; // 0xc18 (0x8)
	struct FGameplayAbilitySpecHandle PrimaryAbilitySpecHandle; // 0xc20 (0x4)
	struct FGameplayAbilitySpecHandle SecondaryAbilitySpecHandle; // 0xc24 (0x4)
	struct FGameplayAbilitySpecHandle ReloadAbilitySpecHandle; // 0xc28 (0x4)
	struct FGameplayAbilitySpecHandle ImpactAbilitySpecHandle; // 0xc2c (0x4)
	struct FGameplayAbilitySpecHandle ReticleTraceOverrideSpecHandle; // 0xc30 (0x4)
	unsigned char unreflected_c34[0x4]; // 0xc34 (0x4) 
	struct TArray<struct FGameplayAbilitySpecHandle> EquippedAbilityHandles; // 0xc38 (0x10)
	struct TArray<struct FFortAbilitySetHandle> EquippedAbilitySetHandles; // 0xc48 (0x10)
	struct TArray<class UFortAlterationItemDefinition*> AppliedAlterations; // 0xc58 (0x10)
	struct TArray<struct FFortWeaponModSlot> WeaponModSlots; // 0xc68 (0x10)
	struct TArray<struct FFortEquippedWeaponModSlot> EquippedWeaponModSlots; // 0xc78 (0x10)
	struct FCosmeticVariantCache PreviousWeaponVariants; // 0xc88 (0x18)
	unsigned char unreflected_ca0[0x20]; // 0xca0 (0x20) 
	class UAthenaItemWrapDefinition* AppliedItemWrap; // 0xcc0 (0x8)
	class AFortFXManager* CachedFXManager; // 0xcc8 (0x8)
	class UFortSignificanceManager* CachedSignificanceManager; // 0xcd0 (0x8)
	struct FName MuzzleSocketName; // 0xcd8 (0x4)
	struct FName MuzzleFalloffSocketName; // 0xcdc (0x4)
	struct FName WeaponHandSocketNameOverride; // 0xce0 (0x4)
	struct FName LeftHandWeaponHandSocketNameOverride; // 0xce4 (0x4)
	struct TArray<struct TEnumAsByte<EFortCustomPartType>> WeaponHandSocketPartOverrides; // 0xce8 (0x10)
	unsigned char unreflected_cf8[0x8]; // 0xcf8 (0x8) 
	unsigned char bForceOverrideGenerateOverlapEvents; // 0xd00 (0x1)
	unsigned char unreflected_d01[0xeb]; // 0xd01 (0xeb) 
	float MaxWeaponSwitchNetworkWaitTime; // 0xdec (0x4)
	float LastFireAbilityTime; // 0xdf0 (0x4)
	unsigned char unreflected_df4[0x2c]; // 0xdf4 (0x2c) 
	struct FDelegate OnGetAimRotOverride; // 0xe20 (0xc)
	unsigned char unreflected_e2c[0x4]; // 0xe2c (0x4) 
	class UAnimMontage* EquipAnimation; // 0xe30 (0x8)
	class UAnimMontage* ReloadAnimation; // 0xe38 (0x8)
	struct TArray<class UAnimMontage*> CustomReloadAnimationPerAmmoToFill; // 0xe40 (0x10)
	class UAnimMontage* PrimaryAbilityAnimation; // 0xe50 (0x8)
	class UAnimMontage* SecondaryAbilityAnimation; // 0xe58 (0x8)
	class UAnimMontage* WeaponEquipMontage; // 0xe60 (0x8)
	class UAnimMontage* WeaponReloadMontage; // 0xe68 (0x8)
	struct TArray<class UAnimMontage*> CustomWeaponReloadMontagePerAmmoToFill; // 0xe70 (0x10)
	class UAnimMontage* WeaponPrimaryAbilityMontage; // 0xe80 (0x8)
	class UAnimMontage* WeaponSecondaryAbilityMontage; // 0xe88 (0x8)
	class UFortWeaponFirstPersonData* FirstPersonData; // 0xe90 (0x8)
	class UAnimSequence* PoseOffsetAnimSequence; // 0xe98 (0x8)
	class UAnimSequence* PoseOffsetAnimSequenceFemaleOverride; // 0xea0 (0x8)
	struct TEnumAsByte<EFortWeaponCoreAnimation> WeaponCoreAnimation; // 0xea8 (0x1)
	struct TEnumAsByte<EFortWeaponCoreAnimation> WeaponCoreAnimationOverride; // 0xea9 (0x1)
	unsigned char unreflected_eaa[0x6]; // 0xeaa (0x6) 
	class UFortWeaponAnimSet* WeaponPawnAnimSet; // 0xeb0 (0x8)
	struct FFortPlayerAnimAssets PlayerAnimAssets; // 0xeb8 (0x20)
	class UClass* WeaponPawnAnimLayerOverlayClass; // 0xed8 (0x8)
	class UFortWeaponAdditiveAnimSet* WeaponAdditiveAnimSet; // 0xee0 (0x8)
	class UFortWeaponAnimSet* WeaponPawnAnimsetOverride; // 0xee8 (0x8)
	unsigned char unreflected_ef0[0x30]; // 0xef0 (0x30) 
	class UAnimMontage* UnableToPerformActionMontageOverride; // 0xf20 (0x8)
	struct TWeakObjectPtr<class UFortWeaponFireModeData> ActiveFireMode; // 0xf28 (0x28)
	struct TWeakObjectPtr<class UFortWeaponFireModeData> FireModeDataHipFire; // 0xf50 (0x28)
	struct TWeakObjectPtr<class UFortWeaponFireModeData> FireModeDataAimDownSight; // 0xf78 (0x28)
	struct TWeakObjectPtr<class UFortWeaponFireModeData> FireModeDataOverride; // 0xfa0 (0x28)
	unsigned char unreflected_fc8[0x10]; // 0xfc8 (0x10) 
	class ACustomItemWrapModifier* ItemWrapModifier; // 0xfd8 (0x8)
	unsigned char unreflected_fe0[0x18]; // 0xfe0 (0x18) 
	class AActor* LockOnTargetCandidate; // 0xff8 (0x8)
	unsigned char unreflected_1000[0x1]; // 0x1000 (0x1) 
	bool bIgnoreTryToFireSlotCooldownRestriction; // 0x1001 (0x1)
	unsigned char unreflected_1002[0x1]; // 0x1002 (0x1) 
	bool bFireConsumableAnalyticEvent; // 0x1003 (0x1)
	unsigned char unreflected_1004[0x4]; // 0x1004 (0x4) 
	struct FMulticastInlineDelegate OnWeaponHudKeyActionUpdated; // 0x1008 (0x10)
	struct TArray<struct FWeaponHudData> HudKeyActionData; // 0x1018 (0x10)
	unsigned char padding_1028[0x18]; // 0x1028 (0x18)

	/* Functions */

	// Function /Script/FortniteGame.FortWeapon.WeaponDataIsValid (Underlying native function: WeaponDataIsValid 0x90434d0)
	bool WeaponDataIsValid(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortWeapon.WeaponDataHasMatchingGameplayTag (Underlying native function: WeaponDataHasMatchingGameplayTag 0x9043444)
	bool WeaponDataHasMatchingGameplayTag(struct FGameplayTag& TagToCheck); // (Final | 0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortWeapon.WeaponDataHasAnyMatchingGameplayTags (Underlying native function: WeaponDataHasAnyMatchingGameplayTags 0x9043378)
	bool WeaponDataHasAnyMatchingGameplayTags(struct FGameplayTagContainer& TagContainer); // (Final | 0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)

