// Class /Script/Engine.GameNetworkManager
// Size: 0x330
class AGameNetworkManager : public AInfo
{
	float BadPacketLossThreshold; // 0x288 (0x4)
	float SeverePacketLossThreshold; // 0x28c (0x4)
	int BadPingThreshold; // 0x290 (0x4)
	int SeverePingThreshold; // 0x294 (0x4)
	int AdjustedNetSpeed; // 0x298 (0x4)
	float LastNetSpeedUpdateTime; // 0x29c (0x4)
	int TotalNetBandwidth; // 0x2a0 (0x4)
	int MinDynamicBandwidth; // 0x2a4 (0x4)
	int MaxDynamicBandwidth; // 0x2a8 (0x4)
	unsigned char bIsStandbyCheckingEnabled; // 0x2ac (0x1)
	unsigned char bHasStandbyCheatTriggered; // 0x2ac (0x1)
	unsigned char unreflected_2ad[0x3]; // 0x2ad (0x3) 
	float StandbyRxCheatTime; // 0x2b0 (0x4)
	float StandbyTxCheatTime; // 0x2b4 (0x4)
	float PercentMissingForRxStandby; // 0x2b8 (0x4)
	float PercentMissingForTxStandby; // 0x2bc (0x4)
	float PercentForBadPing; // 0x2c0 (0x4)
	float JoinInProgressStandbyWaitTime; // 0x2c4 (0x4)
	float MoveRepSize; // 0x2c8 (0x4)
	float MAXPOSITIONERRORSQUARED; // 0x2cc (0x4)
	float MAXNEARZEROVELOCITYSQUARED; // 0x2d0 (0x4)
	float CLIENTADJUSTUPDATECOST; // 0x2d4 (0x4)
	float MAXCLIENTUPDATEINTERVAL; // 0x2d8 (0x4)
	float MaxClientForcedUpdateDuration; // 0x2dc (0x4)
	float ServerForcedUpdateHitchThreshold; // 0x2e0 (0x4)
	float ServerForcedUpdateHitchCooldown; // 0x2e4 (0x4)
	float MaxMoveDeltaTime; // 0x2e8 (0x4)
	float MaxClientSmoothingDeltaTime; // 0x2ec (0x4)
	float ClientNetSendMoveDeltaTime; // 0x2f0 (0x4)
	float ClientNetSendMoveDeltaTimeThrottled; // 0x2f4 (0x4)
	float ClientNetSendMoveDeltaTimeStationary; // 0x2f8 (0x4)
	int ClientNetSendMoveThrottleAtNetSpeed; // 0x2fc (0x4)
	int ClientNetSendMoveThrottleOverPlayerCount; // 0x300 (0x4)
	float ClientErrorUpdateRateLimit; // 0x304 (0x4)
	float ClientNetCamUpdateDeltaTime; // 0x308 (0x4)
	float ClientNetCamUpdatePositionLimit; // 0x30c (0x4)
	bool ClientAuthorativePosition; // 0x310 (0x1)
	bool bMovementTimeDiscrepancyDetection; // 0x311 (0x1)
	bool bMovementTimeDiscrepancyResolution; // 0x312 (0x1)
	unsigned char unreflected_313[0x1]; // 0x313 (0x1) 
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x314 (0x4)
	float MovementTimeDiscrepancyMinTimeMargin; // 0x318 (0x4)
	float MovementTimeDiscrepancyResolutionRate; // 0x31c (0x4)
	float MovementTimeDiscrepancyDriftAllowance; // 0x320 (0x4)
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x324 (0x1)
	bool bUseDistanceBasedRelevancy; // 0x325 (0x1)
	unsigned char padding_326[0xa]; // 0x326 (0xa)
};

