// Class /Script/FortniteGame.GameplayCueNotify_BaconSnack_State
// Size: 0x990
class AGameplayCueNotify_BaconSnack_State : public AFortGameplayCueNotify_Loop
{
	class AFortPlayerPawn* PlayerPawn; // 0x960 (0x8)
	int MeshDataIndex; // 0x968 (0x4)
	unsigned char unreflected_96c[0x4]; // 0x96c (0x4) 
	class UStaticMeshComponent* Mesh; // 0x970 (0x8)
	float StealthMeter; // 0x978 (0x4)
	float StealthMeterTime; // 0x97c (0x4)
	unsigned char unreflected_980[0x8]; // 0x980 (0x8) 
	class UFortAthenaAlertStateComponent* CachedAlertStateComp; // 0x988 (0x8)
};

