// Class /Script/GeometryCollectionEngine.GeometryCollectionDebugDrawActor
// Size: 0x348
class AGeometryCollectionDebugDrawActor : public AActor
{
	struct FGeometryCollectionDebugDrawWarningMessage WarningMessage; // 0x288 (0x1)
	unsigned char unreflected_289[0x7]; // 0x289 (0x7) 
	struct FGeometryCollectionDebugDrawActorSelectedRigidBody SelectedRigidBody; // 0x290 (0x18)
	bool bDebugDrawWholeCollection; // 0x2a8 (0x1)
	bool bDebugDrawHierarchy; // 0x2a9 (0x1)
	bool bDebugDrawClustering; // 0x2aa (0x1)
	enum EGeometryCollectionDebugDrawActorHideGeometry HideGeometry; // 0x2ab (0x1)
	bool bShowRigidBodyId; // 0x2ac (0x1)
	bool bShowRigidBodyCollision; // 0x2ad (0x1)
	bool bCollisionAtOrigin; // 0x2ae (0x1)
	bool bShowRigidBodyTransform; // 0x2af (0x1)
	bool bShowRigidBodyInertia; // 0x2b0 (0x1)
	bool bShowRigidBodyVelocity; // 0x2b1 (0x1)
	bool bShowRigidBodyForce; // 0x2b2 (0x1)
	bool bShowRigidBodyInfos; // 0x2b3 (0x1)
	bool bShowTransformIndex; // 0x2b4 (0x1)
	bool bShowTransform; // 0x2b5 (0x1)
	bool bShowParent; // 0x2b6 (0x1)
	bool bShowLevel; // 0x2b7 (0x1)
	bool bShowConnectivityEdges; // 0x2b8 (0x1)
	bool bShowGeometryIndex; // 0x2b9 (0x1)
	bool bShowGeometryTransform; // 0x2ba (0x1)
	bool bShowBoundingBox; // 0x2bb (0x1)
	bool bShowFaces; // 0x2bc (0x1)
	bool bShowFaceIndices; // 0x2bd (0x1)
	bool bShowFaceNormals; // 0x2be (0x1)
	bool bShowSingleFace; // 0x2bf (0x1)
	int SingleFaceIndex; // 0x2c0 (0x4)
	bool bShowVertices; // 0x2c4 (0x1)
	bool bShowVertexIndices; // 0x2c5 (0x1)
	bool bShowVertexNormals; // 0x2c6 (0x1)
	bool bUseActiveVisualization; // 0x2c7 (0x1)
	float PointThickness; // 0x2c8 (0x4)
	float LineThickness; // 0x2cc (0x4)
	bool bTextShadow; // 0x2d0 (0x1)
	unsigned char unreflected_2d1[0x3]; // 0x2d1 (0x3) 
	float TextScale; // 0x2d4 (0x4)
	float NormalScale; // 0x2d8 (0x4)
	float AxisScale; // 0x2dc (0x4)
	float ArrowScale; // 0x2e0 (0x4)
	struct FColor RigidBodyIdColor; // 0x2e4 (0x4)
	float RigidBodyTransformScale; // 0x2e8 (0x4)
	struct FColor RigidBodyCollisionColor; // 0x2ec (0x4)
	struct FColor RigidBodyInertiaColor; // 0x2f0 (0x4)
	struct FColor RigidBodyVelocityColor; // 0x2f4 (0x4)
	struct FColor RigidBodyForceColor; // 0x2f8 (0x4)
	struct FColor RigidBodyInfoColor; // 0x2fc (0x4)
	struct FColor TransformIndexColor; // 0x300 (0x4)
	float TransformScale; // 0x304 (0x4)
	struct FColor LevelColor; // 0x308 (0x4)
	struct FColor ParentColor; // 0x30c (0x4)
	float ConnectivityEdgeThickness; // 0x310 (0x4)
	struct FColor GeometryIndexColor; // 0x314 (0x4)
	float GeometryTransformScale; // 0x318 (0x4)
	struct FColor BoundingBoxColor; // 0x31c (0x4)
	struct FColor FaceColor; // 0x320 (0x4)
	struct FColor FaceIndexColor; // 0x324 (0x4)
	struct FColor FaceNormalColor; // 0x328 (0x4)
	struct FColor SingleFaceColor; // 0x32c (0x4)
	struct FColor VertexColor; // 0x330 (0x4)
	struct FColor VertexIndexColor; // 0x334 (0x4)
	struct FColor VertexNormalColor; // 0x338 (0x4)
	unsigned char unreflected_33c[0x4]; // 0x33c (0x4) 
	class UBillboardComponent* SpriteComponent; // 0x340 (0x8)
};

