// BlueprintGeneratedClass /Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Parent.NPC_Pawn_Parent_C
// Size: 0x3aa8
class ANPC_Pawn_Parent_C : public AFortAIPawn
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x3300 (0x8)
	class UFortPawnComponent_CustomDepth* FortPawnComponentCustomDepth; // 0x3308 (0x8)
	class UCapsuleComponent* WeaponCapsuleCollision; // 0x3310 (0x8)
	class UFortTaggedNavFiltersComponent* FortTaggedNavFilters; // 0x3318 (0x8)
	class UFortActorComponent_Affiliation* FortActorComponentAffiliation; // 0x3320 (0x8)
	class USoundLibraryComponent* SoundLibraryComponent; // 0x3328 (0x8)
	class UAudioComponent* MovementAudioComponent; // 0x3330 (0x8)
	class UNPC_VoiceComponent_C* NPCVoiceComponent; // 0x3338 (0x8)
	class UAudioComponent* VOAudioComponent; // 0x3340 (0x8)
	class UFortWidgetComponent* NPCStatusWidget; // 0x3348 (0x8)
	float TimelineScaleMeshInOrOutMeshScaleAlpha9DAAC0B243D26E4160CEC3A458AE0E86; // 0x3350 (0x4)
	struct TEnumAsByte<ETimelineDirection> TimelineScaleMeshInOrOutDirection9DAAC0B243D26E4160CEC3A458AE0E86; // 0x3354 (0x1)
	unsigned char unreflected_3355[0x3]; // 0x3355 (0x3) 
	class UTimelineComponent* TimelineScaleMeshInOrOut; // 0x3358 (0x8)
	class UClass* GENPCRecentlyDamaged; // 0x3360 (0x8)
	struct TEnumAsByte<Enum_NPC_AlertLevel> NPCAlertLevel; // 0x3368 (0x1)
	struct TEnumAsByte<Enum_NPC_AlertLevel> NPCAlertLevelPrevious; // 0x3369 (0x1)
	unsigned char unreflected_336a[0x6]; // 0x336a (0x6) 
	struct TMap<struct TEnumAsByte<Enum_NPC_AlertLevel>, struct FGameplayTag> NPCAlertLevelToTagMap; // 0x3370 (0x50)
	bool NPCStatusWidgetHealthBarDisabled; // 0x33c0 (0x1)
	unsigned char unreflected_33c1[0x3]; // 0x33c1 (0x3) 
	struct FGameplayTag GameplayCuePickupGrabbed; // 0x33c4 (0x4)
	enum EFortRarity NPCBestLootRarityInInventory; // 0x33c8 (0x1)
	bool NPCDebugPawn; // 0x33c9 (0x1)
	bool NPCShowInventoryRarityVisuals; // 0x33ca (0x1)
	unsigned char unreflected_33cb[0x5]; // 0x33cb (0x5) 
	double InventoryGlowDelay; // 0x33d0 (0x8)
	struct FScalableFloat NPCNumberOfInventoryItemsToDeliverHF; // 0x33d8 (0x28)
	bool NPCSpawnInvisible; // 0x3400 (0x1)
	bool NPCScaleMeshInOnSpawn; // 0x3401 (0x1)
	unsigned char unreflected_3402[0x6]; // 0x3402 (0x6) 
	struct FGameplayTagContainer TCNPCSpawnAbilityTag; // 0x3408 (0x20)
	struct FGameplayTagContainer TCNPCAlternateSpawnAbilityTag; // 0x3428 (0x20)
	bool NPCIsSpawning; // 0x3448 (0x1)
	unsigned char unreflected_3449[0x7]; // 0x3449 (0x7) 
	double NPCOriginalGravityScale; // 0x3450 (0x8)
	struct FRotator NPCOriginalRotationRate; // 0x3458 (0x18)
	bool NPCHasPawnGoal; // 0x3470 (0x1)
	unsigned char unreflected_3471[0x7]; // 0x3471 (0x7) 
	class AActor* NPCPawnGoalActor; // 0x3478 (0x8)
	struct FScalableFloat NPCNumberOfInventoryItemsToConsumeBeforeFullHF; // 0x3480 (0x28)
	bool NPCPawnIsDestroyingBuildingForNavigation; // 0x34a8 (0x1)
	unsigned char unreflected_34a9[0x7]; // 0x34a9 (0x7) 
	struct FScalableFloat MaxIdleVODelay; // 0x34b0 (0x28)
	struct FScalableFloat MinIdleVODelay; // 0x34d8 (0x28)
	struct FScalableFloat NPCDeathDropLootDelay; // 0x3500 (0x28)
	struct FName NPCDeathDropLootTierGroupName; // 0x3528 (0x4)
	unsigned char unreflected_352c[0x4]; // 0x352c (0x4) 
	struct FGameplayTagContainer NPCDeathDropLootRequiredDamageTags; // 0x3530 (0x20)
	struct FGameplayTagContainer NPCDeathDropLootForbiddenDamageTags; // 0x3550 (0x20)
	struct FGameplayTagContainer GrantStartingItemsAbilityTC; // 0x3570 (0x20)
	bool NPCHasItemInInventory; // 0x3590 (0x1)
	unsigned char unreflected_3591[0x3]; // 0x3591 (0x3) 
	struct FGameplayTag VoiceTagFullAlertIdle; // 0x3594 (0x4)
	struct FGameplayTag VoiceTagIdle; // 0x3598 (0x4)
	struct FGameplayTag VoiceTagReturnToIdle; // 0x359c (0x4)
	struct FGameplayTag VoiceTagLostTarget; // 0x35a0 (0x4)
	struct FGameplayTag VoiceTagSuspicious; // 0x35a4 (0x4)
	struct FGameplayTag VoiceTagFullAlert; // 0x35a8 (0x4)
	unsigned char unreflected_35ac[0x4]; // 0x35ac (0x4) 
	struct TArray<struct FStruct_NPC_TargetSlots> NPCTargetSlotsHF; // 0x35b0 (0x10)
	bool NPCDamageCanCancelIntroPhase; // 0x35c0 (0x1)
	unsigned char unreflected_35c1[0x7]; // 0x35c1 (0x7) 
	struct FGameplayTagQuery TQNPCDamageTagsThatCanCancelIntroPhase; // 0x35c8 (0x48)
	class UClass* GENPCIntroPhaseBehaviorCooldown; // 0x3610 (0x8)
	struct FGameplayTagContainer TCIntroBehaviorActive; // 0x3618 (0x20)
	bool DebugNPCAlertLevelForced; // 0x3638 (0x1)
	bool NPCPawnCanInteractInternal; // 0x3639 (0x1)
	unsigned char unreflected_363a[0x6]; // 0x363a (0x6) 
	struct FScalableFloat NPCPrimtiveDataFloatSetRandomlyInRange; // 0x3640 (0x28)
	struct FScalableFloat NPCPrimtiveDataFloatIndexHF; // 0x3668 (0x28)
	struct FScalableFloat NPCPrimtiveDataFloatMinRangeHF; // 0x3690 (0x28)
	struct FScalableFloat NPCPrimtiveDataFloatMaxRangeHF; // 0x36b8 (0x28)
	class AActor* NPCLeader; // 0x36e0 (0x8)
	struct FGameplayTag GameplayCueLeaderSet; // 0x36e8 (0x4)
	unsigned char unreflected_36ec[0x4]; // 0x36ec (0x4) 
	double NPCSkeletalMeshIndex; // 0x36f0 (0x8)
	class USoundBase* TamedSound; // 0x36f8 (0x8)
	class UAudioComponent* StateChangeSound; // 0x3700 (0x8)
	struct FScalableFloat NPCShouldDespawnFromStormHF; // 0x3708 (0x28)
	struct FScalableFloat NPCDespawnTimerHF; // 0x3730 (0x28)
	struct FGameplayTag NPCDespawnGameplayTag; // 0x3758 (0x4)
	unsigned char unreflected_375c[0x4]; // 0x375c (0x4) 
	struct FTimerHandle* NPCTestIsInSafeZoneTimer; // 0x3760 (0x8)
	struct FTimerHandle* NPCDespawnFromStormTimer; // 0x3768 (0x8)
	bool NPCisTryingToDespawn; // 0x3770 (0x1)
	unsigned char unreflected_3771[0x3]; // 0x3771 (0x3) 
	struct FGameplayTag NPCResetIntroGameplayTags; // 0x3774 (0x4)
	double SelectedPrimitiveDataFloat; // 0x3778 (0x8)
	struct FGameplayTag GameplayCueDeath; // 0x3780 (0x4)
	unsigned char unreflected_3784[0x4]; // 0x3784 (0x4) 
	struct TArray<class UMaterialInterface*> OGMaterials; // 0x3788 (0x10)
	bool NPCApplyGEforSwimming; // 0x3798 (0x1)
	unsigned char unreflected_3799[0x7]; // 0x3799 (0x7) 
	class UClass* NPCGEClassToApplyForSwimming; // 0x37a0 (0x8)
	bool NPCApplyWaterEnterExitBurstGC; // 0x37a8 (0x1)
	unsigned char unreflected_37a9[0x3]; // 0x37a9 (0x3) 
	struct FActiveGameplayEffectHandle* NPCGEAppliedForSwimming; // 0x37ac (0x8)
	struct FName GoalActorBBKey; // 0x37b4 (0x4)
	struct FGameplayTag GameplayCueLureInterest; // 0x37b8 (0x4)
	unsigned char unreflected_37bc[0x4]; // 0x37bc (0x4) 
	class UObject* NPCPreviousLureGoal; // 0x37c0 (0x8)
	struct FGameplayTag ExitWater; // 0x37c8 (0x4)
	struct FGameplayTag EnterWater; // 0x37cc (0x4)
	struct FScalableFloat NPCMaxDistanceFromDamagedNPCToDrawHeallthBarHF; // 0x37d0 (0x28)
	struct FScalableFloat NPCHealthBarHideTimeAfterDeathHF; // 0x37f8 (0x28)
	struct FScalableFloat NPCPlayEffectWhenLuredHF; // 0x3820 (0x28)
	struct FScalableFloat NPCPawnCanInteractHF; // 0x3848 (0x28)
	struct FScalableFloat NPCAllowInteractOnlyWhenUnawareHF; // 0x3870 (0x28)
	struct FScalableFloat NPCAllowInteractWhenHasLeaderHF; // 0x3898 (0x28)
	struct FScalableFloat NPCAllowDrownInShallowWaterHF; // 0x38c0 (0x28)
	bool NPCIsInventoryInitialized; // 0x38e8 (0x1)
	unsigned char unreflected_38e9[0x3]; // 0x38e9 (0x3) 
	float LeaderClearedCueDelay; // 0x38ec (0x4)
	struct FGameplayTag GameplayCueLeaderCleared; // 0x38f0 (0x4)
	bool isGCForLeaderSetLooping; // 0x38f4 (0x1)
	unsigned char unreflected_38f5[0x3]; // 0x38f5 (0x3) 
	struct FGameplayTag NPCDeathByStormTag; // 0x38f8 (0x4)
	bool NPCTryDespawnAbility; // 0x38fc (0x1)
	unsigned char unreflected_38fd[0x3]; // 0x38fd (0x3) 
	struct FActiveGameplayEffectHandle* GeOutsideSafeZoneDamageHandle; // 0x3900 (0x8)
	bool IsGEStormDamageInit; // 0x3908 (0x1)
	bool NPCMeshScalingInProgress; // 0x3909 (0x1)
	bool NPCDisableCapsuleOverlapsWhenScalingOut; // 0x390a (0x1)
	unsigned char unreflected_390b[0x5]; // 0x390b (0x5) 
	struct FVector NPCOriginalMeshScale; // 0x3910 (0x18)
	struct FMulticastInlineDelegate NPCScaleMeshInCompleted; // 0x3928 (0x10)
	struct FMulticastInlineDelegate NPCScaleMeshOutCompleted; // 0x3938 (0x10)
	bool NPCCanDropLoot; // 0x3948 (0x1)
	unsigned char unreflected_3949[0x7]; // 0x3949 (0x7) 
	struct FScalableFloat NPCStaleDespawnTestDistanceHF; // 0x3950 (0x28)
	struct FScalableFloat NPCStaleDespawnTimeThresholdHF; // 0x3978 (0x28)
	double NPCLastNonStaleCheckTime; // 0x39a0 (0x8)
	bool bCanBeDamagedByNullInstigator; // 0x39a8 (0x1)
	bool IsEnteringWater; // 0x39a9 (0x1)
	unsigned char unreflected_39aa[0x6]; // 0x39aa (0x6) 
	struct FMulticastInlineDelegate NPCPawnInteractWithDispatcher; // 0x39b0 (0x10)
	bool NPCDynamicBlockConversionOnInteract; // 0x39c0 (0x1)
	bool NPCTempInteractOverride; // 0x39c1 (0x1)
	unsigned char unreflected_39c2[0x6]; // 0x39c2 (0x6) 
	class USoundBase* HeadShotSound; // 0x39c8 (0x8)
	struct FName HeadshotFXSocket; // 0x39d0 (0x4)
	bool UseHeadShotFX; // 0x39d4 (0x1)
	unsigned char unreflected_39d5[0x3]; // 0x39d5 (0x3) 
	struct FGameplayTagContainer TCWeaponTypesAllowedForHeadshotFX; // 0x39d8 (0x20)
	bool AllowHeadshot; // 0x39f8 (0x1)
	unsigned char unreflected_39f9[0x7]; // 0x39f9 (0x7) 
	double AdditiveHitReactRetriggerDelay; // 0x3a00 (0x8)
	class UAnimMontage* AdditiveHitReactMontage; // 0x3a08 (0x8)
	class USoundBase* DeathNormalSound; // 0x3a10 (0x8)
	class UParticleSystem* HeadshotFXEmitterTemplate; // 0x3a18 (0x8)
	struct TArray<class USoundLibrary*> SoundLibsDefault; // 0x3a20 (0x10)
	struct TArray<class USoundLibrary*> SoundLibsAlert; // 0x3a30 (0x10)
	class USoundLibrary* CurrentSoundLib; // 0x3a40 (0x8)
	struct TArray<class USoundLibrary*> SoundLibsAggressive; // 0x3a48 (0x10)
	struct TArray<class USoundLibrary*> SoundLibsFoley; // 0x3a58 (0x10)
	struct TArray<class USoundLibrary*> SoundLibsFoleyWater; // 0x3a68 (0x10)
	class USoundLibrary* CurrentFoleyLib; // 0x3a78 (0x8)
	double CustomDepthUpdateRate; // 0x3a80 (0x8)
	class UClass* Class; // 0x3a88 (0x8)
	class UClass* GEConverted; // 0x3a90 (0x8)
	struct FActiveGameplayEffectHandle* GEConvertedHandle; // 0x3a98 (0x8)
	double NPCDeathTime; // 0x3aa0 (0x8)

	/* Functions */

	// Function /Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Parent.NPC_Pawn_Parent_C.Orphaned (Has no native function)
	void Orphaned(bool& IsOrphaned, class AFortPawn*& AttachedPawn); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Parent.NPC_Pawn_Parent_C.TryShowHealthBar (Has no native function)
