// BlueprintGeneratedClass /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C
// Size: 0x4a38
class APlayerPawn_Generic_C : public APlayerPawn_Generic_Parent_C
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x4440 (0x8)
	class UMotionWarpingComponent* MotionWarping; // 0x4448 (0x8)
	class UParticleSystemComponent* SplashEffectsForEnteringOrExitingWater; // 0x4450 (0x8)
	class UParticleSystemComponent* GamplayWindInteractionEffects; // 0x4458 (0x8)
	class UParticleSystemComponent* EffectPlayerRunLand; // 0x4460 (0x8)
	class UParticleSystemComponent* EffectPlayerWalkLand; // 0x4468 (0x8)
	class UParticleSystemComponent* EffectPlayerWalkWater; // 0x4470 (0x8)
	class UParticleSystemComponent* EffectPlayerRunWater; // 0x4478 (0x8)
	class UParticleSystemComponent* EffectWaterInteractionFX; // 0x4480 (0x8)
	class UParticleSystemComponent* HitDamageParticles; // 0x4488 (0x8)
	class UWidgetComponent* SpeechBubbleComponent; // 0x4490 (0x8)
	class USpotLightComponent* PlayerLight; // 0x4498 (0x8)
	float ShatterShieldPush3B96BD02488A8F69F3D086A2B7978EC8; // 0x44a0 (0x4)
	float ShatterShieldOpacity3B96BD02488A8F69F3D086A2B7978EC8; // 0x44a4 (0x4)
	float ShatterShieldHighlightCracks3B96BD02488A8F69F3D086A2B7978EC8; // 0x44a8 (0x4)
	struct TEnumAsByte<ETimelineDirection> ShatterShieldDirection3B96BD02488A8F69F3D086A2B7978EC8; // 0x44ac (0x1)
	unsigned char unreflected_44ad[0x3]; // 0x44ad (0x3) 
	class UTimelineComponent* ShatterShield; // 0x44b0 (0x8)
	class USoundBase* HitByHuskRangedSound; // 0x44b8 (0x8)
	class USoundBase* HitByHuskMeleeSound; // 0x44c0 (0x8)
	class UAnimMontage* SoulSuckVictimMontage; // 0x44c8 (0x8)
	double PlayerSpeed; // 0x44d0 (0x8)
	double RunParticleActivateSpeed; // 0x44d8 (0x8)
	double WalkDustActivateSpeed; // 0x44e0 (0x8)
	double WalkParticleResetSpeed; // 0x44e8 (0x8)
	struct FVector PreviousVelocityVector; // 0x44f0 (0x18)
	bool CanSpawnRunKickupFX; // 0x4508 (0x1)
	bool CanSpawnWalkKickupFX; // 0x4509 (0x1)
	bool CanSpawnDustLandFX; // 0x450a (0x1)
	unsigned char unreflected_450b[0x5]; // 0x450b (0x5) 
	struct FRotator RunWalkParticleRotation; // 0x4510 (0x18)
	bool IsNinjaInShadowStance; // 0x4528 (0x1)
	unsigned char unreflected_4529[0x7]; // 0x4529 (0x7) 
	struct FGameplayTagContainer GameplayTagsForHitByHuskMeleeSound; // 0x4530 (0x20)
	class UMaterialInterface* ShieldMaterial; // 0x4550 (0x8)
	struct TArray<class UMaterialInstanceDynamic*> BodyShieldMIDArray; // 0x4558 (0x10)
	struct TArray<class UMaterialInstanceDynamic*> HeadShieldMIDArray; // 0x4568 (0x10)
	bool ShieldActive; // 0x4578 (0x1)
	unsigned char unreflected_4579[0x7]; // 0x4579 (0x7) 
	class USoundBase* SoundShieldImpact; // 0x4580 (0x8)
	class USoundBase* SoundShieldDestroyed; // 0x4588 (0x8)
	class USoundBase* SoundShieldFullyCharged; // 0x4590 (0x8)
	double ShieldShatterOpacity; // 0x4598 (0x8)
	double RegenOpacity; // 0x45a0 (0x8)
	double DamageOpacity; // 0x45a8 (0x8)
	double DefaultShieldopacity; // 0x45b0 (0x8)
	double ShieldPushMinValue; // 0x45b8 (0x8)
	bool ShieldVisibleHit; // 0x45c0 (0x1)
	bool ShieldVisibleRecover; // 0x45c1 (0x1)
	bool ShieldVisibleShatter; // 0x45c2 (0x1)
	bool ShieldVisibleFullHealth; // 0x45c3 (0x1)
	unsigned char unreflected_45c4[0x4]; // 0x45c4 (0x4) 
	double FullyRegenedShieldhealthOpacity; // 0x45c8 (0x8)
	struct FGameplayTagContainer TCGameplayCueDamageShielded; // 0x45d0 (0x20)
	bool LatestDamageIsShieldDamage; // 0x45f0 (0x1)
	unsigned char unreflected_45f1[0x7]; // 0x45f1 (0x7) 
	double DamageTaken; // 0x45f8 (0x8)
	double LastShieldDamageTime; // 0x4600 (0x8)
	struct TArray<class UMaterialInstanceDynamic*> CharmShieldMIDArray; // 0x4608 (0x10)
	bool BodyValid; // 0x4618 (0x1)
	bool BackpackValid; // 0x4619 (0x1)
	bool HatValid; // 0x461a (0x1)
	bool FaceValid; // 0x461b (0x1)
	bool CharmValid; // 0x461c (0x1)
	bool HeadValid; // 0x461d (0x1)
	bool OnPlayerBuiltFloor; // 0x461e (0x1)
	unsigned char unreflected_461f[0x1]; // 0x461f (0x1) 
	struct FGameplayTag EventNeedRoadsActive; // 0x4620 (0x4)
	struct FGameplayTag EventNeedRoadsDeactive; // 0x4624 (0x4)
	struct FGameplayTagContainer TCWhereWereGoingWeNeedRoads; // 0x4628 (0x20)
	class UParticleSystem* EffectPlayerLandedDust; // 0x4648 (0x8)
	class USkeletalMeshComponent* ShieldBodySkeletalMesh; // 0x4650 (0x8)
	class USkeletalMeshComponent* ShieldHeadSkeletalMesh; // 0x4658 (0x8)
	class USkeletalMeshComponent* ShieldCharmSkeletalMesh; // 0x4660 (0x8)
	class USceneComponent* SoundPlayerHit; // 0x4668 (0x8)
	class UForceFeedbackEffect* DamageForceFeedback; // 0x4670 (0x8)
	class UParticleSystem* EffectPlayerLandedWindVectorP; // 0x4678 (0x8)
	class UClass* SpeechBubbleWidgetClass; // 0x4680 (0x8)
	struct FText LastSpeechText; // 0x4688 (0x18)
	class UClass* DamageCameraShake; // 0x46a0 (0x8)
	bool UseAnimTrailsNotifies; // 0x46a8 (0x1)
	unsigned char unreflected_46a9[0x7]; // 0x46a9 (0x7) 
	struct FVector StableVelocityVector; // 0x46b0 (0x18)
	bool TickWaterLevel; // 0x46c8 (0x1)
	unsigned char unreflected_46c9[0x7]; // 0x46c9 (0x7) 
	class UTextureRenderTarget2D* WetnessDepthTexture; // 0x46d0 (0x8)
	class UMaterialInstanceDynamic* WaterLevelMID; // 0x46d8 (0x8)
	class UMaterialInstanceDynamic* WaterDecayMID; // 0x46e0 (0x8)
	bool WasRTTEnabledVarSet; // 0x46e8 (0x1)
	bool IstheWindWaterSceneCaptureEnabled; // 0x46e9 (0x1)
	unsigned char unreflected_46ea[0x6]; // 0x46ea (0x6) 
	class AActor* CachedEffect; // 0x46f0 (0x8)
	struct TArray<class UMaterialInstanceDynamic*> WaterInteractionWakeMIDS; // 0x46f8 (0x10)
	struct FLinearColor WaterTraceImpactNormalAndZHeightLocation; // 0x4708 (0x10)
	struct FVector PlayerVelocity; // 0x4718 (0x18)
	bool EnableRunWalkWaterGroundFX; // 0x4730 (0x1)
	unsigned char unreflected_4731[0x7]; // 0x4731 (0x7) 
	struct TArray<class UMaterialInstanceDynamic*> PreviousMID; // 0x4738 (0x10)
	struct TArray<class UMaterialInstanceDynamic*> PreviousWeaponMID; // 0x4748 (0x10)
	class USkeletalMeshComponent* DuplicateCharacterMesh; // 0x4758 (0x8)
	struct TArray<class UMaterialInstanceDynamic*> PreviousHeadMID; // 0x4760 (0x10)
	struct TArray<class UMaterialInstanceDynamic*> PreviousBodyMID; // 0x4770 (0x10)
	struct TArray<class UMaterialInstanceDynamic*> PreviousHatMID; // 0x4780 (0x10)
	struct TArray<class UMaterialInstanceDynamic*> PreviousBackpackMID; // 0x4790 (0x10)
	struct TArray<class UMaterialInstanceDynamic*> PreviousCharmMID; // 0x47a0 (0x10)
	struct TArray<class UMaterialInstanceDynamic*> PreviousFaceMID; // 0x47b0 (0x10)
	struct FMulticastInlineDelegate SwingRight; // 0x47c0 (0x10)
	struct FMulticastInlineDelegate SwingRightEnd; // 0x47d0 (0x10)
	struct FMulticastInlineDelegate SwingLeft; // 0x47e0 (0x10)
	struct FMulticastInlineDelegate SwingLeftEnd; // 0x47f0 (0x10)
	struct FMulticastInlineDelegate AnimNotifyBegin; // 0x4800 (0x10)
	struct FMulticastInlineDelegate AnimNotifyEnd; // 0x4810 (0x10)
	class UFXSystemComponent* OverrideAnimTrail; // 0x4820 (0x8)
	struct FMulticastInlineDelegate SwingRight2; // 0x4828 (0x10)
	struct FMulticastInlineDelegate SwingLeft2; // 0x4838 (0x10)
	class UFXSystemComponent* AnimTrailFX; // 0x4848 (0x8)
	bool BlockedByPawns; // 0x4850 (0x1)
	unsigned char unreflected_4851[0x7]; // 0x4851 (0x7) 
	struct FGameplayAttribute AttributeCurrentShieldConst; // 0x4858 (0x38)
	struct FGameplayAttribute AttributeShieldConst; // 0x4890 (0x38)
	struct FGameplayAttribute AttributeCurrentHealthConst; // 0x48c8 (0x38)
	struct FGameplayAttribute AttributeMaxHealthConst; // 0x4900 (0x38)
	struct FCameraLensInterfaceClassSupport* LensEffectInterfaceClassPlayerHealthDamage; // 0x4938 (0x8)
	struct FCameraLensInterfaceClassSupport* LensEffectInterfaceClassPlayerShieldDamage; // 0x4940 (0x8)
	struct FCameraLensInterfaceClassSupport* LensEffectInterfaceClassDirectionalPlayerShieldDamage; // 0x4948 (0x8)
	struct FCameraLensInterfaceClassSupport* LensEffectInterfaceClassDirectionalPlayerHealthDamage; // 0x4950 (0x8)
	struct TArray<class UMaterialInstanceDynamic*> TempDIMArray; // 0x4958 (0x10)
	struct TMap<struct TEnumAsByte<EFortCustomPartType>, bool> PartValid; // 0x4968 (0x50)
	struct TArray<struct TEnumAsByte<EFortCustomPartType>> ShieldPartList; // 0x49b8 (0x10)
	struct TArray<struct FCharacterPartMidArrayStruct> ShieldMIDArrays; // 0x49c8 (0x10)
	struct TMap<struct TEnumAsByte<EFortCustomPartType>, class USkeletalMeshComponent*> ShieldSkMeshes; // 0x49d8 (0x50)
	int LShieldMIDIndex; // 0x4a28 (0x4)
	unsigned char unreflected_4a2c[0x4]; // 0x4a2c (0x4) 
	class USkeletalMeshComponent* NullPartMesh; // 0x4a30 (0x8)

	/* Functions */

	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Melee_Effect_Color (Has no native function)
	void MeleeEffectColor(struct FVector& MeleeColorSet); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.On Set Material Part (Has no native function)
	void OnSetMaterialPart(class AFortPlayerPawn*& Pawn, class UCustomCharacterPart*& Part, class USkeletalMeshComponent*& MeshPart, struct TEnumAsByte<EFortCustomPartType>& PartType, bool& K2NodeSwitchEnumCmpSuccess); // (Public | BlueprintCallable | BlueprintEvent)

	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Set Part Material (Has no native function)
