// BlueprintGeneratedClass /Game/Athena/PlayerPawn_Athena_Generic.PlayerPawn_Athena_Generic_C
// Size: 0x5640
class APlayerPawn_Athena_Generic_C : public APlayerPawn_Athena_Generic_Parent_C
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x5350 (0x8)
	class UParticleSystemComponent* EffectWaterInteractionFX; // 0x5358 (0x8)
	class UParticleSystemComponent* AnimTrailPS; // 0x5360 (0x8)
	bool IsInWater; // 0x5368 (0x1)
	unsigned char unreflected_5369[0x7]; // 0x5369 (0x7) 
	struct FRotator RunWalkParticleRotation; // 0x5370 (0x18)
	int WaterCounter; // 0x5388 (0x4)
	unsigned char unreflected_538c[0x4]; // 0x538c (0x4) 
	double TickDeltaSeconds; // 0x5390 (0x8)
	class USoundBase* SoundShieldImpact; // 0x5398 (0x8)
	class USoundBase* SoundShieldDestroyed; // 0x53a0 (0x8)
	class USoundBase* SoundShieldDestroyed1P; // 0x53a8 (0x8)
	class USoundBase* SoundShieldFullyCharged; // 0x53b0 (0x8)
	class USoundBase* SoundShieldStartRecharge; // 0x53b8 (0x8)
	bool BodyValid; // 0x53c0 (0x1)
	bool BackpackValid; // 0x53c1 (0x1)
	bool HatValid; // 0x53c2 (0x1)
	bool FaceValid; // 0x53c3 (0x1)
	bool CharmValid; // 0x53c4 (0x1)
	bool HeadValid; // 0x53c5 (0x1)
	unsigned char unreflected_53c6[0x2]; // 0x53c6 (0x2) 
	struct TArray<class UMaterialInstanceDynamic*> TempArray; // 0x53c8 (0x10)
	class USceneComponent* SoundPlayerHit; // 0x53d8 (0x8)
	class UClass* SpeechBubbleWidgetClass; // 0x53e0 (0x8)
	struct FText LastSpeechText; // 0x53e8 (0x18)
	bool UseAnimTrailsNotifies; // 0x5400 (0x1)
	unsigned char unreflected_5401[0x7]; // 0x5401 (0x7) 
	double Timewhenyoullbeabletosplashagain; // 0x5408 (0x8)
	class AActor* CurrentWaterMeshActor; // 0x5410 (0x8)
	struct FHitResult WaterTraceHitLocation; // 0x5418 (0xe0)
	struct FVector StableVelocityVector; // 0x54f8 (0x18)
	class UParticleSystem* PlayerRunTemplateGround; // 0x5510 (0x8)
	class UParticleSystem* PlayerWalkTemplateGround; // 0x5518 (0x8)
	class UParticleSystem* PlayerRunTemplateWater; // 0x5520 (0x8)
	class UParticleSystem* PlayerWalkTemplateWater; // 0x5528 (0x8)
	class USkeletalMesh* PawnCharmSkeletalMesh; // 0x5530 (0x8)
	class UParticleSystemComponent* AnimTrailsPSRef; // 0x5538 (0x8)
	class UMaterialInterface* WeaponMaterialOverride; // 0x5540 (0x8)
	bool TickWaterLevel; // 0x5548 (0x1)
	unsigned char unreflected_5549[0x7]; // 0x5549 (0x7) 
	class UTextureRenderTarget2D* WetnessDepthTexture; // 0x5550 (0x8)
	class UMaterialInstanceDynamic* WaterLevelMID; // 0x5558 (0x8)
	class UMaterialInstanceDynamic* WaterDecayMID; // 0x5560 (0x8)
	bool WasRTTEnabledVarSet; // 0x5568 (0x1)
	bool IsRTTEnabled; // 0x5569 (0x1)
	unsigned char unreflected_556a[0x6]; // 0x556a (0x6) 
	double StartingMinCapsuleShadowVis; // 0x5570 (0x8)
	bool IsShielded; // 0x5578 (0x1)
	unsigned char unreflected_5579[0x7]; // 0x5579 (0x7) 
	double InstigatorCheckDistanceSqrd; // 0x5580 (0x8)
	double SlideDustActivateSpeed; // 0x5588 (0x8)
	bool CanSpawnSlideKickupFX; // 0x5590 (0x1)
	unsigned char unreflected_5591[0x7]; // 0x5591 (0x7) 
	class UParticleSystem* EffectPlayerShieldActivate; // 0x5598 (0x8)
	class UParticleSystem* EffectPLayerShieldBreak; // 0x55a0 (0x8)
	bool GhostMode; // 0x55a8 (0x1)
	unsigned char unreflected_55a9[0x7]; // 0x55a9 (0x7) 
	class UFXSystemComponent* OverrideAnimTrail; // 0x55b0 (0x8)
	struct FMulticastInlineDelegate AnimNotifyBegin; // 0x55b8 (0x10)
	struct FMulticastInlineDelegate AnimNotifyEnd; // 0x55c8 (0x10)
	class USoundBase* SoundShieldDestroyed2D; // 0x55d8 (0x8)
	class USoundBase* SoundShieldDestroyedCrit2D; // 0x55e0 (0x8)
	class UFXSystemComponent* AnimTrailFX; // 0x55e8 (0x8)
	struct FMulticastInlineDelegate PlayDamageEffect; // 0x55f0 (0x10)
	struct FName ComponentTagAnimTrailFXConst; // 0x5600 (0x4)
	unsigned char unreflected_5604[0x4]; // 0x5604 (0x4) 
	double ReppedCapsuleExtraHalfHeight; // 0x5608 (0x8)
	double CachedCapsuleHalfHeight; // 0x5610 (0x8)
	struct FMulticastInlineDelegate OnCharacterPartsMIDInitialized; // 0x5618 (0x10)
	struct FMulticastInlineDelegate OnShieldBreak; // 0x5628 (0x10)
	class USkeletalMeshComponent* NullPartMesh; // 0x5638 (0x8)

	/* Functions */

	// Function /Game/Athena/PlayerPawn_Athena_Generic.PlayerPawn_Athena_Generic_C.Melee_Effect_Color (Has no native function)
	void MeleeEffectColor(struct FVector& MeleeColorSet); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Athena/PlayerPawn_Athena_Generic.PlayerPawn_Athena_Generic_C.UpdateViewTargetAudioParameters (Has no native function)
