// BlueprintGeneratedClass /Game/Athena/PlayerPawn_Athena.PlayerPawn_Athena_C
// Size: 0x5f11
class APlayerPawn_Athena_C : public APlayerPawn_Athena_Generic_C
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x5640 (0x8)
	class UChildActorComponent* PhysicalRimlight; // 0x5648 (0x8)
	class UFortContrailsComponent* FortContrails; // 0x5650 (0x8)
	class UFortUnderwaterDamageComponent* FortUnderwaterDamage; // 0x5658 (0x8)
	float Timeline0BlendWeightA4943458400C3662DB243099F9EAC7E8; // 0x5660 (0x4)
	struct TEnumAsByte<ETimelineDirection> Timeline0DirectionA4943458400C3662DB243099F9EAC7E8; // 0x5664 (0x1)
	unsigned char unreflected_5665[0x3]; // 0x5665 (0x3) 
	class UTimelineComponent* Timeline0; // 0x5668 (0x8)
	class USkeletalMeshComponent* TargetHead; // 0x5670 (0x8)
	class USkeletalMeshComponent* TargetBody; // 0x5678 (0x8)
	struct TArray<class UMaterialInterface*> PawnHeadMaterials0; // 0x5680 (0x10)
	struct TArray<class UMaterialInterface*> PawnBodyMaterials0; // 0x5690 (0x10)
	struct FGameplayTagContainer TCFlakVest; // 0x56a0 (0x20)
	struct FGameplayEventData EventData; // 0x56c0 (0xb0)
	struct FGameplayTag EventSpawnEffect; // 0x5770 (0x4)
	bool IsMale; // 0x5774 (0x1)
	unsigned char unreflected_5775[0x3]; // 0x5775 (0x3) 
	class AFortWeapon* MenuGoingCommandowWeapon; // 0x5778 (0x8)
	class USoundBase* SafeZonePassThroughSound; // 0x5780 (0x8)
	bool bHasBeenOutsideSafeZone; // 0x5788 (0x1)
	unsigned char unreflected_5789[0x3]; // 0x5789 (0x3) 
	struct FLinearColor ThreatColor; // 0x578c (0x10)
	unsigned char unreflected_579c[0x4]; // 0x579c (0x4) 
	class USoundBase* PlayerKilledSound; // 0x57a0 (0x8)
	class UParticleSystemComponent* WindDebrisParticles; // 0x57a8 (0x8)
	class UParticleSystemComponent* FallingRainParticles; // 0x57b0 (0x8)
	class UParticleSystemComponent* StormAuraParticles; // 0x57b8 (0x8)
	struct FVector LightningSpawnLocation; // 0x57c0 (0x18)
	double LightningIntensityMin; // 0x57d8 (0x8)
	double LightningIntensityMax; // 0x57e0 (0x8)
	class AActor* SafeZoneActor; // 0x57e8 (0x8)
	double LightningIntensity; // 0x57f0 (0x8)
	class UPointLightComponent* RandomLightningLight; // 0x57f8 (0x8)
	double LightningTimelinePlaySpeedMin; // 0x5800 (0x8)
	double LightningTimelinePlaySpeedMax; // 0x5808 (0x8)
	double LightningFlashDiameter; // 0x5810 (0x8)
	double LightningFlashHeight; // 0x5818 (0x8)
	double LightningFlashRepeatDelayMin; // 0x5820 (0x8)
	double LightningFlashRepeatDelayMax; // 0x5828 (0x8)
	class AEmitterCameraLensEffectBase* RainCameraLensParticles; // 0x5830 (0x8)
	double ChanceOfLightningMesh; // 0x5838 (0x8)
	bool ShowInvulnerableVisuals; // 0x5840 (0x1)
	unsigned char unreflected_5841[0x7]; // 0x5841 (0x7) 
	class UAudioComponent* StormAudioLoopInst; // 0x5848 (0x8)
	double StormAudioVolume; // 0x5850 (0x8)
	class UAudioComponent* FallingAudioLoopInst; // 0x5858 (0x8)
	bool bIsPlayingFallingSound; // 0x5860 (0x1)
	unsigned char unreflected_5861[0x7]; // 0x5861 (0x7) 
	double PlayerAttributesSpeedWalk; // 0x5868 (0x8)
	double PlayerAttributesSpeedRun; // 0x5870 (0x8)
	double PlayerAttributesSpeedSprint; // 0x5878 (0x8)
	int MaxTrailsLOD; // 0x5880 (0x4)
	unsigned char unreflected_5884[0x4]; // 0x5884 (0x4) 
	class UPostProcessComponent* MobilePostProcess; // 0x5888 (0x8)
	bool bIsOutsideSafeZoneCached; // 0x5890 (0x1)
	unsigned char unreflected_5891[0x7]; // 0x5891 (0x7) 
	struct TArray<class UMaterialInstanceDynamic*> ResOutMaterials; // 0x5898 (0x10)
	class ADuplicateResOutMesh_C* RezInFXActor; // 0x58a8 (0x8)
	bool bQueueRezIn; // 0x58b0 (0x1)
	unsigned char unreflected_58b1[0x7]; // 0x58b1 (0x7) 
	class ADuplicateResOutMesh_C* RezOutFXActor; // 0x58b8 (0x8)
	bool bQueueRezOut; // 0x58c0 (0x1)
	bool bWasEverInWarmUp; // 0x58c1 (0x1)
	bool bStormAudioCleanedUp; // 0x58c2 (0x1)
	unsigned char unreflected_58c3[0xd]; // 0x58c3 (0xd) 
	struct FTransform BoxLocalTransform; // 0x58d0 (0x60)
	double BoundsRadius; // 0x5930 (0x8)
	class UPointLightComponent* TeleportationPointLight; // 0x5938 (0x8)
	double MaxLightIntensity; // 0x5940 (0x8)
	struct FName SocketMeshTop; // 0x5948 (0x4)
	struct FName SocketMeshBot; // 0x594c (0x4)
	struct FName MIDParamTransition; // 0x5950 (0x4)
	struct FName MIDParamDissolvePercent; // 0x5954 (0x4)
	struct FName MIDParamDissolveDirection; // 0x5958 (0x4)
	struct FName MIDParamDissolveBaseLoc; // 0x595c (0x4)
	struct FName MIDParamDissolveDistance; // 0x5960 (0x4)
	struct FName MIDParamDissolveFirstSpawn; // 0x5964 (0x4)
	class UMaterialInterface* MatCharacterDissolve; // 0x5968 (0x8)
	struct TArray<class UMaterialInstanceDynamic*> DissolveMIDs; // 0x5970 (0x10)
	bool bUseNewTeleportFX; // 0x5980 (0x1)
	unsigned char unreflected_5981[0x3]; // 0x5981 (0x3) 
	struct FGameplayTag OutsideSafeZoneGameplayCueTag; // 0x5984 (0x4)
	int SafeZonePhase; // 0x5988 (0x4)
	int WhichSafeZoneTag; // 0x598c (0x4)
	bool bOutsideSafeZoneGameplayCueActive; // 0x5990 (0x1)
	unsigned char unreflected_5991[0x7]; // 0x5991 (0x7) 
	struct FScalableFloat SafeZoneDamageScalableFloat; // 0x5998 (0x28)
	bool bFrontendPartyInProgress; // 0x59c0 (0x1)
	bool bLockOnInteractionComplete; // 0x59c1 (0x1)
	unsigned char unreflected_59c2[0x6]; // 0x59c2 (0x6) 
	struct FMulticastInlineDelegate ResIn; // 0x59c8 (0x10)
	struct FMulticastInlineDelegate ResOut; // 0x59d8 (0x10)
	struct FMulticastInlineDelegate SwingRight; // 0x59e8 (0x10)
	struct FMulticastInlineDelegate SwingLeft; // 0x59f8 (0x10)
	bool bSkeletalArrayReady; // 0x5a08 (0x1)
	unsigned char unreflected_5a09[0x3]; // 0x5a09 (0x3) 
	int CurDissolveSetupAttempt; // 0x5a0c (0x4)
	class USoundBase* DBNOEnterSound; // 0x5a10 (0x8)
	struct FMulticastInlineDelegate onFadeToWhiteTeleported; // 0x5a18 (0x10)
	bool IsAshton; // 0x5a28 (0x1)
	unsigned char unreflected_5a29[0x7]; // 0x5a29 (0x7) 
	class UParticleSystemComponent* Ashton; // 0x5a30 (0x8)
	struct FMulticastInlineDelegate SwingRightEnd; // 0x5a38 (0x10)
	struct FMulticastInlineDelegate SwingLeftEnd; // 0x5a48 (0x10)
	struct FGameplayTag PhoneGhostCue; // 0x5a58 (0x4)
	struct FGameplayTag WhiteoutCue; // 0x5a5c (0x4)
	struct FGameplayTag OutsideSafeZoneCue; // 0x5a60 (0x4)
	struct FGameplayTag OutsideSafeZone2Cue; // 0x5a64 (0x4)
	struct FGameplayTag OutsideSafeZone3Cue; // 0x5a68 (0x4)
	bool PlayRespawnFXOnSpawn; // 0x5a6c (0x1)
	unsigned char unreflected_5a6d[0x3]; // 0x5a6d (0x3) 
	class AFortPlayerPawnAthena* PlayerPawnAthena; // 0x5a70 (0x8)
	struct FMulticastInlineDelegate SwingRight2; // 0x5a78 (0x10)
	struct FMulticastInlineDelegate SwingLeft2; // 0x5a88 (0x10)
	bool TestProceduralWaterInIsolation; // 0x5a98 (0x1)
	bool NewVar0; // 0x5a99 (0x1)
	bool IsFirstWaterBody; // 0x5a9a (0x1)
	bool IsLastWaterBody; // 0x5a9b (0x1)
	unsigned char unreflected_5a9c[0x4]; // 0x5a9c (0x4) 
	double AccumulatedNormalizedDiveSpeed; // 0x5aa0 (0x8)
	struct FGameplayTag WaterSprintBoostTag; // 0x5aa8 (0x4)
	unsigned char unreflected_5aac[0x4]; // 0x5aac (0x4) 
	struct FMulticastInlineDelegate CCPMisHiddenInProp; // 0x5ab0 (0x10)
	struct TMap<class UObject*, struct FPawnHighlight> PawnHighlights; // 0x5ac0 (0x50)
	class UObject* CurrentHighlightSource; // 0x5b10 (0x8)
	double CurrentHighlightPriority; // 0x5b18 (0x8)
	struct FPawnHighlight InvulnerableHighlight; // 0x5b20 (0x30)
	bool IsGalileo; // 0x5b50 (0x1)
	unsigned char unreflected_5b51[0x7]; // 0x5b51 (0x7) 
	struct FScalableFloat HotFixSnow; // 0x5b58 (0x28)
	struct TSet<struct FName> NoSnowPlaylists; // 0x5b80 (0x50)
	struct FGameplayTag GalileoPlaylistTag; // 0x5bd0 (0x4)
	unsigned char unreflected_5bd4[0x4]; // 0x5bd4 (0x4) 
	struct TArray<class UMaterialInstanceDynamic*> WeaponMIDs; // 0x5bd8 (0x10)
	int AmountOfTimesToAttemptRestoreMats; // 0x5be8 (0x4)
	struct FGameplayTag TCPawnAthenaNPC; // 0x5bec (0x4)
	double HitGlowBrightnessScalar; // 0x5bf0 (0x8)
	struct TArray<class UMaterialInterface*> CurrentWeaponMaterials; // 0x5bf8 (0x10)
	struct TArray<class USkeletalMeshComponent*> CurrentWeaponMeshes; // 0x5c08 (0x10)
	struct TArray<class UMaterialInstanceDynamic*> WeaponDissolveMIDs; // 0x5c18 (0x10)
	double HitGlowBrightnessScalarMobile; // 0x5c28 (0x8)
	struct FGameplayTag TCPawnAthenaDecoy; // 0x5c30 (0x4)
	unsigned char unreflected_5c34[0x4]; // 0x5c34 (0x4) 
	double ScaleRate; // 0x5c38 (0x8)
	struct FGameplayTagContainer TetherQuestTag; // 0x5c40 (0x20)
	struct FName FirefliesTag; // 0x5c60 (0x4)
	unsigned char unreflected_5c64[0xc]; // 0x5c64 (0xc) 
	struct FTransform RightSideRimTransform; // 0x5c70 (0x60)
	class USpotLightComponent* RightSideRimLight; // 0x5cd0 (0x8)
	double RimlightShadowBias; // 0x5cd8 (0x8)
	double RimLightAttenuationRadius; // 0x5ce0 (0x8)
	double RimLightIntensity; // 0x5ce8 (0x8)
	struct FRotator PlayerAimRotation; // 0x5cf0 (0x18)
	struct FScalableFloat ControlRotationReplicationTickRate; // 0x5d08 (0x28)
	struct FGameplayTag EliminationRezSequenceGC; // 0x5d30 (0x4)
	struct FGameplayTag CreativeRespawnTeleportationGC; // 0x5d34 (0x4)
	struct FGameplayTag TeleportInGC; // 0x5d38 (0x4)
	unsigned char unreflected_5d3c[0x4]; // 0x5d3c (0x4) 
	double RimlightDistanceFromCamera; // 0x5d40 (0x8)
	double RimlightOffsetFromCamera; // 0x5d48 (0x8)
	struct FLinearColor RimLightColorNight; // 0x5d50 (0x10)
	struct FLinearColor RimLightColorDay; // 0x5d60 (0x10)
	struct FGameplayTag PhoneModeratorModeGameplayCue; // 0x5d70 (0x4)
	struct FGameplayTag PhoneInvulnerableGameplayCue; // 0x5d74 (0x4)
	bool SwingingHandsUp; // 0x5d78 (0x1)
	bool SwingingLockedToHip; // 0x5d79 (0x1)
	unsigned char unreflected_5d7a[0x6]; // 0x5d7a (0x6) 
	double InputDragCoefficient; // 0x5d80 (0x8)
	bool ToggleSwingNativized; // 0x5d88 (0x1)
	unsigned char unreflected_5d89[0x7]; // 0x5d89 (0x7) 
	class UAudioComponent* SwingingSound; // 0x5d90 (0x8)
	class UCurveFloat* SwingingReelingInCurve; // 0x5d98 (0x8)
	class UCurveFloat* SwingingNotReelingInCurve; // 0x5da0 (0x8)
	struct FVector SwingingOriginalVecToTarget; // 0x5da8 (0x18)
	bool SwingingReelingIn; // 0x5dc0 (0x1)
	unsigned char unreflected_5dc1[0x7]; // 0x5dc1 (0x7) 
	double SwingingGoalLength; // 0x5dc8 (0x8)
	class UCurveFloat* SwingingReelingTimeCurve; // 0x5dd0 (0x8)
	bool SwingingColliderBigger; // 0x5dd8 (0x1)
	unsigned char unreflected_5dd9[0x7]; // 0x5dd9 (0x7) 
	struct TArray<struct FAudioParameter> SoundParams; // 0x5de0 (0x10)
	bool SwingingUseNewRotationAlgorithm; // 0x5df0 (0x1)
	unsigned char unreflected_5df1[0x7]; // 0x5df1 (0x7) 
	struct FVector AttachedWallInverseNormal; // 0x5df8 (0x18)
	double WallCheckDistance; // 0x5e10 (0x8)
	struct FVector VelocityOnSlideStart; // 0x5e18 (0x18)
	double SlideStartTime; // 0x5e30 (0x8)
	double MaxSlideTime; // 0x5e38 (0x8)
	class UCurveVector* WallSlidingVelocityMultiplierCurve; // 0x5e40 (0x8)
	class UCurveFloat* WallSlidingAddedDownwardVelocityMultiplierCurve; // 0x5e48 (0x8)
	double WallSlidingAddedDownwardVelocityMax; // 0x5e50 (0x8)
	struct FVector AttachedWallNormal; // 0x5e58 (0x18)
	struct FVector WallSlidingVelocity; // 0x5e70 (0x18)
	double DesiredDistanceToAttachedWall; // 0x5e88 (0x8)
	double MinGroundSlopeToLeaveAttachedWall; // 0x5e90 (0x8)
	struct FFortGameplayAbilityMontageInfo OverrideSearchMontageInfo; // 0x5e98 (0x58)
	struct FMulticastInlineDelegate DisplayHitNotify; // 0x5ef0 (0x10)
	bool IsHiddingCharacterParrts; // 0x5f00 (0x1)
	unsigned char unreflected_5f01[0x7]; // 0x5f01 (0x7) 
	double RimlightMultiplier; // 0x5f08 (0x8)
	bool RimlightEnabled; // 0x5f10 (0x1)

	/* Functions */

	// Function /Game/Athena/PlayerPawn_Athena.PlayerPawn_Athena_C.GoToHUBIslandIfOutOfBounds (Has no native function)
	void GoToHUBIslandIfOutOfBounds(bool& CallFuncIsBattleLabModePlaylistReturnValue, class APlayerController*& CallFuncGetPlayerControllerReturnValue, class AFortPlayerControllerAthena*& K2NodeDynamicCastAsFortPlayerControllerAthena, bool& K2NodeDynamicCastbSuccess, class AFortMinigame*& CallFuncGetMinigameReturnValue, bool& CallFuncIsValidReturnValue); // (Event | Public | BlueprintCallable | BlueprintEvent)

	// Function /Game/Athena/PlayerPawn_Athena.PlayerPawn_Athena_C.GetRightAxis (Has no native function)
