// Class /Script/NavigationSystem.RecastNavMesh
// Size: 0x578
class ARecastNavMesh : public ANavigationData
{
	unsigned char bDrawTriangleEdges; // 0x498 (0x1)
	unsigned char bDrawPolyEdges; // 0x498 (0x1)
	unsigned char bDrawFilledPolys; // 0x498 (0x1)
	unsigned char bDrawNavMeshEdges; // 0x498 (0x1)
	unsigned char bDrawTileBounds; // 0x498 (0x1)
	unsigned char bDrawPathCollidingGeometry; // 0x498 (0x1)
	unsigned char bDrawTileLabels; // 0x498 (0x1)
	unsigned char bDrawPolygonLabels; // 0x498 (0x1)
	unsigned char bDrawDefaultPolygonCost; // 0x499 (0x1)
	unsigned char bDrawPolygonFlags; // 0x499 (0x1)
	unsigned char bDrawLabelsOnPathNodes; // 0x499 (0x1)
	unsigned char bDrawNavLinks; // 0x499 (0x1)
	unsigned char bDrawFailedNavLinks; // 0x499 (0x1)
	unsigned char bDrawClusters; // 0x499 (0x1)
	unsigned char bDrawOctree; // 0x499 (0x1)
	unsigned char bDrawOctreeDetails; // 0x499 (0x1)
	unsigned char bDrawMarkedForbiddenPolys; // 0x49a (0x1)
	unsigned char bDistinctlyDrawTilesBeingBuilt; // 0x49a (0x1)
	unsigned char unreflected_49b[0x1]; // 0x49b (0x1) 
	float DrawOffset; // 0x49c (0x4)
	struct FRecastNavMeshTileGenerationDebug TileGenerationDebug; // 0x4a0 (0x14)
	unsigned char bFixedTilePoolSize; // 0x4b4 (0x1)
	unsigned char unreflected_4b5[0x3]; // 0x4b5 (0x3) 
	int TilePoolSize; // 0x4b8 (0x4)
	float TileSizeUU; // 0x4bc (0x4)
	float CellSize; // 0x4c0 (0x4)
	float CellHeight; // 0x4c4 (0x4)
	float AgentRadius; // 0x4c8 (0x4)
	float AgentHeight; // 0x4cc (0x4)
	float AgentMaxSlope; // 0x4d0 (0x4)
	float AgentMaxStepHeight; // 0x4d4 (0x4)
	float MinRegionArea; // 0x4d8 (0x4)
	float MergeRegionSize; // 0x4dc (0x4)
	float MaxSimplificationError; // 0x4e0 (0x4)
	int MaxSimultaneousTileGenerationJobsCount; // 0x4e4 (0x4)
	int TileNumberHardLimit; // 0x4e8 (0x4)
	int PolyRefTileBits; // 0x4ec (0x4)
	int PolyRefNavPolyBits; // 0x4f0 (0x4)
	int PolyRefSaltBits; // 0x4f4 (0x4)
	struct FVector NavMeshOriginOffset; // 0x4f8 (0x18)
	float DefaultDrawDistance; // 0x510 (0x4)
	float DefaultMaxSearchNodes; // 0x514 (0x4)
	float DefaultMaxHierarchicalSearchNodes; // 0x518 (0x4)
	struct TEnumAsByte<ERecastPartitioning> RegionPartitioning; // 0x51c (0x1)
	struct TEnumAsByte<ERecastPartitioning> LayerPartitioning; // 0x51d (0x1)
	unsigned char unreflected_51e[0x2]; // 0x51e (0x2) 
	int RegionChunkSplits; // 0x520 (0x4)
	int LayerChunkSplits; // 0x524 (0x4)
	unsigned char bSortNavigationAreasByCost; // 0x528 (0x1)
	unsigned char bIsWorldPartitioned; // 0x528 (0x1)
	unsigned char bPerformVoxelFiltering; // 0x528 (0x1)
	unsigned char bMarkLowHeightAreas; // 0x528 (0x1)
	unsigned char bUseExtraTopCellWhenMarkingAreas; // 0x528 (0x1)
	unsigned char bFilterLowSpanSequences; // 0x528 (0x1)
	unsigned char bFilterLowSpanFromTileCache; // 0x528 (0x1)
	unsigned char bDoFullyAsyncNavDataGathering; // 0x528 (0x1)
	unsigned char bUseBetterOffsetsFromCorners; // 0x529 (0x1)
	unsigned char bStoreEmptyTileLayers; // 0x529 (0x1)
	unsigned char bUseVirtualFilters; // 0x529 (0x1)
	unsigned char bUseVirtualGeometryFilteringAndDirtying; // 0x529 (0x1)
	unsigned char bAllowNavLinkAsPathEnd; // 0x529 (0x1)
	unsigned char unreflected_52a[0x2]; // 0x52a (0x2) 
	int TimeSliceFilterLedgeSpansMaxYProcess; // 0x52c (0x4)
	double TimeSliceLongDurationDebug; // 0x530 (0x8)
	unsigned char bUseVoxelCache; // 0x538 (0x1)
	unsigned char unreflected_539[0x3]; // 0x539 (0x3) 
	float TileSetUpdateInterval; // 0x53c (0x4)
	float HeuristicScale; // 0x540 (0x4)
	float VerticalDeviationFromGroundCompensation; // 0x544 (0x4)
	unsigned char padding_548[0x30]; // 0x548 (0x30)

	/* Functions */

	// Function /Script/NavigationSystem.RecastNavMesh.K2_ReplaceAreaInTileBounds (Underlying native function: K2_ReplaceAreaInTileBounds 0xa0b5620)
	bool K2ReplaceAreaInTileBounds(struct FBox& Bounds, class UClass*& OldArea, class UClass*& NewArea, bool& ReplaceLinks); // (Final | Native | Public | HasDefaults | BlueprintCallable)
};

