// Class /Script/Engine.ServerStatReplicator
// Size: 0x350
class AServerStatReplicator : public AInfo
{
	bool bUpdateStatNet; // 0x288 (0x1)
	bool bOverwriteClientStats; // 0x289 (0x1)
	unsigned char unreflected_28a[0x2]; // 0x28a (0x2) 
	uint32_t Channels; // 0x28c (0x4)
	uint32_t InRate; // 0x290 (0x4)
	uint32_t OutRate; // 0x294 (0x4)
	unsigned char unreflected_298[0x4]; // 0x298 (0x4) 
	uint32_t MaxPacketOverhead; // 0x29c (0x4)
	uint32_t InRateClientMax; // 0x2a0 (0x4)
	uint32_t InRateClientMin; // 0x2a4 (0x4)
	uint32_t InRateClientAvg; // 0x2a8 (0x4)
	uint32_t InPacketsClientMax; // 0x2ac (0x4)
	uint32_t InPacketsClientMin; // 0x2b0 (0x4)
	uint32_t InPacketsClientAvg; // 0x2b4 (0x4)
	uint32_t OutRateClientMax; // 0x2b8 (0x4)
	uint32_t OutRateClientMin; // 0x2bc (0x4)
	uint32_t OutRateClientAvg; // 0x2c0 (0x4)
	uint32_t OutPacketsClientMax; // 0x2c4 (0x4)
	uint32_t OutPacketsClientMin; // 0x2c8 (0x4)
	uint32_t OutPacketsClientAvg; // 0x2cc (0x4)
	uint32_t NetNumClients; // 0x2d0 (0x4)
	uint32_t InPackets; // 0x2d4 (0x4)
	uint32_t OutPackets; // 0x2d8 (0x4)
	uint32_t InBunches; // 0x2dc (0x4)
	uint32_t OutBunches; // 0x2e0 (0x4)
	uint32_t OutLoss; // 0x2e4 (0x4)
	uint32_t InLoss; // 0x2e8 (0x4)
	uint32_t VoiceBytesSent; // 0x2ec (0x4)
	uint32_t VoiceBytesRecv; // 0x2f0 (0x4)
	uint32_t VoicePacketsSent; // 0x2f4 (0x4)
	uint32_t VoicePacketsRecv; // 0x2f8 (0x4)
	uint32_t PercentInVoice; // 0x2fc (0x4)
	uint32_t PercentOutVoice; // 0x300 (0x4)
	uint32_t NumActorChannels; // 0x304 (0x4)
	uint32_t NumConsideredActors; // 0x308 (0x4)
	uint32_t PrioritizedActors; // 0x30c (0x4)
	uint32_t NumRelevantActors; // 0x310 (0x4)
	uint32_t NumRelevantDeletedActors; // 0x314 (0x4)
	uint32_t NumReplicatedActorAttempts; // 0x318 (0x4)
	uint32_t NumReplicatedActors; // 0x31c (0x4)
	uint32_t NumActors; // 0x320 (0x4)
	uint32_t NumNetActors; // 0x324 (0x4)
	uint32_t NumDormantActors; // 0x328 (0x4)
	uint32_t NumInitiallyDormantActors; // 0x32c (0x4)
	uint32_t NumNetGUIDsAckd; // 0x330 (0x4)
	uint32_t NumNetGUIDsPending; // 0x334 (0x4)
	uint32_t NumNetGUIDsUnAckd; // 0x338 (0x4)
	uint32_t ObjPathBytes; // 0x33c (0x4)
	uint32_t NetGUIDOutRate; // 0x340 (0x4)
	uint32_t NetGUIDInRate; // 0x344 (0x4)
	uint32_t NetSaturated; // 0x348 (0x4)
	unsigned char padding_34c[0x4]; // 0x34c (0x4)
};

