// Class /Script/FortniteGame.TimeOfDayController_BlueprintBase
// Size: 0x438
class ATimeOfDayController_BlueprintBase : public AActor
{
	unsigned char bOverrideFogCutoffDistance; // 0x288 (0x1)
	unsigned char bOverrideFogDensity; // 0x288 (0x1)
	unsigned char bOverrideFogHeightFalloff; // 0x288 (0x1)
	unsigned char bOverrideFogInscatteringColor; // 0x288 (0x1)
	unsigned char bOverrideFogMaxOpacity; // 0x288 (0x1)
	unsigned char bOverrideFogStartDistance; // 0x288 (0x1)
	unsigned char bOverrideFogDirectionalInscatteringColor; // 0x288 (0x1)
	unsigned char bOverrideFogDirectionalInscatteringExponent; // 0x288 (0x1)
	unsigned char bOverrideFogDirectionalInscatteringStartDistance; // 0x289 (0x1)
	unsigned char bOverrideFogFullyDirectionalInscatteringColorDistance; // 0x289 (0x1)
	unsigned char bOverrideFogUseVolumetricFog; // 0x289 (0x1)
	unsigned char bOverrideFogVolumetricFogExtinctionScale; // 0x289 (0x1)
	unsigned char bOverrideFogVolumetricFogDistance; // 0x289 (0x1)
	unsigned char bOverrideFogVolumetricFogScatteringDistribution; // 0x289 (0x1)
	unsigned char bOverrideFogVolumetricFogAlbedo; // 0x289 (0x1)
	unsigned char bOverrideTimeOfDay; // 0x289 (0x1)
	unsigned char bOverridePostProcessBlendWeight; // 0x28a (0x1)
	unsigned char bOverridePostProcessFogOpacity; // 0x28a (0x1)
	unsigned char bOverridePostProcessFogColor; // 0x28a (0x1)
	unsigned char bOverrideDirectionalLightColor; // 0x28a (0x1)
	unsigned char bOverrideDirectionalLightIntensity; // 0x28a (0x1)
	unsigned char bOverrideDirectionalLightAngle; // 0x28a (0x1)
	unsigned char bOverrideCloudHorizonColor; // 0x28a (0x1)
	unsigned char bOverrideSkyboxHorizonColor; // 0x28a (0x1)
	unsigned char bOverrideSkyboxZenithColor; // 0x28b (0x1)
	unsigned char bOverrideCloudAmountHorizon; // 0x28b (0x1)
	unsigned char bOverrideCloudAmountZenith; // 0x28b (0x1)
	unsigned char bOverrideCloudSpeedMaster; // 0x28b (0x1)
	unsigned char bOverrideCloudSpeedDetailTextureOne; // 0x28b (0x1)
	unsigned char bOverrideCloudSpeedDetailTextureTwo; // 0x28b (0x1)
	unsigned char bOverrideStormStrength; // 0x28b (0x1)
	unsigned char bOverrideSunScale; // 0x28b (0x1)
	unsigned char bOverrideSunDiscIntensity; // 0x28c (0x1)
	unsigned char bOverrideSkyLightColor; // 0x28c (0x1)
	unsigned char bOverrideSkyLightIntensity; // 0x28c (0x1)
	unsigned char bOverrideSkyLightCubemap; // 0x28c (0x1)
	unsigned char unreflected_28d[0x3]; // 0x28d (0x3) 
	float FogCutoffDistance; // 0x290 (0x4)
	float FogDensity; // 0x294 (0x4)
	float FogHeightFalloff; // 0x298 (0x4)
	struct FLinearColor FogInscatteringColor; // 0x29c (0x10)
	float FogMaxOpacity; // 0x2ac (0x4)
	float FogStartDistance; // 0x2b0 (0x4)
	struct FLinearColor FogDirectionalInscatteringColor; // 0x2b4 (0x10)
	float FogDirectionalInscatteringExponent; // 0x2c4 (0x4)
	float FogDirectionalInscatteringStartDistance; // 0x2c8 (0x4)
	float FogFullyDirectionalInscatteringColorDistance; // 0x2cc (0x4)
	bool FogUseVolumetricFog; // 0x2d0 (0x1)
	unsigned char unreflected_2d1[0x3]; // 0x2d1 (0x3) 
	float FogVolumetricFogExtinctionScale; // 0x2d4 (0x4)
	float FogVolumetricFogDistance; // 0x2d8 (0x4)
	float FogVolumetricFogScatteringDistribution; // 0x2dc (0x4)
	struct FColor FogVolumetricFogAlbedo; // 0x2e0 (0x4)
	float TimeOfDay; // 0x2e4 (0x4)
	float PostProcessBlendWeight; // 0x2e8 (0x4)
	float PostProcessFogOpacity; // 0x2ec (0x4)
	struct FLinearColor PostProcessFogColor; // 0x2f0 (0x10)
	struct FLinearColor DirectionalLightColor; // 0x300 (0x10)
	float DirectionalLightIntensity; // 0x310 (0x4)
	unsigned char unreflected_314[0x4]; // 0x314 (0x4) 
	struct FVector DirectionalLightAngle; // 0x318 (0x18)
	bool bResetMaterialWhenUpdatingParams; // 0x330 (0x1)
	unsigned char unreflected_331[0x3]; // 0x331 (0x3) 
	struct FLinearColor CloudHorizonColor; // 0x334 (0x10)
	struct FLinearColor SkyboxHorizonColor; // 0x344 (0x10)
	struct FLinearColor SkyboxZenithColor; // 0x354 (0x10)
	float CloudAmountHorizon; // 0x364 (0x4)
	float CloudAmountZenith; // 0x368 (0x4)
	float CloudSpeedMaster; // 0x36c (0x4)
	float CloudSpeedDetailTextureOne; // 0x370 (0x4)
	float CloudSpeedDetailTextureTwo; // 0x374 (0x4)
	float StormStrength; // 0x378 (0x4)
	float SunScale; // 0x37c (0x4)
	float SunDiscIntensity; // 0x380 (0x4)
	unsigned char unreflected_384[0x4]; // 0x384 (0x4) 
	struct TMap<struct FName, float> ScalarParameters; // 0x388 (0x50)
	struct TArray<struct FName> SkyboxHorizonMaterialParameters; // 0x3d8 (0x10)
	struct TArray<struct FName> SkyboxZenithMaterialParameters; // 0x3e8 (0x10)
	struct FLinearColor SkyLightColor; // 0x3f8 (0x10)
	float SkyLightIntensity; // 0x408 (0x4)
	unsigned char unreflected_40c[0x4]; // 0x40c (0x4) 
	class UTextureCube* SkyLightCubemap; // 0x410 (0x8)
	class AFortTimeOfDayManager* TODM; // 0x418 (0x8)
	class UExponentialHeightFogComponent* ExponentialHeightFog; // 0x420 (0x8)
	class UDirectionalLightComponent* DirectionalLight; // 0x428 (0x8)
	class USkyLightComponent* SkyLight; // 0x430 (0x8)

	/* Functions */

	// Function /Script/FortniteGame.TimeOfDayController_BlueprintBase.SetSunOrMoonScale (Has no native function)
	void SetSunOrMoonScale(); // (Event | Protected | BlueprintEvent)

	// Function /Script/FortniteGame.TimeOfDayController_BlueprintBase.SetPostProcessSettings (Has no native function)
	void SetPostProcessSettings(); // (Event | Protected | BlueprintEvent)
};

