// ScriptStruct /Script/FortniteAI.AimingCircleSettings
// Size: 0x3e8
struct FAimingCircleSettings
{
	struct FScalableFloat UseAimingCircle; // 0x0 (0x28)
	struct FScalableFloat CircleCenterOffsetZ; // 0x28 (0x28)
	struct FScalableFloat MinCircleOpeningAngleVerticalCurve; // 0x50 (0x28)
	struct FScalableFloat MaxCircleOpeningAngleVerticalCurve; // 0x78 (0x28)
	struct FScalableFloat MinCircleOpeningAngleHorizontalCurve; // 0xa0 (0x28)
	struct FScalableFloat MaxCircleOpeningAngleHorizontalCurve; // 0xc8 (0x28)
	struct FScalableFloat MinCursorRotationSpeed; // 0xf0 (0x28)
	struct FScalableFloat MaxCursorRotationSpeed; // 0x118 (0x28)
	struct FScalableFloat MinCursorUpdateInterval; // 0x140 (0x28)
	struct FScalableFloat MaxCursorUpdateInterval; // 0x168 (0x28)
	struct FScalableFloat MinCursorTrackingFrequency; // 0x190 (0x28)
	struct FScalableFloat MaxCursorTrackingFrequency; // 0x1b8 (0x28)
	struct FScalableFloat CircleShrinkCurve; // 0x1e0 (0x28)
	struct FScalableFloat MinDistanceForTimeBetweenHits; // 0x208 (0x28)
	struct FScalableFloat MaxDistanceForTimeBetweenHits; // 0x230 (0x28)
	struct FScalableFloat MinTimeBetweenHitsAtMinRange; // 0x258 (0x28)
	struct FScalableFloat MaxTimeBetweenHitsAtMinRange; // 0x280 (0x28)
	struct FScalableFloat MinTimeBetweenHitsAtMaxRange; // 0x2a8 (0x28)
	struct FScalableFloat MaxTimeBetweenHitsAtMaxRange; // 0x2d0 (0x28)
	struct FScalableFloat ForceMissEnabled; // 0x2f8 (0x28)
	struct FScalableFloat PreventHeadshots; // 0x320 (0x28)
	struct FScalableFloat WeaponSpreadContributionToClampCurve; // 0x348 (0x28)
	struct FScalableFloat KillingBlowGracePeriodAtMinRange; // 0x370 (0x28)
	struct FScalableFloat KillingBlowGracePeriodAtMaxRange; // 0x398 (0x28)
	struct FScalableFloat ExtraHitOddsCurve; // 0x3c0 (0x28)
};

