// ScriptStruct /Script/FortniteGame.AirControlParams
// Size: 0x140
struct FAirControlParams
{
	struct FScalableFloat MaxAcceleration; // 0x0 (0x28)
	struct FScalableFloat LateralFriction; // 0x28 (0x28)
	struct FScalableFloat MaxLateralSpeed; // 0x50 (0x28)
	struct FScalableFloat TerminalVelocity; // 0x78 (0x28)
	struct FScalableFloat UpwardTerminalVelocity; // 0xa0 (0x28)
	struct FScalableFloat GravityScalar; // 0xc8 (0x28)
	struct FScalableFloat CustomGravityCeiling; // 0xf0 (0x28)
	struct FScalableFloat CustomGravityCeilingWidth; // 0x118 (0x28)
};

