// ScriptStruct /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x138
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty265; // 0x4 (0x4)
	struct FName NameProperty266; // 0x8 (0x4)
	struct FInputScaleBiasClampConstants StructProperty267; // 0xc (0x2c)
	class UBlendProfile* BlendProfile268; // 0x38 (0x8)
	class UCurveFloat* CurveFloat269; // 0x40 (0x8)
	enum EAlphaBlendOption EnumProperty270; // 0x48 (0x1)
	enum EBlendListTransitionType EnumProperty271; // 0x49 (0x1)
	unsigned char unreflected_4a[0x6]; // 0x4a (0x6) 
	struct TArray<float> ArrayProperty272; // 0x50 (0x10)
	bool BoolProperty273; // 0x60 (0x1)
	unsigned char unreflected_61[0x3]; // 0x61 (0x3) 
	float FloatProperty274; // 0x64 (0x4)
	float FloatProperty275; // 0x68 (0x4)
	bool BoolProperty276; // 0x6c (0x1)
	enum EAnimSyncMethod EnumProperty277; // 0x6d (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty278; // 0x6e (0x1)
	unsigned char unreflected_6f[0x1]; // 0x6f (0x1) 
	struct FName NameProperty279; // 0x70 (0x4)
	struct FName NameProperty280; // 0x74 (0x4)
	struct FName NameProperty281; // 0x78 (0x4)
	struct FName NameProperty282; // 0x7c (0x4)
	struct FAnimNodeFunctionRef StructProperty283; // 0x80 (0x18)
	struct FName NameProperty284; // 0x98 (0x4)
	struct FName NameProperty285; // 0x9c (0x4)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0xa0 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x120 (0x18)
};

