// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x44
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char ByteProperty; // 0x1 (0x1)
	unsigned char unreflected_2[0x6]; // 0x2 (0x6) 
	struct TArray<float> ArrayProperty0; // 0x8 (0x10)
	bool BoolProperty1; // 0x18 (0x1)
	bool BoolProperty2; // 0x19 (0x1)
	unsigned char unreflected_1a[0x2]; // 0x1a (0x2) 
	float FloatProperty3; // 0x1c (0x4)
	float FloatProperty4; // 0x20 (0x4)
	unsigned char ByteProperty5; // 0x24 (0x1)
	unsigned char unreflected_25[0x3]; // 0x25 (0x3) 
	struct TArray<float> ArrayProperty6; // 0x28 (0x10)
	bool BoolProperty7; // 0x38 (0x1)
	bool BoolProperty8; // 0x39 (0x1)
	unsigned char unreflected_3a[0x2]; // 0x3a (0x2) 
	float FloatProperty9; // 0x3c (0x4)
	float FloatProperty10; // 0x40 (0x4)
};

