// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x6c
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	unsigned char unreflected_2[0x6]; // 0x2 (0x6) 
	struct TArray<float> ArrayProperty0; // 0x8 (0x10)
	bool BoolProperty1; // 0x18 (0x1)
	unsigned char ByteProperty2; // 0x19 (0x1)
	bool BoolProperty3; // 0x1a (0x1)
	unsigned char unreflected_1b[0x5]; // 0x1b (0x5) 
	struct TArray<float> ArrayProperty4; // 0x20 (0x10)
	bool BoolProperty5; // 0x30 (0x1)
	unsigned char ByteProperty6; // 0x31 (0x1)
	bool BoolProperty7; // 0x32 (0x1)
	unsigned char unreflected_33[0x5]; // 0x33 (0x5) 
	struct TArray<float> ArrayProperty8; // 0x38 (0x10)
	unsigned char ByteProperty9; // 0x48 (0x1)
	unsigned char unreflected_49[0x7]; // 0x49 (0x7) 
	struct TArray<float> ArrayProperty10; // 0x50 (0x10)
	unsigned char ByteProperty11; // 0x60 (0x1)
	unsigned char unreflected_61[0x3]; // 0x61 (0x3) 
	float FloatProperty12; // 0x64 (0x4)
	float FloatProperty13; // 0x68 (0x4)
};

