// ScriptStruct /Game/Weapons/FORT_Melee/Pickaxe_HightowerTapas/Meshes/HighTower_Tapas_Axe_AnimBP.HighTower_Tapas_Axe_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0xe8
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty61; // 0x4 (0x4)
	struct FName NameProperty62; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	class UBlendProfile* BlendProfile63; // 0x10 (0x8)
	class UCurveFloat* CurveFloat64; // 0x18 (0x8)
	bool BoolProperty65; // 0x20 (0x1)
	enum EAlphaBlendOption EnumProperty66; // 0x21 (0x1)
	enum EBlendListTransitionType EnumProperty67; // 0x22 (0x1)
	unsigned char unreflected_23[0x5]; // 0x23 (0x5) 
	struct TArray<float> ArrayProperty68; // 0x28 (0x10)
	struct FAnimNodeFunctionRef StructProperty69; // 0x38 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x50 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0xd0 (0x18)
};

