// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x260
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty2539; // 0x4 (0x4)
	struct TArray<float> ArrayProperty2540; // 0x8 (0x10)
	struct FName NameProperty2541; // 0x18 (0x4)
	unsigned char unreflected_1c[0x4]; // 0x1c (0x4) 
	struct TArray<float> ArrayProperty2542; // 0x20 (0x10)
	struct FName NameProperty2543; // 0x30 (0x4)
	struct FName NameProperty2544; // 0x34 (0x4)
	enum EBlendListTransitionType EnumProperty2545; // 0x38 (0x1)
	unsigned char unreflected_39[0x3]; // 0x39 (0x3) 
	struct FName NameProperty2546; // 0x3c (0x4)
	struct FName NameProperty2547; // 0x40 (0x4)
	struct FName NameProperty2548; // 0x44 (0x4)
	struct FName NameProperty2549; // 0x48 (0x4)
	struct FName NameProperty2550; // 0x4c (0x4)
	struct TArray<float> ArrayProperty2551; // 0x50 (0x10)
	struct TArray<int> ArrayProperty2552; // 0x60 (0x10)
	struct FName NameProperty2553; // 0x70 (0x4)
	struct FName NameProperty2554; // 0x74 (0x4)
	struct FName NameProperty2555; // 0x78 (0x4)
	struct FName NameProperty2556; // 0x7c (0x4)
	struct FName NameProperty2557; // 0x80 (0x4)
	struct FName NameProperty2558; // 0x84 (0x4)
	struct TArray<float> ArrayProperty2559; // 0x88 (0x10)
	struct TArray<int> ArrayProperty2560; // 0x98 (0x10)
	struct FName NameProperty2561; // 0xa8 (0x4)
	struct FName NameProperty2562; // 0xac (0x4)
	struct FName NameProperty2563; // 0xb0 (0x4)
	struct FName NameProperty2564; // 0xb4 (0x4)
	struct FName NameProperty2565; // 0xb8 (0x4)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty2566; // 0xbc (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty2567; // 0xbd (0x1)
	unsigned char unreflected_be[0x2]; // 0xbe (0x2) 
	struct FName NameProperty2568; // 0xc0 (0x4)
	struct FName NameProperty2569; // 0xc4 (0x4)
	struct TArray<float> ArrayProperty2570; // 0xc8 (0x10)
	struct TArray<int> ArrayProperty2571; // 0xd8 (0x10)
	struct TArray<float> ArrayProperty2572; // 0xe8 (0x10)
	struct FName NameProperty2573; // 0xf8 (0x4)
	struct FName NameProperty2574; // 0xfc (0x4)
	struct FName NameProperty2575; // 0x100 (0x4)
	struct FName NameProperty2576; // 0x104 (0x4)
	int IntProperty2577; // 0x108 (0x4)
	enum EAnimSyncMethod EnumProperty2578; // 0x10c (0x1)
	unsigned char unreflected_10d[0x3]; // 0x10d (0x3) 
	struct FName NameProperty2579; // 0x110 (0x4)
	int IntProperty2580; // 0x114 (0x4)
	struct FInputScaleBiasClampConstants StructProperty2581; // 0x118 (0x2c)
	unsigned char unreflected_144[0x4]; // 0x144 (0x4) 
	class UBlendProfile* BlendProfile2582; // 0x148 (0x8)
	class UCurveFloat* CurveFloat2583; // 0x150 (0x8)
	enum EAlphaBlendOption EnumProperty2584; // 0x158 (0x1)
	enum EBlendListTransitionType EnumProperty2585; // 0x159 (0x1)
	unsigned char unreflected_15a[0x6]; // 0x15a (0x6) 
	struct TArray<float> ArrayProperty2586; // 0x160 (0x10)
	struct TArray<int> ArrayProperty2587; // 0x170 (0x10)
	struct FName NameProperty2588; // 0x180 (0x4)
	int IntProperty2589; // 0x184 (0x4)
	float FloatProperty2590; // 0x188 (0x4)
	bool BoolProperty2591; // 0x18c (0x1)
	unsigned char unreflected_18d[0x3]; // 0x18d (0x3) 
	float FloatProperty2592; // 0x190 (0x4)
	bool BoolProperty2593; // 0x194 (0x1)
	enum EAnimSyncMethod EnumProperty2594; // 0x195 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty2595; // 0x196 (0x1)
	unsigned char unreflected_197[0x1]; // 0x197 (0x1) 
	struct FName NameProperty2596; // 0x198 (0x4)
	struct FName NameProperty2597; // 0x19c (0x4)
	int IntProperty2598; // 0x1a0 (0x4)
	struct FName NameProperty2599; // 0x1a4 (0x4)
	struct FName NameProperty2600; // 0x1a8 (0x4)
	int IntProperty2601; // 0x1ac (0x4)
	struct FAnimNodeFunctionRef StructProperty2602; // 0x1b0 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x1c8 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x248 (0x18)
};

