// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x2f0
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty1068; // 0x4 (0x4)
	struct FName NameProperty1069; // 0x8 (0x4)
	struct FName NameProperty1070; // 0xc (0x4)
	struct FName NameProperty1071; // 0x10 (0x4)
	struct FName NameProperty1072; // 0x14 (0x4)
	struct FName NameProperty1073; // 0x18 (0x4)
	struct FName NameProperty1074; // 0x1c (0x4)
	struct FName NameProperty1075; // 0x20 (0x4)
	struct FName NameProperty1076; // 0x24 (0x4)
	struct FName NameProperty1077; // 0x28 (0x4)
	struct FName NameProperty1078; // 0x2c (0x4)
	struct FName NameProperty1079; // 0x30 (0x4)
	struct FName NameProperty1080; // 0x34 (0x4)
	struct FName NameProperty1081; // 0x38 (0x4)
	struct FName NameProperty1082; // 0x3c (0x4)
	struct FName NameProperty1083; // 0x40 (0x4)
	struct FName NameProperty1084; // 0x44 (0x4)
	struct FName NameProperty1085; // 0x48 (0x4)
	struct FName NameProperty1086; // 0x4c (0x4)
	struct FName NameProperty1087; // 0x50 (0x4)
	struct FName NameProperty1088; // 0x54 (0x4)
	struct FName NameProperty1089; // 0x58 (0x4)
	struct FName NameProperty1090; // 0x5c (0x4)
	struct FName NameProperty1091; // 0x60 (0x4)
	struct FName NameProperty1092; // 0x64 (0x4)
	struct FName NameProperty1093; // 0x68 (0x4)
	struct FName NameProperty1094; // 0x6c (0x4)
	struct FName NameProperty1095; // 0x70 (0x4)
	struct FName NameProperty1096; // 0x74 (0x4)
	struct FName NameProperty1097; // 0x78 (0x4)
	unsigned char unreflected_7c[0x4]; // 0x7c (0x4) 
	struct TArray<float> ArrayProperty1098; // 0x80 (0x10)
	struct TArray<float> ArrayProperty1099; // 0x90 (0x10)
	struct TArray<int> ArrayProperty1100; // 0xa0 (0x10)
	struct FName NameProperty1101; // 0xb0 (0x4)
	unsigned char unreflected_b4[0x4]; // 0xb4 (0x4) 
	struct TArray<float> ArrayProperty1102; // 0xb8 (0x10)
	enum EAlphaBlendOption EnumProperty1103; // 0xc8 (0x1)
	unsigned char unreflected_c9[0x7]; // 0xc9 (0x7) 
	struct TArray<float> ArrayProperty1104; // 0xd0 (0x10)
	struct TArray<float> ArrayProperty1105; // 0xe0 (0x10)
	struct TArray<float> ArrayProperty1106; // 0xf0 (0x10)
	struct TArray<int> ArrayProperty1107; // 0x100 (0x10)
	struct FName NameProperty1108; // 0x110 (0x4)
	unsigned char unreflected_114[0x4]; // 0x114 (0x4) 
	struct TArray<float> ArrayProperty1109; // 0x118 (0x10)
	struct FName NameProperty1110; // 0x128 (0x4)
	unsigned char unreflected_12c[0x4]; // 0x12c (0x4) 
	struct TArray<float> ArrayProperty1111; // 0x130 (0x10)
	struct TArray<int> ArrayProperty1112; // 0x140 (0x10)
	struct FName NameProperty1113; // 0x150 (0x4)
	struct FName NameProperty1114; // 0x154 (0x4)
	int IntProperty1115; // 0x158 (0x4)
	struct FName NameProperty1116; // 0x15c (0x4)
	int IntProperty1117; // 0x160 (0x4)
	struct FName NameProperty1118; // 0x164 (0x4)
	struct FName NameProperty1119; // 0x168 (0x4)
	int IntProperty1120; // 0x16c (0x4)
	struct TArray<float> ArrayProperty1121; // 0x170 (0x10)
	struct TArray<float> ArrayProperty1122; // 0x180 (0x10)
	struct FName NameProperty1123; // 0x190 (0x4)
	struct FName NameProperty1124; // 0x194 (0x4)
	int IntProperty1125; // 0x198 (0x4)
	unsigned char unreflected_19c[0x4]; // 0x19c (0x4) 
	struct TArray<int> ArrayProperty1126; // 0x1a0 (0x10)
	enum EAnimSyncMethod EnumProperty1127; // 0x1b0 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty1128; // 0x1b1 (0x1)
	unsigned char unreflected_1b2[0x2]; // 0x1b2 (0x2) 
	struct FName NameProperty1129; // 0x1b4 (0x4)
	struct FName NameProperty1130; // 0x1b8 (0x4)
	int IntProperty1131; // 0x1bc (0x4)
	struct FName NameProperty1132; // 0x1c0 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty1133; // 0x1c4 (0x1)
	bool BoolProperty1134; // 0x1c5 (0x1)
	unsigned char unreflected_1c6[0x2]; // 0x1c6 (0x2) 
	float FloatProperty1135; // 0x1c8 (0x4)
	struct FInputScaleBiasClampConstants StructProperty1136; // 0x1cc (0x2c)
	float FloatProperty1137; // 0x1f8 (0x4)
	enum EAnimSyncMethod EnumProperty1138; // 0x1fc (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty1139; // 0x1fd (0x1)
	unsigned char unreflected_1fe[0x2]; // 0x1fe (0x2) 
	class UBlendProfile* BlendProfile1140; // 0x200 (0x8)
	class UCurveFloat* CurveFloat1141; // 0x208 (0x8)
	bool BoolProperty1142; // 0x210 (0x1)
	enum EAlphaBlendOption EnumProperty1143; // 0x211 (0x1)
	enum EBlendListTransitionType EnumProperty1144; // 0x212 (0x1)
	unsigned char unreflected_213[0x5]; // 0x213 (0x5) 
	struct TArray<float> ArrayProperty1145; // 0x218 (0x10)
	struct FName NameProperty1146; // 0x228 (0x4)
	struct FName NameProperty1147; // 0x22c (0x4)
	int IntProperty1148; // 0x230 (0x4)
	struct FName NameProperty1149; // 0x234 (0x4)
	struct FName NameProperty1150; // 0x238 (0x4)
	int IntProperty1151; // 0x23c (0x4)
	struct FAnimNodeFunctionRef StructProperty1152; // 0x240 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x258 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x2d8 (0x18)
};

