// ScriptStruct /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x71
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	unsigned char unreflected_2[0x2]; // 0x2 (0x2) 
	float FloatProperty0; // 0x4 (0x4)
	bool BoolProperty1; // 0x8 (0x1)
	unsigned char unreflected_9[0x3]; // 0x9 (0x3) 
	float FloatProperty2; // 0xc (0x4)
	float FloatProperty3; // 0x10 (0x4)
	float FloatProperty4; // 0x14 (0x4)
	float FloatProperty5; // 0x18 (0x4)
	float FloatProperty6; // 0x1c (0x4)
	bool BoolProperty7; // 0x20 (0x1)
	bool BoolProperty8; // 0x21 (0x1)
	bool BoolProperty9; // 0x22 (0x1)
	bool BoolProperty10; // 0x23 (0x1)
	bool BoolProperty11; // 0x24 (0x1)
	unsigned char unreflected_25[0x3]; // 0x25 (0x3) 
	float FloatProperty12; // 0x28 (0x4)
	float FloatProperty13; // 0x2c (0x4)
	bool BoolProperty14; // 0x30 (0x1)
	unsigned char unreflected_31[0x3]; // 0x31 (0x3) 
	float FloatProperty15; // 0x34 (0x4)
	float FloatProperty16; // 0x38 (0x4)
	bool BoolProperty17; // 0x3c (0x1)
	bool BoolProperty18; // 0x3d (0x1)
	unsigned char unreflected_3e[0x2]; // 0x3e (0x2) 
	float FloatProperty19; // 0x40 (0x4)
	bool BoolProperty20; // 0x44 (0x1)
	unsigned char unreflected_45[0x3]; // 0x45 (0x3) 
	float FloatProperty21; // 0x48 (0x4)
	float FloatProperty22; // 0x4c (0x4)
	bool BoolProperty23; // 0x50 (0x1)
	unsigned char unreflected_51[0x3]; // 0x51 (0x3) 
	float FloatProperty24; // 0x54 (0x4)
	bool BoolProperty25; // 0x58 (0x1)
	unsigned char unreflected_59[0x3]; // 0x59 (0x3) 
	float FloatProperty26; // 0x5c (0x4)
	float FloatProperty27; // 0x60 (0x4)
	float FloatProperty28; // 0x64 (0x4)
	float FloatProperty29; // 0x68 (0x4)
	float FloatProperty30; // 0x6c (0x4)
	bool BoolProperty31; // 0x70 (0x1)
};

