// ScriptStruct /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x1c
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	unsigned char unreflected_2[0x2]; // 0x2 (0x2) 
	float FloatProperty0; // 0x4 (0x4)
	float FloatProperty1; // 0x8 (0x4)
	bool BoolProperty2; // 0xc (0x1)
	bool BoolProperty3; // 0xd (0x1)
	bool BoolProperty4; // 0xe (0x1)
	unsigned char unreflected_f[0x1]; // 0xf (0x1) 
	float FloatProperty5; // 0x10 (0x4)
	bool BoolProperty6; // 0x14 (0x1)
	bool BoolProperty7; // 0x15 (0x1)
	bool BoolProperty8; // 0x16 (0x1)
	bool BoolProperty9; // 0x17 (0x1)
	float FloatProperty10; // 0x18 (0x4)
};

