// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x150
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty187; // 0x4 (0x4)
	struct FName NameProperty188; // 0x8 (0x4)
	int IntProperty189; // 0xc (0x4)
	struct TArray<float> ArrayProperty190; // 0x10 (0x10)
	struct TArray<int> ArrayProperty191; // 0x20 (0x10)
	struct FInputScaleBiasClampConstants StructProperty192; // 0x30 (0x2c)
	unsigned char unreflected_5c[0x4]; // 0x5c (0x4) 
	class UBlendProfile* BlendProfile193; // 0x60 (0x8)
	class UCurveFloat* CurveFloat194; // 0x68 (0x8)
	bool BoolProperty195; // 0x70 (0x1)
	enum EAlphaBlendOption EnumProperty196; // 0x71 (0x1)
	enum EBlendListTransitionType EnumProperty197; // 0x72 (0x1)
	unsigned char unreflected_73[0x5]; // 0x73 (0x5) 
	struct TArray<float> ArrayProperty198; // 0x78 (0x10)
	float FloatProperty199; // 0x88 (0x4)
	float FloatProperty200; // 0x8c (0x4)
	bool BoolProperty201; // 0x90 (0x1)
	enum EAnimSyncMethod EnumProperty202; // 0x91 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty203; // 0x92 (0x1)
	unsigned char unreflected_93[0x1]; // 0x93 (0x1) 
	struct FName NameProperty204; // 0x94 (0x4)
	struct FName NameProperty205; // 0x98 (0x4)
	int IntProperty206; // 0x9c (0x4)
	struct FAnimNodeFunctionRef StructProperty207; // 0xa0 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0xb8 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x138 (0x18)
};

