// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x68
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char unreflected_1[0x7]; // 0x1 (0x7) 
	struct TArray<float> ArrayProperty; // 0x8 (0x10)
	bool BoolProperty0; // 0x18 (0x1)
	bool BoolProperty1; // 0x19 (0x1)
	bool BoolProperty2; // 0x1a (0x1)
	unsigned char unreflected_1b[0x5]; // 0x1b (0x5) 
	class UAnimSequenceBase* AnimSequenceBase3; // 0x20 (0x8)
	class UAnimSequenceBase* AnimSequenceBase4; // 0x28 (0x8)
	class UAnimSequenceBase* AnimSequenceBase5; // 0x30 (0x8)
	class UAnimSequenceBase* AnimSequenceBase6; // 0x38 (0x8)
	bool BoolProperty7; // 0x40 (0x1)
	unsigned char unreflected_41[0x7]; // 0x41 (0x7) 
	class UAnimSequenceBase* AnimSequenceBase8; // 0x48 (0x8)
	class UAnimSequenceBase* AnimSequenceBase9; // 0x50 (0x8)
	bool BoolProperty10; // 0x58 (0x1)
	bool BoolProperty11; // 0x59 (0x1)
	unsigned char unreflected_5a[0x6]; // 0x5a (0x6) 
	class UAnimSequenceBase* AnimSequenceBase12; // 0x60 (0x8)
};

