// ScriptStruct /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0xa2
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	unsigned char unreflected_2[0x2]; // 0x2 (0x2) 
	float FloatProperty0; // 0x4 (0x4)
	unsigned char ByteProperty1; // 0x8 (0x1)
	unsigned char unreflected_9[0x3]; // 0x9 (0x3) 
	float FloatProperty2; // 0xc (0x4)
	float FloatProperty3; // 0x10 (0x4)
	float FloatProperty4; // 0x14 (0x4)
	bool BoolProperty5; // 0x18 (0x1)
	unsigned char ByteProperty6; // 0x19 (0x1)
	bool BoolProperty7; // 0x1a (0x1)
	unsigned char unreflected_1b[0x1]; // 0x1b (0x1) 
	float FloatProperty8; // 0x1c (0x4)
	bool BoolProperty9; // 0x20 (0x1)
	unsigned char unreflected_21[0x3]; // 0x21 (0x3) 
	float FloatProperty10; // 0x24 (0x4)
	float FloatProperty11; // 0x28 (0x4)
	float FloatProperty12; // 0x2c (0x4)
	float FloatProperty13; // 0x30 (0x4)
	unsigned char ByteProperty14; // 0x34 (0x1)
	unsigned char unreflected_35[0x3]; // 0x35 (0x3) 
	float FloatProperty15; // 0x38 (0x4)
	float FloatProperty16; // 0x3c (0x4)
	unsigned char ByteProperty17; // 0x40 (0x1)
	unsigned char unreflected_41[0x3]; // 0x41 (0x3) 
	float FloatProperty18; // 0x44 (0x4)
	float FloatProperty19; // 0x48 (0x4)
	float FloatProperty20; // 0x4c (0x4)
	float FloatProperty21; // 0x50 (0x4)
	float FloatProperty22; // 0x54 (0x4)
	float FloatProperty23; // 0x58 (0x4)
	float FloatProperty24; // 0x5c (0x4)
	bool BoolProperty25; // 0x60 (0x1)
	unsigned char unreflected_61[0x3]; // 0x61 (0x3) 
	float FloatProperty26; // 0x64 (0x4)
	bool BoolProperty27; // 0x68 (0x1)
	bool BoolProperty28; // 0x69 (0x1)
	bool BoolProperty29; // 0x6a (0x1)
	bool BoolProperty30; // 0x6b (0x1)
	float FloatProperty31; // 0x6c (0x4)
	bool BoolProperty32; // 0x70 (0x1)
	bool BoolProperty33; // 0x71 (0x1)
	unsigned char unreflected_72[0x2]; // 0x72 (0x2) 
	float FloatProperty34; // 0x74 (0x4)
	float FloatProperty35; // 0x78 (0x4)
	float FloatProperty36; // 0x7c (0x4)
	class UAnimSequenceBase* AnimSequenceBase37; // 0x80 (0x8)
	class UAnimSequenceBase* AnimSequenceBase38; // 0x88 (0x8)
	struct TArray<float> ArrayProperty39; // 0x90 (0x10)
	bool BoolProperty40; // 0xa0 (0x1)
	bool BoolProperty41; // 0xa1 (0x1)
};

