// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_AnimBP.Player_InAir_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x83
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	unsigned char unreflected_2[0x6]; // 0x2 (0x6) 
	struct TArray<float> ArrayProperty0; // 0x8 (0x10)
	bool BoolProperty1; // 0x18 (0x1)
	bool BoolProperty2; // 0x19 (0x1)
	bool BoolProperty3; // 0x1a (0x1)
	unsigned char ByteProperty4; // 0x1b (0x1)
	bool BoolProperty5; // 0x1c (0x1)
	unsigned char unreflected_1d[0x3]; // 0x1d (0x3) 
	struct TArray<float> ArrayProperty6; // 0x20 (0x10)
	bool BoolProperty7; // 0x30 (0x1)
	bool BoolProperty8; // 0x31 (0x1)
	bool BoolProperty9; // 0x32 (0x1)
	unsigned char ByteProperty10; // 0x33 (0x1)
	float FloatProperty11; // 0x34 (0x4)
	bool BoolProperty12; // 0x38 (0x1)
	unsigned char unreflected_39[0x3]; // 0x39 (0x3) 
	float FloatProperty13; // 0x3c (0x4)
	float FloatProperty14; // 0x40 (0x4)
	bool BoolProperty15; // 0x44 (0x1)
	unsigned char unreflected_45[0x3]; // 0x45 (0x3) 
	float FloatProperty16; // 0x48 (0x4)
	unsigned char unreflected_4c[0x4]; // 0x4c (0x4) 
	struct TArray<float> ArrayProperty17; // 0x50 (0x10)
	bool BoolProperty18; // 0x60 (0x1)
	unsigned char unreflected_61[0x3]; // 0x61 (0x3) 
	float FloatProperty19; // 0x64 (0x4)
	bool BoolProperty20; // 0x68 (0x1)
	unsigned char unreflected_69[0x3]; // 0x69 (0x3) 
	float FloatProperty21; // 0x6c (0x4)
	bool BoolProperty22; // 0x70 (0x1)
	unsigned char unreflected_71[0x3]; // 0x71 (0x3) 
	float FloatProperty23; // 0x74 (0x4)
	unsigned char ByteProperty24; // 0x78 (0x1)
	unsigned char unreflected_79[0x3]; // 0x79 (0x3) 
	float FloatProperty25; // 0x7c (0x4)
	bool BoolProperty26; // 0x80 (0x1)
	bool BoolProperty27; // 0x81 (0x1)
	bool BoolProperty28; // 0x82 (0x1)
};

