// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x26
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	bool BoolProperty0; // 0x2 (0x1)
	bool BoolProperty1; // 0x3 (0x1)
	unsigned char ByteProperty2; // 0x4 (0x1)
	unsigned char ByteProperty3; // 0x5 (0x1)
	unsigned char ByteProperty4; // 0x6 (0x1)
	bool BoolProperty5; // 0x7 (0x1)
	struct TArray<float> ArrayProperty6; // 0x8 (0x10)
	bool BoolProperty7; // 0x18 (0x1)
	unsigned char ByteProperty8; // 0x19 (0x1)
	bool BoolProperty9; // 0x1a (0x1)
	unsigned char ByteProperty10; // 0x1b (0x1)
	bool BoolProperty11; // 0x1c (0x1)
	unsigned char ByteProperty12; // 0x1d (0x1)
	bool BoolProperty13; // 0x1e (0x1)
	bool BoolProperty14; // 0x1f (0x1)
	bool BoolProperty15; // 0x20 (0x1)
	bool BoolProperty16; // 0x21 (0x1)
	bool BoolProperty17; // 0x22 (0x1)
	bool BoolProperty18; // 0x23 (0x1)
	unsigned char ByteProperty19; // 0x24 (0x1)
	bool BoolProperty20; // 0x25 (0x1)
};

