// ScriptStruct /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x68
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	unsigned char unreflected_2[0x2]; // 0x2 (0x2) 
	float FloatProperty0; // 0x4 (0x4)
	bool BoolProperty1; // 0x8 (0x1)
	unsigned char unreflected_9[0x3]; // 0x9 (0x3) 
	float FloatProperty2; // 0xc (0x4)
	float FloatProperty3; // 0x10 (0x4)
	float FloatProperty4; // 0x14 (0x4)
	bool BoolProperty5; // 0x18 (0x1)
	bool BoolProperty6; // 0x19 (0x1)
	unsigned char unreflected_1a[0x2]; // 0x1a (0x2) 
	float FloatProperty7; // 0x1c (0x4)
	float FloatProperty8; // 0x20 (0x4)
	float FloatProperty9; // 0x24 (0x4)
	bool BoolProperty10; // 0x28 (0x1)
	bool BoolProperty11; // 0x29 (0x1)
	bool BoolProperty12; // 0x2a (0x1)
	bool BoolProperty13; // 0x2b (0x1)
	bool BoolProperty14; // 0x2c (0x1)
	unsigned char unreflected_2d[0x3]; // 0x2d (0x3) 
	float FloatProperty15; // 0x30 (0x4)
	bool BoolProperty16; // 0x34 (0x1)
	unsigned char unreflected_35[0x3]; // 0x35 (0x3) 
	float FloatProperty17; // 0x38 (0x4)
	float FloatProperty18; // 0x3c (0x4)
	bool BoolProperty19; // 0x40 (0x1)
	unsigned char unreflected_41[0x3]; // 0x41 (0x3) 
	float FloatProperty20; // 0x44 (0x4)
	bool BoolProperty21; // 0x48 (0x1)
	unsigned char unreflected_49[0x3]; // 0x49 (0x3) 
	float FloatProperty22; // 0x4c (0x4)
	float FloatProperty23; // 0x50 (0x4)
	float FloatProperty24; // 0x54 (0x4)
	bool BoolProperty25; // 0x58 (0x1)
	unsigned char unreflected_59[0x3]; // 0x59 (0x3) 
	float FloatProperty26; // 0x5c (0x4)
	float FloatProperty27; // 0x60 (0x4)
	float FloatProperty28; // 0x64 (0x4)
};

