// ScriptStruct /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x8d
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float FloatProperty; // 0x4 (0x4)
	float FloatProperty0; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	struct TArray<float> ArrayProperty1; // 0x10 (0x10)
	bool BoolProperty2; // 0x20 (0x1)
	bool BoolProperty3; // 0x21 (0x1)
	bool BoolProperty4; // 0x22 (0x1)
	bool BoolProperty5; // 0x23 (0x1)
	bool BoolProperty6; // 0x24 (0x1)
	unsigned char unreflected_25[0x3]; // 0x25 (0x3) 
	float FloatProperty7; // 0x28 (0x4)
	float FloatProperty8; // 0x2c (0x4)
	bool BoolProperty9; // 0x30 (0x1)
	unsigned char unreflected_31[0x3]; // 0x31 (0x3) 
	float FloatProperty10; // 0x34 (0x4)
	float FloatProperty11; // 0x38 (0x4)
	float FloatProperty12; // 0x3c (0x4)
	float FloatProperty13; // 0x40 (0x4)
	bool BoolProperty14; // 0x44 (0x1)
	bool BoolProperty15; // 0x45 (0x1)
	unsigned char unreflected_46[0x2]; // 0x46 (0x2) 
	float FloatProperty16; // 0x48 (0x4)
	float FloatProperty17; // 0x4c (0x4)
	float FloatProperty18; // 0x50 (0x4)
	float FloatProperty19; // 0x54 (0x4)
	float FloatProperty20; // 0x58 (0x4)
	float FloatProperty21; // 0x5c (0x4)
	bool BoolProperty22; // 0x60 (0x1)
	bool BoolProperty23; // 0x61 (0x1)
	bool BoolProperty24; // 0x62 (0x1)
	bool BoolProperty25; // 0x63 (0x1)
	bool BoolProperty26; // 0x64 (0x1)
	bool BoolProperty27; // 0x65 (0x1)
	unsigned char unreflected_66[0x2]; // 0x66 (0x2) 
	float FloatProperty28; // 0x68 (0x4)
	float FloatProperty29; // 0x6c (0x4)
	float FloatProperty30; // 0x70 (0x4)
	bool BoolProperty31; // 0x74 (0x1)
	unsigned char unreflected_75[0x3]; // 0x75 (0x3) 
	float FloatProperty32; // 0x78 (0x4)
	float FloatProperty33; // 0x7c (0x4)
	bool BoolProperty34; // 0x80 (0x1)
	bool BoolProperty35; // 0x81 (0x1)
	unsigned char unreflected_82[0x2]; // 0x82 (0x2) 
	float FloatProperty36; // 0x84 (0x4)
	float FloatProperty37; // 0x88 (0x4)
	bool BoolProperty38; // 0x8c (0x1)
};

