// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x12f
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float FloatProperty; // 0x4 (0x4)
	float FloatProperty0; // 0x8 (0x4)
	float FloatProperty1; // 0xc (0x4)
	float FloatProperty2; // 0x10 (0x4)
	bool BoolProperty3; // 0x14 (0x1)
	unsigned char unreflected_15[0x3]; // 0x15 (0x3) 
	float FloatProperty4; // 0x18 (0x4)
	float FloatProperty5; // 0x1c (0x4)
	float FloatProperty6; // 0x20 (0x4)
	float FloatProperty7; // 0x24 (0x4)
	float FloatProperty8; // 0x28 (0x4)
	float FloatProperty9; // 0x2c (0x4)
	float FloatProperty10; // 0x30 (0x4)
	float FloatProperty11; // 0x34 (0x4)
	float FloatProperty12; // 0x38 (0x4)
	float FloatProperty13; // 0x3c (0x4)
	bool BoolProperty14; // 0x40 (0x1)
	unsigned char unreflected_41[0x3]; // 0x41 (0x3) 
	float FloatProperty15; // 0x44 (0x4)
	float FloatProperty16; // 0x48 (0x4)
	float FloatProperty17; // 0x4c (0x4)
	float FloatProperty18; // 0x50 (0x4)
	float FloatProperty19; // 0x54 (0x4)
	float FloatProperty20; // 0x58 (0x4)
	float FloatProperty21; // 0x5c (0x4)
	float FloatProperty22; // 0x60 (0x4)
	bool BoolProperty23; // 0x64 (0x1)
	unsigned char unreflected_65[0x3]; // 0x65 (0x3) 
	float FloatProperty24; // 0x68 (0x4)
	float FloatProperty25; // 0x6c (0x4)
	float FloatProperty26; // 0x70 (0x4)
	float FloatProperty27; // 0x74 (0x4)
	bool BoolProperty28; // 0x78 (0x1)
	unsigned char unreflected_79[0x7]; // 0x79 (0x7) 
	struct TArray<float> ArrayProperty29; // 0x80 (0x10)
	unsigned char ByteProperty30; // 0x90 (0x1)
	unsigned char unreflected_91[0x3]; // 0x91 (0x3) 
	float FloatProperty31; // 0x94 (0x4)
	float FloatProperty32; // 0x98 (0x4)
	float FloatProperty33; // 0x9c (0x4)
	float FloatProperty34; // 0xa0 (0x4)
	float FloatProperty35; // 0xa4 (0x4)
	float FloatProperty36; // 0xa8 (0x4)
	float FloatProperty37; // 0xac (0x4)
	float FloatProperty38; // 0xb0 (0x4)
	unsigned char unreflected_b4[0x4]; // 0xb4 (0x4) 
	struct TArray<float> ArrayProperty39; // 0xb8 (0x10)
	unsigned char ByteProperty40; // 0xc8 (0x1)
	unsigned char unreflected_c9[0x3]; // 0xc9 (0x3) 
	float FloatProperty41; // 0xcc (0x4)
	float FloatProperty42; // 0xd0 (0x4)
	float FloatProperty43; // 0xd4 (0x4)
	float FloatProperty44; // 0xd8 (0x4)
	unsigned char unreflected_dc[0x4]; // 0xdc (0x4) 
	struct TArray<float> ArrayProperty45; // 0xe0 (0x10)
	unsigned char ByteProperty46; // 0xf0 (0x1)
	unsigned char unreflected_f1[0x3]; // 0xf1 (0x3) 
	float FloatProperty47; // 0xf4 (0x4)
	float FloatProperty48; // 0xf8 (0x4)
	float FloatProperty49; // 0xfc (0x4)
	float FloatProperty50; // 0x100 (0x4)
	unsigned char ByteProperty51; // 0x104 (0x1)
	unsigned char ByteProperty52; // 0x105 (0x1)
	unsigned char unreflected_106[0x2]; // 0x106 (0x2) 
	float FloatProperty53; // 0x108 (0x4)
	bool BoolProperty54; // 0x10c (0x1)
	unsigned char unreflected_10d[0x3]; // 0x10d (0x3) 
	float FloatProperty55; // 0x110 (0x4)
	float FloatProperty56; // 0x114 (0x4)
	bool BoolProperty57; // 0x118 (0x1)
	bool BoolProperty58; // 0x119 (0x1)
	unsigned char unreflected_11a[0x2]; // 0x11a (0x2) 
	float FloatProperty59; // 0x11c (0x4)
	float FloatProperty60; // 0x120 (0x4)
	float FloatProperty61; // 0x124 (0x4)
	float FloatProperty62; // 0x128 (0x4)
	bool BoolProperty63; // 0x12c (0x1)
	unsigned char ByteProperty64; // 0x12d (0x1)
	bool BoolProperty65; // 0x12e (0x1)
};

