// ScriptStruct /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x3d
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float FloatProperty; // 0x4 (0x4)
	bool BoolProperty0; // 0x8 (0x1)
	unsigned char unreflected_9[0x3]; // 0x9 (0x3) 
	float FloatProperty1; // 0xc (0x4)
	bool BoolProperty2; // 0x10 (0x1)
	unsigned char unreflected_11[0x3]; // 0x11 (0x3) 
	float FloatProperty3; // 0x14 (0x4)
	float FloatProperty4; // 0x18 (0x4)
	float FloatProperty5; // 0x1c (0x4)
	float FloatProperty6; // 0x20 (0x4)
	float FloatProperty7; // 0x24 (0x4)
	float FloatProperty8; // 0x28 (0x4)
	float FloatProperty9; // 0x2c (0x4)
	float FloatProperty10; // 0x30 (0x4)
	float FloatProperty11; // 0x34 (0x4)
	float FloatProperty12; // 0x38 (0x4)
	bool BoolProperty13; // 0x3c (0x1)
};

