// ScriptStruct /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x178
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty288; // 0x4 (0x4)
	struct FName NameProperty289; // 0x8 (0x4)
	struct FName NameProperty290; // 0xc (0x4)
	struct FName NameProperty291; // 0x10 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty292; // 0x14 (0x1)
	unsigned char unreflected_15[0x3]; // 0x15 (0x3) 
	struct FName NameProperty293; // 0x18 (0x4)
	unsigned char unreflected_1c[0x4]; // 0x1c (0x4) 
	struct TArray<float> ArrayProperty294; // 0x20 (0x10)
	struct FName NameProperty295; // 0x30 (0x4)
	int IntProperty296; // 0x34 (0x4)
	struct FName NameProperty297; // 0x38 (0x4)
	int IntProperty298; // 0x3c (0x4)
	struct FName NameProperty299; // 0x40 (0x4)
	int IntProperty300; // 0x44 (0x4)
	bool BoolProperty301; // 0x48 (0x1)
	unsigned char unreflected_49[0x3]; // 0x49 (0x3) 
	struct FName NameProperty302; // 0x4c (0x4)
	int IntProperty303; // 0x50 (0x4)
	unsigned char unreflected_54[0x4]; // 0x54 (0x4) 
	class UBlendProfile* BlendProfile304; // 0x58 (0x8)
	class UCurveFloat* CurveFloat305; // 0x60 (0x8)
	enum EAlphaBlendOption EnumProperty306; // 0x68 (0x1)
	enum EBlendListTransitionType EnumProperty307; // 0x69 (0x1)
	unsigned char unreflected_6a[0x6]; // 0x6a (0x6) 
	struct TArray<float> ArrayProperty308; // 0x70 (0x10)
	struct FName NameProperty309; // 0x80 (0x4)
	struct FName NameProperty310; // 0x84 (0x4)
	float FloatProperty311; // 0x88 (0x4)
	struct FInputScaleBiasClampConstants StructProperty312; // 0x8c (0x2c)
	float FloatProperty313; // 0xb8 (0x4)
	bool BoolProperty314; // 0xbc (0x1)
	enum EAnimSyncMethod EnumProperty315; // 0xbd (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty316; // 0xbe (0x1)
	unsigned char unreflected_bf[0x1]; // 0xbf (0x1) 
	struct FAnimNodeFunctionRef StructProperty317; // 0xc0 (0x18)
	struct FName NameProperty318; // 0xd8 (0x4)
	struct FName NameProperty319; // 0xdc (0x4)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0xe0 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x160 (0x18)
};

