// ScriptStruct /Game/Athena/AI/MANG/AnimSet/MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x158
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty144; // 0x4 (0x4)
	struct FName NameProperty145; // 0x8 (0x4)
	struct FName NameProperty146; // 0xc (0x4)
	class UBlendProfile* BlendProfile147; // 0x10 (0x8)
	class UCurveFloat* CurveFloat148; // 0x18 (0x8)
	enum EAlphaBlendOption EnumProperty149; // 0x20 (0x1)
	enum EBlendListTransitionType EnumProperty150; // 0x21 (0x1)
	unsigned char unreflected_22[0x6]; // 0x22 (0x6) 
	struct TArray<float> ArrayProperty151; // 0x28 (0x10)
	struct FName NameProperty152; // 0x38 (0x4)
	int IntProperty153; // 0x3c (0x4)
	struct FName NameProperty154; // 0x40 (0x4)
	int IntProperty155; // 0x44 (0x4)
	enum EAnimSyncMethod EnumProperty156; // 0x48 (0x1)
	unsigned char unreflected_49[0x3]; // 0x49 (0x3) 
	struct FName NameProperty157; // 0x4c (0x4)
	struct FName NameProperty158; // 0x50 (0x4)
	int IntProperty159; // 0x54 (0x4)
	struct FName NameProperty160; // 0x58 (0x4)
	int IntProperty161; // 0x5c (0x4)
	bool BoolProperty162; // 0x60 (0x1)
	unsigned char unreflected_61[0x3]; // 0x61 (0x3) 
	float FloatProperty163; // 0x64 (0x4)
	struct FInputScaleBiasClampConstants StructProperty164; // 0x68 (0x2c)
	float FloatProperty165; // 0x94 (0x4)
	bool BoolProperty166; // 0x98 (0x1)
	enum EAnimSyncMethod EnumProperty167; // 0x99 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty168; // 0x9a (0x1)
	unsigned char unreflected_9b[0x5]; // 0x9b (0x5) 
	struct FAnimNodeFunctionRef StructProperty169; // 0xa0 (0x18)
	struct FName NameProperty170; // 0xb8 (0x4)
	struct FName NameProperty171; // 0xbc (0x4)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0xc0 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x140 (0x18)
};

