// ScriptStruct /Game/Characters/Player/Male/Male_Avg_Base/Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// Size: 0x418
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty2340; // 0x4 (0x4)
	struct FName NameProperty2341; // 0x8 (0x4)
	struct FName NameProperty2342; // 0xc (0x4)
	struct FName NameProperty2343; // 0x10 (0x4)
	struct FName NameProperty2344; // 0x14 (0x4)
	struct FName NameProperty2345; // 0x18 (0x4)
	struct FName NameProperty2346; // 0x1c (0x4)
	struct FName NameProperty2347; // 0x20 (0x4)
	struct FName NameProperty2348; // 0x24 (0x4)
	struct FName NameProperty2349; // 0x28 (0x4)
	struct FName NameProperty2350; // 0x2c (0x4)
	struct FName NameProperty2351; // 0x30 (0x4)
	struct FName NameProperty2352; // 0x34 (0x4)
	struct FName NameProperty2353; // 0x38 (0x4)
	struct FName NameProperty2354; // 0x3c (0x4)
	float FloatProperty2355; // 0x40 (0x4)
	struct FName NameProperty2356; // 0x44 (0x4)
	float FloatProperty2357; // 0x48 (0x4)
	struct FName NameProperty2358; // 0x4c (0x4)
	float FloatProperty2359; // 0x50 (0x4)
	struct FName NameProperty2360; // 0x54 (0x4)
	struct FName NameProperty2361; // 0x58 (0x4)
	struct FName NameProperty2362; // 0x5c (0x4)
	struct FName NameProperty2363; // 0x60 (0x4)
	float FloatProperty2364; // 0x64 (0x4)
	struct FName NameProperty2365; // 0x68 (0x4)
	unsigned char unreflected_6c[0x4]; // 0x6c (0x4) 
	struct TArray<float> ArrayProperty2366; // 0x70 (0x10)
	struct TArray<float> ArrayProperty2367; // 0x80 (0x10)
	struct TArray<int> ArrayProperty2368; // 0x90 (0x10)
	struct FName NameProperty2369; // 0xa0 (0x4)
	unsigned char unreflected_a4[0x4]; // 0xa4 (0x4) 
	struct TArray<int> ArrayProperty2370; // 0xa8 (0x10)
	struct TArray<int> ArrayProperty2371; // 0xb8 (0x10)
	struct TArray<float> ArrayProperty2372; // 0xc8 (0x10)
	struct TArray<int> ArrayProperty2373; // 0xd8 (0x10)
	struct TArray<float> ArrayProperty2374; // 0xe8 (0x10)
	struct TArray<int> ArrayProperty2375; // 0xf8 (0x10)
	struct TArray<float> ArrayProperty2376; // 0x108 (0x10)
	struct TArray<int> ArrayProperty2377; // 0x118 (0x10)
	struct FName NameProperty2378; // 0x128 (0x4)
	struct FName NameProperty2379; // 0x12c (0x4)
	struct FName NameProperty2380; // 0x130 (0x4)
	struct FName NameProperty2381; // 0x134 (0x4)
	struct FName NameProperty2382; // 0x138 (0x4)
	struct FName NameProperty2383; // 0x13c (0x4)
	struct FName NameProperty2384; // 0x140 (0x4)
	struct FName NameProperty2385; // 0x144 (0x4)
	struct FName NameProperty2386; // 0x148 (0x4)
	struct FName NameProperty2387; // 0x14c (0x4)
	struct FName NameProperty2388; // 0x150 (0x4)
	struct FName NameProperty2389; // 0x154 (0x4)
	struct FName NameProperty2390; // 0x158 (0x4)
	struct FName NameProperty2391; // 0x15c (0x4)
	struct FName NameProperty2392; // 0x160 (0x4)
	struct FName NameProperty2393; // 0x164 (0x4)
	struct TArray<float> ArrayProperty2394; // 0x168 (0x10)
	struct FName NameProperty2395; // 0x178 (0x4)
	struct FName NameProperty2396; // 0x17c (0x4)
	struct FName NameProperty2397; // 0x180 (0x4)
	struct FName NameProperty2398; // 0x184 (0x4)
	struct TArray<float> ArrayProperty2399; // 0x188 (0x10)
	struct FName NameProperty2400; // 0x198 (0x4)
	struct FName NameProperty2401; // 0x19c (0x4)
	struct FName NameProperty2402; // 0x1a0 (0x4)
	enum EBlendListTransitionType EnumProperty2403; // 0x1a4 (0x1)
	unsigned char unreflected_1a5[0x3]; // 0x1a5 (0x3) 
	struct TArray<float> ArrayProperty2404; // 0x1a8 (0x10)
	struct FName NameProperty2405; // 0x1b8 (0x4)
	enum EAlphaBlendOption EnumProperty2406; // 0x1bc (0x1)
	unsigned char unreflected_1bd[0x3]; // 0x1bd (0x3) 
	struct TArray<float> ArrayProperty2407; // 0x1c0 (0x10)
	struct TArray<int> ArrayProperty2408; // 0x1d0 (0x10)
	enum EAnimSyncMethod EnumProperty2409; // 0x1e0 (0x1)
	unsigned char unreflected_1e1[0x3]; // 0x1e1 (0x3) 
	struct FName NameProperty2410; // 0x1e4 (0x4)
	struct FName NameProperty2411; // 0x1e8 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty2412; // 0x1ec (0x1)
	unsigned char unreflected_1ed[0x3]; // 0x1ed (0x3) 
	struct FName NameProperty2413; // 0x1f0 (0x4)
	struct FName NameProperty2414; // 0x1f4 (0x4)
	struct FName NameProperty2415; // 0x1f8 (0x4)
	struct FName NameProperty2416; // 0x1fc (0x4)
	struct FName NameProperty2417; // 0x200 (0x4)
	unsigned char unreflected_204[0x4]; // 0x204 (0x4) 
	struct TArray<float> ArrayProperty2418; // 0x208 (0x10)
	struct FName NameProperty2419; // 0x218 (0x4)
	struct FName NameProperty2420; // 0x21c (0x4)
	struct FName NameProperty2421; // 0x220 (0x4)
	int IntProperty2422; // 0x224 (0x4)
	struct FName NameProperty2423; // 0x228 (0x4)
	int IntProperty2424; // 0x22c (0x4)
	struct TArray<int> ArrayProperty2425; // 0x230 (0x10)
	struct FName NameProperty2426; // 0x240 (0x4)
	int IntProperty2427; // 0x244 (0x4)
	struct FName NameProperty2428; // 0x248 (0x4)
	int IntProperty2429; // 0x24c (0x4)
	struct FName NameProperty2430; // 0x250 (0x4)
	int IntProperty2431; // 0x254 (0x4)
	bool BoolProperty2432; // 0x258 (0x1)
	unsigned char unreflected_259[0x3]; // 0x259 (0x3) 
	float FloatProperty2433; // 0x25c (0x4)
	struct FInputScaleBiasClampConstants StructProperty2434; // 0x260 (0x2c)
	float FloatProperty2435; // 0x28c (0x4)
	enum EAnimSyncMethod EnumProperty2436; // 0x290 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty2437; // 0x291 (0x1)
	unsigned char unreflected_292[0x2]; // 0x292 (0x2) 
	struct FName NameProperty2438; // 0x294 (0x4)
	int IntProperty2439; // 0x298 (0x4)
	struct FName NameProperty2440; // 0x29c (0x4)
	int IntProperty2441; // 0x2a0 (0x4)
	unsigned char unreflected_2a4[0x4]; // 0x2a4 (0x4) 
	struct TArray<float> ArrayProperty2442; // 0x2a8 (0x10)
	struct TArray<float> ArrayProperty2443; // 0x2b8 (0x10)
	struct FName NameProperty2444; // 0x2c8 (0x4)
	struct FName NameProperty2445; // 0x2cc (0x4)
	int IntProperty2446; // 0x2d0 (0x4)
	unsigned char unreflected_2d4[0x4]; // 0x2d4 (0x4) 
	class UBlendProfile* BlendProfile2447; // 0x2d8 (0x8)
	class UCurveFloat* CurveFloat2448; // 0x2e0 (0x8)
	bool BoolProperty2449; // 0x2e8 (0x1)
	enum EAlphaBlendOption EnumProperty2450; // 0x2e9 (0x1)
	enum EBlendListTransitionType EnumProperty2451; // 0x2ea (0x1)
	unsigned char unreflected_2eb[0x5]; // 0x2eb (0x5) 
	struct TArray<float> ArrayProperty2452; // 0x2f0 (0x10)
	struct FAnimNodeFunctionRef StructProperty2453; // 0x300 (0x18)
	struct FAnimSubsystem_Tag AnimBlueprintExtensionTag; // 0x318 (0x60)
	struct FAnimSubsystem* AnimBlueprintExtensionSharedLinkedAnimLayers; // 0x378 (0x8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x380 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x400 (0x18)
};

