// ScriptStruct /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x248
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty1286; // 0x4 (0x4)
	struct FName NameProperty1287; // 0x8 (0x4)
	struct FName NameProperty1288; // 0xc (0x4)
	struct FName NameProperty1289; // 0x10 (0x4)
	struct FName NameProperty1290; // 0x14 (0x4)
	struct FName NameProperty1291; // 0x18 (0x4)
	struct FName NameProperty1292; // 0x1c (0x4)
	struct TArray<float> ArrayProperty1293; // 0x20 (0x10)
	struct TArray<float> ArrayProperty1294; // 0x30 (0x10)
	struct FName NameProperty1295; // 0x40 (0x4)
	struct FName NameProperty1296; // 0x44 (0x4)
	struct FName NameProperty1297; // 0x48 (0x4)
	float FloatProperty1298; // 0x4c (0x4)
	struct TArray<float> ArrayProperty1299; // 0x50 (0x10)
	struct FName NameProperty1300; // 0x60 (0x4)
	int IntProperty1301; // 0x64 (0x4)
	struct FName NameProperty1302; // 0x68 (0x4)
	int IntProperty1303; // 0x6c (0x4)
	struct FName NameProperty1304; // 0x70 (0x4)
	struct FName NameProperty1305; // 0x74 (0x4)
	struct FName NameProperty1306; // 0x78 (0x4)
	struct FName NameProperty1307; // 0x7c (0x4)
	struct FName NameProperty1308; // 0x80 (0x4)
	struct FName NameProperty1309; // 0x84 (0x4)
	struct FName NameProperty1310; // 0x88 (0x4)
	struct FName NameProperty1311; // 0x8c (0x4)
	struct FName NameProperty1312; // 0x90 (0x4)
	int IntProperty1313; // 0x94 (0x4)
	struct FName NameProperty1314; // 0x98 (0x4)
	int IntProperty1315; // 0x9c (0x4)
	float FloatProperty1316; // 0xa0 (0x4)
	struct FName NameProperty1317; // 0xa4 (0x4)
	int IntProperty1318; // 0xa8 (0x4)
	struct FName NameProperty1319; // 0xac (0x4)
	int IntProperty1320; // 0xb0 (0x4)
	enum EBlendListTransitionType EnumProperty1321; // 0xb4 (0x1)
	unsigned char unreflected_b5[0x3]; // 0xb5 (0x3) 
	struct TArray<float> ArrayProperty1322; // 0xb8 (0x10)
	struct TArray<float> ArrayProperty1323; // 0xc8 (0x10)
	struct FName NameProperty1324; // 0xd8 (0x4)
	int IntProperty1325; // 0xdc (0x4)
	struct TArray<float> ArrayProperty1326; // 0xe0 (0x10)
	struct TArray<float> ArrayProperty1327; // 0xf0 (0x10)
	struct FName NameProperty1328; // 0x100 (0x4)
	enum EAnimSyncMethod EnumProperty1329; // 0x104 (0x1)
	unsigned char unreflected_105[0x3]; // 0x105 (0x3) 
	struct FName NameProperty1330; // 0x108 (0x4)
	struct FName NameProperty1331; // 0x10c (0x4)
	struct FName NameProperty1332; // 0x110 (0x4)
	unsigned char unreflected_114[0x4]; // 0x114 (0x4) 
	class UBlendProfile* BlendProfile1333; // 0x118 (0x8)
	class UCurveFloat* CurveFloat1334; // 0x120 (0x8)
	enum EAlphaBlendOption EnumProperty1335; // 0x128 (0x1)
	enum EBlendListTransitionType EnumProperty1336; // 0x129 (0x1)
	unsigned char unreflected_12a[0x6]; // 0x12a (0x6) 
	struct TArray<float> ArrayProperty1337; // 0x130 (0x10)
	bool BoolProperty1338; // 0x140 (0x1)
	unsigned char unreflected_141[0x3]; // 0x141 (0x3) 
	float FloatProperty1339; // 0x144 (0x4)
	struct FInputScaleBiasClampConstants StructProperty1340; // 0x148 (0x2c)
	float FloatProperty1341; // 0x174 (0x4)
	bool BoolProperty1342; // 0x178 (0x1)
	enum EAnimSyncMethod EnumProperty1343; // 0x179 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty1344; // 0x17a (0x1)
	unsigned char unreflected_17b[0x1]; // 0x17b (0x1) 
	struct FName NameProperty1345; // 0x17c (0x4)
	int IntProperty1346; // 0x180 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty1347; // 0x184 (0x1)
	unsigned char unreflected_185[0x3]; // 0x185 (0x3) 
	struct FName NameProperty1348; // 0x188 (0x4)
	struct FName NameProperty1349; // 0x18c (0x4)
	int IntProperty1350; // 0x190 (0x4)
	unsigned char unreflected_194[0x4]; // 0x194 (0x4) 
	struct FAnimNodeFunctionRef StructProperty1351; // 0x198 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x1b0 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x230 (0x18)
};

