// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionPrototype_AnimBP.Player_LocomotionPrototype_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x138
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty427; // 0x4 (0x4)
	struct FName NameProperty428; // 0x8 (0x4)
	struct FName NameProperty429; // 0xc (0x4)
	struct FName NameProperty430; // 0x10 (0x4)
	bool BoolProperty431; // 0x14 (0x1)
	enum EAnimSyncMethod EnumProperty432; // 0x15 (0x1)
	unsigned char unreflected_16[0x2]; // 0x16 (0x2) 
	struct FName NameProperty433; // 0x18 (0x4)
	struct FName NameProperty434; // 0x1c (0x4)
	struct FName NameProperty435; // 0x20 (0x4)
	int IntProperty436; // 0x24 (0x4)
	struct FName NameProperty437; // 0x28 (0x4)
	float FloatProperty438; // 0x2c (0x4)
	struct FInputScaleBiasClampConstants StructProperty439; // 0x30 (0x2c)
	float FloatProperty440; // 0x5c (0x4)
	bool BoolProperty441; // 0x60 (0x1)
	enum EAnimSyncMethod EnumProperty442; // 0x61 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty443; // 0x62 (0x1)
	unsigned char unreflected_63[0x1]; // 0x63 (0x1) 
	struct FName NameProperty444; // 0x64 (0x4)
	struct FName NameProperty445; // 0x68 (0x4)
	int IntProperty446; // 0x6c (0x4)
	struct FName NameProperty447; // 0x70 (0x4)
	int IntProperty448; // 0x74 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty449; // 0x78 (0x1)
	unsigned char unreflected_79[0x3]; // 0x79 (0x3) 
	struct FName NameProperty450; // 0x7c (0x4)
	struct FName NameProperty451; // 0x80 (0x4)
	int IntProperty452; // 0x84 (0x4)
	struct FAnimNodeFunctionRef StructProperty453; // 0x88 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0xa0 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x120 (0x18)
};

