// ScriptStruct /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x228
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty1434; // 0x4 (0x4)
	struct FName NameProperty1435; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	class UBlendProfile* BlendProfile1436; // 0x10 (0x8)
	struct FName NameProperty1437; // 0x18 (0x4)
	struct FName NameProperty1438; // 0x1c (0x4)
	struct FName NameProperty1439; // 0x20 (0x4)
	struct FName NameProperty1440; // 0x24 (0x4)
	struct FName NameProperty1441; // 0x28 (0x4)
	struct FName NameProperty1442; // 0x2c (0x4)
	int IntProperty1443; // 0x30 (0x4)
	struct FName NameProperty1444; // 0x34 (0x4)
	int IntProperty1445; // 0x38 (0x4)
	struct FName NameProperty1446; // 0x3c (0x4)
	int IntProperty1447; // 0x40 (0x4)
	struct FName NameProperty1448; // 0x44 (0x4)
	int IntProperty1449; // 0x48 (0x4)
	struct FName NameProperty1450; // 0x4c (0x4)
	struct FName NameProperty1451; // 0x50 (0x4)
	struct FName NameProperty1452; // 0x54 (0x4)
	struct FName NameProperty1453; // 0x58 (0x4)
	struct FName NameProperty1454; // 0x5c (0x4)
	struct FName NameProperty1455; // 0x60 (0x4)
	struct FName NameProperty1456; // 0x64 (0x4)
	struct FName NameProperty1457; // 0x68 (0x4)
	struct FName NameProperty1458; // 0x6c (0x4)
	int IntProperty1459; // 0x70 (0x4)
	struct FName NameProperty1460; // 0x74 (0x4)
	struct TArray<float> ArrayProperty1461; // 0x78 (0x10)
	enum EBlendListTransitionType EnumProperty1462; // 0x88 (0x1)
	unsigned char unreflected_89[0x7]; // 0x89 (0x7) 
	struct TArray<float> ArrayProperty1463; // 0x90 (0x10)
	struct FName NameProperty1464; // 0xa0 (0x4)
	int IntProperty1465; // 0xa4 (0x4)
	struct FName NameProperty1466; // 0xa8 (0x4)
	int IntProperty1467; // 0xac (0x4)
	struct TArray<float> ArrayProperty1468; // 0xb0 (0x10)
	struct TArray<float> ArrayProperty1469; // 0xc0 (0x10)
	enum EAnimSyncMethod EnumProperty1470; // 0xd0 (0x1)
	unsigned char unreflected_d1[0x3]; // 0xd1 (0x3) 
	struct FName NameProperty1471; // 0xd4 (0x4)
	struct FName NameProperty1472; // 0xd8 (0x4)
	unsigned char unreflected_dc[0x4]; // 0xdc (0x4) 
	class UBlendProfile* BlendProfile1473; // 0xe0 (0x8)
	class UCurveFloat* CurveFloat1474; // 0xe8 (0x8)
	enum EAlphaBlendOption EnumProperty1475; // 0xf0 (0x1)
	enum EBlendListTransitionType EnumProperty1476; // 0xf1 (0x1)
	unsigned char unreflected_f2[0x6]; // 0xf2 (0x6) 
	struct TArray<float> ArrayProperty1477; // 0xf8 (0x10)
	struct FName NameProperty1478; // 0x108 (0x4)
	struct FInputScaleBiasClampConstants StructProperty1479; // 0x10c (0x2c)
	struct FName NameProperty1480; // 0x138 (0x4)
	int IntProperty1481; // 0x13c (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty1482; // 0x140 (0x1)
	unsigned char unreflected_141[0x3]; // 0x141 (0x3) 
	struct FName NameProperty1483; // 0x144 (0x4)
	int IntProperty1484; // 0x148 (0x4)
	bool BoolProperty1485; // 0x14c (0x1)
	unsigned char unreflected_14d[0x3]; // 0x14d (0x3) 
	float FloatProperty1486; // 0x150 (0x4)
	float FloatProperty1487; // 0x154 (0x4)
	bool BoolProperty1488; // 0x158 (0x1)
	enum EAnimSyncMethod EnumProperty1489; // 0x159 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty1490; // 0x15a (0x1)
	unsigned char unreflected_15b[0x1]; // 0x15b (0x1) 
	struct FName NameProperty1491; // 0x15c (0x4)
	struct FName NameProperty1492; // 0x160 (0x4)
	struct FName NameProperty1493; // 0x164 (0x4)
	struct FName NameProperty1494; // 0x168 (0x4)
	unsigned char unreflected_16c[0x4]; // 0x16c (0x4) 
	struct FAnimNodeFunctionRef StructProperty1495; // 0x170 (0x18)
	struct FName NameProperty1496; // 0x188 (0x4)
	struct FName NameProperty1497; // 0x18c (0x4)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x190 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x210 (0x18)
};

