// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x21
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float FloatProperty; // 0x4 (0x4)
	float FloatProperty0; // 0x8 (0x4)
	bool BoolProperty1; // 0xc (0x1)
	bool BoolProperty2; // 0xd (0x1)
	bool BoolProperty3; // 0xe (0x1)
	bool BoolProperty4; // 0xf (0x1)
	bool BoolProperty5; // 0x10 (0x1)
	bool BoolProperty6; // 0x11 (0x1)
	bool BoolProperty7; // 0x12 (0x1)
	bool BoolProperty8; // 0x13 (0x1)
	bool BoolProperty9; // 0x14 (0x1)
	bool BoolProperty10; // 0x15 (0x1)
	bool BoolProperty11; // 0x16 (0x1)
	bool BoolProperty12; // 0x17 (0x1)
	bool BoolProperty13; // 0x18 (0x1)
	unsigned char unreflected_19[0x3]; // 0x19 (0x3) 
	float FloatProperty14; // 0x1c (0x4)
	bool BoolProperty15; // 0x20 (0x1)
};

