// ScriptStruct /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x268
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty1112; // 0x4 (0x4)
	struct TArray<int> ArrayProperty1113; // 0x8 (0x10)
	struct FName NameProperty1114; // 0x18 (0x4)
	unsigned char unreflected_1c[0x4]; // 0x1c (0x4) 
	struct FAnimNodeFunctionRef StructProperty1115; // 0x20 (0x18)
	struct FName NameProperty1116; // 0x38 (0x4)
	struct FName NameProperty1117; // 0x3c (0x4)
	struct FName NameProperty1118; // 0x40 (0x4)
	struct FName NameProperty1119; // 0x44 (0x4)
	struct FName NameProperty1120; // 0x48 (0x4)
	unsigned char unreflected_4c[0x4]; // 0x4c (0x4) 
	struct TArray<float> ArrayProperty1121; // 0x50 (0x10)
	struct FName NameProperty1122; // 0x60 (0x4)
	struct FName NameProperty1123; // 0x64 (0x4)
	float FloatProperty1124; // 0x68 (0x4)
	struct FName NameProperty1125; // 0x6c (0x4)
	float FloatProperty1126; // 0x70 (0x4)
	struct FName NameProperty1127; // 0x74 (0x4)
	struct FName NameProperty1128; // 0x78 (0x4)
	struct FName NameProperty1129; // 0x7c (0x4)
	struct FName NameProperty1130; // 0x80 (0x4)
	struct FName NameProperty1131; // 0x84 (0x4)
	struct FName NameProperty1132; // 0x88 (0x4)
	struct FName NameProperty1133; // 0x8c (0x4)
	struct TArray<float> ArrayProperty1134; // 0x90 (0x10)
	struct TArray<int> ArrayProperty1135; // 0xa0 (0x10)
	struct FName NameProperty1136; // 0xb0 (0x4)
	struct FName NameProperty1137; // 0xb4 (0x4)
	struct FName NameProperty1138; // 0xb8 (0x4)
	struct FName NameProperty1139; // 0xbc (0x4)
	struct FName NameProperty1140; // 0xc0 (0x4)
	struct FName NameProperty1141; // 0xc4 (0x4)
	struct FName NameProperty1142; // 0xc8 (0x4)
	struct FName NameProperty1143; // 0xcc (0x4)
	struct FName NameProperty1144; // 0xd0 (0x4)
	struct FName NameProperty1145; // 0xd4 (0x4)
	int IntProperty1146; // 0xd8 (0x4)
	struct FName NameProperty1147; // 0xdc (0x4)
	int IntProperty1148; // 0xe0 (0x4)
	struct FName NameProperty1149; // 0xe4 (0x4)
	struct FName NameProperty1150; // 0xe8 (0x4)
	int IntProperty1151; // 0xec (0x4)
	enum EBlendListTransitionType EnumProperty1152; // 0xf0 (0x1)
	unsigned char unreflected_f1[0x7]; // 0xf1 (0x7) 
	struct TArray<float> ArrayProperty1153; // 0xf8 (0x10)
	struct FInputScaleBiasClampConstants StructProperty1154; // 0x108 (0x2c)
	struct FName NameProperty1155; // 0x134 (0x4)
	struct FName NameProperty1156; // 0x138 (0x4)
	int IntProperty1157; // 0x13c (0x4)
	struct TArray<float> ArrayProperty1158; // 0x140 (0x10)
	float FloatProperty1159; // 0x150 (0x4)
	struct FName NameProperty1160; // 0x154 (0x4)
	float FloatProperty1161; // 0x158 (0x4)
	enum EAnimSyncMethod EnumProperty1162; // 0x15c (0x1)
	unsigned char unreflected_15d[0x3]; // 0x15d (0x3) 
	struct FName NameProperty1163; // 0x160 (0x4)
	struct FName NameProperty1164; // 0x164 (0x4)
	int IntProperty1165; // 0x168 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty1166; // 0x16c (0x1)
	unsigned char unreflected_16d[0x3]; // 0x16d (0x3) 
	struct FName NameProperty1167; // 0x170 (0x4)
	struct FName NameProperty1168; // 0x174 (0x4)
	struct TEnumAsByte<ESequenceEvalReinit> ByteProperty1169; // 0x178 (0x1)
	unsigned char unreflected_179[0x3]; // 0x179 (0x3) 
	float FloatProperty1170; // 0x17c (0x4)
	enum EAnimSyncMethod EnumProperty1171; // 0x180 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty1172; // 0x181 (0x1)
	bool BoolProperty1173; // 0x182 (0x1)
	unsigned char unreflected_183[0x5]; // 0x183 (0x5) 
	class UBlendProfile* BlendProfile1174; // 0x188 (0x8)
	class UCurveFloat* CurveFloat1175; // 0x190 (0x8)
	bool BoolProperty1176; // 0x198 (0x1)
	enum EAlphaBlendOption EnumProperty1177; // 0x199 (0x1)
	enum EBlendListTransitionType EnumProperty1178; // 0x19a (0x1)
	unsigned char unreflected_19b[0x5]; // 0x19b (0x5) 
	struct TArray<float> ArrayProperty1179; // 0x1a0 (0x10)
	struct FAnimNodeFunctionRef StructProperty1180; // 0x1b0 (0x18)
	struct FName NameProperty1181; // 0x1c8 (0x4)
	struct FName NameProperty1182; // 0x1cc (0x4)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x1d0 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x250 (0x18)
};

