// ScriptStruct /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0xa8
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float FloatProperty; // 0x4 (0x4)
	float FloatProperty0; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	struct TArray<float> ArrayProperty1; // 0x10 (0x10)
	bool BoolProperty2; // 0x20 (0x1)
	bool BoolProperty3; // 0x21 (0x1)
	unsigned char unreflected_22[0x2]; // 0x22 (0x2) 
	float FloatProperty4; // 0x24 (0x4)
	float FloatProperty5; // 0x28 (0x4)
	bool BoolProperty6; // 0x2c (0x1)
	bool BoolProperty7; // 0x2d (0x1)
	bool BoolProperty8; // 0x2e (0x1)
	unsigned char unreflected_2f[0x1]; // 0x2f (0x1) 
	float FloatProperty9; // 0x30 (0x4)
	float FloatProperty10; // 0x34 (0x4)
	bool BoolProperty11; // 0x38 (0x1)
	unsigned char unreflected_39[0x3]; // 0x39 (0x3) 
	float FloatProperty12; // 0x3c (0x4)
	bool BoolProperty13; // 0x40 (0x1)
	unsigned char unreflected_41[0x3]; // 0x41 (0x3) 
	float FloatProperty14; // 0x44 (0x4)
	bool BoolProperty15; // 0x48 (0x1)
	unsigned char unreflected_49[0x3]; // 0x49 (0x3) 
	float FloatProperty16; // 0x4c (0x4)
	float FloatProperty17; // 0x50 (0x4)
	float FloatProperty18; // 0x54 (0x4)
	float FloatProperty19; // 0x58 (0x4)
	float FloatProperty20; // 0x5c (0x4)
	float FloatProperty21; // 0x60 (0x4)
	float FloatProperty22; // 0x64 (0x4)
	bool BoolProperty23; // 0x68 (0x1)
	unsigned char unreflected_69[0x3]; // 0x69 (0x3) 
	float FloatProperty24; // 0x6c (0x4)
	float FloatProperty25; // 0x70 (0x4)
	bool BoolProperty26; // 0x74 (0x1)
	bool BoolProperty27; // 0x75 (0x1)
	bool BoolProperty28; // 0x76 (0x1)
	bool BoolProperty29; // 0x77 (0x1)
	bool BoolProperty30; // 0x78 (0x1)
	unsigned char unreflected_79[0x3]; // 0x79 (0x3) 
	float FloatProperty31; // 0x7c (0x4)
	bool BoolProperty32; // 0x80 (0x1)
	unsigned char unreflected_81[0x3]; // 0x81 (0x3) 
	float FloatProperty33; // 0x84 (0x4)
	float FloatProperty34; // 0x88 (0x4)
	float FloatProperty35; // 0x8c (0x4)
	float FloatProperty36; // 0x90 (0x4)
	bool BoolProperty37; // 0x94 (0x1)
	bool BoolProperty38; // 0x95 (0x1)
	unsigned char unreflected_96[0x2]; // 0x96 (0x2) 
	float FloatProperty39; // 0x98 (0x4)
	float FloatProperty40; // 0x9c (0x4)
	bool BoolProperty41; // 0xa0 (0x1)
	unsigned char unreflected_a1[0x3]; // 0xa1 (0x3) 
	float FloatProperty42; // 0xa4 (0x4)
};

