// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_AnimBP.Player_InAir_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x208
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty831; // 0x4 (0x4)
	struct FName NameProperty832; // 0x8 (0x4)
	struct FName NameProperty833; // 0xc (0x4)
	struct FName NameProperty834; // 0x10 (0x4)
	float FloatProperty835; // 0x14 (0x4)
	struct FName NameProperty836; // 0x18 (0x4)
	unsigned char unreflected_1c[0x4]; // 0x1c (0x4) 
	struct TArray<float> ArrayProperty837; // 0x20 (0x10)
	struct TArray<float> ArrayProperty838; // 0x30 (0x10)
	struct TArray<float> ArrayProperty839; // 0x40 (0x10)
	struct TArray<float> ArrayProperty840; // 0x50 (0x10)
	struct TArray<int> ArrayProperty841; // 0x60 (0x10)
	struct FName NameProperty842; // 0x70 (0x4)
	struct FName NameProperty843; // 0x74 (0x4)
	struct FName NameProperty844; // 0x78 (0x4)
	struct FName NameProperty845; // 0x7c (0x4)
	struct FName NameProperty846; // 0x80 (0x4)
	struct FName NameProperty847; // 0x84 (0x4)
	struct FName NameProperty848; // 0x88 (0x4)
	struct FName NameProperty849; // 0x8c (0x4)
	struct FName NameProperty850; // 0x90 (0x4)
	struct FName NameProperty851; // 0x94 (0x4)
	struct FName NameProperty852; // 0x98 (0x4)
	struct FName NameProperty853; // 0x9c (0x4)
	struct FName NameProperty854; // 0xa0 (0x4)
	struct FName NameProperty855; // 0xa4 (0x4)
	struct FName NameProperty856; // 0xa8 (0x4)
	struct FName NameProperty857; // 0xac (0x4)
	struct FName NameProperty858; // 0xb0 (0x4)
	struct FName NameProperty859; // 0xb4 (0x4)
	int IntProperty860; // 0xb8 (0x4)
	struct FName NameProperty861; // 0xbc (0x4)
	int IntProperty862; // 0xc0 (0x4)
	struct FName NameProperty863; // 0xc4 (0x4)
	struct TArray<float> ArrayProperty864; // 0xc8 (0x10)
	enum EBlendListTransitionType EnumProperty865; // 0xd8 (0x1)
	bool BoolProperty866; // 0xd9 (0x1)
	unsigned char unreflected_da[0x2]; // 0xda (0x2) 
	struct FName NameProperty867; // 0xdc (0x4)
	int IntProperty868; // 0xe0 (0x4)
	float FloatProperty869; // 0xe4 (0x4)
	struct FInputScaleBiasClampConstants StructProperty870; // 0xe8 (0x2c)
	float FloatProperty871; // 0x114 (0x4)
	enum EAnimSyncMethod EnumProperty872; // 0x118 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty873; // 0x119 (0x1)
	unsigned char unreflected_11a[0x2]; // 0x11a (0x2) 
	struct FName NameProperty874; // 0x11c (0x4)
	struct FName NameProperty875; // 0x120 (0x4)
	int IntProperty876; // 0x124 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty877; // 0x128 (0x1)
	unsigned char unreflected_129[0x7]; // 0x129 (0x7) 
	class UBlendProfile* BlendProfile878; // 0x130 (0x8)
	class UCurveFloat* CurveFloat879; // 0x138 (0x8)
	bool BoolProperty880; // 0x140 (0x1)
	enum EAlphaBlendOption EnumProperty881; // 0x141 (0x1)
	enum EBlendListTransitionType EnumProperty882; // 0x142 (0x1)
	unsigned char unreflected_143[0x5]; // 0x143 (0x5) 
	struct TArray<float> ArrayProperty883; // 0x148 (0x10)
	struct FAnimNodeFunctionRef StructProperty884; // 0x158 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x170 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x1f0 (0x18)
};

