// ScriptStruct /Game/Athena/AI/MANG/AnimSet/MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x1c
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	unsigned char unreflected_2[0x2]; // 0x2 (0x2) 
	float FloatProperty0; // 0x4 (0x4)
	float FloatProperty1; // 0x8 (0x4)
	float FloatProperty2; // 0xc (0x4)
	float FloatProperty3; // 0x10 (0x4)
	float FloatProperty4; // 0x14 (0x4)
	float FloatProperty5; // 0x18 (0x4)
};

