// ScriptStruct /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x220
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty1446; // 0x4 (0x4)
	struct FName NameProperty1447; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	class UBlendProfile* BlendProfile1448; // 0x10 (0x8)
	struct FName NameProperty1449; // 0x18 (0x4)
	struct FName NameProperty1450; // 0x1c (0x4)
	struct FName NameProperty1451; // 0x20 (0x4)
	struct FName NameProperty1452; // 0x24 (0x4)
	struct FName NameProperty1453; // 0x28 (0x4)
	struct FName NameProperty1454; // 0x2c (0x4)
	int IntProperty1455; // 0x30 (0x4)
	unsigned char unreflected_34[0x4]; // 0x34 (0x4) 
	struct TArray<float> ArrayProperty1456; // 0x38 (0x10)
	struct FName NameProperty1457; // 0x48 (0x4)
	int IntProperty1458; // 0x4c (0x4)
	struct FName NameProperty1459; // 0x50 (0x4)
	int IntProperty1460; // 0x54 (0x4)
	struct FName NameProperty1461; // 0x58 (0x4)
	int IntProperty1462; // 0x5c (0x4)
	struct FName NameProperty1463; // 0x60 (0x4)
	struct FName NameProperty1464; // 0x64 (0x4)
	struct FName NameProperty1465; // 0x68 (0x4)
	struct FName NameProperty1466; // 0x6c (0x4)
	struct FName NameProperty1467; // 0x70 (0x4)
	struct FName NameProperty1468; // 0x74 (0x4)
	struct FName NameProperty1469; // 0x78 (0x4)
	struct FName NameProperty1470; // 0x7c (0x4)
	struct FName NameProperty1471; // 0x80 (0x4)
	int IntProperty1472; // 0x84 (0x4)
	struct FName NameProperty1473; // 0x88 (0x4)
	enum EBlendListTransitionType EnumProperty1474; // 0x8c (0x1)
	unsigned char unreflected_8d[0x3]; // 0x8d (0x3) 
	struct TArray<float> ArrayProperty1475; // 0x90 (0x10)
	struct TArray<float> ArrayProperty1476; // 0xa0 (0x10)
	struct FName NameProperty1477; // 0xb0 (0x4)
	int IntProperty1478; // 0xb4 (0x4)
	struct FName NameProperty1479; // 0xb8 (0x4)
	int IntProperty1480; // 0xbc (0x4)
	struct TArray<float> ArrayProperty1481; // 0xc0 (0x10)
	enum EAnimSyncMethod EnumProperty1482; // 0xd0 (0x1)
	unsigned char unreflected_d1[0x3]; // 0xd1 (0x3) 
	struct FName NameProperty1483; // 0xd4 (0x4)
	struct FName NameProperty1484; // 0xd8 (0x4)
	struct FInputScaleBiasClampConstants StructProperty1485; // 0xdc (0x2c)
	struct FName NameProperty1486; // 0x108 (0x4)
	int IntProperty1487; // 0x10c (0x4)
	struct FName NameProperty1488; // 0x110 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty1489; // 0x114 (0x1)
	bool BoolProperty1490; // 0x115 (0x1)
	unsigned char unreflected_116[0x2]; // 0x116 (0x2) 
	float FloatProperty1491; // 0x118 (0x4)
	float FloatProperty1492; // 0x11c (0x4)
	enum EAnimSyncMethod EnumProperty1493; // 0x120 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty1494; // 0x121 (0x1)
	unsigned char unreflected_122[0x6]; // 0x122 (0x6) 
	class UBlendProfile* BlendProfile1495; // 0x128 (0x8)
	class UCurveFloat* CurveFloat1496; // 0x130 (0x8)
	bool BoolProperty1497; // 0x138 (0x1)
	enum EAlphaBlendOption EnumProperty1498; // 0x139 (0x1)
	enum EBlendListTransitionType EnumProperty1499; // 0x13a (0x1)
	unsigned char unreflected_13b[0x5]; // 0x13b (0x5) 
	struct TArray<float> ArrayProperty1500; // 0x140 (0x10)
	struct FName NameProperty1501; // 0x150 (0x4)
	int IntProperty1502; // 0x154 (0x4)
	struct FName NameProperty1503; // 0x158 (0x4)
	struct FName NameProperty1504; // 0x15c (0x4)
	struct FName NameProperty1505; // 0x160 (0x4)
	struct FName NameProperty1506; // 0x164 (0x4)
	struct FAnimNodeFunctionRef StructProperty1507; // 0x168 (0x18)
	struct FName NameProperty1508; // 0x180 (0x4)
	struct FName NameProperty1509; // 0x184 (0x4)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x188 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x208 (0x18)
};

