// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1a8
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty637; // 0x4 (0x4)
	struct FName NameProperty638; // 0x8 (0x4)
	struct FName NameProperty639; // 0xc (0x4)
	struct FName NameProperty640; // 0x10 (0x4)
	struct FName NameProperty641; // 0x14 (0x4)
	struct FName NameProperty642; // 0x18 (0x4)
	struct FName NameProperty643; // 0x1c (0x4)
	struct FName NameProperty644; // 0x20 (0x4)
	struct FName NameProperty645; // 0x24 (0x4)
	struct FName NameProperty646; // 0x28 (0x4)
	struct FName NameProperty647; // 0x2c (0x4)
	struct FName NameProperty648; // 0x30 (0x4)
	struct FName NameProperty649; // 0x34 (0x4)
	struct FName NameProperty650; // 0x38 (0x4)
	struct FName NameProperty651; // 0x3c (0x4)
	struct FName NameProperty652; // 0x40 (0x4)
	struct FName NameProperty653; // 0x44 (0x4)
	struct FName NameProperty654; // 0x48 (0x4)
	struct FName NameProperty655; // 0x4c (0x4)
	struct FName NameProperty656; // 0x50 (0x4)
	struct FName NameProperty657; // 0x54 (0x4)
	struct FName NameProperty658; // 0x58 (0x4)
	struct FName NameProperty659; // 0x5c (0x4)
	struct FName NameProperty660; // 0x60 (0x4)
	struct FName NameProperty661; // 0x64 (0x4)
	struct FName NameProperty662; // 0x68 (0x4)
	struct FName NameProperty663; // 0x6c (0x4)
	struct TArray<float> ArrayProperty664; // 0x70 (0x10)
	struct FName NameProperty665; // 0x80 (0x4)
	struct FName NameProperty666; // 0x84 (0x4)
	struct FName NameProperty667; // 0x88 (0x4)
	unsigned char unreflected_8c[0x4]; // 0x8c (0x4) 
	struct TArray<float> ArrayProperty668; // 0x90 (0x10)
	struct FName NameProperty669; // 0xa0 (0x4)
	struct FName NameProperty670; // 0xa4 (0x4)
	struct FName NameProperty671; // 0xa8 (0x4)
	unsigned char unreflected_ac[0x4]; // 0xac (0x4) 
	struct TArray<int> ArrayProperty672; // 0xb0 (0x10)
	struct TArray<float> ArrayProperty673; // 0xc0 (0x10)
	class UBlendProfile* BlendProfile674; // 0xd0 (0x8)
	class UCurveFloat* CurveFloat675; // 0xd8 (0x8)
	bool BoolProperty676; // 0xe0 (0x1)
	enum EAlphaBlendOption EnumProperty677; // 0xe1 (0x1)
	enum EBlendListTransitionType EnumProperty678; // 0xe2 (0x1)
	unsigned char unreflected_e3[0x5]; // 0xe3 (0x5) 
	struct TArray<float> ArrayProperty679; // 0xe8 (0x10)
	struct FAnimNodeFunctionRef StructProperty680; // 0xf8 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x110 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x190 (0x18)
};

