// ScriptStruct /Script/FortniteGame.AnimSpinner
// Size: 0x48
struct FAnimSpinner
{
	struct FRotator Rotation; // 0x0 (0x18)
	struct FVector RotationAxis; // 0x18 (0x18)
	float BaseRotationSpeed; // 0x30 (0x4)
	float RotationRate; // 0x34 (0x4)
	float InterpolationRateSpeedUp; // 0x38 (0x4)
	float InterpolationRateSlowDown; // 0x3c (0x4)
	float RotationAngle; // 0x40 (0x4)
	unsigned char padding_44[0x4]; // 0x44 (0x4)
};

