// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x4c
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	unsigned char unreflected_2[0x6]; // 0x2 (0x6) 
	struct TArray<float> ArrayProperty0; // 0x8 (0x10)
	bool BoolProperty1; // 0x18 (0x1)
	unsigned char ByteProperty2; // 0x19 (0x1)
	bool BoolProperty3; // 0x1a (0x1)
	unsigned char unreflected_1b[0x5]; // 0x1b (0x5) 
	struct TArray<float> ArrayProperty4; // 0x20 (0x10)
	bool BoolProperty5; // 0x30 (0x1)
	unsigned char ByteProperty6; // 0x31 (0x1)
	bool BoolProperty7; // 0x32 (0x1)
	unsigned char unreflected_33[0x1]; // 0x33 (0x1) 
	float FloatProperty8; // 0x34 (0x4)
	float FloatProperty9; // 0x38 (0x4)
	float FloatProperty10; // 0x3c (0x4)
	float FloatProperty11; // 0x40 (0x4)
	float FloatProperty12; // 0x44 (0x4)
	float FloatProperty13; // 0x48 (0x4)
};

