// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Sprint_AnimBP.Player_Sprint_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x29
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float FloatProperty; // 0x4 (0x4)
	float FloatProperty0; // 0x8 (0x4)
	bool BoolProperty1; // 0xc (0x1)
	bool BoolProperty2; // 0xd (0x1)
	unsigned char unreflected_e[0x2]; // 0xe (0x2) 
	float FloatProperty3; // 0x10 (0x4)
	bool BoolProperty4; // 0x14 (0x1)
	bool BoolProperty5; // 0x15 (0x1)
	unsigned char unreflected_16[0x2]; // 0x16 (0x2) 
	float FloatProperty6; // 0x18 (0x4)
	float FloatProperty7; // 0x1c (0x4)
	float FloatProperty8; // 0x20 (0x4)
	float FloatProperty9; // 0x24 (0x4)
	bool BoolProperty10; // 0x28 (0x1)
};

