// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Sprint_AnimBP.Player_Sprint_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x158
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty256; // 0x4 (0x4)
	struct FName NameProperty257; // 0x8 (0x4)
	int IntProperty258; // 0xc (0x4)
	enum EBlendListTransitionType EnumProperty259; // 0x10 (0x1)
	unsigned char unreflected_11[0x7]; // 0x11 (0x7) 
	struct TArray<float> ArrayProperty260; // 0x18 (0x10)
	struct FName NameProperty261; // 0x28 (0x4)
	int IntProperty262; // 0x2c (0x4)
	struct FInputScaleBiasClampConstants StructProperty263; // 0x30 (0x2c)
	float FloatProperty264; // 0x5c (0x4)
	enum EAnimSyncMethod EnumProperty265; // 0x60 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty266; // 0x61 (0x1)
	bool BoolProperty267; // 0x62 (0x1)
	unsigned char unreflected_63[0x1]; // 0x63 (0x1) 
	float FloatProperty268; // 0x64 (0x4)
	enum EAnimSyncMethod EnumProperty269; // 0x68 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty270; // 0x69 (0x1)
	unsigned char unreflected_6a[0x2]; // 0x6a (0x2) 
	struct FName NameProperty271; // 0x6c (0x4)
	class UBlendProfile* BlendProfile272; // 0x70 (0x8)
	class UCurveFloat* CurveFloat273; // 0x78 (0x8)
	bool BoolProperty274; // 0x80 (0x1)
	enum EAlphaBlendOption EnumProperty275; // 0x81 (0x1)
	enum EBlendListTransitionType EnumProperty276; // 0x82 (0x1)
	unsigned char unreflected_83[0x5]; // 0x83 (0x5) 
	struct TArray<float> ArrayProperty277; // 0x88 (0x10)
	struct FName NameProperty278; // 0x98 (0x4)
	struct FName NameProperty279; // 0x9c (0x4)
	int IntProperty280; // 0xa0 (0x4)
	unsigned char unreflected_a4[0x4]; // 0xa4 (0x4) 
	struct FAnimNodeFunctionRef StructProperty281; // 0xa8 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0xc0 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x140 (0x18)
};

