// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x42c
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float FloatProperty; // 0x4 (0x4)
	float FloatProperty0; // 0x8 (0x4)
	float FloatProperty1; // 0xc (0x4)
	float FloatProperty2; // 0x10 (0x4)
	int IntProperty3; // 0x14 (0x4)
	unsigned char ByteProperty4; // 0x18 (0x1)
	unsigned char unreflected_19[0x3]; // 0x19 (0x3) 
	float FloatProperty5; // 0x1c (0x4)
	float FloatProperty6; // 0x20 (0x4)
	float FloatProperty7; // 0x24 (0x4)
	float FloatProperty8; // 0x28 (0x4)
	unsigned char ByteProperty9; // 0x2c (0x1)
	unsigned char unreflected_2d[0x3]; // 0x2d (0x3) 
	float FloatProperty10; // 0x30 (0x4)
	float FloatProperty11; // 0x34 (0x4)
	float FloatProperty12; // 0x38 (0x4)
	float FloatProperty13; // 0x3c (0x4)
	float FloatProperty14; // 0x40 (0x4)
	float FloatProperty15; // 0x44 (0x4)
	float FloatProperty16; // 0x48 (0x4)
	float FloatProperty17; // 0x4c (0x4)
	float FloatProperty18; // 0x50 (0x4)
	float FloatProperty19; // 0x54 (0x4)
	float FloatProperty20; // 0x58 (0x4)
	float FloatProperty21; // 0x5c (0x4)
	float FloatProperty22; // 0x60 (0x4)
	float FloatProperty23; // 0x64 (0x4)
	float FloatProperty24; // 0x68 (0x4)
	float FloatProperty25; // 0x6c (0x4)
	float FloatProperty26; // 0x70 (0x4)
	float FloatProperty27; // 0x74 (0x4)
	float FloatProperty28; // 0x78 (0x4)
	float FloatProperty29; // 0x7c (0x4)
	float FloatProperty30; // 0x80 (0x4)
	float FloatProperty31; // 0x84 (0x4)
	float FloatProperty32; // 0x88 (0x4)
	float FloatProperty33; // 0x8c (0x4)
	int IntProperty34; // 0x90 (0x4)
	float FloatProperty35; // 0x94 (0x4)
	float FloatProperty36; // 0x98 (0x4)
	float FloatProperty37; // 0x9c (0x4)
	float FloatProperty38; // 0xa0 (0x4)
	float FloatProperty39; // 0xa4 (0x4)
	float FloatProperty40; // 0xa8 (0x4)
	float FloatProperty41; // 0xac (0x4)
	float FloatProperty42; // 0xb0 (0x4)
	bool BoolProperty43; // 0xb4 (0x1)
	unsigned char unreflected_b5[0x3]; // 0xb5 (0x3) 
	int IntProperty44; // 0xb8 (0x4)
	float FloatProperty45; // 0xbc (0x4)
	float FloatProperty46; // 0xc0 (0x4)
	float FloatProperty47; // 0xc4 (0x4)
	float FloatProperty48; // 0xc8 (0x4)
	float FloatProperty49; // 0xcc (0x4)
	float FloatProperty50; // 0xd0 (0x4)
	int IntProperty51; // 0xd4 (0x4)
	int IntProperty52; // 0xd8 (0x4)
	float FloatProperty53; // 0xdc (0x4)
	float FloatProperty54; // 0xe0 (0x4)
	float FloatProperty55; // 0xe4 (0x4)
	float FloatProperty56; // 0xe8 (0x4)
	float FloatProperty57; // 0xec (0x4)
	float FloatProperty58; // 0xf0 (0x4)
	float FloatProperty59; // 0xf4 (0x4)
	float FloatProperty60; // 0xf8 (0x4)
	float FloatProperty61; // 0xfc (0x4)
	float FloatProperty62; // 0x100 (0x4)
	float FloatProperty63; // 0x104 (0x4)
	float FloatProperty64; // 0x108 (0x4)
	unsigned char ByteProperty65; // 0x10c (0x1)
	unsigned char unreflected_10d[0x3]; // 0x10d (0x3) 
	float FloatProperty66; // 0x110 (0x4)
	float FloatProperty67; // 0x114 (0x4)
	unsigned char ByteProperty68; // 0x118 (0x1)
	unsigned char unreflected_119[0x3]; // 0x119 (0x3) 
	float FloatProperty69; // 0x11c (0x4)
	float FloatProperty70; // 0x120 (0x4)
	float FloatProperty71; // 0x124 (0x4)
	float FloatProperty72; // 0x128 (0x4)
	float FloatProperty73; // 0x12c (0x4)
	float FloatProperty74; // 0x130 (0x4)
	float FloatProperty75; // 0x134 (0x4)
	float FloatProperty76; // 0x138 (0x4)
	float FloatProperty77; // 0x13c (0x4)
	float FloatProperty78; // 0x140 (0x4)
	float FloatProperty79; // 0x144 (0x4)
	float FloatProperty80; // 0x148 (0x4)
	float FloatProperty81; // 0x14c (0x4)
	float FloatProperty82; // 0x150 (0x4)
	float FloatProperty83; // 0x154 (0x4)
	float FloatProperty84; // 0x158 (0x4)
	float FloatProperty85; // 0x15c (0x4)
	float FloatProperty86; // 0x160 (0x4)
	float FloatProperty87; // 0x164 (0x4)
	float FloatProperty88; // 0x168 (0x4)
	float FloatProperty89; // 0x16c (0x4)
	float FloatProperty90; // 0x170 (0x4)
	float FloatProperty91; // 0x174 (0x4)
	float FloatProperty92; // 0x178 (0x4)
	float FloatProperty93; // 0x17c (0x4)
	float FloatProperty94; // 0x180 (0x4)
	float FloatProperty95; // 0x184 (0x4)
	float FloatProperty96; // 0x188 (0x4)
	unsigned char ByteProperty97; // 0x18c (0x1)
	unsigned char ByteProperty98; // 0x18d (0x1)
	unsigned char ByteProperty99; // 0x18e (0x1)
	unsigned char unreflected_18f[0x1]; // 0x18f (0x1) 
	float FloatProperty100; // 0x190 (0x4)
	float FloatProperty101; // 0x194 (0x4)
	float FloatProperty102; // 0x198 (0x4)
	float FloatProperty103; // 0x19c (0x4)
	float FloatProperty104; // 0x1a0 (0x4)
	float FloatProperty105; // 0x1a4 (0x4)
	unsigned char ByteProperty106; // 0x1a8 (0x1)
	unsigned char ByteProperty107; // 0x1a9 (0x1)
	unsigned char ByteProperty108; // 0x1aa (0x1)
	unsigned char unreflected_1ab[0x1]; // 0x1ab (0x1) 
	float FloatProperty109; // 0x1ac (0x4)
	float FloatProperty110; // 0x1b0 (0x4)
	float FloatProperty111; // 0x1b4 (0x4)
	float FloatProperty112; // 0x1b8 (0x4)
	float FloatProperty113; // 0x1bc (0x4)
	float FloatProperty114; // 0x1c0 (0x4)
	float FloatProperty115; // 0x1c4 (0x4)
	float FloatProperty116; // 0x1c8 (0x4)
	float FloatProperty117; // 0x1cc (0x4)
	float FloatProperty118; // 0x1d0 (0x4)
	float FloatProperty119; // 0x1d4 (0x4)
	float FloatProperty120; // 0x1d8 (0x4)
	float FloatProperty121; // 0x1dc (0x4)
	float FloatProperty122; // 0x1e0 (0x4)
	float FloatProperty123; // 0x1e4 (0x4)
	float FloatProperty124; // 0x1e8 (0x4)
	float FloatProperty125; // 0x1ec (0x4)
	float FloatProperty126; // 0x1f0 (0x4)
	unsigned char ByteProperty127; // 0x1f4 (0x1)
	unsigned char ByteProperty128; // 0x1f5 (0x1)
	unsigned char ByteProperty129; // 0x1f6 (0x1)
	unsigned char unreflected_1f7[0x1]; // 0x1f7 (0x1) 
	float FloatProperty130; // 0x1f8 (0x4)
	float FloatProperty131; // 0x1fc (0x4)
	float FloatProperty132; // 0x200 (0x4)
	float FloatProperty133; // 0x204 (0x4)
	unsigned char ByteProperty134; // 0x208 (0x1)
	unsigned char ByteProperty135; // 0x209 (0x1)
	unsigned char unreflected_20a[0x2]; // 0x20a (0x2) 
	float FloatProperty136; // 0x20c (0x4)
	float FloatProperty137; // 0x210 (0x4)
	unsigned char ByteProperty138; // 0x214 (0x1)
	unsigned char ByteProperty139; // 0x215 (0x1)
	unsigned char ByteProperty140; // 0x216 (0x1)
	unsigned char unreflected_217[0x1]; // 0x217 (0x1) 
	float FloatProperty141; // 0x218 (0x4)
	float FloatProperty142; // 0x21c (0x4)
	float FloatProperty143; // 0x220 (0x4)
	float FloatProperty144; // 0x224 (0x4)
	float FloatProperty145; // 0x228 (0x4)
	float FloatProperty146; // 0x22c (0x4)
	float FloatProperty147; // 0x230 (0x4)
	float FloatProperty148; // 0x234 (0x4)
	float FloatProperty149; // 0x238 (0x4)
	float FloatProperty150; // 0x23c (0x4)
	unsigned char ByteProperty151; // 0x240 (0x1)
	unsigned char ByteProperty152; // 0x241 (0x1)
	unsigned char unreflected_242[0x2]; // 0x242 (0x2) 
	float FloatProperty153; // 0x244 (0x4)
	float FloatProperty154; // 0x248 (0x4)
	float FloatProperty155; // 0x24c (0x4)
	float FloatProperty156; // 0x250 (0x4)
	float FloatProperty157; // 0x254 (0x4)
	float FloatProperty158; // 0x258 (0x4)
	float FloatProperty159; // 0x25c (0x4)
	float FloatProperty160; // 0x260 (0x4)
	unsigned char ByteProperty161; // 0x264 (0x1)
	unsigned char unreflected_265[0x3]; // 0x265 (0x3) 
	float FloatProperty162; // 0x268 (0x4)
	float FloatProperty163; // 0x26c (0x4)
	float FloatProperty164; // 0x270 (0x4)
	float FloatProperty165; // 0x274 (0x4)
	float FloatProperty166; // 0x278 (0x4)
	float FloatProperty167; // 0x27c (0x4)
	float FloatProperty168; // 0x280 (0x4)
	float FloatProperty169; // 0x284 (0x4)
	float FloatProperty170; // 0x288 (0x4)
	float FloatProperty171; // 0x28c (0x4)
	float FloatProperty172; // 0x290 (0x4)
	float FloatProperty173; // 0x294 (0x4)
	float FloatProperty174; // 0x298 (0x4)
	float FloatProperty175; // 0x29c (0x4)
	float FloatProperty176; // 0x2a0 (0x4)
	float FloatProperty177; // 0x2a4 (0x4)
	float FloatProperty178; // 0x2a8 (0x4)
	float FloatProperty179; // 0x2ac (0x4)
	float FloatProperty180; // 0x2b0 (0x4)
	float FloatProperty181; // 0x2b4 (0x4)
	float FloatProperty182; // 0x2b8 (0x4)
	float FloatProperty183; // 0x2bc (0x4)
	float FloatProperty184; // 0x2c0 (0x4)
	float FloatProperty185; // 0x2c4 (0x4)
	float FloatProperty186; // 0x2c8 (0x4)
	float FloatProperty187; // 0x2cc (0x4)
	float FloatProperty188; // 0x2d0 (0x4)
	float FloatProperty189; // 0x2d4 (0x4)
	float FloatProperty190; // 0x2d8 (0x4)
	float FloatProperty191; // 0x2dc (0x4)
	float FloatProperty192; // 0x2e0 (0x4)
	float FloatProperty193; // 0x2e4 (0x4)
	float FloatProperty194; // 0x2e8 (0x4)
	float FloatProperty195; // 0x2ec (0x4)
	float FloatProperty196; // 0x2f0 (0x4)
	float FloatProperty197; // 0x2f4 (0x4)
	float FloatProperty198; // 0x2f8 (0x4)
	float FloatProperty199; // 0x2fc (0x4)
	float FloatProperty200; // 0x300 (0x4)
	float FloatProperty201; // 0x304 (0x4)
	float FloatProperty202; // 0x308 (0x4)
	float FloatProperty203; // 0x30c (0x4)
	float FloatProperty204; // 0x310 (0x4)
	float FloatProperty205; // 0x314 (0x4)
	float FloatProperty206; // 0x318 (0x4)
	float FloatProperty207; // 0x31c (0x4)
	float FloatProperty208; // 0x320 (0x4)
	float FloatProperty209; // 0x324 (0x4)
	unsigned char ByteProperty210; // 0x328 (0x1)
	unsigned char ByteProperty211; // 0x329 (0x1)
	unsigned char ByteProperty212; // 0x32a (0x1)
	unsigned char ByteProperty213; // 0x32b (0x1)
	unsigned char ByteProperty214; // 0x32c (0x1)
	unsigned char ByteProperty215; // 0x32d (0x1)
	unsigned char ByteProperty216; // 0x32e (0x1)
	unsigned char ByteProperty217; // 0x32f (0x1)
	unsigned char ByteProperty218; // 0x330 (0x1)
	unsigned char unreflected_331[0x3]; // 0x331 (0x3) 
	float FloatProperty219; // 0x334 (0x4)
	float FloatProperty220; // 0x338 (0x4)
	float FloatProperty221; // 0x33c (0x4)
	float FloatProperty222; // 0x340 (0x4)
	float FloatProperty223; // 0x344 (0x4)
	float FloatProperty224; // 0x348 (0x4)
	float FloatProperty225; // 0x34c (0x4)
	float FloatProperty226; // 0x350 (0x4)
	float FloatProperty227; // 0x354 (0x4)
	float FloatProperty228; // 0x358 (0x4)
	float FloatProperty229; // 0x35c (0x4)
	float FloatProperty230; // 0x360 (0x4)
	float FloatProperty231; // 0x364 (0x4)
	float FloatProperty232; // 0x368 (0x4)
	float FloatProperty233; // 0x36c (0x4)
	float FloatProperty234; // 0x370 (0x4)
	float FloatProperty235; // 0x374 (0x4)
	float FloatProperty236; // 0x378 (0x4)
	float FloatProperty237; // 0x37c (0x4)
	unsigned char ByteProperty238; // 0x380 (0x1)
	unsigned char ByteProperty239; // 0x381 (0x1)
	unsigned char ByteProperty240; // 0x382 (0x1)
	unsigned char unreflected_383[0x1]; // 0x383 (0x1) 
	float FloatProperty241; // 0x384 (0x4)
	float FloatProperty242; // 0x388 (0x4)
	float FloatProperty243; // 0x38c (0x4)
	float FloatProperty244; // 0x390 (0x4)
	float FloatProperty245; // 0x394 (0x4)
	unsigned char ByteProperty246; // 0x398 (0x1)
	unsigned char ByteProperty247; // 0x399 (0x1)
	unsigned char unreflected_39a[0x2]; // 0x39a (0x2) 
	float FloatProperty248; // 0x39c (0x4)
	float FloatProperty249; // 0x3a0 (0x4)
	unsigned char ByteProperty250; // 0x3a4 (0x1)
	unsigned char unreflected_3a5[0x3]; // 0x3a5 (0x3) 
	float FloatProperty251; // 0x3a8 (0x4)
	float FloatProperty252; // 0x3ac (0x4)
	float FloatProperty253; // 0x3b0 (0x4)
	float FloatProperty254; // 0x3b4 (0x4)
	float FloatProperty255; // 0x3b8 (0x4)
	float FloatProperty256; // 0x3bc (0x4)
	float FloatProperty257; // 0x3c0 (0x4)
	float FloatProperty258; // 0x3c4 (0x4)
	float FloatProperty259; // 0x3c8 (0x4)
	float FloatProperty260; // 0x3cc (0x4)
	float FloatProperty261; // 0x3d0 (0x4)
	float FloatProperty262; // 0x3d4 (0x4)
	unsigned char ByteProperty263; // 0x3d8 (0x1)
	unsigned char unreflected_3d9[0x3]; // 0x3d9 (0x3) 
	float FloatProperty264; // 0x3dc (0x4)
	float FloatProperty265; // 0x3e0 (0x4)
	unsigned char ByteProperty266; // 0x3e4 (0x1)
	unsigned char unreflected_3e5[0x3]; // 0x3e5 (0x3) 
	float FloatProperty267; // 0x3e8 (0x4)
	float FloatProperty268; // 0x3ec (0x4)
	float FloatProperty269; // 0x3f0 (0x4)
	float FloatProperty270; // 0x3f4 (0x4)
	float FloatProperty271; // 0x3f8 (0x4)
	float FloatProperty272; // 0x3fc (0x4)
	float FloatProperty273; // 0x400 (0x4)
	float FloatProperty274; // 0x404 (0x4)
	float FloatProperty275; // 0x408 (0x4)
	float FloatProperty276; // 0x40c (0x4)
	float FloatProperty277; // 0x410 (0x4)
	float FloatProperty278; // 0x414 (0x4)
	float FloatProperty279; // 0x418 (0x4)
	float FloatProperty280; // 0x41c (0x4)
	unsigned char ByteProperty281; // 0x420 (0x1)
	unsigned char unreflected_421[0x3]; // 0x421 (0x3) 
	float FloatProperty282; // 0x424 (0x4)
	float FloatProperty283; // 0x428 (0x4)
};

