// ScriptStruct /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x228
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty1121; // 0x4 (0x4)
	struct FName NameProperty1122; // 0x8 (0x4)
	struct FName NameProperty1123; // 0xc (0x4)
	struct FName NameProperty1124; // 0x10 (0x4)
	struct FName NameProperty1125; // 0x14 (0x4)
	struct TArray<float> ArrayProperty1126; // 0x18 (0x10)
	struct FName NameProperty1127; // 0x28 (0x4)
	struct FName NameProperty1128; // 0x2c (0x4)
	struct TArray<float> ArrayProperty1129; // 0x30 (0x10)
	float FloatProperty1130; // 0x40 (0x4)
	struct FName NameProperty1131; // 0x44 (0x4)
	int IntProperty1132; // 0x48 (0x4)
	struct FName NameProperty1133; // 0x4c (0x4)
	struct FName NameProperty1134; // 0x50 (0x4)
	struct FName NameProperty1135; // 0x54 (0x4)
	struct FName NameProperty1136; // 0x58 (0x4)
	struct FName NameProperty1137; // 0x5c (0x4)
	struct FName NameProperty1138; // 0x60 (0x4)
	struct FName NameProperty1139; // 0x64 (0x4)
	struct FName NameProperty1140; // 0x68 (0x4)
	struct FName NameProperty1141; // 0x6c (0x4)
	int IntProperty1142; // 0x70 (0x4)
	unsigned char unreflected_74[0x4]; // 0x74 (0x4) 
	struct TArray<float> ArrayProperty1143; // 0x78 (0x10)
	struct FName NameProperty1144; // 0x88 (0x4)
	int IntProperty1145; // 0x8c (0x4)
	enum EBlendListTransitionType EnumProperty1146; // 0x90 (0x1)
	unsigned char unreflected_91[0x7]; // 0x91 (0x7) 
	struct TArray<float> ArrayProperty1147; // 0x98 (0x10)
	struct TArray<float> ArrayProperty1148; // 0xa8 (0x10)
	struct FName NameProperty1149; // 0xb8 (0x4)
	int IntProperty1150; // 0xbc (0x4)
	struct FName NameProperty1151; // 0xc0 (0x4)
	int IntProperty1152; // 0xc4 (0x4)
	struct FName NameProperty1153; // 0xc8 (0x4)
	int IntProperty1154; // 0xcc (0x4)
	struct FName NameProperty1155; // 0xd0 (0x4)
	int IntProperty1156; // 0xd4 (0x4)
	struct TArray<float> ArrayProperty1157; // 0xd8 (0x10)
	class UBlendProfile* BlendProfile1158; // 0xe8 (0x8)
	class UCurveFloat* CurveFloat1159; // 0xf0 (0x8)
	enum EAlphaBlendOption EnumProperty1160; // 0xf8 (0x1)
	enum EBlendListTransitionType EnumProperty1161; // 0xf9 (0x1)
	unsigned char unreflected_fa[0x6]; // 0xfa (0x6) 
	struct TArray<float> ArrayProperty1162; // 0x100 (0x10)
	enum EAnimSyncMethod EnumProperty1163; // 0x110 (0x1)
	unsigned char unreflected_111[0x3]; // 0x111 (0x3) 
	struct FName NameProperty1164; // 0x114 (0x4)
	struct FName NameProperty1165; // 0x118 (0x4)
	struct FName NameProperty1166; // 0x11c (0x4)
	bool BoolProperty1167; // 0x120 (0x1)
	unsigned char unreflected_121[0x3]; // 0x121 (0x3) 
	float FloatProperty1168; // 0x124 (0x4)
	struct FInputScaleBiasClampConstants StructProperty1169; // 0x128 (0x2c)
	float FloatProperty1170; // 0x154 (0x4)
	bool BoolProperty1171; // 0x158 (0x1)
	enum EAnimSyncMethod EnumProperty1172; // 0x159 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty1173; // 0x15a (0x1)
	unsigned char unreflected_15b[0x1]; // 0x15b (0x1) 
	struct FName NameProperty1174; // 0x15c (0x4)
	int IntProperty1175; // 0x160 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty1176; // 0x164 (0x1)
	unsigned char unreflected_165[0x3]; // 0x165 (0x3) 
	struct FName NameProperty1177; // 0x168 (0x4)
	struct FName NameProperty1178; // 0x16c (0x4)
	int IntProperty1179; // 0x170 (0x4)
	unsigned char unreflected_174[0x4]; // 0x174 (0x4) 
	struct FAnimNodeFunctionRef StructProperty1180; // 0x178 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x190 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x210 (0x18)
};

