// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0xb
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	bool BoolProperty0; // 0x2 (0x1)
	bool BoolProperty1; // 0x3 (0x1)
	bool BoolProperty2; // 0x4 (0x1)
	bool BoolProperty3; // 0x5 (0x1)
	bool BoolProperty4; // 0x6 (0x1)
	bool BoolProperty5; // 0x7 (0x1)
	unsigned char ByteProperty6; // 0x8 (0x1)
	bool BoolProperty7; // 0x9 (0x1)
	bool BoolProperty8; // 0xa (0x1)
};

