// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1c0
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty342; // 0x4 (0x4)
	struct FName NameProperty343; // 0x8 (0x4)
	struct FName NameProperty344; // 0xc (0x4)
	struct FName NameProperty345; // 0x10 (0x4)
	struct FName NameProperty346; // 0x14 (0x4)
	struct FName NameProperty347; // 0x18 (0x4)
	struct FName NameProperty348; // 0x1c (0x4)
	struct FName NameProperty349; // 0x20 (0x4)
	unsigned char unreflected_24[0x4]; // 0x24 (0x4) 
	struct TArray<float> ArrayProperty350; // 0x28 (0x10)
	struct TArray<float> ArrayProperty351; // 0x38 (0x10)
	struct TArray<int> ArrayProperty352; // 0x48 (0x10)
	struct FName NameProperty353; // 0x58 (0x4)
	struct FName NameProperty354; // 0x5c (0x4)
	struct FName NameProperty355; // 0x60 (0x4)
	struct FName NameProperty356; // 0x64 (0x4)
	struct FName NameProperty357; // 0x68 (0x4)
	struct FName NameProperty358; // 0x6c (0x4)
	struct FName NameProperty359; // 0x70 (0x4)
	struct FName NameProperty360; // 0x74 (0x4)
	struct FName NameProperty361; // 0x78 (0x4)
	struct FName NameProperty362; // 0x7c (0x4)
	struct FName NameProperty363; // 0x80 (0x4)
	struct FName NameProperty364; // 0x84 (0x4)
	struct FName NameProperty365; // 0x88 (0x4)
	struct FName NameProperty366; // 0x8c (0x4)
	struct FInputScaleBiasClampConstants StructProperty367; // 0x90 (0x2c)
	float FloatProperty368; // 0xbc (0x4)
	class UBlendProfile* BlendProfile369; // 0xc0 (0x8)
	class UCurveFloat* CurveFloat370; // 0xc8 (0x8)
	enum EAlphaBlendOption EnumProperty371; // 0xd0 (0x1)
	enum EBlendListTransitionType EnumProperty372; // 0xd1 (0x1)
	unsigned char unreflected_d2[0x6]; // 0xd2 (0x6) 
	struct TArray<float> ArrayProperty373; // 0xd8 (0x10)
	bool BoolProperty374; // 0xe8 (0x1)
	unsigned char unreflected_e9[0x3]; // 0xe9 (0x3) 
	struct FName NameProperty375; // 0xec (0x4)
	int IntProperty376; // 0xf0 (0x4)
	float FloatProperty377; // 0xf4 (0x4)
	float FloatProperty378; // 0xf8 (0x4)
	bool BoolProperty379; // 0xfc (0x1)
	enum EAnimSyncMethod EnumProperty380; // 0xfd (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty381; // 0xfe (0x1)
	unsigned char unreflected_ff[0x1]; // 0xff (0x1) 
	struct FName NameProperty382; // 0x100 (0x4)
	struct FName NameProperty383; // 0x104 (0x4)
	int IntProperty384; // 0x108 (0x4)
	unsigned char unreflected_10c[0x4]; // 0x10c (0x4) 
	struct FAnimNodeFunctionRef StructProperty385; // 0x110 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x128 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x1a8 (0x18)
};

