// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_PropertiesDebug_AnimBP.Player_PropertiesDebug_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0xc8
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty4; // 0x4 (0x4)
	struct FName NameProperty5; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	struct FAnimNodeFunctionRef StructProperty6; // 0x10 (0x18)
	struct TEnumAsByte<ERefPoseType> ByteProperty7; // 0x28 (0x1)
	unsigned char unreflected_29[0x7]; // 0x29 (0x7) 
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x30 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0xb0 (0x18)
};

