// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x1a5
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float FloatProperty; // 0x4 (0x4)
	float FloatProperty0; // 0x8 (0x4)
	float FloatProperty1; // 0xc (0x4)
	float FloatProperty2; // 0x10 (0x4)
	float FloatProperty3; // 0x14 (0x4)
	float FloatProperty4; // 0x18 (0x4)
	bool BoolProperty5; // 0x1c (0x1)
	bool BoolProperty6; // 0x1d (0x1)
	unsigned char unreflected_1e[0x2]; // 0x1e (0x2) 
	float FloatProperty7; // 0x20 (0x4)
	float FloatProperty8; // 0x24 (0x4)
	float FloatProperty9; // 0x28 (0x4)
	float FloatProperty10; // 0x2c (0x4)
	float FloatProperty11; // 0x30 (0x4)
	float FloatProperty12; // 0x34 (0x4)
	bool BoolProperty13; // 0x38 (0x1)
	unsigned char unreflected_39[0x3]; // 0x39 (0x3) 
	float FloatProperty14; // 0x3c (0x4)
	float FloatProperty15; // 0x40 (0x4)
	float FloatProperty16; // 0x44 (0x4)
	float FloatProperty17; // 0x48 (0x4)
	float FloatProperty18; // 0x4c (0x4)
	float FloatProperty19; // 0x50 (0x4)
	bool BoolProperty20; // 0x54 (0x1)
	unsigned char unreflected_55[0x3]; // 0x55 (0x3) 
	float FloatProperty21; // 0x58 (0x4)
	float FloatProperty22; // 0x5c (0x4)
	float FloatProperty23; // 0x60 (0x4)
	bool BoolProperty24; // 0x64 (0x1)
	unsigned char unreflected_65[0x3]; // 0x65 (0x3) 
	float FloatProperty25; // 0x68 (0x4)
	float FloatProperty26; // 0x6c (0x4)
	float FloatProperty27; // 0x70 (0x4)
	unsigned char ByteProperty28; // 0x74 (0x1)
	unsigned char unreflected_75[0x3]; // 0x75 (0x3) 
	float FloatProperty29; // 0x78 (0x4)
	float FloatProperty30; // 0x7c (0x4)
	float FloatProperty31; // 0x80 (0x4)
	float FloatProperty32; // 0x84 (0x4)
	bool BoolProperty33; // 0x88 (0x1)
	unsigned char unreflected_89[0x3]; // 0x89 (0x3) 
	float FloatProperty34; // 0x8c (0x4)
	float FloatProperty35; // 0x90 (0x4)
	float FloatProperty36; // 0x94 (0x4)
	float FloatProperty37; // 0x98 (0x4)
	float FloatProperty38; // 0x9c (0x4)
	float FloatProperty39; // 0xa0 (0x4)
	bool BoolProperty40; // 0xa4 (0x1)
	bool BoolProperty41; // 0xa5 (0x1)
	unsigned char unreflected_a6[0x2]; // 0xa6 (0x2) 
	float FloatProperty42; // 0xa8 (0x4)
	float FloatProperty43; // 0xac (0x4)
	float FloatProperty44; // 0xb0 (0x4)
	bool BoolProperty45; // 0xb4 (0x1)
	unsigned char unreflected_b5[0x3]; // 0xb5 (0x3) 
	float FloatProperty46; // 0xb8 (0x4)
	float FloatProperty47; // 0xbc (0x4)
	float FloatProperty48; // 0xc0 (0x4)
	bool BoolProperty49; // 0xc4 (0x1)
	unsigned char unreflected_c5[0x3]; // 0xc5 (0x3) 
	float FloatProperty50; // 0xc8 (0x4)
	float FloatProperty51; // 0xcc (0x4)
	float FloatProperty52; // 0xd0 (0x4)
	bool BoolProperty53; // 0xd4 (0x1)
	unsigned char unreflected_d5[0x3]; // 0xd5 (0x3) 
	float FloatProperty54; // 0xd8 (0x4)
	float FloatProperty55; // 0xdc (0x4)
	float FloatProperty56; // 0xe0 (0x4)
	unsigned char ByteProperty57; // 0xe4 (0x1)
	unsigned char unreflected_e5[0x3]; // 0xe5 (0x3) 
	float FloatProperty58; // 0xe8 (0x4)
	float FloatProperty59; // 0xec (0x4)
	float FloatProperty60; // 0xf0 (0x4)
	float FloatProperty61; // 0xf4 (0x4)
	bool BoolProperty62; // 0xf8 (0x1)
	unsigned char unreflected_f9[0x3]; // 0xf9 (0x3) 
	float FloatProperty63; // 0xfc (0x4)
	float FloatProperty64; // 0x100 (0x4)
	float FloatProperty65; // 0x104 (0x4)
	float FloatProperty66; // 0x108 (0x4)
	float FloatProperty67; // 0x10c (0x4)
	float FloatProperty68; // 0x110 (0x4)
	float FloatProperty69; // 0x114 (0x4)
	unsigned char ByteProperty70; // 0x118 (0x1)
	unsigned char unreflected_119[0x3]; // 0x119 (0x3) 
	float FloatProperty71; // 0x11c (0x4)
	struct TArray<float> ArrayProperty72; // 0x120 (0x10)
	unsigned char ByteProperty73; // 0x130 (0x1)
	unsigned char unreflected_131[0x3]; // 0x131 (0x3) 
	float FloatProperty74; // 0x134 (0x4)
	float FloatProperty75; // 0x138 (0x4)
	float FloatProperty76; // 0x13c (0x4)
	float FloatProperty77; // 0x140 (0x4)
	float FloatProperty78; // 0x144 (0x4)
	float FloatProperty79; // 0x148 (0x4)
	float FloatProperty80; // 0x14c (0x4)
	float FloatProperty81; // 0x150 (0x4)
	unsigned char unreflected_154[0x4]; // 0x154 (0x4) 
	struct TArray<float> ArrayProperty82; // 0x158 (0x10)
	unsigned char ByteProperty83; // 0x168 (0x1)
	unsigned char unreflected_169[0x3]; // 0x169 (0x3) 
	float FloatProperty84; // 0x16c (0x4)
	float FloatProperty85; // 0x170 (0x4)
	float FloatProperty86; // 0x174 (0x4)
	float FloatProperty87; // 0x178 (0x4)
	unsigned char ByteProperty88; // 0x17c (0x1)
	bool BoolProperty89; // 0x17d (0x1)
	unsigned char unreflected_17e[0x2]; // 0x17e (0x2) 
	struct TArray<float> ArrayProperty90; // 0x180 (0x10)
	unsigned char ByteProperty91; // 0x190 (0x1)
	unsigned char unreflected_191[0x3]; // 0x191 (0x3) 
	float FloatProperty92; // 0x194 (0x4)
	float FloatProperty93; // 0x198 (0x4)
	float FloatProperty94; // 0x19c (0x4)
	float FloatProperty95; // 0x1a0 (0x4)
	bool BoolProperty96; // 0x1a4 (0x1)
};

