// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_BuildingPose_AnimBP.Player_BuildingPose_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x158
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty129; // 0x4 (0x4)
	struct TArray<float> ArrayProperty130; // 0x8 (0x10)
	struct TArray<int> ArrayProperty131; // 0x18 (0x10)
	struct FName NameProperty132; // 0x28 (0x4)
	int IntProperty133; // 0x2c (0x4)
	bool BoolProperty134; // 0x30 (0x1)
	unsigned char unreflected_31[0x3]; // 0x31 (0x3) 
	float FloatProperty135; // 0x34 (0x4)
	struct FInputScaleBiasClampConstants StructProperty136; // 0x38 (0x2c)
	float FloatProperty137; // 0x64 (0x4)
	enum EAnimSyncMethod EnumProperty138; // 0x68 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty139; // 0x69 (0x1)
	unsigned char unreflected_6a[0x6]; // 0x6a (0x6) 
	class UBlendProfile* BlendProfile140; // 0x70 (0x8)
	class UCurveFloat* CurveFloat141; // 0x78 (0x8)
	bool BoolProperty142; // 0x80 (0x1)
	enum EAlphaBlendOption EnumProperty143; // 0x81 (0x1)
	enum EBlendListTransitionType EnumProperty144; // 0x82 (0x1)
	unsigned char unreflected_83[0x5]; // 0x83 (0x5) 
	struct TArray<float> ArrayProperty145; // 0x88 (0x10)
	struct FName NameProperty146; // 0x98 (0x4)
	struct FName NameProperty147; // 0x9c (0x4)
	int IntProperty148; // 0xa0 (0x4)
	unsigned char unreflected_a4[0x4]; // 0xa4 (0x4) 
	struct FAnimNodeFunctionRef StructProperty149; // 0xa8 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0xc0 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x140 (0x18)
};

