// ScriptStruct /Game/Characters/Player/Male/Male_Avg_Base/Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// Size: 0x14d
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	bool BoolProperty0; // 0x2 (0x1)
	bool BoolProperty1; // 0x3 (0x1)
	bool BoolProperty2; // 0x4 (0x1)
	unsigned char unreflected_5[0x3]; // 0x5 (0x3) 
	struct TArray<float> ArrayProperty3; // 0x8 (0x10)
	bool BoolProperty4; // 0x18 (0x1)
	bool BoolProperty5; // 0x19 (0x1)
	bool BoolProperty6; // 0x1a (0x1)
	unsigned char ByteProperty7; // 0x1b (0x1)
	bool BoolProperty8; // 0x1c (0x1)
	unsigned char unreflected_1d[0x3]; // 0x1d (0x3) 
	struct TArray<float> ArrayProperty9; // 0x20 (0x10)
	bool BoolProperty10; // 0x30 (0x1)
	bool BoolProperty11; // 0x31 (0x1)
	bool BoolProperty12; // 0x32 (0x1)
	unsigned char ByteProperty13; // 0x33 (0x1)
	float FloatProperty14; // 0x34 (0x4)
	bool BoolProperty15; // 0x38 (0x1)
	unsigned char unreflected_39[0x3]; // 0x39 (0x3) 
	float FloatProperty16; // 0x3c (0x4)
	float FloatProperty17; // 0x40 (0x4)
	bool BoolProperty18; // 0x44 (0x1)
	unsigned char unreflected_45[0x3]; // 0x45 (0x3) 
	float FloatProperty19; // 0x48 (0x4)
	unsigned char unreflected_4c[0x4]; // 0x4c (0x4) 
	struct TArray<float> ArrayProperty20; // 0x50 (0x10)
	bool BoolProperty21; // 0x60 (0x1)
	unsigned char unreflected_61[0x3]; // 0x61 (0x3) 
	float FloatProperty22; // 0x64 (0x4)
	bool BoolProperty23; // 0x68 (0x1)
	unsigned char unreflected_69[0x3]; // 0x69 (0x3) 
	float FloatProperty24; // 0x6c (0x4)
	bool BoolProperty25; // 0x70 (0x1)
	unsigned char unreflected_71[0x3]; // 0x71 (0x3) 
	float FloatProperty26; // 0x74 (0x4)
	unsigned char ByteProperty27; // 0x78 (0x1)
	bool BoolProperty28; // 0x79 (0x1)
	bool BoolProperty29; // 0x7a (0x1)
	bool BoolProperty30; // 0x7b (0x1)
	unsigned char ByteProperty31; // 0x7c (0x1)
	unsigned char ByteProperty32; // 0x7d (0x1)
	unsigned char ByteProperty33; // 0x7e (0x1)
	bool BoolProperty34; // 0x7f (0x1)
	struct TArray<float> ArrayProperty35; // 0x80 (0x10)
	bool BoolProperty36; // 0x90 (0x1)
	unsigned char ByteProperty37; // 0x91 (0x1)
	bool BoolProperty38; // 0x92 (0x1)
	unsigned char ByteProperty39; // 0x93 (0x1)
	bool BoolProperty40; // 0x94 (0x1)
	unsigned char ByteProperty41; // 0x95 (0x1)
	bool BoolProperty42; // 0x96 (0x1)
	bool BoolProperty43; // 0x97 (0x1)
	bool BoolProperty44; // 0x98 (0x1)
	unsigned char unreflected_99[0x7]; // 0x99 (0x7) 
	struct TArray<float> ArrayProperty45; // 0xa0 (0x10)
	bool BoolProperty46; // 0xb0 (0x1)
	bool BoolProperty47; // 0xb1 (0x1)
	bool BoolProperty48; // 0xb2 (0x1)
	unsigned char ByteProperty49; // 0xb3 (0x1)
	bool BoolProperty50; // 0xb4 (0x1)
	bool BoolProperty51; // 0xb5 (0x1)
	unsigned char unreflected_b6[0x2]; // 0xb6 (0x2) 
	struct TArray<float> ArrayProperty52; // 0xb8 (0x10)
	bool BoolProperty53; // 0xc8 (0x1)
	bool BoolProperty54; // 0xc9 (0x1)
	bool BoolProperty55; // 0xca (0x1)
	bool BoolProperty56; // 0xcb (0x1)
	unsigned char unreflected_cc[0x4]; // 0xcc (0x4) 
	struct TArray<float> ArrayProperty57; // 0xd0 (0x10)
	bool BoolProperty58; // 0xe0 (0x1)
	bool BoolProperty59; // 0xe1 (0x1)
	bool BoolProperty60; // 0xe2 (0x1)
	bool BoolProperty61; // 0xe3 (0x1)
	float FloatProperty62; // 0xe4 (0x4)
	float FloatProperty63; // 0xe8 (0x4)
	float FloatProperty64; // 0xec (0x4)
	float FloatProperty65; // 0xf0 (0x4)
	bool BoolProperty66; // 0xf4 (0x1)
	unsigned char unreflected_f5[0x3]; // 0xf5 (0x3) 
	float FloatProperty67; // 0xf8 (0x4)
	float FloatProperty68; // 0xfc (0x4)
	float FloatProperty69; // 0x100 (0x4)
	float FloatProperty70; // 0x104 (0x4)
	unsigned char ByteProperty71; // 0x108 (0x1)
	unsigned char unreflected_109[0x3]; // 0x109 (0x3) 
	float FloatProperty72; // 0x10c (0x4)
	float FloatProperty73; // 0x110 (0x4)
	bool BoolProperty74; // 0x114 (0x1)
	bool BoolProperty75; // 0x115 (0x1)
	bool BoolProperty76; // 0x116 (0x1)
	unsigned char unreflected_117[0x1]; // 0x117 (0x1) 
	float FloatProperty77; // 0x118 (0x4)
	float FloatProperty78; // 0x11c (0x4)
	struct TArray<float> ArrayProperty79; // 0x120 (0x10)
	bool BoolProperty80; // 0x130 (0x1)
	bool BoolProperty81; // 0x131 (0x1)
	unsigned char unreflected_132[0x2]; // 0x132 (0x2) 
	float FloatProperty82; // 0x134 (0x4)
	float FloatProperty83; // 0x138 (0x4)
	float FloatProperty84; // 0x13c (0x4)
	float FloatProperty85; // 0x140 (0x4)
	bool BoolProperty86; // 0x144 (0x1)
	unsigned char ByteProperty87; // 0x145 (0x1)
	bool BoolProperty88; // 0x146 (0x1)
	unsigned char unreflected_147[0x1]; // 0x147 (0x1) 
	int IntProperty89; // 0x148 (0x4)
	bool BoolProperty90; // 0x14c (0x1)
};

