// ScriptStruct /Script/FortniteGame.AthenaLevelInfo
// Size: 0x24
struct FAthenaLevelInfo
{
	int AccountLevel; // 0x0 (0x4)
	int Level; // 0x4 (0x4)
	int MaxLevel; // 0x8 (0x4)
	int LevelXp; // 0xc (0x4)
	int LevelXpForLevel; // 0x10 (0x4)
	int BookLevel; // 0x14 (0x4)
	int BookMaxLevel; // 0x18 (0x4)
	int BookLevelXp; // 0x1c (0x4)
	int BookLevelXpForLevel; // 0x20 (0x4)
};

