// ScriptStruct /Script/FortniteGame.AthenaCarPlayerSlot
// Size: 0x198
struct FAthenaCarPlayerSlot
{
	struct FName SeatSocket; // 0x0 (0x4)
	struct FName SeatChoiceSocket; // 0x4 (0x4)
	struct FName SeatIndicatorSocket; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	struct FText SeatChoiceDisplayText; // 0x10 (0x18)
	struct FName SeatCollision; // 0x28 (0x4)
	unsigned char unreflected_2c[0x4]; // 0x2c (0x4) 
	struct TArray<struct FName> ExitSockets; // 0x30 (0x10)
	struct FAthenaVehicleShootingCone* ShootingCone; // 0x40 (0x8)
	class USoundBase* SoundOnEnter; // 0x48 (0x8)
	class USoundBase* SoundOnExit; // 0x50 (0x8)
	class UClass* AnimInstanceOverride; // 0x58 (0x8)
	class UClass* AnimLayerOverride; // 0x60 (0x8)
	unsigned char bUsePerSeatAnimInstanceOverride; // 0x68 (0x1)
	unsigned char bIsSelectable; // 0x68 (0x1)
	unsigned char bUseGroundMotion; // 0x68 (0x1)
	unsigned char bUseVehicleIsOnGround; // 0x68 (0x1)
	unsigned char bCanEmote; // 0x68 (0x1)
	unsigned char bCanCarryDBNOPlayer; // 0x68 (0x1)
	unsigned char bForceCrouch; // 0x68 (0x1)
	unsigned char bPlayEnterSoundForTransition; // 0x68 (0x1)
	unsigned char bPlayExitSoundForTransition; // 0x69 (0x1)
	unsigned char bIsPushDriver; // 0x69 (0x1)
	unsigned char bCanOnlyFireWhenTargeting; // 0x69 (0x1)
	unsigned char bIsOccupantEnclosed; // 0x69 (0x1)
	unsigned char unreflected_6a[0x6]; // 0x6a (0x6) 
	struct FVector ActorSpaceCameraOffset; // 0x70 (0x18)
	struct FVector VehicleSpaceCameraOffset; // 0x88 (0x18)
	float SlopeCompensationCameraOffset; // 0xa0 (0x4)
	unsigned char unreflected_a4[0x4]; // 0xa4 (0x4) 
	struct FVector StandingFiringOffset; // 0xa8 (0x18)
	struct FVector CrouchingFiringOffset; // 0xc0 (0x18)
	struct FVector EmoteOffset; // 0xd8 (0x18)
	struct TWeakObjectPtr<class AFortPlayerPawn> Player; // 0xf0 (0x8)
	struct TScriptInterface<class IFortVehicleUserInterface> ControllerUser; // 0xf8 (0x10)
	float PlayerEntryTime; // 0x108 (0x4)
	float EnterSeatTime; // 0x10c (0x4)
	bool bConstrainPawnToSeatTransform; // 0x110 (0x1)
	bool bConstrainPawnToSeatDuringTransitionMontage; // 0x111 (0x1)
	bool bOffsetPlayerRelativeAttachLocation; // 0x112 (0x1)
	bool bUseExitTimer; // 0x113 (0x1)
	unsigned char unreflected_114[0x4]; // 0x114 (0x4) 
	class UFortVehicleSeatWeaponComponent* WeaponComponent; // 0x118 (0x8)
	float CameraPitchConstraint; // 0x120 (0x4)
	float CameraYawConstraint; // 0x124 (0x4)
	struct TWeakObjectPtr<class AActor> ReservingActor; // 0x128 (0x8)
	bool bReserved; // 0x130 (0x1)
	unsigned char unreflected_131[0x7]; // 0x131 (0x7) 
	struct TArray<struct FActionDefForUI> ActionDefForUI; // 0x138 (0x10)
	enum ESlotEnvironmentExposure EnvironmentExposure; // 0x148 (0x1)
	unsigned char unreflected_149[0x7]; // 0x149 (0x7) 
	struct FGameplayTagContainer SeatTags; // 0x150 (0x20)
	float VehicleApexZ; // 0x170 (0x4)
	int SeatIndex; // 0x174 (0x4)
	int ExitSocketIndex; // 0x178 (0x4)
	bool bOverrideVehicleExit; // 0x17c (0x1)
	unsigned char unreflected_17d[0x3]; // 0x17d (0x3) 
	struct FVector SeatTransitionVector; // 0x180 (0x18)
};

