// ScriptStruct /Script/FortniteUI.AthenaPlaylistLeaderboardData
// Size: 0x68
struct FAthenaPlaylistLeaderboardData
{
	struct FName StatId; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FText StatDisplayName; // 0x8 (0x18)
	struct FText TabDisplayName; // 0x20 (0x18)
	struct FText RowDisplayName; // 0x38 (0x18)
	struct FString BaseGameplayTag; // 0x50 (0x10)
	bool bIsGlobal; // 0x60 (0x1)
	unsigned char padding_61[0x7]; // 0x61 (0x7)
};

