// ScriptStruct /Script/FortniteUI.AthenaChallengeListVisualOptions
// Size: 0xc
struct FAthenaChallengeListVisualOptions
{
	bool bHideHeaders; // 0x0 (0x1)
	bool bHideCompletionRewards; // 0x1 (0x1)
	bool bHideQuestRewards; // 0x2 (0x1)
	bool bUseCompactActionInfo; // 0x3 (0x1)
	bool bHideLockedQuests; // 0x4 (0x1)
	bool bHideCompletedQuests; // 0x5 (0x1)
	bool bShowOnlyCurentBundleLevelChallenges; // 0x6 (0x1)
	bool bSortCompletedToEnd; // 0x7 (0x1)
	int PreviewBundleLevel; // 0x8 (0x4)
};

