// ScriptStruct /Script/FortniteUI.AthenaBossHealthData
// Size: 0x30
struct FAthenaBossHealthData
{
	bool bVisible; // 0x0 (0x1)
	bool bShowShields; // 0x1 (0x1)
	unsigned char unreflected_2[0x6]; // 0x2 (0x6) 
	struct FText Name; // 0x8 (0x18)
	int Health; // 0x20 (0x4)
	int HealthMax; // 0x24 (0x4)
	int Shields; // 0x28 (0x4)
	int ShieldsMax; // 0x2c (0x4)
};

