// ScriptStruct /Script/FortniteGame.AthenaSeasonEntry
// Size: 0x24
struct FAthenaSeasonEntry
{
	int BookLevel; // 0x0 (0x4)
	int BookXp; // 0x4 (0x4)
	int NumHighBracket; // 0x8 (0x4)
	int NumLowBracket; // 0xc (0x4)
	int NumWins; // 0x10 (0x4)
	bool PurchasedVIP; // 0x14 (0x1)
	unsigned char unreflected_15[0x3]; // 0x15 (0x3) 
	int SeasonLevel; // 0x18 (0x4)
	int SeasonNumber; // 0x1c (0x4)
	int SeasonXp; // 0x20 (0x4)
};

