// ScriptStruct /Script/Engine.AudioEQEffect
// Size: 0x40
struct FAudioEQEffect : FAudioEffectParameters
{
	unsigned char unreflected_8[0x8]; // 0x8 (0x8) 
	float FrequencyCenter0; // 0x10 (0x4)
	float Gain0; // 0x14 (0x4)
	float Bandwidth0; // 0x18 (0x4)
	float FrequencyCenter1; // 0x1c (0x4)
	float Gain1; // 0x20 (0x4)
	float Bandwidth1; // 0x24 (0x4)
	float FrequencyCenter2; // 0x28 (0x4)
	float Gain2; // 0x2c (0x4)
	float Bandwidth2; // 0x30 (0x4)
	float FrequencyCenter3; // 0x34 (0x4)
	float Gain3; // 0x38 (0x4)
	float Bandwidth3; // 0x3c (0x4)
};

