// ScriptStruct /Script/AudioWidgets.AudioSliderStyle
// Size: 0x6d0
struct FAudioSliderStyle : FSlateWidgetStyle
{
	unsigned char unreflected_8[0x8]; // 0x8 (0x8) 
	struct FSliderStyle SliderStyle; // 0x10 (0x4a0)
	struct FAudioTextBoxStyle TextBoxStyle; // 0x4b0 (0xf0)
	struct FSlateBrush WidgetBackgroundImage; // 0x5a0 (0xc0)
	struct FSlateColor SliderBackgroundColor; // 0x660 (0x14)
	unsigned char unreflected_674[0x4]; // 0x674 (0x4) 
	struct FVector2D SliderBackgroundSize; // 0x678 (0x10)
	float LabelPadding; // 0x688 (0x4)
	struct FSlateColor SliderBarColor; // 0x68c (0x14)
	struct FSlateColor SliderThumbColor; // 0x6a0 (0x14)
	struct FSlateColor WidgetBackgroundColor; // 0x6b4 (0x14)
	unsigned char padding_6c8[0x8]; // 0x6c8 (0x8)
};

