// ScriptStruct /Script/AudioWidgets.AudioRadialSliderStyle
// Size: 0x150
struct FAudioRadialSliderStyle : FSlateWidgetStyle
{
	unsigned char unreflected_8[0x8]; // 0x8 (0x8) 
	struct FAudioTextBoxStyle TextBoxStyle; // 0x10 (0xf0)
	struct FSlateColor CenterBackgroundColor; // 0x100 (0x14)
	struct FSlateColor SliderBarColor; // 0x114 (0x14)
	struct FSlateColor SliderProgressColor; // 0x128 (0x14)
	float LabelPadding; // 0x13c (0x4)
	float DefaultSliderRadius; // 0x140 (0x4)
	unsigned char padding_144[0xc]; // 0x144 (0xc)
};

