// ScriptStruct /Script/FortniteGame.BlackWidowLegSinAnimationScalar
// Size: 0x28
struct FBlackWidowLegSinAnimationScalar
{
	bool bUseConstantValue; // 0x0 (0x1)
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float ConstantValue; // 0x4 (0x4)
	float TimeOffset; // 0x8 (0x4)
	float FrequencyOffset; // 0xc (0x4)
	float SinOffset; // 0x10 (0x4)
	float ResultMultiplier; // 0x14 (0x4)
	struct FVector2D MappedRangeOutput; // 0x18 (0x10)
};

