// ScriptStruct /Script/Engine.BodyInstance
// Size: 0x188
struct FBodyInstance : FBodyInstanceCore
{
	unsigned char unreflected_18[0x6]; // 0x18 (0x6) 
	struct TEnumAsByte<ECollisionChannel> ObjectType; // 0x1e (0x1)
	unsigned char unreflected_1f[0x1]; // 0x1f (0x1) 
	struct TEnumAsByte<ECollisionEnabled> CollisionEnabled; // 0x20 (0x1)
	unsigned char unreflected_21[0x38]; // 0x21 (0x38) 
	enum ESleepFamily SleepFamily; // 0x59 (0x1)
	struct TEnumAsByte<EDOFMode> DOFMode; // 0x5a (0x1)
	unsigned char bUseCCD; // 0x5b (0x1)
	unsigned char bIgnoreAnalyticCollisions; // 0x5b (0x1)
	unsigned char bNotifyRigidBodyCollision; // 0x5b (0x1)
	unsigned char bSmoothEdgeCollisions; // 0x5b (0x1)
	unsigned char bLockTranslation; // 0x5b (0x1)
	unsigned char bLockRotation; // 0x5b (0x1)
	unsigned char bLockXTranslation; // 0x5b (0x1)
	unsigned char bLockYTranslation; // 0x5c (0x1)
	unsigned char bLockZTranslation; // 0x5c (0x1)
	unsigned char bLockXRotation; // 0x5c (0x1)
	unsigned char bLockYRotation; // 0x5c (0x1)
	unsigned char bLockZRotation; // 0x5c (0x1)
	unsigned char bOverrideMaxAngularVelocity; // 0x5c (0x1)
	unsigned char bOverrideMaxDepenetrationVelocity; // 0x5d (0x1)
	unsigned char bOverrideWalkableSlopeOnInstance; // 0x5d (0x1)
	unsigned char bInterpolateWhenSubStepping; // 0x5d (0x1)
	unsigned char bInertiaConditioning; // 0x5d (0x1)
	unsigned char unreflected_5e[0x1a]; // 0x5e (0x1a) 
	struct FName CollisionProfileName; // 0x78 (0x4)
	unsigned char PositionSolverIterationCount; // 0x7c (0x1)
	unsigned char VelocitySolverIterationCount; // 0x7d (0x1)
	unsigned char unreflected_7e[0x2]; // 0x7e (0x2) 
	struct FCollisionResponse CollisionResponses; // 0x80 (0x30)
	float MaxDepenetrationVelocity; // 0xb0 (0x4)
	float MassInKgOverride; // 0xb4 (0x4)
	unsigned char unreflected_b8[0x8]; // 0xb8 (0x8) 
	float LinearDamping; // 0xc0 (0x4)
	float AngularDamping; // 0xc4 (0x4)
	struct FVector CustomDOFPlaneNormal; // 0xc8 (0x18)
	struct FVector COMNudge; // 0xe0 (0x18)
	float MassScale; // 0xf8 (0x4)
	unsigned char unreflected_fc[0x4]; // 0xfc (0x4) 
	struct FVector InertiaTensorScale; // 0x100 (0x18)
	unsigned char unreflected_118[0x10]; // 0x118 (0x10) 
	struct FWalkableSlopeOverride WalkableSlopeOverride; // 0x128 (0x10)
	class UPhysicalMaterial* PhysMaterialOverride; // 0x138 (0x8)
	float MaxAngularVelocity; // 0x140 (0x4)
	float CustomSleepThresholdMultiplier; // 0x144 (0x4)
	float StabilizationThresholdMultiplier; // 0x148 (0x4)
	float PhysicsBlendWeight; // 0x14c (0x4)
	unsigned char padding_150[0x38]; // 0x150 (0x38)
};

