// ScriptStruct /Script/FortniteGame.BuildingStats
// Size: 0x20
struct FBuildingStats
{
	int BuildingsPlaced; // 0x0 (0x4)
	int WallsPlaced; // 0x4 (0x4)
	int StairsPlaced; // 0x8 (0x4)
	int FloorsPlaced; // 0xc (0x4)
	int RoofsPlaced; // 0x10 (0x4)
	int WoodBuildingsPlaced; // 0x14 (0x4)
	int StoneBuildingsPlaced; // 0x18 (0x4)
	int MetalBuildingsPlaced; // 0x1c (0x4)
};

