// ScriptStruct /Script/Water.BuoyancyData
// Size: 0x90
struct FBuoyancyData
{
	struct TArray<struct FSphericalPontoon> Pontoons; // 0x0 (0x10)
	bool bCenterPontoonsOnCOM; // 0x10 (0x1)
	unsigned char unreflected_11[0x3]; // 0x11 (0x3) 
	float BuoyancyCoefficient; // 0x14 (0x4)
	float BuoyancyDamp; // 0x18 (0x4)
	float BuoyancyDamp2; // 0x1c (0x4)
	float BuoyancyRampMinVelocity; // 0x20 (0x4)
	float BuoyancyRampMaxVelocity; // 0x24 (0x4)
	float BuoyancyRampMax; // 0x28 (0x4)
	float MaxBuoyantForce; // 0x2c (0x4)
	bool bApplyDragForcesInWater; // 0x30 (0x1)
	unsigned char unreflected_31[0x3]; // 0x31 (0x3) 
	float DragCoefficient; // 0x34 (0x4)
	float DragCoefficient2; // 0x38 (0x4)
	float AngularDragCoefficient; // 0x3c (0x4)
	float MaxDragSpeed; // 0x40 (0x4)
	bool bApplyRiverForces; // 0x44 (0x1)
	unsigned char unreflected_45[0x3]; // 0x45 (0x3) 
	int RiverPontoonIndex; // 0x48 (0x4)
	float WaterShorePushFactor; // 0x4c (0x4)
	float RiverTraversalPathWidth; // 0x50 (0x4)
	float MaxShorePushForce; // 0x54 (0x4)
	float WaterVelocityStrength; // 0x58 (0x4)
	float MaxWaterForce; // 0x5c (0x4)
	bool bAlwaysAllowLateralPush; // 0x60 (0x1)
	bool bAllowCurrentWhenMovingFastUpstream; // 0x61 (0x1)
	bool bApplyDownstreamAngularRotation; // 0x62 (0x1)
	unsigned char unreflected_63[0x5]; // 0x63 (0x5) 
	struct FVector DownstreamAxisOfRotation; // 0x68 (0x18)
	float DownstreamRotationStrength; // 0x80 (0x4)
	float DownstreamRotationStiffness; // 0x84 (0x4)
	float DownstreamRotationAngularDamping; // 0x88 (0x4)
	float DownstreamMaxAcceleration; // 0x8c (0x4)
};

