// ScriptStruct /Script/FortniteGame.CachedLinkAnalyticsData
// Size: 0x40
struct FCachedLinkAnalyticsData
{
	struct FString IslandTitle; // 0x0 (0x10)
	struct FString IslandMnemonic; // 0x10 (0x10)
	int IslandVersion; // 0x20 (0x4)
	bool bIsInDiscovery; // 0x24 (0x1)
	bool bIsValid; // 0x25 (0x1)
	unsigned char unreflected_26[0x2]; // 0x26 (0x2) 
	struct FString IslandAccountID; // 0x28 (0x10)
	float IslandThermometerValue; // 0x38 (0x4)
	unsigned char padding_3c[0x4]; // 0x3c (0x4)
};

