// ScriptStruct /Script/Engine.CanvasUVTri
// Size: 0x90
struct FCanvasUVTri
{
	struct FVector2D V0Pos; // 0x0 (0x10)
	struct FVector2D V0UV; // 0x10 (0x10)
	struct FLinearColor V0Color; // 0x20 (0x10)
	struct FVector2D V1Pos; // 0x30 (0x10)
	struct FVector2D V1UV; // 0x40 (0x10)
	struct FLinearColor V1Color; // 0x50 (0x10)
	struct FVector2D V2Pos; // 0x60 (0x10)
	struct FVector2D V2UV; // 0x70 (0x10)
	struct FLinearColor V2Color; // 0x80 (0x10)
};

