// ScriptStruct /Script/FortniteGame.CCP_Backpack_Downpour_AmbientMovementSettings
// Size: 0x48
struct FCCP_Backpack_Downpour_AmbientMovementSettings
{
	float TimeOffset; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FVector Period; // 0x8 (0x18)
	float PeriodMultiplier; // 0x20 (0x4)
	unsigned char unreflected_24[0x4]; // 0x24 (0x4) 
	struct FVector Magnitude; // 0x28 (0x18)
	float MagnitudeMultiplier; // 0x40 (0x4)
	float RotateMultiplier; // 0x44 (0x4)
};

