// ScriptStruct /Script/LauncherSocialTypes.ChatMarkupStyle
// Size: 0x8b0
struct FChatMarkupStyle
{
	struct FButtonStyle MarkupButtonStyle; // 0x0 (0x3b0)
	struct FTextBlockStyle MarkupTextStyle; // 0x3b0 (0x310)
	struct FSlateBrush MarkupBackground; // 0x6c0 (0xc0)
	struct FSlateColor ButtonColor; // 0x780 (0x14)
	struct FSlateColor ButtonHoverColor; // 0x794 (0x14)
	struct FSlateColor TipColor; // 0x7a8 (0x14)
	unsigned char unreflected_7bc[0x4]; // 0x7bc (0x4) 
	struct FSlateBrush SeperatorBrush; // 0x7c0 (0xc0)
	float SeperatorThickness; // 0x880 (0x4)
	struct FMargin MarkupPadding; // 0x884 (0x10)
	struct FMargin ButtonPadding; // 0x894 (0x10)
	unsigned char padding_8a4[0xc]; // 0x8a4 (0xc)
};

