// ScriptStruct /Script/LauncherSocialTypes.ChatStyle
// Size: 0x1fe0
struct FChatStyle
{
	struct FEditableTextBoxStyle ChatEntryTextStyle; // 0x0 (0xd80)
	struct FEditableTextBoxStyle ChatDisplayTextStyle; // 0xd80 (0xd80)
	struct FScrollBoxStyle ScrollBorderStyle; // 0x1b00 (0x310)
	struct FSlateBrush MessageNotificationBrush; // 0x1e10 (0xc0)
	struct FMargin ChatEntryPadding; // 0x1ed0 (0x10)
	float ChatEntryHeight; // 0x1ee0 (0x4)
	unsigned char unreflected_1ee4[0xc]; // 0x1ee4 (0xc) 
	struct FSlateBrush ChatMenuBackgroundBrush; // 0x1ef0 (0xc0)
	struct FMargin FriendActionPadding; // 0x1fb0 (0x10)
	struct FMargin FriendActionHeaderPadding; // 0x1fc0 (0x10)
	struct FMargin FriendActionStatusMargin; // 0x1fd0 (0x10)
};

