// ScriptStruct /Script/LauncherSocialTypes.ChatColorScheme
// Size: 0x120
struct FChatColorScheme
{
	struct FLinearColor TimeStampColor; // 0x0 (0x10)
	struct FLinearColor DefaultChatColor; // 0x10 (0x10)
	struct FLinearColor WhisperChatColor; // 0x20 (0x10)
	struct FLinearColor GlobalChatColor; // 0x30 (0x10)
	struct FLinearColor FounderChatColor; // 0x40 (0x10)
	struct FLinearColor GameChatColor; // 0x50 (0x10)
	struct FLinearColor TeamChatColor; // 0x60 (0x10)
	struct FLinearColor PartyChatColor; // 0x70 (0x10)
	struct FLinearColor AdminChatColor; // 0x80 (0x10)
	struct FLinearColor GameAdminChatColor; // 0x90 (0x10)
	struct FLinearColor WhisperHyperlinkChatColor; // 0xa0 (0x10)
	struct FLinearColor GlobalHyperlinkChatColor; // 0xb0 (0x10)
	struct FLinearColor FounderHyperlinkChatColor; // 0xc0 (0x10)
	struct FLinearColor GameHyperlinkChatColor; // 0xd0 (0x10)
	struct FLinearColor TeamHyperlinkChatColor; // 0xe0 (0x10)
	struct FLinearColor PartyHyperlinkChatColor; // 0xf0 (0x10)
	struct FLinearColor EnemyColor; // 0x100 (0x10)
	struct FLinearColor FriendlyColor; // 0x110 (0x10)
};

