// ScriptStruct /Script/LauncherSocialTypes.ChatChromeStyle
// Size: 0xb50
struct FChatChromeStyle
{
	struct FSlateBrush UserListBrush; // 0x0 (0xc0)
	struct FSlateBrush ChatBackgroundBrush; // 0xc0 (0xc0)
	struct FSlateBrush ChatEntryBackgroundBrush; // 0x180 (0xc0)
	struct FSlateBrush ChannelBackgroundBrush; // 0x240 (0xc0)
	struct FSlateBrush TabBackgroundBrush; // 0x300 (0xc0)
	struct FButtonStyle TabSelectorButtonStyle; // 0x3c0 (0x3b0)
	struct FMargin TabOptionPadding; // 0x770 (0x10)
	struct FMargin TabContentPadding; // 0x780 (0x10)
	struct FMargin TabClosePadding; // 0x790 (0x10)
	struct FButtonStyle UserListButtonStyle; // 0x7a0 (0x3b0)
};

