// ScriptStruct /Script/ClamberingCodeRuntime.ClamberingTargetingConfig_Ledge
// Size: 0x320
struct FClamberingTargetingConfig_Ledge
{
	struct FScalableFloat ForwardCastDistance; // 0x0 (0x28)
	struct FScalableFloat ForwardCastRadius; // 0x28 (0x28)
	struct FScalableFloat FowardCast2D; // 0x50 (0x28)
	struct FScalableFloat VerticalSurfaceThreshold; // 0x78 (0x28)
	struct FScalableFloat HorizontalSurfaceThreshold; // 0xa0 (0x28)
	struct FScalableFloat UpwardDistanceCapsuleHeightMultiplier; // 0xc8 (0x28)
	struct FScalableFloat UpwardStartDistanceCapsuleHeightMultiplier; // 0xf0 (0x28)
	struct FScalableFloat DownwardDistanceCapsuleHeightMultiplier; // 0x118 (0x28)
	struct FScalableFloat MinimumLedgeHeight; // 0x140 (0x28)
	struct FScalableFloat MinimumLedgeHeightWater; // 0x168 (0x28)
	struct FScalableFloat FallingSpeedThreshold; // 0x190 (0x28)
	struct FScalableFloat MinimumLedgeFallingHeight; // 0x1b8 (0x28)
	struct FScalableFloat MinimumLedgeFallingWaterHeight; // 0x1e0 (0x28)
	struct FScalableFloat ForwardSphereCastRadius; // 0x208 (0x28)
	struct FScalableFloat DownwardSphereCastRadius; // 0x230 (0x28)
	struct FScalableFloat AllowNonWalkableSurfaces; // 0x258 (0x28)
	struct FScalableFloat TargetValidationEnabled; // 0x280 (0x28)
	struct FScalableFloat TargetValidationCapsuleRadiusModifier; // 0x2a8 (0x28)
	struct FScalableFloat TargetValidationCapsuleHalfHeightModifier; // 0x2d0 (0x28)
	struct FScalableFloat TargetValidationCapsuleBottomVerticalOffset; // 0x2f8 (0x28)
};

