// ScriptStruct /Script/Engine.ClothPhysicsProperties_Legacy
// Size: 0x50
struct FClothPhysicsProperties_Legacy
{
	float VerticalResistance; // 0x0 (0x4)
	float HorizontalResistance; // 0x4 (0x4)
	float BendResistance; // 0x8 (0x4)
	float ShearResistance; // 0xc (0x4)
	float Friction; // 0x10 (0x4)
	float Damping; // 0x14 (0x4)
	float TetherStiffness; // 0x18 (0x4)
	float TetherLimit; // 0x1c (0x4)
	float Drag; // 0x20 (0x4)
	float StiffnessFrequency; // 0x24 (0x4)
	float GravityScale; // 0x28 (0x4)
	float MassScale; // 0x2c (0x4)
	float InertiaBlend; // 0x30 (0x4)
	float SelfCollisionThickness; // 0x34 (0x4)
	float SelfCollisionSquashScale; // 0x38 (0x4)
	float SelfCollisionStiffness; // 0x3c (0x4)
	float SolverFrequency; // 0x40 (0x4)
	float FiberCompression; // 0x44 (0x4)
	float FiberExpansion; // 0x48 (0x4)
	float FiberResistance; // 0x4c (0x4)
};

