// ScriptStruct /Script/FortniteGame.CollisionReactionConfiguration
// Size: 0x1d8
struct FCollisionReactionConfiguration
{
	bool bEnabled; // 0x0 (0x1)
	bool bAutoRun; // 0x1 (0x1)
	bool bAutomaticallyRegisterCapsule; // 0x2 (0x1)
	bool bAutomaticallyRegisterMesh; // 0x3 (0x1)
	bool bBoxSweepEnabled; // 0x4 (0x1)
	unsigned char unreflected_5[0x3]; // 0x5 (0x3) 
	float OverriddenSweepBoxDelay; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	struct TArray<struct TEnumAsByte<EObjectTypeQuery>> BoxSweepTypes; // 0x10 (0x10)
	struct FVector BoxSweepOffset; // 0x20 (0x18)
	struct FRotator BoxSweepRotation; // 0x38 (0x18)
	bool bProjectBoxSweepRotationOnTheFloor; // 0x50 (0x1)
	unsigned char unreflected_51[0x7]; // 0x51 (0x7) 
	struct FVector BoxSweepExtent; // 0x58 (0x18)
	struct FName BoxSweepFollowBone; // 0x70 (0x4)
	float BoxSweepVelocityMultiplier; // 0x74 (0x4)
	float ExtremePenetrationThreshold; // 0x78 (0x4)
	bool bUseImpactNormal; // 0x7c (0x1)
	unsigned char unreflected_7d[0x3]; // 0x7d (0x3) 
	float BehindCollisionLaunchVelocityMultiplier; // 0x80 (0x4)
	float AheadCollisionLaunchVelocityMultiplier; // 0x84 (0x4)
	float MinimumMovementVelocityForLaunchVelocityMultiplier; // 0x88 (0x4)
	float MaximumMovementVelocityForLaunchVelocityMultiplier; // 0x8c (0x4)
	float LaunchVelocityMultiplierAtMinimumMovementVelocity; // 0x90 (0x4)
	float LaunchVelocityMultiplierAtMaximumMovementVelocity; // 0x94 (0x4)
	float LaunchVelocityMultiplierWhenAboveSweep; // 0x98 (0x4)
	float AboveSweepThresholdForLaunchVelocityMultiplier; // 0x9c (0x4)
	float LaunchVelocityMaximumMultiplier; // 0xa0 (0x4)
	unsigned char unreflected_a4[0x4]; // 0xa4 (0x4) 
	struct TArray<struct FCollisionReactionForcedLaunchDirection> ForcedLaunchDirections; // 0xa8 (0x10)
	unsigned char unreflected_b8[0x10]; // 0xb8 (0x10) 
	struct TArray<class UClass*> BuildingActorGameplayEffectClasses; // 0xc8 (0x10)
	enum FCollisionWithBuildingActorReactionTypes BuildingActorReaction; // 0xd8 (0x4)
	float BuildingActorImmunityDuration; // 0xdc (0x4)
	enum ETypeOfBuildingActor TypeOfBuildingActor; // 0xe0 (0x4)
	unsigned char unreflected_e4[0x4]; // 0xe4 (0x4) 
	struct FGameplayTagContainer BuildingActorBlacklistTags; // 0xe8 (0x20)
	enum FCollisionWithLaunchableReactionTypes PawnReaction; // 0x108 (0x4)
	unsigned char unreflected_10c[0x4]; // 0x10c (0x4) 
	struct FGameplayTagContainer PawnBlacklistTags; // 0x110 (0x20)
	float TeleportPawnOnSweepBoxExtremePenetrationForSeconds; // 0x130 (0x4)
	float ExtraSpacingWhenTeleportingOutsideOfSweepBox; // 0x134 (0x4)
	struct FVector PawnReactionLaunchVelocity; // 0x138 (0x18)
	float PawnReactionDelayPerActor; // 0x150 (0x4)
	enum FCollisionWithLaunchableReactionTypes VehicleReaction; // 0x154 (0x4)
	struct FVector VehicleReactionLaunchVelocity; // 0x158 (0x18)
	float VehicleReactionDelayPerActor; // 0x170 (0x4)
	enum ETypeOfBuildingActor TypeOfBuildingActorOnPhysicsObject; // 0x174 (0x4)
	enum FCollisionWithLaunchableReactionTypes PhysicsObjectReaction; // 0x178 (0x4)
	unsigned char unreflected_17c[0x4]; // 0x17c (0x4) 
	struct TMap<enum EFortPhysicsSimSize, struct FCollisionReactionConfigurationPerPhysicsObjectSize> PhysicsObjectReactionPerPhysicsObjectSize; // 0x180 (0x50)
	float PhysicsObjectReactionDelayPerActor; // 0x1d0 (0x4)
	unsigned char padding_1d4[0x4]; // 0x1d4 (0x4)
};

