// ScriptStruct /Script/CommonUI.CommonAnalogCursorSettings
// Size: 0x24
struct FCommonAnalogCursorSettings
{
	int PreprocessorPriority; // 0x0 (0x4)
	bool bEnableCursorAcceleration; // 0x4 (0x1)
	unsigned char unreflected_5[0x3]; // 0x5 (0x3) 
	float CursorAcceleration; // 0x8 (0x4)
	float CursorMaxSpeed; // 0xc (0x4)
	float CursorDeadZone; // 0x10 (0x4)
	float HoverSlowdownFactor; // 0x14 (0x4)
	float ScrollDeadZone; // 0x18 (0x4)
	float ScrollUpdatePeriod; // 0x1c (0x4)
	float ScrollMultiplier; // 0x20 (0x4)
};

