// ScriptStruct /Script/Engine.ConvolutionBloomSettings
// Size: 0x30
struct FConvolutionBloomSettings
{
	class UTexture2D* Texture; // 0x0 (0x8)
	float ScatterDispersion; // 0x8 (0x4)
	float Size; // 0xc (0x4)
	struct FVector2D CenterUV; // 0x10 (0x10)
	float PreFilterMin; // 0x20 (0x4)
	float PreFilterMax; // 0x24 (0x4)
	float PreFilterMult; // 0x28 (0x4)
	float BufferScale; // 0x2c (0x4)
};

