// ScriptStruct /Script/FortniteGame.CosmeticLoadoutPartyReplState
// Size: 0x58
struct FCosmeticLoadoutPartyReplState
{
	struct FString BackpackPersistentName; // 0x0 (0x10)
	struct FString BannerIconId; // 0x10 (0x10)
	struct FString BannerColorId; // 0x20 (0x10)
	int BattlePassLevel; // 0x30 (0x4)
	int BattlePassSelfBoostXp; // 0x34 (0x4)
	int BattlePassFriendBoostXp; // 0x38 (0x4)
	unsigned char unreflected_3c[0x4]; // 0x3c (0x4) 
	struct FDisplayManagerVariantData AthenaCharacterVariantInfo; // 0x40 (0x18)
};

