// ScriptStruct /Script/FortniteGame.CrashpadStaticParams
// Size: 0x128
struct FCrashpadStaticParams
{
	struct FGameplayTag HoverTag; // 0x0 (0x4)
	float PawnLaunchMultiplierXY; // 0x4 (0x4)
	float PawnLaunchHorzClamp; // 0x8 (0x4)
	float PawnLaunchVertOffset; // 0xc (0x4)
	float VerticalVelocityMultiplier; // 0x10 (0x4)
	float MinLaunch; // 0x14 (0x4)
	float MaxLaunch; // 0x18 (0x4)
	float MinLaunchCrashpadPlus; // 0x1c (0x4)
	float MaxLaunchCrashpadPlus; // 0x20 (0x4)
	float GrowthStart; // 0x24 (0x4)
	float GrowthEnd; // 0x28 (0x4)
	unsigned char unreflected_2c[0x4]; // 0x2c (0x4) 
	class UCurveFloat* LaunchCurve; // 0x30 (0x8)
	class UCurveFloat* LaunchAngleWeight; // 0x38 (0x8)
	float PlacedLaunchMod; // 0x40 (0x4)
	float VehicleLaunchMultiplierXY; // 0x44 (0x4)
	float VehicleLaunchMultiplierZ; // 0x48 (0x4)
	float VehicleImpactRadius; // 0x4c (0x4)
	float PawnOrVehicleBounceIntensity; // 0x50 (0x4)
	float CrashpadLaunchVertOffset; // 0x54 (0x4)
	float CrashpadBounceIntensity; // 0x58 (0x4)
	unsigned char unreflected_5c[0x4]; // 0x5c (0x4) 
	struct TArray<float> CrashpadBounceScales; // 0x60 (0x10)
	float MovingWithHeldObjectThreshold; // 0x70 (0x4)
	float ProjectileLaunchMultiplierXY; // 0x74 (0x4)
	float ProjectileLaunchMultiplierZ; // 0x78 (0x4)
	float ProjectileBounceIntensity; // 0x7c (0x4)
	class UClass* FallImmunityGameplayEffect; // 0x80 (0x8)
	class UClass* WebLaunchGameplayEffect; // 0x88 (0x8)
	struct FGameplayTag SharkTag; // 0x90 (0x4)
	bool bDestroyByShark; // 0x94 (0x1)
	unsigned char unreflected_95[0x3]; // 0x95 (0x3) 
	struct FGameplayTag KnockbackImmunityTag; // 0x98 (0x4)
	struct FGameplayTag TagBuildingPhysics; // 0x9c (0x4)
	float PhysicsObjectMassMultiplier; // 0xa0 (0x4)
	float PhysicsObjectImpulseMultiplier; // 0xa4 (0x4)
	float MinPhysicsObjectMass; // 0xa8 (0x4)
	float MaxPhysicsObjectMass; // 0xac (0x4)
	float MaxPhysicsObjectLaunch; // 0xb0 (0x4)
	float MinPhysicsObjectStartVelZ; // 0xb4 (0x4)
	float MaxPhysicsObjectStartVelZ; // 0xb8 (0x4)
	float PhysicsObjectBounceIntensity; // 0xbc (0x4)
	float NonPawnLaunchScaleXY; // 0xc0 (0x4)
	float NonPawnLaunchScaleZ; // 0xc4 (0x4)
	float NonPawnLaunchOffsetZ; // 0xc8 (0x4)
	float MinNonPawnVelocity; // 0xcc (0x4)
	float MaxNonPawnVelocity; // 0xd0 (0x4)
	struct FGameplayTag TagEventUsedLaunchPad; // 0xd4 (0x4)
	float BuildingActorBounceIntensity; // 0xd8 (0x4)
	unsigned char unreflected_dc[0x4]; // 0xdc (0x4) 
	class UStaticMeshComponent* CrashpadMesh; // 0xe0 (0x8)
	struct FGameplayTagContainer TagCrashpadPlus; // 0xe8 (0x20)
	struct FGameplayTagContainer QuestCrashpadUseTag; // 0x108 (0x20)
};

