// ScriptStruct /Script/FortniteGame.CreativeToolPersistentData
// Size: 0x8
struct FCreativeToolPersistentData
{
	unsigned char GridSnapIndex; // 0x0 (0x1)
	unsigned char RotationAxisIndex; // 0x1 (0x1)
	unsigned char SelectedScaleAxis; // 0x2 (0x1)
	bool bShouldUsePrecisionGridSnapping; // 0x3 (0x1)
	bool bAllowGravityOnPlace; // 0x4 (0x1)
	bool bShouldDestroyPropsWhenPlacing; // 0x5 (0x1)
	unsigned char HitTraceRule; // 0x6 (0x1)
	bool bIsScalingInsteadOfRotating; // 0x7 (0x1)
};

