// ScriptStruct /Script/FortniteGame.CrucibleSegmentResults
// Size: 0x24
struct FCrucibleSegmentResults
{
	int SegmentId; // 0x0 (0x4)
	float CalculatedScore; // 0x4 (0x4)
	float CalculatedPenalty; // 0x8 (0x4)
	int CalculatedMissedTargets; // 0xc (0x4)
	float StartTime; // 0x10 (0x4)
	float FinishTime; // 0x14 (0x4)
	float CancelTime; // 0x18 (0x4)
	int NumAIElims; // 0x1c (0x4)
	int NumTargetElims; // 0x20 (0x4)
};

