// ScriptStruct /Script/Engine.CurveAtlasColorAdjustments
// Size: 0x24
struct FCurveAtlasColorAdjustments
{
	unsigned char bChromaKeyTexture; // 0x0 (0x1)
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float AdjustBrightness; // 0x4 (0x4)
	float AdjustBrightnessCurve; // 0x8 (0x4)
	float AdjustVibrance; // 0xc (0x4)
	float AdjustSaturation; // 0x10 (0x4)
	float AdjustRGBCurve; // 0x14 (0x4)
	float AdjustHue; // 0x18 (0x4)
	float AdjustMinAlpha; // 0x1c (0x4)
	float AdjustMaxAlpha; // 0x20 (0x4)
};

