// ScriptStruct /Script/DataAssetDirectory.DataAssetDirectoryTestPODStruct
// Size: 0x40
struct FDataAssetDirectoryTestPODStruct
{
	enum EDataAssetDirectoryTestEnum EnumProperty; // 0x0 (0x1)
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	int IntProperty; // 0x4 (0x4)
	float FloatProperty; // 0x8 (0x4)
	bool BoolProperty; // 0xc (0x1)
	unsigned char unreflected_d[0x3]; // 0xd (0x3) 
	struct FString StringProperty; // 0x10 (0x10)
	struct FName NameProperty; // 0x20 (0x4)
	unsigned char unreflected_24[0x4]; // 0x24 (0x4) 
	struct FText TextProperty; // 0x28 (0x18)
};

