// ScriptStruct /Script/FortniteAI.DigestedEvasiveManeuverSkillSettings
// Size: 0x58
struct FDigestedEvasiveManeuverSkillSettings
{
	float JumpDelay; // 0x0 (0x4)
	float JumpRandomDeviationDelay; // 0x4 (0x4)
	float CrouchDelay; // 0x8 (0x4)
	float CrouchRandomDeviationDelay; // 0xc (0x4)
	float DodgeDelay; // 0x10 (0x4)
	float DodgeRandomDeviationDelay; // 0x14 (0x4)
	float CrouchOverlayWeight; // 0x18 (0x4)
	float JumpOverlayWeight; // 0x1c (0x4)
	float NoOverlayWeight; // 0x20 (0x4)
	float DodgeWeight; // 0x24 (0x4)
	float DodgeJumpWeight; // 0x28 (0x4)
	float DodgeDistanceMax; // 0x2c (0x4)
	float DodgeDistanceMin; // 0x30 (0x4)
	float CrouchTimeMax; // 0x34 (0x4)
	float CrouchTimeMin; // 0x38 (0x4)
	unsigned char unreflected_3c[0x4]; // 0x3c (0x4) 
	struct FString DebugName; // 0x40 (0x10)
	unsigned char padding_50[0x8]; // 0x50 (0x8)
};

