// ScriptStruct /Script/FortniteGame.DynamicBuildingDestructionParamNamesConfig
// Size: 0x60
struct FDynamicBuildingDestructionParamNamesConfig
{
	struct TArray<struct FDynamicBuildingDestructionOpacityMask*> MaterialSourceOpacityMasks; // 0x0 (0x10)
	struct FName MaterialOpacityChannel; // 0x10 (0x4)
	struct FName MaterialSphereRadius; // 0x14 (0x4)
	struct FName MaterialOpacityMask; // 0x18 (0x4)
	struct FName MaterialHitLocation; // 0x1c (0x4)
	struct FName MaterialHitVector; // 0x20 (0x4)
	struct FName MaterialDestructionTimeStamp; // 0x24 (0x4)
	struct FName MaterialDissolveDuration; // 0x28 (0x4)
	struct FName MaterialTextureSize; // 0x2c (0x4)
	struct FName MaterialResource; // 0x30 (0x4)
	struct FName NiagaraDestroyedMesh; // 0x34 (0x4)
	struct FName NiagaraRadius; // 0x38 (0x4)
	struct FName NiagaraScale; // 0x3c (0x4)
	struct FName NiagaraHitLocation; // 0x40 (0x4)
	struct FName NiagaraHitVector; // 0x44 (0x4)
	struct FName NiagaraBounds; // 0x48 (0x4)
	struct FName NiagaraResource; // 0x4c (0x4)
	struct FName NiagaraDamageDealt; // 0x50 (0x4)
	struct FName NiagaraIsCurieFireDamage; // 0x54 (0x4)
	struct FName NiagaraIsInstantDeath; // 0x58 (0x4)
	unsigned char padding_5c[0x4]; // 0x5c (0x4)
};

