// ScriptStruct /Script/Synthesis.DynamicsBandSettings
// Size: 0x20
struct FDynamicsBandSettings
{
	float CrossoverTopFrequency; // 0x0 (0x4)
	float AttackTimeMsec; // 0x4 (0x4)
	float ReleaseTimeMsec; // 0x8 (0x4)
	float ThresholdDb; // 0xc (0x4)
	float Ratio; // 0x10 (0x4)
	float KneeBandwidthDb; // 0x14 (0x4)
	float InputGainDb; // 0x18 (0x4)
	float OutputGainDb; // 0x1c (0x4)
};

