// ScriptStruct /Script/FortniteGame.DynamicXpCircuitBreaker
// Size: 0x28
struct FDynamicXpCircuitBreaker
{
	float TimespanOutlierMult; // 0x0 (0x4)
	int TimespanOutlierDuration; // 0x4 (0x4)
	float BankXpRemovalMult; // 0x8 (0x4)
	float BankXpRemovalTimeIntervalSecs; // 0xc (0x4)
	float ExcessXpThresholdMult; // 0x10 (0x4)
	float XpCutoffThresholdMult; // 0x14 (0x4)
	float XpCutoffRewardMult; // 0x18 (0x4)
	float FrequencyThresholdMult; // 0x1c (0x4)
	float MinXpThresholdMult; // 0x20 (0x4)
	float MaxXpBoosterMult; // 0x24 (0x4)
};

