// ScriptStruct /Script/FortniteGame.DynamicXpProfileStats
// Size: 0x24
struct FDynamicXpProfileStats
{
	float Timespan; // 0x0 (0x4)
	int BucketXp; // 0x4 (0x4)
	int BankXp; // 0x8 (0x4)
	float BankXpMult; // 0xc (0x4)
	int BoosterBucketXp; // 0x10 (0x4)
	float BoosterXpMult; // 0x14 (0x4)
	float DailyExcessXpMult; // 0x18 (0x4)
	int CurrentDayXp; // 0x1c (0x4)
	int CurrentDay; // 0x20 (0x4)
};

