// ScriptStruct /Script/FortniteAI.EvasiveManeuverSkillSettings
// Size: 0x258
struct FEvasiveManeuverSkillSettings
{
	struct FScalableFloat CrouchOverlayWeight; // 0x0 (0x28)
	struct FScalableFloat JumpOverlayWeight; // 0x28 (0x28)
	struct FScalableFloat NoOverlayWeight; // 0x50 (0x28)
	struct FScalableFloat DodgeWeight; // 0x78 (0x28)
	struct FScalableFloat DodgeJumpWeight; // 0xa0 (0x28)
	struct FScalableFloat JumpDelay; // 0xc8 (0x28)
	struct FScalableFloat JumpRandomDeviationDelay; // 0xf0 (0x28)
	struct FScalableFloat CrouchDelay; // 0x118 (0x28)
	struct FScalableFloat CrouchRandomDeviationDelay; // 0x140 (0x28)
	struct FScalableFloat DodgeDelay; // 0x168 (0x28)
	struct FScalableFloat DodgeRandomDeviationDelay; // 0x190 (0x28)
	struct FScalableFloat DodgeDistanceMax; // 0x1b8 (0x28)
	struct FScalableFloat DodgeDistanceMin; // 0x1e0 (0x28)
	struct FScalableFloat CrouchTimeMax; // 0x208 (0x28)
	struct FScalableFloat CrouchTimeMin; // 0x230 (0x28)
};

