// ScriptStruct /Script/FortniteGame.ExitCraftInfo
// Size: 0x1e8
struct FExitCraftInfo
{
	struct FGameplayTag RequiredExitCraftTag; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FScalableFloat ExitCraftSpawnerZOffset; // 0x8 (0x28)
	struct FScalableFloat ExitCraftSpawnDelay; // 0x30 (0x28)
	struct FScalableFloat SpawnDestructionInitialDelay; // 0x58 (0x28)
	struct FScalableFloat SpawnDestructionDelayBetweenPieces; // 0x80 (0x28)
	struct FScalableFloat ExitCraftZOffset; // 0xa8 (0x28)
	struct FScalableFloat ExitCraftTargetZOffset; // 0xd0 (0x28)
	struct FScalableFloat ExitCraftTimeToHoverLocation; // 0xf8 (0x28)
	struct FScalableFloat ExitCraftTimeToHoverRotation; // 0x120 (0x28)
	struct FScalableFloat MinLandingSpeed; // 0x148 (0x28)
	struct FScalableFloat ExitZOffset; // 0x170 (0x28)
	struct FScalableFloat ExitTime; // 0x198 (0x28)
	struct FScalableFloat InteractionTime; // 0x1c0 (0x28)
};

