// ScriptStruct /Script/FortniteGame.FlightParams
// Size: 0xc8
struct FFlightParams
{
	float TopSpeedKmh; // 0x0 (0x4)
	float LiftoffSpeedKmh; // 0x4 (0x4)
	float LandingSpeedKmh; // 0x8 (0x4)
	float ControlSpeedKmh; // 0xc (0x4)
	float HeadingStabilizationRate; // 0x10 (0x4)
	float HeadingStabilizationMaxForwardVelocityKmh; // 0x14 (0x4)
	float HeadingStabilizationMaxDegPerSecond; // 0x18 (0x4)
	float VerticalStabilizationDrag; // 0x1c (0x4)
	float HorizontalStabilizationDrag; // 0x20 (0x4)
	float VerticalStabilizationTorque; // 0x24 (0x4)
	float MaxVerticalStabilizationTorque; // 0x28 (0x4)
	float HorizontalStabilizationTorque; // 0x2c (0x4)
	float MaxHorizontalStabilizationTorque; // 0x30 (0x4)
	float RotationalDampingCoefficient; // 0x34 (0x4)
	float MaxRotationalDampingTorque; // 0x38 (0x4)
	float TailLength; // 0x3c (0x4)
	float LowSpeedThrust; // 0x40 (0x4)
	float HighSpeedThrust; // 0x44 (0x4)
	float AntigravityHorizontal; // 0x48 (0x4)
	float AntigravityUp; // 0x4c (0x4)
	float AntigravityDown; // 0x50 (0x4)
	float ControlFrameHeight; // 0x54 (0x4)
	float ControlFrameDistance; // 0x58 (0x4)
	float ControlFrameDistanceInterpPerSecond; // 0x5c (0x4)
	float ControlFrameOrbitInterpPerSecond; // 0x60 (0x4)
	float ControlFrameRollInterpPerSecond; // 0x64 (0x4)
	struct FVector ControlFrameDefaultRollUp; // 0x68 (0x18)
	float ControlFrameRollUpAcceleration; // 0x80 (0x4)
	float ControlFrameRollUpMaxVelocity; // 0x84 (0x4)
	float ControlFrameRollUpDamping; // 0x88 (0x4)
	float ControlFrameMinUpNudge; // 0x8c (0x4)
	float ControlFrameMaxUpNudge; // 0x90 (0x4)
	float ControlFrameUpsideDownIgnoreNudgePercent; // 0x94 (0x4)
	float SteerPitchRate; // 0x98 (0x4)
	float SteerYawRate; // 0x9c (0x4)
	float SteerMaxHeadingDiffDegrees; // 0xa0 (0x4)
	float RollPerHeadingDiff; // 0xa4 (0x4)
	float HeadingMatchRate; // 0xa8 (0x4)
	float RollMatchRate; // 0xac (0x4)
	float MatchingTorqueCap; // 0xb0 (0x4)
	float StallVelocityLow; // 0xb4 (0x4)
	float StallVelocityHigh; // 0xb8 (0x4)
	float MinStallYawMultiplier; // 0xbc (0x4)
	float MaxStallYawMultiplier; // 0xc0 (0x4)
	float StallHighVelocityDeviationAngle; // 0xc4 (0x4)
};

