// UserDefinedStruct /FortWater/FluidSimulation/Blueprints/Structs/FluidForceImpulseTimedEffects.FluidForceImpulseTimedEffects
// Size: 0x28
struct FFluidForceImpulseTimedEffects
{
	bool EnableWaterDropsEffect390A7932284406807D62695D8E0927BD70; // 0x0 (0x1)
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float EffectRadius30C9A94C02422D8BF40DF6B1BB2A0D8CBC; // 0x4 (0x4)
	float Strength292CAA30794D1EFF60AE1C3491D011CECF; // 0x8 (0x4)
	float WaterDropsperSquareMeter27C31B527C4C367A5CA5E1DF8E49E76234; // 0xc (0x4)
	float StartTimeOffset335A792CE8489A59E5D9B24F9E4DCFE94A; // 0x10 (0x4)
	float Lifetime35C2749C1449C41D4F236BCBAF6ED34113; // 0x14 (0x4)
	float StrengthoverLifePower374FA6941A4AD024828AFEB782783DD01C; // 0x18 (0x4)
	unsigned char unreflected_1c[0x4]; // 0x1c (0x4) 
	class UMaterialInterface* MaterialOverride42FB856A244A1713590BB76EAA7CC7A0DF; // 0x20 (0x8)
};

