// ScriptStruct /Script/AnimationWarpingRuntime.FootPlacementInterpolationSettings
// Size: 0x24
struct FFootPlacementInterpolationSettings
{
	float UnplantLinearStiffness; // 0x0 (0x4)
	float UnplantLinearDamping; // 0x4 (0x4)
	float UnplantAngularStiffness; // 0x8 (0x4)
	float UnplantAngularDamping; // 0xc (0x4)
	float FloorLinearStiffness; // 0x10 (0x4)
	float FloorLinearDamping; // 0x14 (0x4)
	float FloorAngularStiffness; // 0x18 (0x4)
	float FloorAngularDamping; // 0x1c (0x4)
	bool bEnableFloorInterpolation; // 0x20 (0x1)
	unsigned char padding_21[0x3]; // 0x21 (0x3)
};

