// ScriptStruct /Script/FortniteGame.FortAnimInput_JackalVehicle
// Size: 0x240
struct FFortAnimInput_JackalVehicle
{
	unsigned char bIsUsingJackalVehicle; // 0x0 (0x1)
	unsigned char bIsSteeringLeft; // 0x0 (0x1)
	unsigned char bIsSteeringRight; // 0x0 (0x1)
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float SteerAngleDeadZoneDegrees; // 0x4 (0x4)
	float SteerAngle; // 0x8 (0x4)
	float LeanYaw; // 0xc (0x4)
	float QuantizedSteerAngle; // 0x10 (0x4)
	float SteerAlpha; // 0x14 (0x4)
	float RunForwardAlpha; // 0x18 (0x4)
	float SlopePitchDegreeAngle; // 0x1c (0x4)
	float SlopeRollDegreeAngle; // 0x20 (0x4)
	float DistanceFromGround; // 0x24 (0x4)
	float PivotPlayRate; // 0x28 (0x4)
	unsigned char bIsReversing; // 0x2c (0x1)
	unsigned char bIsBraking; // 0x2c (0x1)
	unsigned char bIsMoving; // 0x2c (0x1)
	unsigned char bIsMovingForward; // 0x2c (0x1)
	unsigned char bIsSprinting; // 0x2c (0x1)
	unsigned char bInAir; // 0x2c (0x1)
	unsigned char bIsFalling; // 0x2c (0x1)
	unsigned char bIsJumping; // 0x2c (0x1)
	unsigned char bIsRelaxed; // 0x2d (0x1)
	unsigned char bIsBoosting; // 0x2d (0x1)
	unsigned char bHasReachedJumpChargeStartThreshold; // 0x2d (0x1)
	unsigned char bHasReachedJumpChargeMidThreshold; // 0x2d (0x1)
	unsigned char bHasReachedJumpChargeFullThreshold; // 0x2d (0x1)
	unsigned char bAdjustRootForFemaleRider; // 0x2d (0x1)
	unsigned char bIsPlayingEmoteOnHoverboard; // 0x2d (0x1)
	unsigned char bShouldApplyAdditive; // 0x2d (0x1)
	unsigned char bPlayPivotOnGroundAndNotBoosting; // 0x2e (0x1)
	unsigned char bIsOnLowerHill; // 0x2e (0x1)
	unsigned char bLowerBodyIdleToLoopTransition; // 0x2e (0x1)
	unsigned char bInterruptHoverboardFullybody; // 0x2e (0x1)
	unsigned char bEnterFullBodyHoverboardState; // 0x2e (0x1)
	unsigned char bDefaultToJumpStartTransition; // 0x2e (0x1)
	unsigned char bLocomotionPoseToJumpTransition; // 0x2e (0x1)
	unsigned char bBoostingToBoostingJumpTransition; // 0x2e (0x1)
	unsigned char bJumpToLocomotionPoseTransition; // 0x2f (0x1)
	unsigned char bJumpApexToJumpFallTransition; // 0x2f (0x1)
	unsigned char bIdleToMovementStartTransition; // 0x2f (0x1)
	unsigned char bIdleToMovementLoopTransition; // 0x2f (0x1)
	unsigned char bMovementLoopToMovementStopTransition; // 0x2f (0x1)
	unsigned char bMovementLoopToPivotTransition; // 0x2f (0x1)
	unsigned char bMovementLoopToIdleTransition; // 0x2f (0x1)
	unsigned char bIdleAdditiveToCollisionNTransition; // 0x2f (0x1)
	unsigned char bSplitBodyToHoverboardBRTransition; // 0x30 (0x1)
	unsigned char bHoverboardBRToSplitBodyTransition; // 0x30 (0x1)
	unsigned char bHoverboardBRMovementToJumpChargeTransition; // 0x30 (0x1)
	unsigned char bIdlesToJackalVehicleTransition; // 0x30 (0x1)
	unsigned char bPlayAdditiveLeans; // 0x30 (0x1)
	unsigned char bPlayBalloonLeans; // 0x30 (0x1)
	unsigned char bPlayJumpTrickVertical; // 0x30 (0x1)
	unsigned char bPlayJumpTrick; // 0x30 (0x1)
	unsigned char bPlayMovingFast; // 0x31 (0x1)
	unsigned char bPlayHipAdjustmentAdditive; // 0x31 (0x1)
	unsigned char bPlayDriveSouth; // 0x31 (0x1)
	unsigned char bPlayHeadAimOffset; // 0x31 (0x1)
	unsigned char bPlaySlopeAimOffset; // 0x31 (0x1)
	unsigned char unreflected_32[0x2]; // 0x32 (0x2) 
	float JumpCombatAdditiveWeight; // 0x34 (0x4)
	float MeleeTwistIdle; // 0x38 (0x4)
	float MeleeTwistLocomotionLoop; // 0x3c (0x4)
	struct FFortAnimInput_VelocityImpact VelocityImpact; // 0x40 (0xf0)
	struct FVector ImpactDisplacement; // 0x130 (0x18)
	unsigned char unreflected_148[0x8]; // 0x148 (0x8) 
	float SteerYaw; // 0x150 (0x4)
	unsigned char unreflected_154[0x4]; // 0x154 (0x4) 
	struct FVector EmoteHoverboardPosition; // 0x158 (0x18)
	struct FRotator EmoteHoverboardRotation; // 0x170 (0x18)
	unsigned char bShouldAttachFeetToHoverboard; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	struct FVector FootLeftLocationOffset; // 0x190 (0x18)
	struct FRotator FootLeftRotationOffset; // 0x1a8 (0x18)
	struct FVector FootRightLocationOffset; // 0x1c0 (0x18)
	struct FRotator FootRightRotationOffset; // 0x1d8 (0x18)
	float StoppedThreshold; // 0x1f0 (0x4)
	float MovingForwardThreshold; // 0x1f4 (0x4)
	float MovingFowardFastThreshold; // 0x1f8 (0x4)
	float DefaultToJumpStartTransitionThreshold; // 0x1fc (0x4)
	float JumpTrickAngularVelocityThreshold; // 0x200 (0x4)
	float JumpDistanceFromGroundThreshold; // 0x204 (0x4)
	float VelocityStartThreshold; // 0x208 (0x4)
	float MovingFastThreshold; // 0x20c (0x4)
	float RelaxedSpeedThreshold; // 0x210 (0x4)
	float JumpChargeStartThreshold; // 0x214 (0x4)
	float JumpChargeMidThreshold; // 0x218 (0x4)
	float JumpChargeFullThreshold; // 0x21c (0x4)
	float RotatingAngularVelocityThreshold; // 0x220 (0x4)
	float IdleToLoopTransitionSpeedThreshold; // 0x224 (0x4)
	float IdleToMovementLoopTransitionThreshold; // 0x228 (0x4)
	float MeleeTwistIdleMultiplier; // 0x22c (0x4)
	float MeleeTwistLocomotionLoopMultiplier; // 0x230 (0x4)
	float LeanYawForMaxPivotPlayRate; // 0x234 (0x4)
	float SteerAlphaForMaxPivotPlayRate; // 0x238 (0x4)
	unsigned char padding_23c[0x4]; // 0x23c (0x4)
};

