// ScriptStruct /Script/FortniteGame.FortEffectDistanceQuality
// Size: 0x18
struct FFortEffectDistanceQuality
{
	float MinDistanceCinematic; // 0x0 (0x4)
	float MinDistanceEpic; // 0x4 (0x4)
	float MinDistanceHigh; // 0x8 (0x4)
	float MinDistanceMedium; // 0xc (0x4)
	float MinDistanceLow; // 0x10 (0x4)
	unsigned char bAllowCinematic; // 0x14 (0x1)
	unsigned char bAllowEpic; // 0x14 (0x1)
	unsigned char bAllowHigh; // 0x14 (0x1)
	unsigned char bAllowMedium; // 0x14 (0x1)
	unsigned char bAllowLow; // 0x14 (0x1)
	unsigned char padding_15[0x3]; // 0x15 (0x3)
};

