// ScriptStruct /Script/SaveTheWorldUI.FortSurvivorSquadSelectorButtonSummaryStats
// Size: 0xa0
struct FFortSurvivorSquadSelectorButtonSummaryStats
{
	struct FName SquadId; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FGameplayAttribute FortAttribute; // 0x8 (0x38)
	float FortAttributeValue; // 0x40 (0x4)
	unsigned char unreflected_44[0x4]; // 0x44 (0x4) 
	struct FGameplayAttribute FortTeamAttribute; // 0x48 (0x38)
	float TeamFortAttributeValue; // 0x80 (0x4)
	float SquadPowerValue; // 0x84 (0x4)
	struct FText FortAttributeName; // 0x88 (0x18)
};

