// ScriptStruct /Script/FortniteGame.FortAnimInput_AdjustedAim
// Size: 0x23c
struct FFortAnimInput_AdjustedAim
{
	struct FFortAnimInput_AdjustedAimOffset WeaponOffsets[0x22]; // 0x0 (0x10) (ARRAY) 
	float YawOffset; // 0x220 (0x4)
	float PitchOffset; // 0x224 (0x4)
	float YawScale; // 0x228 (0x4)
	float PitchScale; // 0x22c (0x4)
	float ResultingYaw; // 0x230 (0x4)
	float ResultingPitch; // 0x234 (0x4)
	struct FName ZeroOutPitchWeightCurveName; // 0x238 (0x4)
};

