// ScriptStruct /Script/FortniteGame.FortAnimInput_Motorcycle
// Size: 0x54
struct FFortAnimInput_Motorcycle
{
	unsigned char bIsUsingMotorcycle; // 0x0 (0x1)
	unsigned char bIsDriver; // 0x0 (0x1)
	unsigned char bIsFrontPassenger; // 0x0 (0x1)
	unsigned char bIsBackPassenger; // 0x0 (0x1)
	unsigned char bHasPassenger; // 0x0 (0x1)
	unsigned char bIsBackPassengerAndLeaning; // 0x0 (0x1)
	unsigned char bIsDrifting; // 0x0 (0x1)
	unsigned char bIsBoosting; // 0x0 (0x1)
	unsigned char bIsReversing; // 0x1 (0x1)
	unsigned char bIsBraking; // 0x1 (0x1)
	unsigned char bIsMoving; // 0x1 (0x1)
	unsigned char bIsMovingForward; // 0x1 (0x1)
	unsigned char bIsSteeringRight; // 0x1 (0x1)
	unsigned char bIsSteeringLeft; // 0x1 (0x1)
	unsigned char unreflected_2[0x2]; // 0x2 (0x2) 
	float RunForwardAlpha; // 0x4 (0x4)
	float VerticalVelocity; // 0x8 (0x4)
	float VerticalAcceleration; // 0xc (0x4)
	unsigned char bAimFWD; // 0x10 (0x1)
	unsigned char bAimBWD; // 0x10 (0x1)
	unsigned char bAimLFT; // 0x10 (0x1)
	unsigned char bAimRGT; // 0x10 (0x1)
	unsigned char unreflected_11[0x3]; // 0x11 (0x3) 
	float PawnToVehicleDeltaYawAngleDegrees; // 0x14 (0x4)
	float AimCardDirDeadZoneAngleDegrees; // 0x18 (0x4)
	float AimCardDirAngleOffsetDegrees; // 0x1c (0x4)
	int LastCardDirIndex; // 0x20 (0x4)
	float AimFWDDeltaAngleDegrees; // 0x24 (0x4)
	float AimBWDDeltaAngleDegrees; // 0x28 (0x4)
	float AimLFTDeltaAngleDegrees; // 0x2c (0x4)
	float AimRGTDeltaAngleDegrees; // 0x30 (0x4)
	float SlopePitchDegreeAngle; // 0x34 (0x4)
	float SlopeRollDegreeAngle; // 0x38 (0x4)
	float SteerAngle; // 0x3c (0x4)
	float SteerAlpha; // 0x40 (0x4)
	float SteerAngleDeadZoneDegrees; // 0x44 (0x4)
	float SteeringRotation; // 0x48 (0x4)
	float VehiclePitch; // 0x4c (0x4)
	float VehicleRoll; // 0x50 (0x4)
};

