// ScriptStruct /Script/FortniteGame.FortGyroV2Settings
// Size: 0x64
struct FFortGyroV2Settings
{
	float GyroV2Sensitivity; // 0x0 (0x4)
	enum EGyroSpace GyroV2DetachedSpace; // 0x4 (0x1)
	enum EGyroSpace GyroV2AttachedSpace; // 0x5 (0x1)
	enum EAxisDirection GyroV2YawDirection; // 0x6 (0x1)
	enum EAxisDirection GyroV2PitchDirection; // 0x7 (0x1)
	enum EAxisDirection GyroV2RollDirection; // 0x8 (0x1)
	enum EGyroActiveMode GyroV2ActiveMode; // 0x9 (0x1)
	enum EGyroActiveBuildMode GyroV2ActiveBuildMode; // 0xa (0x1)
	enum EGyroStickMode GyroV2StickMode; // 0xb (0x1)
	enum EGyroTouchMode GyroV2TouchMode; // 0xc (0x1)
	bool bGyroV2AimAssist; // 0xd (0x1)
	unsigned char unreflected_e[0x2]; // 0xe (0x2) 
	float GyroV2AccelMultiplier; // 0x10 (0x4)
	float GyroV2AccelMinThreshold; // 0x14 (0x4)
	float GyroV2AccelMaxThreshold; // 0x18 (0x4)
	enum EGyroAcceleration GyroV2AccelerationMode; // 0x1c (0x1)
	unsigned char unreflected_1d[0x3]; // 0x1d (0x3) 
	float GyroV2VerticalMultiplier; // 0x20 (0x4)
	float GyroV2BuildingMultiplier; // 0x24 (0x4)
	float GyroV2EditingMultiplier; // 0x28 (0x4)
	float GyroV2DeadZone; // 0x2c (0x4)
	float GyroV2SmoothingThreshold; // 0x30 (0x4)
	float GyroV2SmoothingWindow; // 0x34 (0x4)
	float GyroV2Tightening; // 0x38 (0x4)
	enum EGyroButtonResponse GyroV2ButtonX; // 0x3c (0x1)
	enum EGyroButtonResponse GyroV2ButtonY; // 0x3d (0x1)
	unsigned char unreflected_3e[0x2]; // 0x3e (0x2) 
	float GyroV2TrackballDecay; // 0x40 (0x4)
	float GyroV2ButtonHoldTime; // 0x44 (0x4)
	bool bGyroV2DisabledWhileDriving; // 0x48 (0x1)
	bool bUseZoomSensitivityScaling; // 0x49 (0x1)
	bool bGyroV2VibrationCompensationEnabled; // 0x4a (0x1)
	bool bFlickStickEnabled; // 0x4b (0x1)
	float FlickTime; // 0x4c (0x4)
	float FlickSmoothingThreshold; // 0x50 (0x4)
	float FlickDeadZone; // 0x54 (0x4)
	float FlickForwardDeadZone; // 0x58 (0x4)
	float FlickWindingSpeed; // 0x5c (0x4)
	bool bZoomScalesWinding; // 0x60 (0x1)
	unsigned char padding_61[0x3]; // 0x61 (0x3)
};

