// ScriptStruct /Script/FortniteGame.FortPlayerAttributeSets
// Size: 0x50
struct FFortPlayerAttributeSets
{
	class UFortRegenHealthSet* HealthSet; // 0x0 (0x8)
	class UFortControlResistanceSet* ControlResistanceSet; // 0x8 (0x8)
	class UFortDamageSet* DamageSet; // 0x10 (0x8)
	class UFortMovementSet* MovementSet; // 0x18 (0x8)
	class UFortAdvancedMovementSet* AdvancedMovementSet; // 0x20 (0x8)
	class UFortConstructionSet* ConstructionSet; // 0x28 (0x8)
	class UFortPlayerAttrSet* PlayerAttrSet; // 0x30 (0x8)
	class UFortCharacterAttrSet* CharacterAttrSet; // 0x38 (0x8)
	class UFortWeaponAttrSet* WeaponAttrSet; // 0x40 (0x8)
	class UFortHomebaseSet* HomebaseSet; // 0x48 (0x8)
};

