// ScriptStruct /Script/FortniteGame.FortFloatingPetSpringCalculationControls
// Size: 0x94
struct FFortFloatingPetSpringCalculationControls
{
	float SpringStiffnessInterpSpeedSmoothInterpSpeed; // 0x0 (0x4)
	float CarrierOffsetTotalTargetLocalVelocityXMultiplier; // 0x4 (0x4)
	float CarrierOffsetTotalTargetLocalVelocityXClampMin; // 0x8 (0x4)
	float CarrierOffsetTotalTargetLocalVelocityXClampMax; // 0xc (0x4)
	float CarrierOffsetTotalTargetLocalVelocityYMultiplier; // 0x10 (0x4)
	float CarrierOffsetTotalTargetLocalVelocityYClampMin; // 0x14 (0x4)
	float CarrierOffsetTotalTargetLocalVelocityYClampMax; // 0x18 (0x4)
	float CarrierOffsetTotalTargetLocalVelocityZMultiplier; // 0x1c (0x4)
	float CarrierOffsetTotalTargetLocalVelocityZClampMin; // 0x20 (0x4)
	float CarrierOffsetTotalTargetLocalVelocityZClampMax; // 0x24 (0x4)
	float CarrierOffsetTotalTargetMeleeTwistCurveMultiplier; // 0x28 (0x4)
	float CarrierOffsetTotalSpringMass; // 0x2c (0x4)
	float RootRotationMeleeTwistSpringTargetMeleeTwistCurveMultiplier; // 0x30 (0x4)
	float RootRotationMeleeTwistSpringMass; // 0x34 (0x4)
	float YawDefinedHoverOffsetSpringMass; // 0x38 (0x4)
	float CarrierOffsetRateSmoothInterpSpeed; // 0x3c (0x4)
	float CarrierOffsetRotationReactionXMultiplier; // 0x40 (0x4)
	float CarrierOffsetRotationReactionXMultiplierWhenPlayingMeleeAnim; // 0x44 (0x4)
	float CarrierOffsetRotationReactionYMultiplier; // 0x48 (0x4)
	float CarrierOffsetRotationReactionYZMultiplierWhenPlayingMeleeAnim; // 0x4c (0x4)
	float CarrierOffsetRotationReactionZMultiplier; // 0x50 (0x4)
	float CarrierOffsetRotationReactionXClampMin; // 0x54 (0x4)
	float CarrierOffsetRotationReactionXClampMax; // 0x58 (0x4)
	float CarrierOffsetRotationReactionYZClampMin; // 0x5c (0x4)
	float CarrierOffsetRotationReactionYZClampMax; // 0x60 (0x4)
	float CarrierOffsetRotationReactionSmoothInterpSpeed; // 0x64 (0x4)
	float PlayerYawDeltaInterpInterpSpeed; // 0x68 (0x4)
	float LocalVelocityInterpInterpSpeed; // 0x6c (0x4)
	float CarrierOffsetRotationVelocityXMultiplier; // 0x70 (0x4)
	float CarrierOffsetRotationVelocityXClampMin; // 0x74 (0x4)
	float CarrierOffsetRotationVelocityXClampMax; // 0x78 (0x4)
	float CarrierOffsetRotationVelocityYMultiplier; // 0x7c (0x4)
	float CarrierOffsetRotationVelocityYClampMin; // 0x80 (0x4)
	float CarrierOffsetRotationVelocityYClampMax; // 0x84 (0x4)
	float CarrierOffsetRotationVelocityZClampMin; // 0x88 (0x4)
	float CarrierOffsetRotationVelocityZClampMax; // 0x8c (0x4)
	struct FName CancelVelocityRotationCurve; // 0x90 (0x4)
};

