// ScriptStruct /Script/FortniteGame.FortSurfaceDamageRatioStats
// Size: 0x38
struct FFortSurfaceDamageRatioStats : FTableRowBase
{
	struct FName Default; // 0x8 (0x4)
	struct FName Wood; // 0xc (0x4)
	struct FName Stone; // 0x10 (0x4)
	struct FName Metal; // 0x14 (0x4)
	struct FName HumanEntity; // 0x18 (0x4)
	struct FName AIEntity; // 0x1c (0x4)
	struct FName Explosive; // 0x20 (0x4)
	struct FName WeakSpot; // 0x24 (0x4)
	struct FName Objective; // 0x28 (0x4)
	struct FName WeakSpotWood; // 0x2c (0x4)
	struct FName WeakSpotStone; // 0x30 (0x4)
	struct FName WeakSpotMetal; // 0x34 (0x4)
};

