// ScriptStruct /Script/FortniteGame.FortFloatingPetTranslationStateOffsets
// Size: 0x1b0
struct FFortFloatingPetTranslationStateOffsets
{
	struct FVector DefaultIdle; // 0x0 (0x18)
	struct FVector DefaultDownsights; // 0x18 (0x18)
	struct FVector DBNOIdle; // 0x30 (0x18)
	struct FVector MeleePlaying; // 0x48 (0x18)
	struct FVector EmotePlaying; // 0x60 (0x18)
	struct FVector IsOperatingTurret; // 0x78 (0x18)
	struct FVector CrouchTurning; // 0x90 (0x18)
	struct FVector CrouchIdle; // 0xa8 (0x18)
	struct FVector CrouchDownsights; // 0xc0 (0x18)
	struct FVector CrouchMeleePlaying; // 0xd8 (0x18)
	struct FVector DefaultSkydive; // 0xf0 (0x18)
	struct FVector ParachuteOpen; // 0x108 (0x18)
	struct FVector DivingSkydive; // 0x120 (0x18)
	struct FVector SurfaceSwimmingIdle; // 0x138 (0x18)
	struct FVector SurfaceSwimmingDownsights; // 0x150 (0x18)
	struct FVector SurfaceSwimmingMeleePlaying; // 0x168 (0x18)
	struct FVector SurfaceSwimmingSprint; // 0x180 (0x18)
	struct FVector DiveJumping; // 0x198 (0x18)
};

