// ScriptStruct /Script/FortniteGame.FortFlightParamsRuntimeModifiers
// Size: 0x28
struct FFortFlightParamsRuntimeModifiers
{
	float TopSpeedKmh; // 0x0 (0x4)
	float RollPerHeadingDiff; // 0x4 (0x4)
	float LowSpeedThrust; // 0x8 (0x4)
	float HighSpeedThrust; // 0xc (0x4)
	float RollMatchRate; // 0x10 (0x4)
	float MaxRotationalDampingTorque; // 0x14 (0x4)
	float RotationalDampingCoefficient; // 0x18 (0x4)
	float SteerYawRate; // 0x1c (0x4)
	float SteerPitchRate; // 0x20 (0x4)
	float HeadingMatchRate; // 0x24 (0x4)
};

