// ScriptStruct /Script/FortniteGame.FortAnimInput_Skydiving
// Size: 0x78
struct FFortAnimInput_Skydiving
{
	struct FVector ParaGilderRootOffset; // 0x0 (0x18)
	struct FRotator ParaGliderRootRotationOverride; // 0x18 (0x18)
	unsigned char bUseParaGlideRootModifier; // 0x30 (0x1)
	unsigned char bIsSkydivingFromLaunchPad; // 0x30 (0x1)
	unsigned char bIsSkydivingFromBus; // 0x30 (0x1)
	unsigned char bIsInVortex; // 0x30 (0x1)
	unsigned char bIsUsingUmbrella; // 0x30 (0x1)
	unsigned char bIsActivelyStrafingInAir; // 0x30 (0x1)
	unsigned char bIsDiving; // 0x30 (0x1)
	unsigned char bIsDivingUpInVortex; // 0x30 (0x1)
	unsigned char bIsParachuteOpen; // 0x31 (0x1)
	unsigned char bIsSkydiving; // 0x31 (0x1)
	unsigned char bIsParachuteLeaning; // 0x31 (0x1)
	unsigned char bIsSkydiveLeaning; // 0x31 (0x1)
	unsigned char bIsLeaning; // 0x31 (0x1)
	unsigned char bIsSkydiveDiveMode; // 0x31 (0x1)
	unsigned char bParachuteLeanTransition; // 0x31 (0x1)
	unsigned char bPlayedParachuteLeanTransition; // 0x31 (0x1)
	unsigned char bPlaySkydiveDrift; // 0x32 (0x1)
	unsigned char bSkydiveDriftDelayActive; // 0x32 (0x1)
	unsigned char bSkydiveDriftAnimAllowed; // 0x32 (0x1)
	unsigned char bIsGliderRight; // 0x32 (0x1)
	unsigned char bIsGliderCenter; // 0x32 (0x1)
	unsigned char bIsGliderLeft; // 0x32 (0x1)
	unsigned char bIsGliderForward; // 0x32 (0x1)
	unsigned char bIsGliderBack; // 0x32 (0x1)
	unsigned char unreflected_33[0x1]; // 0x33 (0x1) 
	float LocalAccelForward; // 0x34 (0x4)
	float LocalAccelRight; // 0x38 (0x4)
	float LocalVelocityRight; // 0x3c (0x4)
	float SkydiveAimPitch; // 0x40 (0x4)
	float SkydiveAimPitchInterpSpeed; // 0x44 (0x4)
	float SkydiveAimYaw; // 0x48 (0x4)
	float DeployChuteAnimRate; // 0x4c (0x4)
	float SkydiveDriftAnimRate; // 0x50 (0x4)
	float SkydiveDriftAnimRateCurrent; // 0x54 (0x4)
	float SkydiveFidgetAnimRate; // 0x58 (0x4)
	float SkydiveFidgetAnimRateCurrent; // 0x5c (0x4)
	float SkydiveAdditiveAlpha; // 0x60 (0x4)
	float SkydiveDriftDelay; // 0x64 (0x4)
	int SkydiveDriftAnim; // 0x68 (0x4)
	int SkydiveDriftAnimMax; // 0x6c (0x4)
	int LaunchpadAnim; // 0x70 (0x4)
	struct TEnumAsByte<ESkydivingDirection> LocalAccelDir; // 0x74 (0x1)
	struct TEnumAsByte<ESkydivingDirection> DirectionLast; // 0x75 (0x1)
	unsigned char padding_76[0x2]; // 0x76 (0x2)
};

