// ScriptStruct /Script/FortniteGame.FortRespawnLogicData
// Size: 0x140
struct FFortRespawnLogicData
{
	struct FScalableFloat DirectionDeviation; // 0x0 (0x28)
	struct FScalableFloat MinDistFromCenterPercent; // 0x28 (0x28)
	struct FScalableFloat MaxDistFromCenterPercent; // 0x50 (0x28)
	struct FScalableFloat SingleBusRespawnNearDeathLocation; // 0x78 (0x28)
	struct FScalableFloat MinHeightFromGround; // 0xa0 (0x28)
	struct FScalableFloat MinHeightFromZero; // 0xc8 (0x28)
	struct FScalableFloat CameraDistance; // 0xf0 (0x28)
	struct FScalableFloat RespawnTraceHeight; // 0x118 (0x28)
};

