// ScriptStruct /Script/FortniteGame.FortTargetFilter
// Size: 0x38
struct FFortTargetFilter
{
	struct TEnumAsByte<EFortTargetSelectionFilter> ActorTypeFilter; // 0x0 (0x1)
	unsigned char unreflected_1[0x7]; // 0x1 (0x7) 
	unsigned char ActorClassFilter_8[0x8]; // 0x8 (0x8) (UNHANDLED PROPERTY TYPE: ClassPtrProperty UID: 0)
	unsigned char bExcludeInstigator; // 0x10 (0x1)
	unsigned char bUseTrapsOwningPawnAsInstigator; // 0x10 (0x1)
	unsigned char bExcludeRequester; // 0x10 (0x1)
	unsigned char bExcludeAllAttachedToInstigator; // 0x10 (0x1)
	unsigned char bExcludeAthenaVehicleOfInstigator; // 0x10 (0x1)
	unsigned char bExcludeAllAttachedToRequester; // 0x10 (0x1)
	unsigned char bExcludePawnFriends; // 0x10 (0x1)
	unsigned char bExcludeFriendlyAI; // 0x10 (0x1)
	unsigned char bExcludeAllAI; // 0x11 (0x1)
	unsigned char bExcludePawnNeutrals; // 0x11 (0x1)
	unsigned char bExcludePawnEnemies; // 0x11 (0x1)
	unsigned char bExcludeNonPawnFriends; // 0x11 (0x1)
	unsigned char bExcludeNonPawnEnemies; // 0x11 (0x1)
	unsigned char bConsiderFriendlyFireWhenExcludingFriends; // 0x11 (0x1)
	unsigned char bExcludeDBNOPawns; // 0x11 (0x1)
	unsigned char bExcludeWaterVolumes; // 0x11 (0x1)
	unsigned char bExcludeWaterBodies; // 0x12 (0x1)
	unsigned char bExcludeAthenaVehicleOccupiedBySource; // 0x12 (0x1)
	unsigned char bExcludeAthenaVehicleUnoccupied; // 0x12 (0x1)
	unsigned char bExcludeAthenaVehicleOccupied; // 0x12 (0x1)
	unsigned char bExcludeAthenaVehicleFromObstructionChecks; // 0x12 (0x1)
	unsigned char bExcludeWithoutNavigationCorridor; // 0x12 (0x1)
	unsigned char bExcludeNonPlayerBuiltPieces; // 0x12 (0x1)
	unsigned char bExcludePlayerBuiltPieces; // 0x12 (0x1)
	unsigned char bExcludeNonBGABuildings; // 0x13 (0x1)
	unsigned char bExcludeNonBlockingHits; // 0x13 (0x1)
	unsigned char bExcludeProjectiles; // 0x13 (0x1)
	unsigned char bTraceComplexCollision; // 0x13 (0x1)
	unsigned char bExcludeLandscape; // 0x13 (0x1)
	unsigned char bConsiderPhysicsPawnsAsNonPlayerPawns; // 0x13 (0x1)
	unsigned char unreflected_14[0x4]; // 0x14 (0x4) 
	struct FGameplayTagContainer ExclusionGameplayTags; // 0x18 (0x20)
};

