// ScriptStruct /Script/FortniteGame.FortMeleeWeaponStats
// Size: 0x170
struct FFortMeleeWeaponStats : FFortBaseWeaponStats
{
	float RangeVSEnemies; // 0x148 (0x4)
	float ConeYawAngle; // 0x14c (0x4)
	float ConePitchAngle; // 0x150 (0x4)
	float SwingPlaySpeed; // 0x154 (0x4)
	float SwingTime; // 0x158 (0x4)
	float BuildingConeAngle; // 0x15c (0x4)
	float BuildingConeAnglePitch; // 0x160 (0x4)
	float RangeVSBuildings2D; // 0x164 (0x4)
	float RangeVSBuildingsZ; // 0x168 (0x4)
	float RangeVSWeakSpots; // 0x16c (0x4)
};

