// ScriptStruct /Script/FortniteGame.FortRarityItemData
// Size: 0x80
struct FFortRarityItemData
{
	struct FText Name; // 0x0 (0x18)
	struct FLinearColor Color1; // 0x18 (0x10)
	struct FLinearColor Color2; // 0x28 (0x10)
	struct FLinearColor Color3; // 0x38 (0x10)
	struct FLinearColor Color4; // 0x48 (0x10)
	struct FLinearColor Color5; // 0x58 (0x10)
	float Radius; // 0x68 (0x4)
	float Falloff; // 0x6c (0x4)
	float Brightness; // 0x70 (0x4)
	float Roughness; // 0x74 (0x4)
	float Glow; // 0x78 (0x4)
	unsigned char padding_7c[0x4]; // 0x7c (0x4)
};

