// ScriptStruct /Script/FortniteGame.FortWeaponDurabilityByRarityStats
// Size: 0x28
struct FFortWeaponDurabilityByRarityStats : FTableRowBase
{
	int Common; // 0x8 (0x4)
	int Uncommon; // 0xc (0x4)
	int Rare; // 0x10 (0x4)
	int Epic; // 0x14 (0x4)
	int Legendary; // 0x18 (0x4)
	int Mythic; // 0x1c (0x4)
	int Transcendent; // 0x20 (0x4)
	int Unattainable; // 0x24 (0x4)
};

