// ScriptStruct /Script/FortniteGame.FortPartyMatchmakingInfo
// Size: 0x50
struct FFortPartyMatchmakingInfo
{
	int BuildId; // 0x0 (0x4)
	int HotfixVersion; // 0x4 (0x4)
	struct FString RegionId; // 0x8 (0x10)
	struct FName PlaylistName; // 0x18 (0x4)
	int PlaylistRevision; // 0x1c (0x4)
	struct FString TournamentId; // 0x20 (0x10)
	struct FString EventWindowId; // 0x30 (0x10)
	struct FString LinkCode; // 0x40 (0x10)
};

