// ScriptStruct /Script/FortniteUI.FortEventStyleInfo
// Size: 0xa8
struct FFortEventStyleInfo : FTableRowBase
{
	struct FLinearColor BaseColor; // 0x8 (0x10)
	struct FLinearColor PrimaryColor; // 0x18 (0x10)
	struct FLinearColor SecondaryColor; // 0x28 (0x10)
	struct FLinearColor HighlightColor; // 0x38 (0x10)
	struct FLinearColor TitleColor; // 0x48 (0x10)
	struct FLinearColor ShadowColor; // 0x58 (0x10)
	struct FLinearColor BackgroundLeftColor; // 0x68 (0x10)
	struct FLinearColor BackgroundRightColor; // 0x78 (0x10)
	struct FLinearColor BackgroundTextColor; // 0x88 (0x10)
	struct FLinearColor PosterFadeColor; // 0x98 (0x10)
};

