// ScriptStruct /Script/FortniteGame.FortChallengePunchCardStyles
// Size: 0xb0
struct FFortChallengePunchCardStyles
{
	struct FGameplayTag StyleType; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FString EncodedName; // 0x8 (0x10)
	struct FLinearColor BaseColor1; // 0x18 (0x10)
	struct FLinearColor BaseColor2; // 0x28 (0x10)
	struct FLinearColor BaseColor3; // 0x38 (0x10)
	struct FLinearColor BaseColor4; // 0x48 (0x10)
	struct FLinearColor BaseColor5; // 0x58 (0x10)
	struct FLinearColor AccentColor1; // 0x68 (0x10)
	struct FLinearColor AccentColor2; // 0x78 (0x10)
	struct TWeakObjectPtr<class UTexture2D> BackgrounTexture; // 0x88 (0x28)
};

