// ScriptStruct /Script/FortniteGame.FortAnimInput_VehicleDriverAnimAsset
// Size: 0xb0
struct FFortAnimInput_VehicleDriverAnimAsset
{
	class UAnimSequence* DriveNPose; // 0x0 (0x8)
	class UAnimSequence* DriveEPose; // 0x8 (0x8)
	class UAnimSequence* DriveWPose; // 0x10 (0x8)
	class UAnimSequence* DriveNAdditivePose; // 0x18 (0x8)
	class UAnimSequence* DriveFastAdditivePose; // 0x20 (0x8)
	class UAnimSequence* OverrideDriverPose; // 0x28 (0x8)
	class UAnimSequence* DriveIdle; // 0x30 (0x8)
	class UAnimSequence* DriveIdleFastAdditive; // 0x38 (0x8)
	class UAimOffsetBlendSpace* DriverHeadAimOffset; // 0x40 (0x8)
	class UAnimSequence* DriveNStart; // 0x48 (0x8)
	class UAnimSequence* Braking; // 0x50 (0x8)
	class UAnimSequence* BoostStart; // 0x58 (0x8)
	class UAnimSequence* BoostLoop; // 0x60 (0x8)
	class UAnimSequence* ReverseStart; // 0x68 (0x8)
	class UAnimSequence* ReverseLoop; // 0x70 (0x8)
	class UAnimSequence* ReverseEnd; // 0x78 (0x8)
	class UAnimSequence* ReturnToIdleTransition; // 0x80 (0x8)
	class UAnimSequence* PoseCorrectionAdditive; // 0x88 (0x8)
	class UAnimSequence* CollisionN; // 0x90 (0x8)
	class UAnimSequence* CollisionS; // 0x98 (0x8)
	class UAnimSequence* CollisionE; // 0xa0 (0x8)
	class UAnimSequence* CollisionW; // 0xa8 (0x8)
};

