// ScriptStruct /Script/FortniteGame.FortAthenaVehicleInputStateReliable
// Size: 0x2
struct FFortAthenaVehicleInputStateReliable
{
	unsigned char bIsReversing; // 0x0 (0x1)
	unsigned char bIsSprinting; // 0x0 (0x1)
	unsigned char bIsJumping; // 0x0 (0x1)
	unsigned char bIsBraking; // 0x0 (0x1)
	unsigned char bIsHonking; // 0x0 (0x1)
	unsigned char bIgnoreForwardInAir; // 0x0 (0x1)
	unsigned char bMovementModifier0; // 0x0 (0x1)
	unsigned char bMovementModifier1; // 0x0 (0x1)
	unsigned char bMovementModifier2; // 0x1 (0x1)
	unsigned char bUsingGamepad; // 0x1 (0x1)
	unsigned char bUsingTrigger; // 0x1 (0x1)
};

