// ScriptStruct /Script/FortniteGame.FortSafeZoneDefinition
// Size: 0x298
struct FFortSafeZoneDefinition
{
	struct FScalableFloat Count; // 0x0 (0x28)
	struct FScalableFloat Radius; // 0x28 (0x28)
	struct FScalableFloat ForceDistanceMin; // 0x50 (0x28)
	struct FScalableFloat ForceDistanceMax; // 0x78 (0x28)
	struct FScalableFloat RejectRadius; // 0xa0 (0x28)
	struct FScalableFloat RejectOuterDistance; // 0xc8 (0x28)
	struct FScalableFloat WaitTime; // 0xf0 (0x28)
	struct FScalableFloat ShrinkTime; // 0x118 (0x28)
	struct FScalableFloat MegaStormGridCellThickness; // 0x140 (0x28)
	struct FScalableFloat PlayerCapSolo; // 0x168 (0x28)
	struct FScalableFloat PlayerCapDuo; // 0x190 (0x28)
	struct FScalableFloat PlayerCapSquad; // 0x1b8 (0x28)
	unsigned char padding_1e0[0xb8]; // 0x1e0 (0xb8)
};

