// ScriptStruct /Script/FortniteGame.FortRechargingActionTimerConfig
// Size: 0x28
struct FFortRechargingActionTimerConfig
{
	float ChargeRate; // 0x8 (0x4)
	float ActiveExpenseRate; // 0xc (0x4)
	float PassiveExpenseRate; // 0x10 (0x4)
	float MinActiveDuration; // 0x14 (0x4)
	float MinActivationCharge; // 0x18 (0x4)
	float ActiveCooldownTime; // 0x1c (0x4)
	float ChargeThreshold; // 0x20 (0x4)
	unsigned char padding_24[0x4]; // 0x24 (0x4)
};

