// ScriptStruct /Script/FortniteUI.FortItemCard_PowerRatingBlock_Configuration
// Size: 0x150
struct FFortItemCard_PowerRatingBlock_Configuration
{
	struct FSlateBrush MoonbeamBorderBrush; // 0x10 (0xc0)
	struct FMargin MoonbeamBorderExteriorPadding; // 0xd0 (0x10)
	struct FMargin MoonbeamBorderPadding; // 0xe0 (0x10)
	struct FMargin CustomRatingInternalPadding; // 0xf0 (0x10)
	struct FVector2D CustomRatingIconSize; // 0x100 (0x10)
	struct TWeakObjectPtr<class UClass> CustomRatingTextStyle; // 0x110 (0x28)
	struct FVector2D ComparisonIndicatorSize; // 0x138 (0x10)
	unsigned char padding_148[0x8]; // 0x148 (0x8)
};

