// ScriptStruct /Script/FortniteGame.FortCreativeBudgetOverride
// Size: 0x30
struct FFortCreativeBudgetOverride
{
	struct FString ActorClass; // 0x0 (0x10)
	int AssetCost; // 0x10 (0x4)
	float AssetCostMultiplier; // 0x14 (0x4)
	int InstanceCost; // 0x18 (0x4)
	float InstanceCostMultiplier; // 0x1c (0x4)
	int SimulationCost; // 0x20 (0x4)
	int DrawCall; // 0x24 (0x4)
	int AudioCost; // 0x28 (0x4)
	int NetworkCost; // 0x2c (0x4)
};

