// ScriptStruct /Script/FortniteGame.FortAnimInput_FerretVehicle
// Size: 0xb8
struct FFortAnimInput_FerretVehicle
{
	unsigned char bIsUsingFerretVehicle; // 0x0 (0x1)
	unsigned char bIsDriver; // 0x0 (0x1)
	unsigned char bIsFrontPassenger; // 0x0 (0x1)
	unsigned char bIsBackLeftPassenger; // 0x0 (0x1)
	unsigned char bIsBackRightPassenger; // 0x0 (0x1)
	unsigned char bIsFrontPassengerAndLeaning; // 0x0 (0x1)
	unsigned char bIsBackPassengerAndLeaning; // 0x0 (0x1)
	unsigned char bIsDrifting; // 0x0 (0x1)
	unsigned char bIsBoosting; // 0x1 (0x1)
	unsigned char bIsReversing; // 0x1 (0x1)
	unsigned char bIsBraking; // 0x1 (0x1)
	unsigned char bIsMoving; // 0x1 (0x1)
	unsigned char bIsMovingForward; // 0x1 (0x1)
	unsigned char bIsLeaning; // 0x1 (0x1)
	unsigned char bIsLeaningOrBouncing; // 0x1 (0x1)
	unsigned char bIsBounceCrouching; // 0x1 (0x1)
	unsigned char bIsBounceCrouched; // 0x2 (0x1)
	unsigned char bIsBounceJumping; // 0x2 (0x1)
	unsigned char bIsBounceRecoiling; // 0x2 (0x1)
	unsigned char bIsSteeringRight; // 0x3 (0x1)
	unsigned char bIsSteeringLeft; // 0x4 (0x1)
	unsigned char bIsShooting; // 0x5 (0x1)
	unsigned char bIsFerretPassengerRotating; // 0x6 (0x1)
	unsigned char unreflected_7[0x1]; // 0x7 (0x1) 
	float RunForwardAlpha; // 0x8 (0x4)
	float BounceCompression; // 0xc (0x4)
	struct FVector LeanPosition; // 0x10 (0x18)
	float LeanPositionX; // 0x28 (0x4)
	float LeanPositionY; // 0x2c (0x4)
	float LeanPositionZ; // 0x30 (0x4)
	unsigned char bAimFWD; // 0x34 (0x1)
	unsigned char bAimBWD; // 0x34 (0x1)
	unsigned char bAimLFT; // 0x34 (0x1)
	unsigned char bAimRGT; // 0x34 (0x1)
	unsigned char unreflected_35[0x3]; // 0x35 (0x3) 
	float PawnToVehicleDeltaYawAngleDegrees; // 0x38 (0x4)
	float AimCardDirDeadZoneAngleDegrees; // 0x3c (0x4)
	float AimCardDirAngleOffsetDegrees; // 0x40 (0x4)
	int LastCardDirIndex; // 0x44 (0x4)
	float AimFWDDeltaAngleDegrees; // 0x48 (0x4)
	float AimBWDDeltaAngleDegrees; // 0x4c (0x4)
	float AimLFTDeltaAngleDegrees; // 0x50 (0x4)
	float AimRGTDeltaAngleDegrees; // 0x54 (0x4)
	float SlopePitchDegreeAngle; // 0x58 (0x4)
	float SlopeRollDegreeAngle; // 0x5c (0x4)
	float SteerAngle; // 0x60 (0x4)
	unsigned char unreflected_64[0x4]; // 0x64 (0x4) 
	struct FVector SeatSwitchDirection; // 0x68 (0x18)
	unsigned char bWasUp; // 0x80 (0x1)
	unsigned char unreflected_81[0x7]; // 0x81 (0x7) 
	struct FVector PrevPlayerYAxis; // 0x88 (0x18)
	struct FVector PrevPlayerZAxis; // 0xa0 (0x18)
};

