// ScriptStruct /Script/FortniteGame.FortSeasonItemMapData
// Size: 0x1e0
struct FFortSeasonItemMapData
{
	struct FString SeasonItemTag; // 0x0 (0x10)
	struct FVector WorldLocation; // 0x10 (0x18)
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	struct FSlateBrush FullScreenMapIconBrush; // 0x30 (0xc0)
	struct FSlateBrush InteractedIconBrush; // 0xf0 (0xc0)
	struct FVector2D FullScreenMapScale; // 0x1b0 (0x10)
	bool bAlwaysRender; // 0x1c0 (0x1)
	unsigned char unreflected_1c1[0x7]; // 0x1c1 (0x7) 
	struct FString CalendarEventName; // 0x1c8 (0x10)
	unsigned char padding_1d8[0x8]; // 0x1d8 (0x8)
};

