// ScriptStruct /Script/FortniteGame.FortFloatingPetAnimInstanceControls
// Size: 0xc0
struct FFortFloatingPetAnimInstanceControls
{
	struct FVector BackpackTargetVectorTransformDirection; // 0x0 (0x18)
	struct FName BackpackTargetVectorLocationSocket; // 0x18 (0x4)
	struct FName BackpackTargetVectorTransformSocket; // 0x1c (0x4)
	float SkydivingYawDefinedHoverOffset; // 0x20 (0x4)
	float SkydivingSpringStiffnessInterpSpeed; // 0x24 (0x4)
	float SkydivingBaseAimPitchSmooth; // 0x28 (0x4)
	float SkydivingBaseAimPitchSmoothWhileDiving; // 0x2c (0x4)
	float BaseAimPitchSmooth; // 0x30 (0x4)
	float SpringStiffnessInterpSpeed; // 0x34 (0x4)
	float YawDefinedHoverOffsetWhileEmoting; // 0x38 (0x4)
	struct FName YawDefinedHoverOffsetTransformSocket; // 0x3c (0x4)
	float SpringStiffnessInterpSpeedSmoothInterpSpeed; // 0x40 (0x4)
	float BackpackTargetVectorAlphaSmoothTarget; // 0x44 (0x4)
	float BackpackTargetVectorAlphaSmoothTargetWhilePlayingEmote; // 0x48 (0x4)
	float BackpackTargetVectorAlphaSmoothTargetWhileSkydiving; // 0x4c (0x4)
	struct FRotator RotationYawDefinedHoverOffsetSmoothTargetWhileEmoting; // 0x50 (0x18)
	float RotationYawDefinedHoverOffsetSmoothInterpSpeed; // 0x68 (0x4)
	unsigned char unreflected_6c[0x4]; // 0x6c (0x4) 
	struct FVector CarrierOffsetTotalTarget; // 0x70 (0x18)
	struct FVector CarrierOffsetTotalTargetWhileEmoting; // 0x88 (0x18)
	struct FVector CarrierOffsetTotalTargetWhileSkydiving; // 0xa0 (0x18)
	float CarrierOffsetTotalInterpSpeed; // 0xb8 (0x4)
	float RootYawOffsetMultiplier; // 0xbc (0x4)
};

