// ScriptStruct /Script/FortniteUI.FortItemCard_M_PersonnelAndSchematics_Configuration
// Size: 0x4c0
struct FFortItemCard_M_PersonnelAndSchematics_Configuration
{
	struct FMargin BackgroundPadding; // 0x0 (0x10)
	struct FFortItemCard_PowerRatingBlock_PersonnelAndSchematics_Configuration PowerRatingBlock; // 0x10 (0x330)
	struct FVector2D BookmarkImageSize; // 0x340 (0x10)
	struct FFortItemCard_NameplateBorder_Configuration Nameplate; // 0x350 (0xd0)
	struct FVector2D ClassIconSize; // 0x420 (0x10)
	struct FVector2D LeadSurvivorTypeIconSize; // 0x430 (0x10)
	struct FVector2D FirstIconSlotSize; // 0x440 (0x10)
	float PaddingBetweenIconSlots; // 0x450 (0x4)
	unsigned char unreflected_454[0x4]; // 0x454 (0x4) 
	struct FVector2D SecondIconSlotSize; // 0x458 (0x10)
	struct FFortItemCard_DefenderWeaponTypeIcon_Configuration DefenderWeaponTypeIcon; // 0x468 (0x10)
	struct FFortItemCard_DetailAreaBorder_Configuration DetailAreaBorder; // 0x478 (0x14)
	struct FFortItemCard_LevelMeter_Configuration LevelMeter; // 0x48c (0x14)
	float TierMeterLeftPadding; // 0x4a0 (0x4)
	unsigned char unreflected_4a4[0x4]; // 0x4a4 (0x4) 
	struct FFortItemCard_TierMeter_Configuration TierMeter; // 0x4a8 (0x18)
};

