// ScriptStruct /Script/FortniteGame.FortItemEntry
// Size: 0x1a0
struct FFortItemEntry : FFastArraySerializerItem
{
	int Count; // 0xc (0x4)
	int PreviousCount; // 0x10 (0x4)
	unsigned char unreflected_14[0x4]; // 0x14 (0x4) 
	class UFortItemDefinition* ItemDefinition; // 0x18 (0x8)
	int16_t OrderIndex; // 0x20 (0x2)
	unsigned char unreflected_22[0x2]; // 0x22 (0x2) 
	float Durability; // 0x24 (0x4)
	int Level; // 0x28 (0x4)
	int LoadedAmmo; // 0x2c (0x4)
	int PhantomReserveAmmo; // 0x30 (0x4)
	unsigned char unreflected_34[0x4]; // 0x34 (0x4) 
	struct TArray<struct FString> AlterationDefinitions; // 0x38 (0x10)
	struct TArray<struct FFortSavedWeaponModSlot> SavedWeaponModSlots; // 0x48 (0x10)
	struct FString ItemSource; // 0x58 (0x10)
	struct FGuid ItemGuid; // 0x68 (0x10)
	struct FGuid TrackerGuid; // 0x78 (0x10)
	struct FGuid ItemVariantGuid; // 0x88 (0x10)
	int ControlOverride; // 0x98 (0x4)
	bool inventoryoverflowdate; // 0x9c (0x1)
	bool bWasGifted; // 0x9d (0x1)
	bool bIsReplicatedCopy; // 0x9e (0x1)
	bool bIsDirty; // 0x9f (0x1)
	bool bUpdateStatsOnCollection; // 0xa0 (0x1)
	unsigned char unreflected_a1[0x7]; // 0xa1 (0x7) 
	struct FFortGiftingInfo GiftingInfo; // 0xa8 (0x28)
	struct TArray<struct FFortItemEntryStateValue> StateValues; // 0xd0 (0x10)
	struct TWeakObjectPtr<class AFortInventory> ParentInventory; // 0xe0 (0x8)
	struct FGameplayAbilitySpecHandle GameplayAbilitySpecHandle; // 0xe8 (0x4)
	unsigned char unreflected_ec[0x4]; // 0xec (0x4) 
	struct TArray<class UFortAlterationItemDefinition*> AlterationInstances; // 0xf0 (0x10)
	struct TArray<struct FFortWeaponModSlot> WeaponModSlots; // 0x100 (0x10)
	struct TWeakObjectPtr<class UAthenaItemWrapDefinition> WrapOverride; // 0x110 (0x28)
	struct TArray<float> GenericAttributeValues; // 0x138 (0x10)
	unsigned char unreflected_148[0x50]; // 0x148 (0x50) 
	int PickupVariantIndex; // 0x198 (0x4)
	int ItemVariantDataMappingIndex; // 0x19c (0x4)
};

