// ScriptStruct /Script/FortniteGame.FortWorldPartitionGridRangeOverrides
// Size: 0x70
struct FFortWorldPartitionGridRangeOverrides
{
	struct FName TargetGrid; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FString LoadingRange; // 0x8 (0x10)
	unsigned char unreflected_18[0x8]; // 0x18 (0x8) 
	struct FString StartingRange; // 0x20 (0x10)
	unsigned char unreflected_30[0x8]; // 0x30 (0x8) 
	struct FString StreamingSourceScale; // 0x38 (0x10)
	unsigned char unreflected_48[0x8]; // 0x48 (0x8) 
	bool bSetHLODTreeCullDistance; // 0x50 (0x1)
	unsigned char unreflected_51[0x7]; // 0x51 (0x7) 
	struct FString DebugColor; // 0x58 (0x10)
	unsigned char padding_68[0x8]; // 0x68 (0x8)
};

