// ScriptStruct /Script/FortniteUI.FortShowdownEventBestResultsSummary
// Size: 0x1c
struct FFortShowdownEventBestResultsSummary
{
	int TotalScore; // 0x0 (0x4)
	int MatchesPlayed; // 0x4 (0x4)
	int NumVictoryRoyales; // 0x8 (0x4)
	int PlacementPoints; // 0xc (0x4)
	int EliminationPoints; // 0x10 (0x4)
	int EntryFeePoints; // 0x14 (0x4)
	bool bIsValidSummary; // 0x18 (0x1)
	unsigned char padding_19[0x3]; // 0x19 (0x3)
};

