// ScriptStruct /Script/FortniteGame.FortAimAssist2D_Settings
// Size: 0x3b0
struct FFortAimAssist2D_Settings
{
	struct FScalableFloat AssistInnerReticleWidth; // 0x0 (0x28)
	struct FScalableFloat AssistInnerReticleHeight; // 0x28 (0x28)
	struct FScalableFloat AssistOuterReticleWidth; // 0x50 (0x28)
	struct FScalableFloat AssistOuterReticleHeight; // 0x78 (0x28)
	struct FScalableFloat TargetingReticleWidth; // 0xa0 (0x28)
	struct FScalableFloat TargetingReticleHeight; // 0xc8 (0x28)
	struct FScalableFloat TargetRange; // 0xf0 (0x28)
	class UCurveFloat* TargetWeightCurve; // 0x118 (0x8)
	struct FScalableFloat TargetWeightDBNOScale; // 0x120 (0x28)
	struct FFortTargetFilter TargetFilter; // 0x148 (0x38)
	struct FScalableFloat PullInnerStrengthHip; // 0x180 (0x28)
	struct FScalableFloat PullOuterStrengthHip; // 0x1a8 (0x28)
	struct FScalableFloat PullInnerStrengthAds; // 0x1d0 (0x28)
	struct FScalableFloat PullOuterStrengthAds; // 0x1f8 (0x28)
	struct FScalableFloat PullLerpInRate; // 0x220 (0x28)
	struct FScalableFloat PullLerpOutRate; // 0x248 (0x28)
	struct FScalableFloat PullMaxRotationRate; // 0x270 (0x28)
	struct FScalableFloat SlowInnerStrengthHip; // 0x298 (0x28)
	struct FScalableFloat SlowOuterStrengthHip; // 0x2c0 (0x28)
	struct FScalableFloat SlowInnerStrengthAds; // 0x2e8 (0x28)
	struct FScalableFloat SlowOuterStrengthAds; // 0x310 (0x28)
	struct FScalableFloat SlowLerpInRate; // 0x338 (0x28)
	struct FScalableFloat SlowLerpOutRate; // 0x360 (0x28)
	struct FScalableFloat SlowMinRotationRate; // 0x388 (0x28)
};

