// ScriptStruct /Script/FortniteUI.FortHUDState
// Size: 0x4
struct FFortHUDState
{
	unsigned char bInBuildMode; // 0x0 (0x1)
	unsigned char bInCombatMode; // 0x0 (0x1)
	unsigned char bInEditMode; // 0x0 (0x1)
	unsigned char bInCreativeMode; // 0x0 (0x1)
	unsigned char bInBattleLabMode; // 0x0 (0x1)
	unsigned char bIsParachuteOpen; // 0x0 (0x1)
	unsigned char bIsFreeFalling; // 0x0 (0x1)
	unsigned char bInLockedBus; // 0x0 (0x1)
	unsigned char bInUnlockedBus; // 0x1 (0x1)
	unsigned char bOnTargeting; // 0x1 (0x1)
	unsigned char bOnUsingScopeTargeting; // 0x1 (0x1)
	unsigned char bOnCanTarget; // 0x1 (0x1)
	unsigned char bOnCanUseScopeTargeting; // 0x1 (0x1)
	unsigned char bOnCanUseSecondaryAbility; // 0x1 (0x1)
	unsigned char bCanOpenChute; // 0x1 (0x1)
	unsigned char bCrouching; // 0x1 (0x1)
	unsigned char bDBNO; // 0x2 (0x1)
	unsigned char bIsControllingRCPawn; // 0x2 (0x1)
	unsigned char bIsInVehicle; // 0x2 (0x1)
	unsigned char bIsDrivingVehicle; // 0x2 (0x1)
	unsigned char bCanSwapSeats; // 0x2 (0x1)
	unsigned char bIsCarryingDBNO; // 0x2 (0x1)
	unsigned char bIsCarryingHeldObject; // 0x2 (0x1)
	unsigned char bIsZiplining; // 0x2 (0x1)
	unsigned char bIsCreativeFlying; // 0x3 (0x1)
	unsigned char bImprovedDBNO; // 0x3 (0x1)
};

