// ScriptStruct /Script/FortniteGame.FortFloatingPetOffsetCalculationControls
// Size: 0x78
struct FFortFloatingPetOffsetCalculationControls
{
	float RootYawOffsetTurnInPlaceSmoothInterpSpeed; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FVector ParachuteJustOpenedOffsetTarget; // 0x8 (0x18)
	struct FVector ParachuteJustOpenedOffsetTargetWhenParachuteJustOpened; // 0x20 (0x18)
	float ParachuteJustOpenedOffsetInterpSpeed; // 0x38 (0x4)
	float ParachuteJustOpenedOffsetInterpSpeedWhenParachuteJustOpened; // 0x3c (0x4)
	struct FVector JumpUpOffsetSmoothTarget; // 0x40 (0x18)
	struct FVector JumpUpOffsetSmoothTargetWhenJumping; // 0x58 (0x18)
	float JumpUpOffsetSmoothInterpSpeed; // 0x70 (0x4)
	float SkydivingRotationOffsetBaseAimPitchSmoothMultiplier; // 0x74 (0x4)
};

