// ScriptStruct /Script/FortniteGame.FortPartyMemberRepData
// Size: 0xcb8
struct FFortPartyMemberRepData : FPartyMemberRepData
{
	struct FPartyMemberPackedState PackedState; // 0x268 (0x9)
	unsigned char unreflected_271[0x1b7]; // 0x271 (0x1b7) 
	struct FPartyMemberCampaignHero CampaignHero; // 0x428 (0x38)
	unsigned char unreflected_460[0x30]; // 0x460 (0x30) 
	struct FPartyMemberCampaignInfo CampaignInfo; // 0x490 (0x20)
	unsigned char unreflected_4b0[0x90]; // 0x4b0 (0x90) 
	struct FPartyMemberFrontendEmote FrontendEmote; // 0x540 (0x40)
	unsigned char unreflected_580[0x30]; // 0x580 (0x30) 
	unsigned char NumAthenaPlayersLeft; // 0x5b0 (0x1)
	unsigned char unreflected_5b1[0x37]; // 0x5b1 (0x37) 
	struct FDateTime* UtcTimeStartedMatchAthena; // 0x5e8 (0x8)
	unsigned char unreflected_5f0[0x30]; // 0x5f0 (0x30) 
	struct FPartyMemberLobbyState LobbyState; // 0x620 (0xc)
	unsigned char unreflected_62c[0x124]; // 0x62c (0x124) 
	class UFortFeatItemDefinition* FeatDefinition; // 0x750 (0x8)
	unsigned char unreflected_758[0x30]; // 0x758 (0x30) 
	struct FPartyMemberSquadAssignmentRequest MemberSquadAssignmentRequest; // 0x788 (0x40)
	unsigned char unreflected_7c8[0x30]; // 0x7c8 (0x30) 
	struct FPartyMemberFrontEndMapMarker FrontEndMapMarker; // 0x7f8 (0x18)
	unsigned char unreflected_810[0x30]; // 0x810 (0x30) 
	struct FPartyMemberCosmeticLoadout AthenaCosmeticLoadout; // 0x840 (0x168)
	unsigned char unreflected_9a8[0x30]; // 0x9a8 (0x30) 
	struct FPartyMemberVariantCache AthenaCosmeticLoadoutVariants; // 0x9d8 (0x58)
	unsigned char unreflected_a30[0x30]; // 0xa30 (0x30) 
	struct TArray<struct FString> ArbitraryCustomDataStore; // 0xa60 (0x10)
	unsigned char unreflected_a70[0x30]; // 0xa70 (0x30) 
	struct FPartyMemberAthenaBannerInfo AthenaBannerInfo; // 0xaa0 (0x28)
	unsigned char unreflected_ac8[0x30]; // 0xac8 (0x30) 
	struct FPartyMemberBattlePassInfo BattlePassInfo; // 0xaf8 (0x10)
	unsigned char unreflected_b08[0x30]; // 0xb08 (0x30) 
	struct FPartyMemberSharedQuestData SharedQuests; // 0xb38 (0x60)
	unsigned char unreflected_b98[0x30]; // 0xb98 (0x30) 
	float DownloadOnDemandProgress; // 0xbc8 (0x4)
	unsigned char unreflected_bcc[0x34]; // 0xbcc (0x34) 
	bool bIsPartyUsingPartySignal; // 0xc00 (0x1)
	unsigned char unreflected_c01[0x37]; // 0xc01 (0x37) 
	struct FPartyMemberSpectateInfo SpectateInfo; // 0xc38 (0x20)
	unsigned char padding_c58[0x60]; // 0xc58 (0x60)
};

