// ScriptStruct /Script/FortniteGame.FortFloatingPetSimpleControls
// Size: 0x20
struct FFortFloatingPetSimpleControls
{
	float SpringStiffness; // 0x0 (0x4)
	float SpringStiffnessSmooth; // 0x4 (0x4)
	float SpringStiffnessInterpSpeed; // 0x8 (0x4)
	float SpringStiffnessInterpSpeedSmooth; // 0xc (0x4)
	float SpringCriticalDampingFactor; // 0x10 (0x4)
	float SpringCriticalDampingFactorSmooth; // 0x14 (0x4)
	float YawDefinedHoverOffset; // 0x18 (0x4)
	float BaseAimPitchSmooth; // 0x1c (0x4)
};

