// ScriptStruct /Script/FortniteGame.FortAnimInput_CommonVehicle
// Size: 0x8
struct FFortAnimInput_CommonVehicle
{
	unsigned char bIsUsingVehicle; // 0x4 (0x1)
	unsigned char bIsJumpingVehicle; // 0x4 (0x1)
	unsigned char bCanChargeJump; // 0x4 (0x1)
	unsigned char bIsChargingJump; // 0x4 (0x1)
	unsigned char bIsJumping; // 0x4 (0x1)
	unsigned char bIsOnGround; // 0x4 (0x1)
	unsigned char bCanDriverAimWeapon; // 0x4 (0x1)
	unsigned char padding_5[0x3]; // 0x5 (0x3)
};

