// ScriptStruct /Script/FortniteGame.FortAnimInput_ShoppingCart
// Size: 0x5c
struct FFortAnimInput_ShoppingCart
{
	unsigned char bIsUsingShoppingCart; // 0x0 (0x1)
	unsigned char bIsUsingVehicle; // 0x0 (0x1)
	enum ECoastState CoastState; // 0x1 (0x1)
	unsigned char bIsCoastStatePedaling; // 0x2 (0x1)
	unsigned char bIsCoastStateCoasting; // 0x2 (0x1)
	unsigned char bIsCoastStateDismount; // 0x2 (0x1)
	unsigned char bIsCoastStateIdle; // 0x2 (0x1)
	unsigned char bIsInAir; // 0x2 (0x1)
	unsigned char bIsCoasting; // 0x2 (0x1)
	unsigned char bIsPedaling; // 0x2 (0x1)
	unsigned char bIsReadyToPedal; // 0x2 (0x1)
	unsigned char unreflected_3[0x1]; // 0x3 (0x1) 
	float IsReadyToPedal; // 0x4 (0x4)
	unsigned char bWantsToCoast; // 0x8 (0x1)
	unsigned char bIsCoastIdling; // 0x8 (0x1)
	unsigned char bIsStartCoasting; // 0x8 (0x1)
	unsigned char bIsEndCoasting; // 0x8 (0x1)
	unsigned char bIsDismountingFromCoast; // 0x8 (0x1)
	unsigned char bIsCoastingOrDismountingFromCoast; // 0x8 (0x1)
	unsigned char bIsStandingInPlace; // 0x8 (0x1)
	unsigned char bIsSprinting; // 0x8 (0x1)
	unsigned char bIsSprintingAndMovingForward; // 0x9 (0x1)
	unsigned char bIsMovingForwardNotSprinting; // 0x9 (0x1)
	unsigned char bIsBraking; // 0x9 (0x1)
	unsigned char bIsReversing; // 0x9 (0x1)
	unsigned char bIsMoving; // 0x9 (0x1)
	unsigned char bIsMovingForward; // 0x9 (0x1)
	unsigned char bIsMovingBackwards; // 0x9 (0x1)
	unsigned char bIsMovingOrTurningInPlace; // 0x9 (0x1)
	unsigned char bIsInAirSteady; // 0xa (0x1)
	unsigned char bIsOnSlope; // 0xa (0x1)
	unsigned char bAimFWD; // 0xa (0x1)
	unsigned char bAimBWD; // 0xa (0x1)
	unsigned char bAimLFT; // 0xa (0x1)
	unsigned char bAimRGT; // 0xa (0x1)
	unsigned char unreflected_b[0x1]; // 0xb (0x1) 
	float ForwardVelocity; // 0xc (0x4)
	float ForwardSpeedKmh; // 0x10 (0x4)
	float CurrentBrakeForce; // 0x14 (0x4)
	float RunForwardAlpha; // 0x18 (0x4)
	unsigned char bIsAcceleratingForward; // 0x1c (0x1)
	unsigned char bIsAccelBreakingOrReversing; // 0x1c (0x1)
	unsigned char unreflected_1d[0x3]; // 0x1d (0x3) 
	float SteerAngle; // 0x20 (0x4)
	float SteerAngleInterpSpeed; // 0x24 (0x4)
	float CoastSteerAngleInterpSpeed; // 0x28 (0x4)
	float IsReadyToPedalInterpSpeed; // 0x2c (0x4)
	float StandingInPlaceSteerAngle; // 0x30 (0x4)
	float SlopePitchDegreeAngle; // 0x34 (0x4)
	float SlopeRollDegreeAngle; // 0x38 (0x4)
	float PawnToVehicleDeltaYawAngleDegrees; // 0x3c (0x4)
	float AimCardDirDeadZoneAngleDegrees; // 0x40 (0x4)
	float AimCardDirAngleOffsetDegrees; // 0x44 (0x4)
	float AimFWDDeltaAngleDegrees; // 0x48 (0x4)
	float AimBWDDeltaAngleDegrees; // 0x4c (0x4)
	float AimLFTDeltaAngleDegrees; // 0x50 (0x4)
	float AimRGTDeltaAngleDegrees; // 0x54 (0x4)
	int LastCardDirIndex; // 0x58 (0x4)
};

