// ScriptStruct /Script/FortniteGame.FortUserMixSettings
// Size: 0x40
struct FFortUserMixSettings
{
	class USoundControlBusMix* Mix; // 0x0 (0x8)
	class USoundControlBus* MainBus; // 0x8 (0x8)
	class USoundControlBus* MusicBus; // 0x10 (0x8)
	class USoundControlBus* SFXBus; // 0x18 (0x8)
	class USoundControlBus* DialogueBus; // 0x20 (0x8)
	class USoundControlBus* ChatBus; // 0x28 (0x8)
	class USoundControlBus* CinematicsBus; // 0x30 (0x8)
	class USoundControlBus* PIPBus; // 0x38 (0x8)
};

