// ScriptStruct /Script/FortniteGame.FortMissionPopupWidgetData
// Size: 0x280
struct FFortMissionPopupWidgetData
{
	struct FText DisplayName; // 0x0 (0x18)
	bool bShowDescription; // 0x18 (0x1)
	unsigned char unreflected_19[0x7]; // 0x19 (0x7) 
	struct FText Description; // 0x20 (0x18)
	unsigned char unreflected_38[0x8]; // 0x38 (0x8) 
	struct FSlateBrush DescriptionIcon; // 0x40 (0xc0)
	struct FSlateBrush AvailableIcon; // 0x100 (0xc0)
	struct FSlateBrush UnavailableIcon; // 0x1c0 (0xc0)
};

