// ScriptStruct /Script/FortniteGame.FortKeepAmmoStash
// Size: 0x30
struct FFortKeepAmmoStash : FTableRowBase
{
	int Max1; // 0x8 (0x4)
	int Cooldown1; // 0xc (0x4)
	int Max2; // 0x10 (0x4)
	int Cooldown2; // 0x14 (0x4)
	int Max3; // 0x18 (0x4)
	int Cooldown3; // 0x1c (0x4)
	int Max4; // 0x20 (0x4)
	int Cooldown4; // 0x24 (0x4)
	int PickupTier; // 0x28 (0x4)
	unsigned char padding_2c[0x4]; // 0x2c (0x4)
};

