// ScriptStruct /Script/FortniteGame.FortAnimSetLocomotion
// Size: 0xf8
struct FFortAnimSetLocomotion
{
	bool EnableAdditiveLeans; // 0x0 (0x1)
	bool UseMovementAdditiveForOneHandedTransitions; // 0x1 (0x1)
	bool PlayMovementTransitions; // 0x2 (0x1)
	unsigned char unreflected_3[0x5]; // 0x3 (0x5) 
	class UBlendSpace* MovementBlendSpaceTargeting; // 0x8 (0x8)
	class UBlendSpace* MovementBlendSpaceTargetingRightFootForward; // 0x10 (0x8)
	class UBlendSpace* MovementBlendSpace; // 0x18 (0x8)
	class UBlendSpace* MovementBlendSpaceNo45s; // 0x20 (0x8)
	class UAnimSequenceBase* StartN; // 0x28 (0x8)
	class UAnimSequenceBase* StartS; // 0x30 (0x8)
	class UAnimSequenceBase* StartE; // 0x38 (0x8)
	class UAnimSequenceBase* StartW; // 0x40 (0x8)
	class UAnimSequenceBase* StopN; // 0x48 (0x8)
	class UAnimSequenceBase* StopS; // 0x50 (0x8)
	class UAnimSequenceBase* StopE; // 0x58 (0x8)
	class UAnimSequenceBase* StopW; // 0x60 (0x8)
	class UAnimSequenceBase* PivotN; // 0x68 (0x8)
	class UAnimSequenceBase* PivotS; // 0x70 (0x8)
	class UAnimSequenceBase* PivotE; // 0x78 (0x8)
	class UAnimSequenceBase* PivotW; // 0x80 (0x8)
	class UBlendSpace* CrouchAdditiveLean; // 0x88 (0x8)
	class UBlendSpace* AdditiveLean; // 0x90 (0x8)
	class UAnimSequenceBase* AdditiveStartN; // 0x98 (0x8)
	class UAnimSequenceBase* AdditiveStartS; // 0xa0 (0x8)
	class UAnimSequenceBase* AdditiveStartE; // 0xa8 (0x8)
	class UAnimSequenceBase* AdditiveStartW; // 0xb0 (0x8)
	class UAnimSequenceBase* AdditiveStopN; // 0xb8 (0x8)
	class UAnimSequenceBase* AdditiveStopS; // 0xc0 (0x8)
	class UAnimSequenceBase* AdditiveStopE; // 0xc8 (0x8)
	class UAnimSequenceBase* AdditiveStopW; // 0xd0 (0x8)
	class UAnimSequenceBase* AdditivePivotN; // 0xd8 (0x8)
	class UAnimSequenceBase* AdditivePivotS; // 0xe0 (0x8)
	class UAnimSequenceBase* AdditivePivotE; // 0xe8 (0x8)
	class UAnimSequenceBase* AdditivePivotW; // 0xf0 (0x8)
};

