// ScriptStruct /Script/FortniteGame.FortRangedWeaponStats
// Size: 0x320
struct FFortRangedWeaponStats : FFortBaseWeaponStats
{
	unsigned char unreflected_148[0x4]; // 0x148 (0x4) 
	float Spread; // 0x14c (0x4)
	float OverrideBaseSpread; // 0x150 (0x4)
	float SpreadDownsights; // 0x154 (0x4)
	float StandingStillSpreadMultiplier; // 0x158 (0x4)
	float AthenaCrouchingSpreadMultiplier; // 0x15c (0x4)
	float AthenaSlidingSpreadMultiplier; // 0x160 (0x4)
	float AthenaJumpingFallingSpreadMultiplier; // 0x164 (0x4)
	float AthenaSprintingSpreadMultiplier; // 0x168 (0x4)
	float MinSpeedForSpreadMultiplier; // 0x16c (0x4)
	float MaxSpeedForSpreadMultiplier; // 0x170 (0x4)
	float SpreadDownsightsAdditionalCooldownTime; // 0x174 (0x4)
	float SpreadExponent; // 0x178 (0x4)
	float HeatX1; // 0x17c (0x4)
	float HeatY1; // 0x180 (0x4)
	float HeatX2; // 0x184 (0x4)
	float HeatY2; // 0x188 (0x4)
	float HeatX3; // 0x18c (0x4)
	float HeatY3; // 0x190 (0x4)
	float HeatXScale; // 0x194 (0x4)
	float HeatYScale; // 0x198 (0x4)
	float CoolX1; // 0x19c (0x4)
	float CoolY1; // 0x1a0 (0x4)
	float CoolX2; // 0x1a4 (0x4)
	float CoolY2; // 0x1a8 (0x4)
	float CoolX3; // 0x1ac (0x4)
	float CoolY3; // 0x1b0 (0x4)
	float CoolXScale; // 0x1b4 (0x4)
	float CoolYScale; // 0x1b8 (0x4)
	float PerfectAimCooldown; // 0x1bc (0x4)
	int BulletsPerCartridge; // 0x1c0 (0x4)
	int MinHitsPerCartridge; // 0x1c4 (0x4)
	float FiringRate; // 0x1c8 (0x4)
	float ROFScale; // 0x1cc (0x4)
	float BurstFiringRate; // 0x1d0 (0x4)
	float FiringRateDownsightsMultiplier; // 0x1d4 (0x4)
	float AutofireRange; // 0x1d8 (0x4)
	float AutofireAcquisitionDelay; // 0x1dc (0x4)
	float AutofireDBNOAcquisitionDelay; // 0x1e0 (0x4)
	float AutofireAcquisitionRechargeTime; // 0x1e4 (0x4)
	float AutofireReleaseTime; // 0x1e8 (0x4)
	float AutofireCooldown; // 0x1ec (0x4)
	float RecoilVert; // 0x1f0 (0x4)
	float RecoilVertScale; // 0x1f4 (0x4)
	float RecoilVertScaleGamepad; // 0x1f8 (0x4)
	float VertRecoilDownChance; // 0x1fc (0x4)
	float RecoilHoriz; // 0x200 (0x4)
	float RecoilHorizScale; // 0x204 (0x4)
	float RecoilHorizScaleGamepad; // 0x208 (0x4)
	float RecoilInterpSpeed; // 0x20c (0x4)
	float RecoilRecoveryInterpSpeed; // 0x210 (0x4)
	float RecoilRecoveryDelay; // 0x214 (0x4)
	float RecoilRecoveryFraction; // 0x218 (0x4)
	float RecoilDownsightsMultiplier; // 0x21c (0x4)
	float AthenaRecoilMagnitudeMin; // 0x220 (0x4)
	float AthenaRecoilMagnitudeMax; // 0x224 (0x4)
	float AthenaRecoilMagnitudeScale; // 0x228 (0x4)
	float AthenaRecoilAngleMin; // 0x22c (0x4)
	float AthenaRecoilAngleMax; // 0x230 (0x4)
	float AthenaRecoilRollMagnitudeMin; // 0x234 (0x4)
	float AthenaRecoilRollMagnitudeMax; // 0x238 (0x4)
	float AthenaRecoilInterpSpeed; // 0x23c (0x4)
	float AthenaRecoilRecoveryInterpSpeed; // 0x240 (0x4)
	float AthenaRecoilDownsightsMultiplier; // 0x244 (0x4)
	float AthenaRecoilHipFireMultiplier; // 0x248 (0x4)
	float PitchLimitForPerBulletRecoil; // 0x24c (0x4)
	bool bPerBulletRecoilRecoveryWhileFiring; // 0x250 (0x1)
	unsigned char unreflected_251[0x3]; // 0x251 (0x3) 
	float AthenaAimAssistRange; // 0x254 (0x4)
	float ADSTransitionInTime; // 0x258 (0x4)
	float ADSTransitionOutTime; // 0x25c (0x4)
	int MaxSpareAmmo; // 0x260 (0x4)
	int BulletsPerTracer; // 0x264 (0x4)
	float AIDelayBeforeFiringMin; // 0x268 (0x4)
	float AIDelayBeforeFiringMax; // 0x26c (0x4)
	float AIFireDurationMin; // 0x270 (0x4)
	float AIFireDurationMax; // 0x274 (0x4)
	float AIMinSpreadDuration; // 0x278 (0x4)
	float AIMaxSpreadDuration; // 0x27c (0x4)
	float AIDurationSpreadMultiplier; // 0x280 (0x4)
	float AIAdditionalSpreadForTargetMovingLaterally; // 0x284 (0x4)
	float AIAthenaHearFiringNoiseRange; // 0x288 (0x4)
	float EQSDensity; // 0x28c (0x4)
	float MinApproachRange; // 0x290 (0x4)
	float MinActualRange; // 0x294 (0x4)
	float MinPreferredRange; // 0x298 (0x4)
	float MinPreferredRangeEQS; // 0x29c (0x4)
	float MaxPreferredRangeEQS; // 0x2a0 (0x4)
	float MaxPreferredRange; // 0x2a4 (0x4)
	float MaxActualRange; // 0x2a8 (0x4)
	float MaxApproachRange; // 0x2ac (0x4)
	float RangeToAutomaticallyAddEnemyPawnGoals; // 0x2b0 (0x4)
	float SweepRadius; // 0x2b4 (0x4)
	float AutoReloadDelayOverride; // 0x2b8 (0x4)
	float OverheatingMaxValue; // 0x2bc (0x4)
	float OverheatHeatingValue; // 0x2c0 (0x4)
	float FullChargeOverheatHeatingValue; // 0x2c4 (0x4)
	float OverheatingCoolingValue; // 0x2c8 (0x4)
	float FullyOverheatedCoolingValue; // 0x2cc (0x4)
	float HeatingCooldownDelay; // 0x2d0 (0x4)
	float OverheatedCooldownDelay; // 0x2d4 (0x4)
	bool bCoolOverheatWhileCharging; // 0x2d8 (0x1)
	unsigned char unreflected_2d9[0x3]; // 0x2d9 (0x3) 
	float FortHomingTurnSpeedMin; // 0x2dc (0x4)
	float FortHomingTurnSpeedMax; // 0x2e0 (0x4)
	float FortHomingTimeUntilMaxTurnSpeed; // 0x2e4 (0x4)
	float AimAssistPullStrengthMultiplier; // 0x2e8 (0x4)
	float AimAssistSlowStrengthMultiplier; // 0x2ec (0x4)
	int BulletsPerBulletFireFX; // 0x2f0 (0x4)
	float MaxDamagePerCartridge; // 0x2f4 (0x4)
	unsigned char unreflected_2f8[0x8]; // 0x2f8 (0x8) 
	struct TArray<struct FFortRangedWeaponRecoil> PerBulletRecoil; // 0x300 (0x10)
	struct TArray<struct FFortBulletPatternEntryData> OverrideBulletPattern; // 0x310 (0x10)
};

