// ScriptStruct /Script/FortniteGame.FortFollowCam_Settings
// Size: 0x168
struct FFortFollowCam_Settings
{
	struct FScalableFloat TurnDampeningStart; // 0x0 (0x28)
	struct FScalableFloat TurnFullRate; // 0x28 (0x28)
	struct FScalableFloat TurnFullDeflectionThreshold; // 0x50 (0x28)
	struct FScalableFloat TurnBoostRate; // 0x78 (0x28)
	struct FScalableFloat TurnDampeningRecoveryRate; // 0xa0 (0x28)
	struct FScalableFloat TurnDeadZone; // 0xc8 (0x28)
	struct FScalableFloat HorizonPullDelay; // 0xf0 (0x28)
	struct FScalableFloat HorizonPullDampeningTime; // 0x118 (0x28)
	struct FScalableFloat HorizonPullHalfTime; // 0x140 (0x28)
};

