// ScriptStruct /Script/FortniteGame.FortCreativeDiscoveryContentPanel
// Size: 0x150
struct FFortCreativeDiscoveryContentPanel
{
	struct FName PanelName; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FText PanelDisplayName; // 0x8 (0x18)
	enum EFortCreativeDiscoveryPanelType PanelType; // 0x20 (0x1)
	enum EFortCreativeDiscoveryPanelOrdering PanelOrdering; // 0x21 (0x1)
	unsigned char unreflected_22[0x2]; // 0x22 (0x2) 
	int PageSize; // 0x24 (0x4)
	int NumPages; // 0x28 (0x4)
	unsigned char unreflected_2c[0x4]; // 0x2c (0x4) 
	struct TArray<struct FString> PlatformWhitelist; // 0x30 (0x10)
	struct TArray<struct FString> PlatformBlacklist; // 0x40 (0x10)
	struct TArray<struct FString> MMRegionAllowlist; // 0x50 (0x10)
	struct TArray<struct FString> MMRegionBlocklist; // 0x60 (0x10)
	struct TArray<struct FString> CountryCodeAllowlist; // 0x70 (0x10)
	struct TArray<struct FString> CountryCodeBlocklist; // 0x80 (0x10)
	struct TArray<struct FString> PanelLinkCodeBlacklist; // 0x90 (0x10)
	struct TArray<struct FString> PanelLinkCodeWhitelist; // 0xa0 (0x10)
	enum EFortCreativeDiscoverySkippedEntries EntrySkippingMethod; // 0xb0 (0x1)
	unsigned char unreflected_b1[0x3]; // 0xb1 (0x3) 
	int SkippedEntriesCount; // 0xb4 (0x4)
	float SkippedEntriesPercent; // 0xb8 (0x4)
	unsigned char unreflected_bc[0x4]; // 0xbc (0x4) 
	struct TArray<struct FName> FeatureTags; // 0xc0 (0x10)
	struct FString AnalyticsId; // 0xd0 (0x10)
	struct TArray<struct FString> CuratedListOfLinkCodes; // 0xe0 (0x10)
	struct FString MetricName; // 0xf0 (0x10)
	struct FString MetricInterval; // 0x100 (0x10)
	bool bLowestToHighest; // 0x110 (0x1)
	unsigned char unreflected_111[0x7]; // 0x111 (0x7) 
	struct FString ModelName; // 0x118 (0x10)
	enum EFortCreativeDiscoveryPlayHistoryType PlayHistoryType; // 0x128 (0x1)
	unsigned char unreflected_129[0x7]; // 0x129 (0x7) 
	struct FString AnalyticsListName; // 0x130 (0x10)
	struct TArray<struct FFortCreativeDiscoverySplicedEntry> SplicedEntries; // 0x140 (0x10)
};

