// ScriptStruct /Script/FortniteGame.FortAnimInput_PlayerSkydiveAnimAsset
// Size: 0xd8
struct FFortAnimInput_PlayerSkydiveAnimAsset
{
	class UBlendSpace* DiveBSFemale; // 0x0 (0x8)
	class UBlendSpace* DiveBSMale; // 0x8 (0x8)
	class UBlendSpace* DiveToGlideBSFemale; // 0x10 (0x8)
	class UBlendSpace* DiveToGlideBSMale; // 0x18 (0x8)
	class UBlendSpace* DiveLeanAdditiveBSFemale; // 0x20 (0x8)
	class UBlendSpace* DiveLeanAdditiveBSMale; // 0x28 (0x8)
	class UAnimSequence* DiveLeanCenterPose; // 0x30 (0x8)
	class UBlendSpace* DiveTurnAdditiveBSFemale; // 0x38 (0x8)
	class UBlendSpace* DiveTurnAdditiveBSMale; // 0x40 (0x8)
	class UBlendSpace* DiveDriftAAdditiveBS; // 0x48 (0x8)
	class UBlendSpace* DiveDriftBAdditiveBS; // 0x50 (0x8)
	class UBlendSpace* DiveDriftCAdditiveBS; // 0x58 (0x8)
	class UBlendSpace* DiveFidgetAAdditiveBS; // 0x60 (0x8)
	class UBlendSpace* DiveFidgetBAdditiveBS; // 0x68 (0x8)
	class UBlendSpace* DiveFidgetCAdditiveBS; // 0x70 (0x8)
	class UBlendSpace* GlideBSFemale; // 0x78 (0x8)
	class UBlendSpace* GlideBSMale; // 0x80 (0x8)
	class UBlendSpace* GlideToDiveBSFemale; // 0x88 (0x8)
	class UBlendSpace* GlideToDiveBSMale; // 0x90 (0x8)
	class UBlendSpace* GlideLeanAdditiveBSFemale; // 0x98 (0x8)
	class UBlendSpace* GlideLeanAdditiveBSMale; // 0xa0 (0x8)
	class UBlendSpace* GlideTurnAdditiveBSFemale; // 0xa8 (0x8)
	class UBlendSpace* GlideTurnAdditiveBSMale; // 0xb0 (0x8)
	class UAnimSequence* GlideDriftAAdditive; // 0xb8 (0x8)
	class UAnimSequence* GlideDriftBAdditive; // 0xc0 (0x8)
	class UAnimSequence* GlideDriftCAdditive; // 0xc8 (0x8)
	class UAnimSequence* GlideDriftZeroAdditive; // 0xd0 (0x8)
};

