// ScriptStruct /Script/FortniteGame.FortPartyRepData
// Size: 0x708
struct FFortPartyRepData : FPartyRepData
{
	struct FString PrimaryGameSessionId; // 0x80 (0x10)
	unsigned char unreflected_90[0x30]; // 0x90 (0x30) 
	enum EFortPartyState PartyState; // 0xc0 (0x1)
	unsigned char unreflected_c1[0x37]; // 0xc1 (0x37) 
	struct FFortPartyCampaignInfo CampaignInfo; // 0xf8 (0x18)
	unsigned char unreflected_110[0x120]; // 0x110 (0x120) 
	struct FString ZoneInstanceId; // 0x230 (0x10)
	unsigned char unreflected_240[0x30]; // 0x240 (0x30) 
	struct TArray<bool> TileStates; // 0x270 (0x10)
	unsigned char unreflected_280[0x30]; // 0x280 (0x30) 
	struct FFortPartyMatchmakingInfo PartyMatchmakingInfo; // 0x2b0 (0x50)
	unsigned char unreflected_300[0x30]; // 0x300 (0x30) 
	struct TArray<struct FFortCreativeDiscoverySurfaceRevision*> CreativeDiscoverySurfaceRevisions; // 0x330 (0x10)
	unsigned char unreflected_340[0x30]; // 0x340 (0x30) 
	struct FString CustomMatchKey; // 0x370 (0x10)
	unsigned char unreflected_380[0x30]; // 0x380 (0x30) 
	struct FPlaylistData PlaylistData; // 0x3b0 (0x58)
	unsigned char unreflected_408[0x30]; // 0x408 (0x30) 
	struct FOnlineLinkId CurrentGameMode; // 0x438 (0x18)
	unsigned char unreflected_450[0x30]; // 0x450 (0x30) 
	struct FDateTime* CreativePortalCountdownStartTime; // 0x480 (0x8)
	unsigned char unreflected_488[0x30]; // 0x488 (0x30) 
	struct FString ActivityName; // 0x4b8 (0x10)
	unsigned char unreflected_4c8[0x30]; // 0x4c8 (0x30) 
	enum EFortGameActivityType ActivityType; // 0x4f8 (0x1)
	unsigned char unreflected_4f9[0x37]; // 0x4f9 (0x37) 
	bool AllowJoinInProgress; // 0x530 (0x1)
	unsigned char unreflected_531[0x37]; // 0x531 (0x37) 
	struct FDateTime* LFGTime; // 0x568 (0x8)
	unsigned char unreflected_570[0x30]; // 0x570 (0x30) 
	bool AthenaSquadFill; // 0x5a0 (0x1)
	unsigned char unreflected_5a1[0x37]; // 0x5a1 (0x37) 
	bool AthenaPrivateMatch; // 0x5d8 (0x1)
	unsigned char unreflected_5d9[0x37]; // 0x5d9 (0x37) 
	bool PartyIsJoinedInProgress; // 0x610 (0x1)
	unsigned char unreflected_611[0x37]; // 0x611 (0x37) 
	struct FString GameSessionKey; // 0x648 (0x10)
	unsigned char unreflected_658[0x30]; // 0x658 (0x30) 
	struct TArray<struct FFortPartySquadAssignment> RawSquadAssignments; // 0x688 (0x10)
	unsigned char unreflected_698[0x30]; // 0x698 (0x30) 
	struct FString CurrentRegionId; // 0x6c8 (0x10)
	unsigned char padding_6d8[0x30]; // 0x6d8 (0x30)
};

