// ScriptStruct /Script/FortniteGame.FortAnimInput_PatrolAnimSet
// Size: 0x40
struct FFortAnimInput_PatrolAnimSet
{
	class UAnimSequence* PatrolIdlePose; // 0x0 (0x8)
	class UAnimSequence* PatrolIdleAdditive; // 0x8 (0x8)
	class UAnimMontage* AdditiveHitReactMontage; // 0x10 (0x8)
	class UAnimMontage* FullBodyHitReactMontage; // 0x18 (0x8)
	class UAnimMontage* PatrolToAlertMontage; // 0x20 (0x8)
	class UAnimMontage* AlertToCombatMontage; // 0x28 (0x8)
	class UBlendSpace* WalkBlendSpaceCore; // 0x30 (0x8)
	class UBlendSpace* WalkBlendSpaceAdditive; // 0x38 (0x8)
};

