// ScriptStruct /Script/Engine.GaussianSumBloomSettings
// Size: 0x84
struct FGaussianSumBloomSettings
{
	float Intensity; // 0x0 (0x4)
	float Threshold; // 0x4 (0x4)
	float SizeScale; // 0x8 (0x4)
	float Filter1Size; // 0xc (0x4)
	float Filter2Size; // 0x10 (0x4)
	float Filter3Size; // 0x14 (0x4)
	float Filter4Size; // 0x18 (0x4)
	float Filter5Size; // 0x1c (0x4)
	float Filter6Size; // 0x20 (0x4)
	struct FLinearColor Filter1Tint; // 0x24 (0x10)
	struct FLinearColor Filter2Tint; // 0x34 (0x10)
	struct FLinearColor Filter3Tint; // 0x44 (0x10)
	struct FLinearColor Filter4Tint; // 0x54 (0x10)
	struct FLinearColor Filter5Tint; // 0x64 (0x10)
	struct FLinearColor Filter6Tint; // 0x74 (0x10)
};

