// ScriptStruct /Script/FortniteGame.GearConfig
// Size: 0x18
struct FGearConfig
{
	float TopSpeed; // 0x0 (0x4)
	float MinSpeed; // 0x4 (0x4)
	float PushForce; // 0x8 (0x4)
	float RampTime; // 0xc (0x4)
	float SteeringAngleMultiplier; // 0x10 (0x4)
	unsigned char bAutoBrake; // 0x14 (0x1)
	unsigned char bIgnoreGravity; // 0x14 (0x1)
	unsigned char bForwardGear; // 0x14 (0x1)
	unsigned char padding_15[0x3]; // 0x15 (0x3)
};

