// ScriptStruct /Script/FortniteGame.GlobalWeatherData
// Size: 0xcb0
struct FGlobalWeatherData
{
	struct FString WeatherEventName; // 0x0 (0x10)
	struct FString RequiredCalendarEvent; // 0x10 (0x10)
	struct FGameplayTagContainer WeatherEventTags; // 0x20 (0x20)
	struct FScalableFloat EnableChanceMin; // 0x40 (0x28)
	struct FScalableFloat EnableChanceMax; // 0x68 (0x28)
	class UCurveFloat* Frequency; // 0x90 (0x8)
	struct FScalableFloat FrequencyMin; // 0x98 (0x28)
	struct FScalableFloat FrequencyMax; // 0xc0 (0x28)
	class UCurveFloat* Chance; // 0xe8 (0x8)
	struct FScalableFloat ChanceMin; // 0xf0 (0x28)
	struct FScalableFloat ChanceMax; // 0x118 (0x28)
	class UCurveFloat* ChanceMultiplierOverElapsedMinutes; // 0x140 (0x8)
	struct FScalableFloat DurationMin; // 0x148 (0x28)
	struct FScalableFloat DurationMax; // 0x170 (0x28)
	struct FScalableFloat CooldownMin; // 0x198 (0x28)
	struct FScalableFloat CooldownMax; // 0x1c0 (0x28)
	struct FScalableFloat ChanceToRemainActiveMin; // 0x1e8 (0x28)
	struct FScalableFloat ChanceToRemainActiveMax; // 0x210 (0x28)
	struct FScalableFloat BlendInMin; // 0x238 (0x28)
	struct FScalableFloat BlendInMax; // 0x260 (0x28)
	struct FScalableFloat BlendOutMin; // 0x288 (0x28)
	struct FScalableFloat BlendOutMax; // 0x2b0 (0x28)
	unsigned char unreflected_2d8[0x8]; // 0x2d8 (0x8) 
	struct FPostProcessSettings PostProcessSettings; // 0x2e0 (0x6e0)
	struct FFortTimeOfDayCurve_Float PostProcessBlendWeight; // 0x9c0 (0x10)
	struct FSkylightWeatherData SkylightWeatherData; // 0x9d0 (0x38)
	struct FDirectionalLightWeatherData DirectionalLightWeatherData; // 0xa08 (0x58)
	struct FExponentialHeightFogWeatherData ExponentialHeightFogWeatherData; // 0xa60 (0x128)
	struct FSkyAtmosphereWeatherData SkyAtmosphereWeatherData; // 0xb88 (0x38)
	struct FHeightFogAltitudeWeatherData HeightFogAltitudeWeatherData; // 0xbc0 (0x18)
	struct FMaterialWeatherData MaterialWeatherData; // 0xbd8 (0x10)
	struct FWindWeatherData WindWeatherData; // 0xbe8 (0x40)
	struct FAIWeatherData AIWeatherData; // 0xc28 (0x78)
	float TimeForNextAttempt; // 0xca0 (0x4)
	unsigned char bIsEnabled; // 0xca4 (0x1)
	unsigned char bOverridePostProcessBlendWeight; // 0xca4 (0x1)
	unsigned char padding_ca5[0xb]; // 0xca5 (0xb)
};

