// ScriptStruct /Script/Engine.GPUSpriteEmitterInfo
// Size: 0x350
struct FGPUSpriteEmitterInfo
{
	class UParticleModuleRequired* RequiredModule; // 0x0 (0x8)
	class UParticleModuleSpawn* SpawnModule; // 0x8 (0x8)
	class UParticleModuleSpawnPerUnit* SpawnPerUnitModule; // 0x10 (0x8)
	struct TArray<class UParticleModule*> SpawnModules; // 0x18 (0x10)
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	struct FGPUSpriteLocalVectorFieldInfo LocalVectorField; // 0x30 (0xd0)
	struct FFloatDistribution VectorFieldScale; // 0x100 (0x20)
	struct FFloatDistribution DragCoefficient; // 0x120 (0x20)
	struct FFloatDistribution PointAttractorStrength; // 0x140 (0x20)
	struct FFloatDistribution Resilience; // 0x160 (0x20)
	struct FVector ConstantAcceleration; // 0x180 (0x18)
	struct FVector PointAttractorPosition; // 0x198 (0x18)
	float PointAttractorRadiusSq; // 0x1b0 (0x4)
	unsigned char unreflected_1b4[0x4]; // 0x1b4 (0x4) 
	struct FVector OrbitOffsetBase; // 0x1b8 (0x18)
	struct FVector OrbitOffsetRange; // 0x1d0 (0x18)
	struct FVector2D InvMaxSize; // 0x1e8 (0x10)
	float InvRotationRateScale; // 0x1f8 (0x4)
	float MaxLifetime; // 0x1fc (0x4)
	int MaxParticleCount; // 0x200 (0x4)
	struct TEnumAsByte<EParticleScreenAlignment> ScreenAlignment; // 0x204 (0x1)
	struct TEnumAsByte<EParticleAxisLock> LockAxisFlag; // 0x205 (0x1)
	unsigned char unreflected_206[0x2]; // 0x206 (0x2) 
	unsigned char bEnableCollision; // 0x208 (0x1)
	unsigned char unreflected_209[0x3]; // 0x209 (0x3) 
	struct TEnumAsByte<EParticleCollisionMode> CollisionMode; // 0x20c (0x1)
	unsigned char unreflected_20d[0x3]; // 0x20d (0x3) 
	unsigned char bRemoveHMDRoll; // 0x210 (0x1)
	unsigned char unreflected_211[0x3]; // 0x211 (0x3) 
	float MinFacingCameraBlendDistance; // 0x214 (0x4)
	float MaxFacingCameraBlendDistance; // 0x218 (0x4)
	unsigned char unreflected_21c[0x4]; // 0x21c (0x4) 
	struct FRawDistributionVector DynamicColor; // 0x220 (0x60)
	struct FRawDistributionFloat DynamicAlpha; // 0x280 (0x30)
	struct FRawDistributionVector DynamicColorScale; // 0x2b0 (0x60)
	struct FRawDistributionFloat DynamicAlphaScale; // 0x310 (0x30)
	unsigned char padding_340[0x10]; // 0x340 (0x10)
};

