// ScriptStruct /Script/Engine.GPUSpriteResourceData
// Size: 0x240
struct FGPUSpriteResourceData
{
	struct TArray<struct FColor> QuantizedColorSamples; // 0x0 (0x10)
	struct TArray<struct FColor> QuantizedMiscSamples; // 0x10 (0x10)
	struct TArray<struct FColor> QuantizedSimulationAttrSamples; // 0x20 (0x10)
	struct FVector4 ColorScale; // 0x30 (0x20)
	struct FVector4 ColorBias; // 0x50 (0x20)
	struct FVector4 MiscScale; // 0x70 (0x20)
	struct FVector4 MiscBias; // 0x90 (0x20)
	struct FVector4 SimulationAttrCurveScale; // 0xb0 (0x20)
	struct FVector4 SimulationAttrCurveBias; // 0xd0 (0x20)
	struct FVector4 SubImageSize; // 0xf0 (0x20)
	struct FVector4 SizeBySpeed; // 0x110 (0x20)
	struct FVector ConstantAcceleration; // 0x130 (0x18)
	struct FVector OrbitOffsetBase; // 0x148 (0x18)
	struct FVector OrbitOffsetRange; // 0x160 (0x18)
	struct FVector OrbitFrequencyBase; // 0x178 (0x18)
	struct FVector OrbitFrequencyRange; // 0x190 (0x18)
	struct FVector OrbitPhaseBase; // 0x1a8 (0x18)
	struct FVector OrbitPhaseRange; // 0x1c0 (0x18)
	float GlobalVectorFieldScale; // 0x1d8 (0x4)
	float GlobalVectorFieldTightness; // 0x1dc (0x4)
	float PerParticleVectorFieldScale; // 0x1e0 (0x4)
	float PerParticleVectorFieldBias; // 0x1e4 (0x4)
	float DragCoefficientScale; // 0x1e8 (0x4)
	float DragCoefficientBias; // 0x1ec (0x4)
	float ResilienceScale; // 0x1f0 (0x4)
	float ResilienceBias; // 0x1f4 (0x4)
	float CollisionRadiusScale; // 0x1f8 (0x4)
	float CollisionRadiusBias; // 0x1fc (0x4)
	float CollisionTimeBias; // 0x200 (0x4)
	float CollisionRandomSpread; // 0x204 (0x4)
	float CollisionRandomDistribution; // 0x208 (0x4)
	float OneMinusFriction; // 0x20c (0x4)
	float RotationRateScale; // 0x210 (0x4)
	float CameraMotionBlurAmount; // 0x214 (0x4)
	struct TEnumAsByte<EParticleScreenAlignment> ScreenAlignment; // 0x218 (0x1)
	struct TEnumAsByte<EParticleAxisLock> LockAxisFlag; // 0x219 (0x1)
	unsigned char unreflected_21a[0x6]; // 0x21a (0x6) 
	struct FVector2D PivotOffset; // 0x220 (0x10)
	unsigned char bRemoveHMDRoll; // 0x230 (0x1)
	unsigned char unreflected_231[0x3]; // 0x231 (0x3) 
	float MinFacingCameraBlendDistance; // 0x234 (0x4)
	float MaxFacingCameraBlendDistance; // 0x238 (0x4)
	unsigned char padding_23c[0x4]; // 0x23c (0x4)
};

