// ScriptStruct /Script/FortniteGame.InspectorScreenshotContext
// Size: 0x30
struct FInspectorScreenshotContext
{
	float DelaySeconds; // 0x0 (0x4)
	float FOVAngle; // 0x4 (0x4)
	uint32_t ResX; // 0x8 (0x4)
	uint32_t ResY; // 0xc (0x4)
	uint32_t SampleMultiplier; // 0x10 (0x4)
	unsigned char unreflected_14[0x4]; // 0x14 (0x4) 
	struct FString ResponseUri; // 0x18 (0x10)
	unsigned char padding_28[0x8]; // 0x28 (0x8)
};

