// ScriptStruct /Script/Engine.ISMComponentDescriptor
// Size: 0x1f0
struct FISMComponentDescriptor
{
	uint32_t Hash; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	class UClass* ComponentClass; // 0x8 (0x8)
	class UStaticMesh* StaticMesh; // 0x10 (0x8)
	struct TArray<class UMaterialInterface*> OverrideMaterials; // 0x18 (0x10)
	struct TArray<class URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x28 (0x10)
	struct TEnumAsByte<EComponentMobility> Mobility; // 0x38 (0x1)
	enum ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x39 (0x1)
	enum ELightmapType LightmapType; // 0x3a (0x1)
	struct FLightingChannels LightingChannels; // 0x3b (0x1)
	int RayTracingGroupId; // 0x3c (0x4)
	enum ERayTracingGroupCullingPriority RayTracingGroupCullingPriority; // 0x40 (0x1)
	struct TEnumAsByte<EHasCustomNavigableGeometry> bHasCustomNavigableGeometry; // 0x41 (0x1)
	enum ERendererStencilMask CustomDepthStencilWriteMask; // 0x42 (0x1)
	unsigned char unreflected_43[0x5]; // 0x43 (0x5) 
	struct FBodyInstance BodyInstance; // 0x48 (0x188)
	int InstanceStartCullDistance; // 0x1d0 (0x4)
	int InstanceEndCullDistance; // 0x1d4 (0x4)
	int VirtualTextureCullMips; // 0x1d8 (0x4)
	int TranslucencySortPriority; // 0x1dc (0x4)
	int OverriddenLightMapRes; // 0x1e0 (0x4)
	int CustomDepthStencilValue; // 0x1e4 (0x4)
	unsigned char bCastShadow; // 0x1e8 (0x1)
	unsigned char bCastDynamicShadow; // 0x1e8 (0x1)
	unsigned char bCastStaticShadow; // 0x1e8 (0x1)
	unsigned char bCastContactShadow; // 0x1e8 (0x1)
	unsigned char bCastShadowAsTwoSided; // 0x1e8 (0x1)
	unsigned char bAffectDynamicIndirectLighting; // 0x1e8 (0x1)
	unsigned char bAffectDistanceFieldLighting; // 0x1e8 (0x1)
	unsigned char bReceivesDecals; // 0x1e8 (0x1)
	unsigned char bOverrideLightMapRes; // 0x1e9 (0x1)
	unsigned char bUseAsOccluder; // 0x1e9 (0x1)
	unsigned char bEnableDensityScaling; // 0x1e9 (0x1)
	unsigned char bEnableDiscardOnLoad; // 0x1e9 (0x1)
	unsigned char bRenderCustomDepth; // 0x1e9 (0x1)
	unsigned char bVisibleInRayTracing; // 0x1e9 (0x1)
	unsigned char bHiddenInGame; // 0x1e9 (0x1)
	unsigned char bIsEditorOnly; // 0x1e9 (0x1)
	unsigned char bVisible; // 0x1ea (0x1)
	unsigned char bEvaluateWorldPositionOffset; // 0x1ea (0x1)
	unsigned char bIsLocalToWorldDeterminantNegative; // 0x1ea (0x1)
	unsigned char padding_1eb[0x5]; // 0x1eb (0x5)
};

