// ScriptStruct /Script/Engine.LightmassMaterialInterfaceSettings
// Size: 0x10
struct FLightmassMaterialInterfaceSettings
{
	float EmissiveBoost; // 0x0 (0x4)
	float DiffuseBoost; // 0x4 (0x4)
	float ExportResolutionScale; // 0x8 (0x4)
	unsigned char bCastShadowAsMasked; // 0xc (0x1)
	unsigned char bOverrideCastShadowAsMasked; // 0xc (0x1)
	unsigned char bOverrideEmissiveBoost; // 0xc (0x1)
	unsigned char bOverrideDiffuseBoost; // 0xc (0x1)
	unsigned char bOverrideExportResolutionScale; // 0xc (0x1)
	unsigned char padding_d[0x3]; // 0xd (0x3)
};

