// ScriptStruct /Script/MaterialShaderQualitySettings.MaterialQualityOverrides
// Size: 0x8
struct FMaterialQualityOverrides
{
	bool bDiscardQualityDuringCook; // 0x0 (0x1)
	bool bEnableOverride; // 0x1 (0x1)
	bool bForceFullyRough; // 0x2 (0x1)
	bool bForceNonMetal; // 0x3 (0x1)
	bool bForceDisableLMDirectionality; // 0x4 (0x1)
	bool bForceDisablePreintegratedGF; // 0x5 (0x1)
	bool bDisableMaterialNormalCalculation; // 0x6 (0x1)
	enum EMobileShadowQuality MobileShadowQuality; // 0x7 (0x1)
};

