// ScriptStruct /Script/Engine.MaterialProxySettings
// Size: 0x94
struct FMaterialProxySettings
{
	struct TEnumAsByte<ETextureSizingType> TextureSizingType; // 0x0 (0x1)
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FIntPoint* TextureSize; // 0x4 (0x8)
	float TargetTexelDensityPerMeter; // 0xc (0x4)
	float MeshMaxScreenSizePercent; // 0x10 (0x4)
	float MeshMinDrawDistance; // 0x14 (0x4)
	float GutterSpace; // 0x18 (0x4)
	float MetallicConstant; // 0x1c (0x4)
	float RoughnessConstant; // 0x20 (0x4)
	float AnisotropyConstant; // 0x24 (0x4)
	float SpecularConstant; // 0x28 (0x4)
	float OpacityConstant; // 0x2c (0x4)
	float OpacityMaskConstant; // 0x30 (0x4)
	float AmbientOcclusionConstant; // 0x34 (0x4)
	struct TEnumAsByte<EMaterialMergeType> MaterialMergeType; // 0x38 (0x1)
	struct TEnumAsByte<EBlendMode> BlendMode; // 0x39 (0x1)
	unsigned char bAllowTwoSidedMaterial; // 0x3a (0x1)
	unsigned char bNormalMap; // 0x3a (0x1)
	unsigned char bTangentMap; // 0x3a (0x1)
	unsigned char bMetallicMap; // 0x3a (0x1)
	unsigned char bRoughnessMap; // 0x3a (0x1)
	unsigned char bAnisotropyMap; // 0x3a (0x1)
	unsigned char bSpecularMap; // 0x3a (0x1)
	unsigned char bEmissiveMap; // 0x3a (0x1)
	unsigned char bOpacityMap; // 0x3b (0x1)
	unsigned char bOpacityMaskMap; // 0x3b (0x1)
	unsigned char bAmbientOcclusionMap; // 0x3b (0x1)
	struct FIntPoint* DiffuseTextureSize; // 0x3c (0x8)
	struct FIntPoint* NormalTextureSize; // 0x44 (0x8)
	struct FIntPoint* TangentTextureSize; // 0x4c (0x8)
	struct FIntPoint* MetallicTextureSize; // 0x54 (0x8)
	struct FIntPoint* RoughnessTextureSize; // 0x5c (0x8)
	struct FIntPoint* AnisotropyTextureSize; // 0x64 (0x8)
	struct FIntPoint* SpecularTextureSize; // 0x6c (0x8)
	struct FIntPoint* EmissiveTextureSize; // 0x74 (0x8)
	struct FIntPoint* OpacityTextureSize; // 0x7c (0x8)
	struct FIntPoint* OpacityMaskTextureSize; // 0x84 (0x8)
	struct FIntPoint* AmbientOcclusionTextureSize; // 0x8c (0x8)
};

