// DelegateFunction /Script/FortniteGame.MediaRegionLockCanPlayContentInRegionComplete__DelegateSignature
// Size: 0x40
struct FMediaRegionLockCanPlayContentInRegionComplete__DelegateSignature
{
	bool bResolved; // 0x0 (0x1)
	bool bApproved; // 0x1 (0x1)
	unsigned char unreflected_2[0x6]; // 0x2 (0x6) 
	struct FString InURL; // 0x8 (0x10)
	struct FString Limits; // 0x18 (0x10)
	struct FString ContentId; // 0x28 (0x10)
	bool bBulk; // 0x38 (0x1)
	unsigned char padding_39[0x7]; // 0x39 (0x7)
};

