// ScriptStruct /Script/FortniteGame.MeshNetworkEditorSettings
// Size: 0x28
struct FMeshNetworkEditorSettings
{
	bool bEnableMeshNetwork; // 0x0 (0x1)
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	int BaseMeshPort; // 0x4 (0x4)
	int BaseMeshGamePort; // 0x8 (0x4)
	int NumRootClients; // 0xc (0x4)
	int RootLoginStartIndex; // 0x10 (0x4)
	unsigned char unreflected_14[0x4]; // 0x14 (0x4) 
	struct FString MeshMetadata; // 0x18 (0x10)
};

