// ScriptStruct /Script/FortniteGame.MtxPackage
// Size: 0xb0
struct FMtxPackage
{
	struct FString StorefrontName; // 0x0 (0x10)
	struct FString OfferId; // 0x10 (0x10)
	struct FText Title; // 0x20 (0x18)
	struct FText Description; // 0x38 (0x18)
	int TotalAmount; // 0x50 (0x4)
	int BonusAmount; // 0x54 (0x4)
	struct FText Price; // 0x58 (0x18)
	unsigned char unreflected_70[0x8]; // 0x70 (0x8) 
	struct FText SaleBasePrice; // 0x78 (0x18)
	struct FString DisplayAssetPath; // 0x90 (0x10)
	struct FString BannerOverride; // 0xa0 (0x10)
};

