// ScriptStruct /Script/FortniteGame.NativeCurieFXTypeSettings
// Size: 0x120
struct FNativeCurieFXTypeSettings
{
	struct FRuntimeFloatCurve GlowFadeInCurve; // 0x0 (0x88)
	struct FRuntimeFloatCurve GlowFadeOutCurve; // 0x88 (0x88)
	int GlowPriority; // 0x110 (0x4)
	float GlowMaterialIdx; // 0x114 (0x4)
	unsigned char bNeedsSignificanceTracking; // 0x118 (0x1)
	unsigned char bNeedsGlow; // 0x118 (0x1)
	unsigned char bNeedsAmbientAudio; // 0x118 (0x1)
	unsigned char padding_119[0x7]; // 0x119 (0x7)
};

