// ScriptStruct /Script/NavigationSystem.NavigationFilterFlags
// Size: 0x4
struct FNavigationFilterFlags
{
	unsigned char bNavFlag0; // 0x0 (0x1)
	unsigned char bNavFlag1; // 0x0 (0x1)
	unsigned char bNavFlag2; // 0x0 (0x1)
	unsigned char bNavFlag3; // 0x0 (0x1)
	unsigned char bNavFlag4; // 0x0 (0x1)
	unsigned char bNavFlag5; // 0x0 (0x1)
	unsigned char bNavFlag6; // 0x0 (0x1)
	unsigned char bNavFlag7; // 0x0 (0x1)
	unsigned char bNavFlag8; // 0x1 (0x1)
	unsigned char bNavFlag9; // 0x1 (0x1)
	unsigned char bNavFlag10; // 0x1 (0x1)
	unsigned char bNavFlag11; // 0x1 (0x1)
	unsigned char bNavFlag12; // 0x1 (0x1)
	unsigned char bNavFlag13; // 0x1 (0x1)
	unsigned char bNavFlag14; // 0x1 (0x1)
	unsigned char bNavFlag15; // 0x1 (0x1)
	unsigned char padding_2[0x2]; // 0x2 (0x2)
};

