// ScriptStruct /Script/Engine.NavAvoidanceMask
// Size: 0x4
struct FNavAvoidanceMask
{
	unsigned char bGroup0; // 0x0 (0x1)
	unsigned char bGroup1; // 0x0 (0x1)
	unsigned char bGroup2; // 0x0 (0x1)
	unsigned char bGroup3; // 0x0 (0x1)
	unsigned char bGroup4; // 0x0 (0x1)
	unsigned char bGroup5; // 0x0 (0x1)
	unsigned char bGroup6; // 0x0 (0x1)
	unsigned char bGroup7; // 0x0 (0x1)
	unsigned char bGroup8; // 0x1 (0x1)
	unsigned char bGroup9; // 0x1 (0x1)
	unsigned char bGroup10; // 0x1 (0x1)
	unsigned char bGroup11; // 0x1 (0x1)
	unsigned char bGroup12; // 0x1 (0x1)
	unsigned char bGroup13; // 0x1 (0x1)
	unsigned char bGroup14; // 0x1 (0x1)
	unsigned char bGroup15; // 0x1 (0x1)
	unsigned char bGroup16; // 0x2 (0x1)
	unsigned char bGroup17; // 0x2 (0x1)
	unsigned char bGroup18; // 0x2 (0x1)
	unsigned char bGroup19; // 0x2 (0x1)
	unsigned char bGroup20; // 0x2 (0x1)
	unsigned char bGroup21; // 0x2 (0x1)
	unsigned char bGroup22; // 0x2 (0x1)
	unsigned char bGroup23; // 0x2 (0x1)
	unsigned char bGroup24; // 0x3 (0x1)
	unsigned char bGroup25; // 0x3 (0x1)
	unsigned char bGroup26; // 0x3 (0x1)
	unsigned char bGroup27; // 0x3 (0x1)
	unsigned char bGroup28; // 0x3 (0x1)
	unsigned char bGroup29; // 0x3 (0x1)
	unsigned char bGroup30; // 0x3 (0x1)
	unsigned char bGroup31; // 0x3 (0x1)
};

