// ScriptStruct /Script/Engine.NavAgentSelector
// Size: 0x4
struct FNavAgentSelector
{
	unsigned char bSupportsAgent0; // 0x0 (0x1)
	unsigned char bSupportsAgent1; // 0x0 (0x1)
	unsigned char bSupportsAgent2; // 0x0 (0x1)
	unsigned char bSupportsAgent3; // 0x0 (0x1)
	unsigned char bSupportsAgent4; // 0x0 (0x1)
	unsigned char bSupportsAgent5; // 0x0 (0x1)
	unsigned char bSupportsAgent6; // 0x0 (0x1)
	unsigned char bSupportsAgent7; // 0x0 (0x1)
	unsigned char bSupportsAgent8; // 0x1 (0x1)
	unsigned char bSupportsAgent9; // 0x1 (0x1)
	unsigned char bSupportsAgent10; // 0x1 (0x1)
	unsigned char bSupportsAgent11; // 0x1 (0x1)
	unsigned char bSupportsAgent12; // 0x1 (0x1)
	unsigned char bSupportsAgent13; // 0x1 (0x1)
	unsigned char bSupportsAgent14; // 0x1 (0x1)
	unsigned char bSupportsAgent15; // 0x1 (0x1)
	unsigned char padding_2[0x2]; // 0x2 (0x2)
};

