// ScriptStruct /Script/Niagara.NiagaraDebugHUDSettingsData
// Size: 0x238
struct FNiagaraDebugHUDSettingsData
{
	bool bHudEnabled; // 0x0 (0x1)
	bool bHudRenderingEnabled; // 0x1 (0x1)
	bool bValidateSystemSimulationDataBuffers; // 0x2 (0x1)
	bool bValidateParticleDataBuffers; // 0x3 (0x1)
	bool bOverviewEnabled; // 0x4 (0x1)
	unsigned char unreflected_5[0x3]; // 0x5 (0x3) 
	enum ENiagaraDebugHUDOverviewMode OverviewMode; // 0x8 (0x4)
	enum ENiagaraDebugHudFont OverviewFont; // 0xc (0x4)
	struct FVector2D OverviewLocation; // 0x10 (0x10)
	bool bShowRegisteredComponents; // 0x20 (0x1)
	bool bOverviewShowFilteredSystemOnly; // 0x21 (0x1)
	unsigned char unreflected_22[0x6]; // 0x22 (0x6) 
	struct FString ActorFilter; // 0x28 (0x10)
	bool bComponentFilterEnabled; // 0x38 (0x1)
	unsigned char unreflected_39[0x7]; // 0x39 (0x7) 
	struct FString ComponentFilter; // 0x40 (0x10)
	bool bSystemFilterEnabled; // 0x50 (0x1)
	unsigned char unreflected_51[0x7]; // 0x51 (0x7) 
	struct FString SystemFilter; // 0x58 (0x10)
	bool bEmitterFilterEnabled; // 0x68 (0x1)
	unsigned char unreflected_69[0x7]; // 0x69 (0x7) 
	struct FString EmitterFilter; // 0x70 (0x10)
	bool bActorFilterEnabled; // 0x80 (0x1)
	unsigned char unreflected_81[0x3]; // 0x81 (0x3) 
	enum ENiagaraDebugHudVerbosity SystemDebugVerbosity; // 0x84 (0x4)
	enum ENiagaraDebugHudVerbosity SystemEmitterVerbosity; // 0x88 (0x4)
	enum ENiagaraDebugHudVerbosity DataInterfaceVerbosity; // 0x8c (0x4)
	bool bSystemShowBounds; // 0x90 (0x1)
	unsigned char unreflected_91[0x3]; // 0x91 (0x3) 
	float SystemBoundsSolidBoxAlpha; // 0x94 (0x4)
	bool bSystemShowActiveOnlyInWorld; // 0x98 (0x1)
	bool bShowSystemVariables; // 0x99 (0x1)
	unsigned char unreflected_9a[0x6]; // 0x9a (0x6) 
	struct TArray<struct FNiagaraDebugHUDVariable> SystemVariables; // 0xa0 (0x10)
	struct FNiagaraDebugHudTextOptions SystemTextOptions; // 0xb0 (0x18)
	bool bShowParticleVariables; // 0xc8 (0x1)
	bool bEnableGpuParticleReadback; // 0xc9 (0x1)
	bool bShowParticleIndex; // 0xca (0x1)
	unsigned char unreflected_cb[0x5]; // 0xcb (0x5) 
	struct TArray<struct FNiagaraDebugHUDVariable> ParticlesVariables; // 0xd0 (0x10)
	struct FNiagaraDebugHudTextOptions ParticleTextOptions; // 0xe0 (0x18)
	bool bShowParticlesVariablesWithSystem; // 0xf8 (0x1)
	bool bShowParticleVariablesVertical; // 0xf9 (0x1)
	bool bUseMaxParticlesToDisplay; // 0xfa (0x1)
	bool bUseParticleDisplayClip; // 0xfb (0x1)
	unsigned char unreflected_fc[0x4]; // 0xfc (0x4) 
	struct FVector2D ParticleDisplayClip; // 0x100 (0x10)
	bool bUseParticleDisplayCenterRadius; // 0x110 (0x1)
	unsigned char unreflected_111[0x3]; // 0x111 (0x3) 
	float ParticleDisplayCenterRadius; // 0x114 (0x4)
	int MaxParticlesToDisplay; // 0x118 (0x4)
	int PerfReportFrames; // 0x11c (0x4)
	enum ENiagaraDebugHUDPerfSampleMode PerfSampleMode; // 0x120 (0x4)
	enum ENiagaraDebugHUDPerfGraphMode PerfGraphMode; // 0x124 (0x4)
	int PerfHistoryFrames; // 0x128 (0x4)
	float PerfGraphTimeRange; // 0x12c (0x4)
	struct FVector2D PerfGraphSize; // 0x130 (0x10)
	struct FLinearColor PerfGraphAxisColor; // 0x140 (0x10)
	bool bEnableSmoothing; // 0x150 (0x1)
	unsigned char unreflected_151[0x3]; // 0x151 (0x3) 
	int SmoothingWidth; // 0x154 (0x4)
	struct FLinearColor DefaultBackgroundColor; // 0x158 (0x10)
	struct FLinearColor OverviewHeadingColor; // 0x168 (0x10)
	struct FLinearColor OverviewDetailColor; // 0x178 (0x10)
	struct FLinearColor OverviewDetailHighlightColor; // 0x188 (0x10)
	struct FLinearColor InWorldErrorTextColor; // 0x198 (0x10)
	struct FLinearColor InWorldTextColor; // 0x1a8 (0x10)
	struct FLinearColor MessageInfoTextColor; // 0x1b8 (0x10)
	struct FLinearColor MessageWarningTextColor; // 0x1c8 (0x10)
	struct FLinearColor MessageErrorTextColor; // 0x1d8 (0x10)
	float SystemColorTableOpacity; // 0x1e8 (0x4)
	uint32_t SystemColorSeed; // 0x1ec (0x4)
	struct FVector SystemColorHSVMin; // 0x1f0 (0x18)
	struct FVector SystemColorHSVMax; // 0x208 (0x18)
	enum ENiagaraDebugPlaybackMode PlaybackMode; // 0x220 (0x1)
	bool bPlaybackRateEnabled; // 0x221 (0x1)
	unsigned char unreflected_222[0x2]; // 0x222 (0x2) 
	float PlaybackRate; // 0x224 (0x4)
	bool bLoopTimeEnabled; // 0x228 (0x1)
	unsigned char unreflected_229[0x3]; // 0x229 (0x3) 
	float LoopTime; // 0x22c (0x4)
	bool bShowGlobalBudgetInfo; // 0x230 (0x1)
	unsigned char padding_231[0x7]; // 0x231 (0x7)
};

