// DelegateFunction /Script/FortniteGame.OnDeathPlayEffectsDelegate__DelegateSignature
// Size: 0x148
struct FOnDeathPlayEffectsDelegate__DelegateSignature
{
	float Damage; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FGameplayTagContainer DamageTags; // 0x8 (0x20)
	struct FVector Momentum; // 0x28 (0x18)
	struct FHitResult HitInfo; // 0x40 (0xe0)
	class AFortPawn* InstigatedBy; // 0x120 (0x8)
	class AActor* DamageCauser; // 0x128 (0x8)
	struct FGameplayEffectContextHandle EffectContext; // 0x130 (0x18)
};

