// ScriptStruct /Script/Account.OnlineAccountTexts_FailedLoginConsole
// Size: 0x138
struct FOnlineAccountTexts_FailedLoginConsole
{
	struct FText AgeRestriction; // 0x0 (0x18)
	struct FText Generic; // 0x18 (0x18)
	struct FText MissingAuthAssociation; // 0x30 (0x18)
	struct FText NeedPremiumAccount; // 0x48 (0x18)
	struct FText OnlinePlayRestriction; // 0x60 (0x18)
	struct FText PatchAvailable; // 0x78 (0x18)
	struct FText PleaseSignIn; // 0x90 (0x18)
	struct FText SystemUpdateAvailable; // 0xa8 (0x18)
	struct FText UI; // 0xc0 (0x18)
	struct FText UnableToComplete; // 0xd8 (0x18)
	struct FText UnableToSignIn; // 0xf0 (0x18)
	struct FText UnableToStartPrivCheck; // 0x108 (0x18)
	struct FText UnexpectedError; // 0x120 (0x18)
};

