// ScriptStruct /Script/Account.OnlineAccountTexts
// Size: 0x9d8
struct FOnlineAccountTexts
{
	struct FText AllGiftCodesUsed; // 0x0 (0x18)
	struct FText AssociateConsoleAuth; // 0x18 (0x18)
	struct FText AutoLoginFailed; // 0x30 (0x18)
	struct FText AutoLoginFailedMobile; // 0x48 (0x18)
	struct FText BannedFromGame; // 0x60 (0x18)
	struct FText CheckEntitledToPlay; // 0x78 (0x18)
	struct FText CheckingRejoin; // 0x90 (0x18)
	struct FText CheckServiceAvailability; // 0xa8 (0x18)
	struct FText ConsolePrivileges; // 0xc0 (0x18)
	struct FText CreateAccountCompleted; // 0xd8 (0x18)
	struct FText CreateAccountFailure; // 0xf0 (0x18)
	struct FText CreateHeadless; // 0x108 (0x18)
	struct FText DoQosPingTests; // 0x120 (0x18)
	struct FText DowntimeMinutesWarningText; // 0x138 (0x18)
	struct FText DowntimeSecondsWarningText; // 0x150 (0x18)
	struct FText DuplicateAuthAssociaton; // 0x168 (0x18)
	struct FText EulaCheck; // 0x180 (0x18)
	struct FText ExchangeConsoleGiftsForAccess; // 0x198 (0x18)
	struct FText FailedAccountCreate; // 0x1b0 (0x18)
	struct FText FailedEulaCheckEulaAcceptanceFailed; // 0x1c8 (0x18)
	struct FText FailedEulaCheckMustAcceptEula; // 0x1e0 (0x18)
	struct FText FailedLoginCredentialsMsg; // 0x1f8 (0x18)
	struct FText FailedLoginAgeVerificationIncomplete; // 0x210 (0x18)
	struct FText FailedLoginParentalLock; // 0x228 (0x18)
	struct FText FailedLoginNoRealId; // 0x240 (0x18)
	struct FText FailedLoginLockoutMsg; // 0x258 (0x18)
	struct FText FailedLoginRequiresMFA; // 0x270 (0x18)
	struct FText FailedLoginRequiresAuthAppMFA; // 0x288 (0x18)
	struct FText FailedInvalidMFA; // 0x2a0 (0x18)
	struct FText FailedLoginRequiresCorrectiveAction; // 0x2b8 (0x18)
	struct FText FailedLoginMsg; // 0x2d0 (0x18)
	struct FText FailedLoginMsgInvalidRefreshToken; // 0x2e8 (0x18)
	struct FText FailedLoginTencentUnableToSignIn; // 0x300 (0x18)
	struct FText FailedLoginTencentNotSignedInToWeGame; // 0x318 (0x18)
	struct FText FailedLoginTencentFailedToInitializeWeGame; // 0x330 (0x18)
	struct FText FailedLoginTencentWeGameSystemOffline; // 0x348 (0x18)
	struct FText TencentExitByAntiAddiction; // 0x360 (0x18)
	struct FText FailedStartLogin; // 0x378 (0x18)
	struct FText FounderChatExitedText; // 0x390 (0x18)
	struct FText FounderChatJoinedText; // 0x3a8 (0x18)
	struct FText GameDisplayName; // 0x3c0 (0x18)
	struct FText GeneralLoginFailure; // 0x3d8 (0x18)
	struct FText GlobalChatExitedText; // 0x3f0 (0x18)
	struct FText GlobalChatJoinedText; // 0x408 (0x18)
	struct FText HeadlessAccountFailed; // 0x420 (0x18)
	struct FText InMatchShutdownTimeWarningText; // 0x438 (0x18)
	struct FText InvalidUser; // 0x450 (0x18)
	struct FText LoggedOutofMCP; // 0x468 (0x18)
	struct FText DisconnectedFromMCP; // 0x480 (0x18)
	struct FText LoggedOutReturnedToTitle; // 0x498 (0x18)
	struct FText LoggedOutSwitchedProfile; // 0x4b0 (0x18)
	struct FText LoggingIn; // 0x4c8 (0x18)
	struct FText LoggingInConsoleAuth; // 0x4e0 (0x18)
	struct FText LoggingOut; // 0x4f8 (0x18)
	struct FText LoginConsole; // 0x510 (0x18)
	struct FText LoginFailure; // 0x528 (0x18)
	struct FText LogoutUnlink; // 0x540 (0x18)
	struct FText LogoutCompleted; // 0x558 (0x18)
	struct FText LostConnection; // 0x570 (0x18)
	struct FText LoginStepTimeout; // 0x588 (0x18)
	struct FText MCPTimeout; // 0x5a0 (0x18)
	struct FText LightswitchCheckNetworkFailureMsg; // 0x5b8 (0x18)
	struct FText NetworkConnectionUnavailable; // 0x5d0 (0x18)
	struct FText NoPlayEntitlement; // 0x5e8 (0x18)
	struct FText NoServerAccess; // 0x600 (0x18)
	struct FText PlayAccessRevoked; // 0x618 (0x18)
	struct FText PremiumAccountNameDefault; // 0x630 (0x18)
	struct FText PremiumAccountNameSony; // 0x648 (0x18)
	struct FText PremiumAccountNameSwitch; // 0x660 (0x18)
	struct FText PremiumAccountNameXboxOne; // 0x678 (0x18)
	struct FText RedeemOfflinePurchases; // 0x690 (0x18)
	struct FText ServiceDowntime; // 0x6a8 (0x18)
	struct FText SignInCompleting; // 0x6c0 (0x18)
	struct FText SignIntoConsoleServices; // 0x6d8 (0x18)
	struct FText TokenExpired; // 0x6f0 (0x18)
	struct FText UnableToConnect; // 0x708 (0x18)
	struct FText UnableToJoinWaitingRoomLoginQueue; // 0x720 (0x18)
	struct FText UnexpectedConsoleAuthFailure; // 0x738 (0x18)
	struct FText UnlinkConsoleFailed; // 0x750 (0x18)
	struct FText UserLoginFailed; // 0x768 (0x18)
	struct FText WaitingRoom; // 0x780 (0x18)
	struct FText WaitingRoomError; // 0x798 (0x18)
	struct FText WaitingRoomFailure; // 0x7b0 (0x18)
	struct FText WaitingRoomWaiting; // 0x7c8 (0x18)
	struct FOnlineAccountTexts_FailedLoginConsole FailedLoginConsole; // 0x7e0 (0x138)
	struct FText LoggingInExternalAuth; // 0x918 (0x18)
	struct FText CreateDeviceAuth; // 0x930 (0x18)
	struct FText ExtAuthCanceled; // 0x948 (0x18)
	struct FText ExtAuthFailure; // 0x960 (0x18)
	struct FText ExtAuthAssociationFailure; // 0x978 (0x18)
	struct FText ExtAuthTimeout; // 0x990 (0x18)
	struct FText ExtAuthMissingAuthAssociation; // 0x9a8 (0x18)
	struct FText UnableToQueryReceipts; // 0x9c0 (0x18)
};

