// DelegateFunction /Script/Engine.ParticleCollisionSignature__DelegateSignature
// Size: 0x80
struct FParticleCollisionSignature__DelegateSignature
{
	struct FName EventName; // 0x0 (0x4)
	float EmitterTime; // 0x4 (0x4)
	int ParticleTime; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	struct FVector Location; // 0x10 (0x18)
	struct FVector Velocity; // 0x28 (0x18)
	struct FVector Direction; // 0x40 (0x18)
	struct FVector Normal; // 0x58 (0x18)
	struct FName BoneName; // 0x70 (0x4)
	unsigned char unreflected_74[0x4]; // 0x74 (0x4) 
	class UPhysicalMaterial* PhysMat; // 0x78 (0x8)
};

