// DelegateFunction /Script/FortniteGame.PawnDamagedSignature__DelegateSignature
// Size: 0x60
struct FPawnDamagedSignature__DelegateSignature
{
	class AActor* DamagedActor; // 0x0 (0x8)
	float Damage; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	class AController* InstigatedBy; // 0x10 (0x8)
	class AActor* DamageCauser; // 0x18 (0x8)
	struct FVector HitLocation; // 0x20 (0x18)
	class UPrimitiveComponent* FHitComponent; // 0x38 (0x8)
	struct FName BoneName; // 0x40 (0x4)
	unsigned char unreflected_44[0x4]; // 0x44 (0x4) 
	struct FVector Momentum; // 0x48 (0x18)
};

