// ScriptStruct /Script/PBIK.PBIKEffector
// Size: 0x90
struct FPBIKEffector
{
	struct FName bone; // 0x0 (0x4)
	unsigned char unreflected_4[0xc]; // 0x4 (0xc) 
	struct FTransform Transform; // 0x10 (0x60)
	float PositionAlpha; // 0x70 (0x4)
	float RotationAlpha; // 0x74 (0x4)
	float StrengthAlpha; // 0x78 (0x4)
	float PullChainAlpha; // 0x7c (0x4)
	float PinRotation; // 0x80 (0x4)
	unsigned char padding_84[0xc]; // 0x84 (0xc)
};

