// ScriptStruct /Script/FortniteGame.PelvisMod_BankAngleInput_Spring
// Size: 0x24
struct FPelvisMod_BankAngleInput_Spring
{
	float BankLeanStrafeA; // 0x0 (0x4)
	float BankLeanStrafeB; // 0x4 (0x4)
	float BankTurnA; // 0x8 (0x4)
	float BankTurnB; // 0xc (0x4)
	float BankStiffness; // 0x10 (0x4)
	float BankDampening; // 0x14 (0x4)
	float BankMass; // 0x18 (0x4)
	float BankClampMin; // 0x1c (0x4)
	float BankClampMax; // 0x20 (0x4)
};

