// UserDefinedStruct /Game/Athena/Items/PhysicsActors/PhysicsTreeLog/PhysicsLogAnalyticsStruct.PhysicsLogAnalyticsStruct
// Size: 0x6c
struct FPhysicsLogAnalyticsStruct
{
	struct FString InstanceName29E13A3CF84B9151E7004D9B8C51FD00B9; // 0x0 (0x10)
	struct FString FelledBy2076924F44337FDE90F8B5C9C7645CDF2; // 0x10 (0x10)
	struct FVector FelledAtLocation787D469DB42BC3085780226AC3B154AD1; // 0x20 (0x18)
	float FelledAtMatchTime17701A35DB42F8DA247CDC50AC58CCCD4E; // 0x38 (0x4)
	unsigned char unreflected_3c[0x4]; // 0x3c (0x4) 
	struct FVector DestroyedAtLocation3393747681485FCEB2F9D50B8F2C9BA72B; // 0x40 (0x18)
	float DestroyedAtMatchTime311DCF4002426A45C86050D4B13C85632F; // 0x58 (0x4)
	float DamageToPlayers20F701392440AAC7AC33A8B2BCAEB3C5D0; // 0x5c (0x4)
	float DamageToStructures22636FABDE409E1A51BAF808863B05D213; // 0x60 (0x4)
	float DamageToVehicles2469A07F714B43DF853CA180B441A6A29C; // 0x64 (0x4)
	float DamageToAI269671D0A943425BB2EC73159C0B19C99D; // 0x68 (0x4)
};

