// ScriptStruct /Script/FortniteGame.PoseDeformationQueryResults_Arms
// Size: 0x28
struct FPoseDeformationQueryResults_Arms
{
	float ArmUpL; // 0x0 (0x4)
	float ArmUpR; // 0x4 (0x4)
	float ArmForwardL; // 0x8 (0x4)
	float ArmForwardR; // 0xc (0x4)
	float ArmBackL; // 0x10 (0x4)
	float ArmBackR; // 0x14 (0x4)
	float ArmForwardUpL; // 0x18 (0x4)
	float ArmForwardUpR; // 0x1c (0x4)
	float ArmForwardDownL; // 0x20 (0x4)
	float ArmForwardDownR; // 0x24 (0x4)
};

