// ScriptStruct /Script/FortniteGame.PoseDeformationQuery_Arms
// Size: 0x118
struct FPoseDeformationQuery_Arms
{
	struct FPoseDeformationQueryResults_Arms QueryResults; // 0x0 (0x28)
	struct FPoseDeformationQuery ArmUpL; // 0x28 (0x18)
	struct FPoseDeformationQuery ArmUpR; // 0x40 (0x18)
	struct FPoseDeformationQuery ArmForwardL; // 0x58 (0x18)
	struct FPoseDeformationQuery ArmForwardR; // 0x70 (0x18)
	struct FPoseDeformationQuery ArmBackL; // 0x88 (0x18)
	struct FPoseDeformationQuery ArmBackR; // 0xa0 (0x18)
	struct FPoseDeformationQuery ArmForwardUpL; // 0xb8 (0x18)
	struct FPoseDeformationQuery ArmForwardUpR; // 0xd0 (0x18)
	struct FPoseDeformationQuery ArmForwardDownL; // 0xe8 (0x18)
	struct FPoseDeformationQuery ArmForwardDownR; // 0x100 (0x18)
};

