// ScriptStruct /Script/Engine.PostProcessSettings
// Size: 0x6e0
struct FPostProcessSettings
{
	unsigned char bOverrideTemperatureType; // 0x0 (0x1)
	unsigned char bOverrideWhiteTemp; // 0x0 (0x1)
	unsigned char bOverrideWhiteTint; // 0x0 (0x1)
	unsigned char bOverrideColorSaturation; // 0x0 (0x1)
	unsigned char bOverrideColorContrast; // 0x0 (0x1)
	unsigned char bOverrideColorGamma; // 0x0 (0x1)
	unsigned char bOverrideColorGain; // 0x0 (0x1)
	unsigned char bOverrideColorOffset; // 0x0 (0x1)
	unsigned char bOverrideColorSaturationShadows; // 0x1 (0x1)
	unsigned char bOverrideColorContrastShadows; // 0x1 (0x1)
	unsigned char bOverrideColorGammaShadows; // 0x1 (0x1)
	unsigned char bOverrideColorGainShadows; // 0x1 (0x1)
	unsigned char bOverrideColorOffsetShadows; // 0x1 (0x1)
	unsigned char bOverrideColorSaturationMidtones; // 0x1 (0x1)
	unsigned char bOverrideColorContrastMidtones; // 0x1 (0x1)
	unsigned char bOverrideColorGammaMidtones; // 0x1 (0x1)
	unsigned char bOverrideColorGainMidtones; // 0x2 (0x1)
	unsigned char bOverrideColorOffsetMidtones; // 0x2 (0x1)
	unsigned char bOverrideColorSaturationHighlights; // 0x2 (0x1)
	unsigned char bOverrideColorContrastHighlights; // 0x2 (0x1)
	unsigned char bOverrideColorGammaHighlights; // 0x2 (0x1)
	unsigned char bOverrideColorGainHighlights; // 0x2 (0x1)
	unsigned char bOverrideColorOffsetHighlights; // 0x2 (0x1)
	unsigned char bOverrideColorCorrectionShadowsMax; // 0x2 (0x1)
	unsigned char bOverrideColorCorrectionHighlightsMin; // 0x3 (0x1)
	unsigned char bOverrideColorCorrectionHighlightsMax; // 0x3 (0x1)
	unsigned char bOverrideBlueCorrection; // 0x3 (0x1)
	unsigned char bOverrideExpandGamut; // 0x3 (0x1)
	unsigned char bOverrideToneCurveAmount; // 0x3 (0x1)
	unsigned char bOverrideFilmSlope; // 0x3 (0x1)
	unsigned char bOverrideFilmToe; // 0x3 (0x1)
	unsigned char bOverrideFilmShoulder; // 0x3 (0x1)
	unsigned char bOverrideFilmBlackClip; // 0x4 (0x1)
	unsigned char bOverrideFilmWhiteClip; // 0x4 (0x1)
	unsigned char bOverrideSceneColorTint; // 0x4 (0x1)
	unsigned char bOverrideSceneFringeIntensity; // 0x4 (0x1)
	unsigned char bOverrideChromaticAberrationStartOffset; // 0x4 (0x1)
	unsigned char bOverrideAmbientCubemapTint; // 0x4 (0x1)
	unsigned char bOverrideAmbientCubemapIntensity; // 0x4 (0x1)
	unsigned char bOverrideBloomMethod; // 0x4 (0x1)
	unsigned char bOverrideBloomIntensity; // 0x5 (0x1)
	unsigned char bOverrideBloomThreshold; // 0x5 (0x1)
	unsigned char bOverrideBloom1Tint; // 0x5 (0x1)
	unsigned char bOverrideBloom1Size; // 0x5 (0x1)
	unsigned char bOverrideBloom2Size; // 0x5 (0x1)
	unsigned char bOverrideBloom2Tint; // 0x5 (0x1)
	unsigned char bOverrideBloom3Tint; // 0x5 (0x1)
	unsigned char bOverrideBloom3Size; // 0x5 (0x1)
	unsigned char bOverrideBloom4Tint; // 0x6 (0x1)
	unsigned char bOverrideBloom4Size; // 0x6 (0x1)
	unsigned char bOverrideBloom5Tint; // 0x6 (0x1)
	unsigned char bOverrideBloom5Size; // 0x6 (0x1)
	unsigned char bOverrideBloom6Tint; // 0x6 (0x1)
	unsigned char bOverrideBloom6Size; // 0x6 (0x1)
	unsigned char bOverrideBloomSizeScale; // 0x6 (0x1)
	unsigned char bOverrideBloomConvolutionTexture; // 0x6 (0x1)
	unsigned char bOverrideBloomConvolutionScatterDispersion; // 0x7 (0x1)
	unsigned char bOverrideBloomConvolutionSize; // 0x7 (0x1)
	unsigned char bOverrideBloomConvolutionCenterUV; // 0x7 (0x1)
	unsigned char bOverrideBloomConvolutionPreFilter; // 0x7 (0x1)
	unsigned char bOverrideBloomConvolutionPreFilterMin; // 0x7 (0x1)
	unsigned char bOverrideBloomConvolutionPreFilterMax; // 0x7 (0x1)
	unsigned char bOverrideBloomConvolutionPreFilterMult; // 0x7 (0x1)
	unsigned char bOverrideBloomConvolutionBufferScale; // 0x7 (0x1)
	unsigned char bOverrideBloomDirtMaskIntensity; // 0x8 (0x1)
	unsigned char bOverrideBloomDirtMaskTint; // 0x8 (0x1)
	unsigned char bOverrideBloomDirtMask; // 0x8 (0x1)
	unsigned char bOverrideCameraShutterSpeed; // 0x8 (0x1)
	unsigned char bOverrideCameraISO; // 0x8 (0x1)
	unsigned char bOverrideAutoExposureMethod; // 0x8 (0x1)
	unsigned char bOverrideAutoExposureLowPercent; // 0x8 (0x1)
	unsigned char bOverrideAutoExposureHighPercent; // 0x8 (0x1)
	unsigned char bOverrideAutoExposureMinBrightness; // 0x9 (0x1)
	unsigned char bOverrideAutoExposureMaxBrightness; // 0x9 (0x1)
	unsigned char bOverrideAutoExposureCalibrationConstant; // 0x9 (0x1)
	unsigned char bOverrideAutoExposureSpeedUp; // 0x9 (0x1)
	unsigned char bOverrideAutoExposureSpeedDown; // 0x9 (0x1)
	unsigned char bOverrideAutoExposureBias; // 0x9 (0x1)
	unsigned char bOverrideAutoExposureBiasCurve; // 0x9 (0x1)
	unsigned char bOverrideAutoExposureMeterMask; // 0x9 (0x1)
	unsigned char bOverrideAutoExposureApplyPhysicalCameraExposure; // 0xa (0x1)
	unsigned char bOverrideHistogramLogMin; // 0xa (0x1)
	unsigned char bOverrideHistogramLogMax; // 0xa (0x1)
	unsigned char bOverrideLocalExposureContrastScale; // 0xa (0x1)
	unsigned char bOverrideLocalExposureHighlightContrastScale; // 0xa (0x1)
	unsigned char bOverrideLocalExposureShadowContrastScale; // 0xa (0x1)
	unsigned char bOverrideLocalExposureDetailStrength; // 0xa (0x1)
	unsigned char bOverrideLocalExposureBlurredLuminanceBlend; // 0xa (0x1)
	unsigned char bOverrideLocalExposureBlurredLuminanceKernelSizePercent; // 0xb (0x1)
	unsigned char bOverrideLocalExposureMiddleGreyBias; // 0xb (0x1)
	unsigned char bOverrideLensFlareIntensity; // 0xb (0x1)
	unsigned char bOverrideLensFlareTint; // 0xb (0x1)
	unsigned char bOverrideLensFlareTints; // 0xb (0x1)
	unsigned char bOverrideLensFlareBokehSize; // 0xb (0x1)
	unsigned char bOverrideLensFlareBokehShape; // 0xb (0x1)
	unsigned char bOverrideLensFlareThreshold; // 0xb (0x1)
	unsigned char bOverrideVignetteIntensity; // 0xc (0x1)
	unsigned char bOverrideGrainIntensity; // 0xc (0x1)
	unsigned char bOverrideGrainJitter; // 0xc (0x1)
	unsigned char bOverrideFilmGrainIntensity; // 0xc (0x1)
	unsigned char bOverrideFilmGrainIntensityShadows; // 0xc (0x1)
	unsigned char bOverrideFilmGrainIntensityMidtones; // 0xc (0x1)
	unsigned char bOverrideFilmGrainIntensityHighlights; // 0xc (0x1)
	unsigned char bOverrideFilmGrainShadowsMax; // 0xc (0x1)
	unsigned char bOverrideFilmGrainHighlightsMin; // 0xd (0x1)
	unsigned char bOverrideFilmGrainHighlightsMax; // 0xd (0x1)
	unsigned char bOverrideFilmGrainTexelSize; // 0xd (0x1)
	unsigned char bOverrideFilmGrainTexture; // 0xd (0x1)
	unsigned char bOverrideAmbientOcclusionIntensity; // 0xd (0x1)
	unsigned char bOverrideAmbientOcclusionStaticFraction; // 0xd (0x1)
	unsigned char bOverrideAmbientOcclusionRadius; // 0xd (0x1)
	unsigned char bOverrideAmbientOcclusionFadeDistance; // 0xd (0x1)
	unsigned char bOverrideAmbientOcclusionFadeRadius; // 0xe (0x1)
	unsigned char bOverrideAmbientOcclusionDistance; // 0xe (0x1)
	unsigned char bOverrideAmbientOcclusionRadiusInWS; // 0xe (0x1)
	unsigned char bOverrideAmbientOcclusionPower; // 0xe (0x1)
	unsigned char bOverrideAmbientOcclusionBias; // 0xe (0x1)
	unsigned char bOverrideAmbientOcclusionQuality; // 0xe (0x1)
	unsigned char bOverrideAmbientOcclusionMipBlend; // 0xe (0x1)
	unsigned char bOverrideAmbientOcclusionMipScale; // 0xe (0x1)
	unsigned char bOverrideAmbientOcclusionMipThreshold; // 0xf (0x1)
	unsigned char bOverrideAmbientOcclusionTemporalBlendWeight; // 0xf (0x1)
	unsigned char bOverrideRayTracingAO; // 0x10 (0x1)
	unsigned char bOverrideRayTracingAOSamplesPerPixel; // 0x10 (0x1)
	unsigned char bOverrideRayTracingAOIntensity; // 0x10 (0x1)
	unsigned char bOverrideRayTracingAORadius; // 0x10 (0x1)
	unsigned char unreflected_11[0x3]; // 0x11 (0x3) 
	unsigned char bOverrideLPVIntensity; // 0x14 (0x1)
	unsigned char bOverrideLPVDirectionalOcclusionIntensity; // 0x14 (0x1)
	unsigned char bOverrideLPVDirectionalOcclusionRadius; // 0x14 (0x1)
	unsigned char bOverrideLPVDiffuseOcclusionExponent; // 0x14 (0x1)
	unsigned char bOverrideLPVSpecularOcclusionExponent; // 0x14 (0x1)
	unsigned char bOverrideLPVDiffuseOcclusionIntensity; // 0x14 (0x1)
	unsigned char bOverrideLPVSpecularOcclusionIntensity; // 0x14 (0x1)
	unsigned char bOverrideLPVSize; // 0x14 (0x1)
	unsigned char bOverrideLPVSecondaryOcclusionIntensity; // 0x15 (0x1)
	unsigned char bOverrideLPVSecondaryBounceIntensity; // 0x15 (0x1)
	unsigned char bOverrideLPVGeometryVolumeBias; // 0x15 (0x1)
	unsigned char bOverrideLPVVplInjectionBias; // 0x15 (0x1)
	unsigned char bOverrideLPVEmissiveInjectionIntensity; // 0x15 (0x1)
	unsigned char bOverrideLPVFadeRange; // 0x15 (0x1)
	unsigned char bOverrideLPVDirectionalOcclusionFadeRange; // 0x15 (0x1)
	unsigned char bOverrideIndirectLightingColor; // 0x15 (0x1)
	unsigned char bOverrideIndirectLightingIntensity; // 0x16 (0x1)
	unsigned char bOverrideColorGradingIntensity; // 0x16 (0x1)
	unsigned char bOverrideColorGradingLUT; // 0x16 (0x1)
	unsigned char bOverrideDepthOfFieldFocalDistance; // 0x16 (0x1)
	unsigned char bOverrideDepthOfFieldFstop; // 0x16 (0x1)
	unsigned char bOverrideDepthOfFieldMinFstop; // 0x16 (0x1)
	unsigned char bOverrideDepthOfFieldBladeCount; // 0x16 (0x1)
	unsigned char bOverrideDepthOfFieldSensorWidth; // 0x16 (0x1)
	unsigned char bOverrideDepthOfFieldSqueezeFactor; // 0x17 (0x1)
	unsigned char bOverrideDepthOfFieldDepthBlurRadius; // 0x17 (0x1)
	unsigned char bOverrideDepthOfFieldDepthBlurAmount; // 0x17 (0x1)
	unsigned char bOverrideDepthOfFieldFocalRegion; // 0x17 (0x1)
	unsigned char bOverrideDepthOfFieldNearTransitionRegion; // 0x17 (0x1)
	unsigned char bOverrideDepthOfFieldFarTransitionRegion; // 0x17 (0x1)
	unsigned char bOverrideDepthOfFieldScale; // 0x17 (0x1)
	unsigned char bOverrideDepthOfFieldNearBlurSize; // 0x17 (0x1)
	unsigned char bOverrideDepthOfFieldFarBlurSize; // 0x18 (0x1)
	unsigned char bOverrideMobileHQGaussian; // 0x18 (0x1)
	unsigned char bOverrideDepthOfFieldOcclusion; // 0x18 (0x1)
	unsigned char bOverrideDepthOfFieldSkyFocusDistance; // 0x18 (0x1)
	unsigned char bOverrideDepthOfFieldVignetteSize; // 0x18 (0x1)
	unsigned char bOverrideMotionBlurAmount; // 0x18 (0x1)
	unsigned char bOverrideMotionBlurMax; // 0x18 (0x1)
	unsigned char bOverrideMotionBlurTargetFPS; // 0x18 (0x1)
	unsigned char bOverrideMotionBlurPerObjectSize; // 0x19 (0x1)
	unsigned char bOverrideScreenPercentage; // 0x19 (0x1)
	unsigned char bOverrideReflectionMethod; // 0x19 (0x1)
	unsigned char bOverrideLumenReflectionQuality; // 0x19 (0x1)
	unsigned char bOverrideScreenSpaceReflectionIntensity; // 0x19 (0x1)
	unsigned char bOverrideScreenSpaceReflectionQuality; // 0x19 (0x1)
	unsigned char bOverrideScreenSpaceReflectionMaxRoughness; // 0x19 (0x1)
	unsigned char bOverrideScreenSpaceReflectionRoughnessScale; // 0x19 (0x1)
	unsigned char unreflected_1a[0x2]; // 0x1a (0x2) 
	unsigned char bOverrideReflectionsType; // 0x1c (0x1)
	unsigned char bOverrideRayTracingReflectionsMaxRoughness; // 0x1c (0x1)
	unsigned char bOverrideRayTracingReflectionsMaxBounces; // 0x1c (0x1)
	unsigned char bOverrideRayTracingReflectionsSamplesPerPixel; // 0x1c (0x1)
	unsigned char bOverrideRayTracingReflectionsShadows; // 0x1c (0x1)
	unsigned char bOverrideRayTracingReflectionsTranslucency; // 0x1c (0x1)
	unsigned char bOverrideTranslucencyType; // 0x1c (0x1)
	unsigned char bOverrideRayTracingTranslucencyMaxRoughness; // 0x1c (0x1)
	unsigned char bOverrideRayTracingTranslucencyRefractionRays; // 0x1d (0x1)
	unsigned char bOverrideRayTracingTranslucencySamplesPerPixel; // 0x1d (0x1)
	unsigned char bOverrideRayTracingTranslucencyShadows; // 0x1d (0x1)
	unsigned char bOverrideRayTracingTranslucencyRefraction; // 0x1d (0x1)
	unsigned char bOverrideDynamicGlobalIlluminationMethod; // 0x1d (0x1)
	unsigned char bOverrideLumenSceneLightingQuality; // 0x1d (0x1)
	unsigned char bOverrideLumenSceneDetail; // 0x1d (0x1)
	unsigned char bOverrideLumenSceneViewDistance; // 0x1d (0x1)
	unsigned char bOverrideLumenSceneLightingUpdateSpeed; // 0x1e (0x1)
	unsigned char bOverrideLumenFinalGatherQuality; // 0x1e (0x1)
	unsigned char bOverrideLumenFinalGatherLightingUpdateSpeed; // 0x1e (0x1)
	unsigned char bOverrideLumenMaxTraceDistance; // 0x1e (0x1)
	unsigned char bOverrideLumenDiffuseColorBoost; // 0x1e (0x1)
	unsigned char bOverrideLumenSkylightLeaking; // 0x1e (0x1)
	unsigned char bOverrideLumenFullSkylightLeakingDistance; // 0x1e (0x1)
	unsigned char unreflected_1f[0x1]; // 0x1f (0x1) 
	unsigned char bOverrideLumenRayLightingMode; // 0x20 (0x1)
	unsigned char bOverrideLumenFrontLayerTranslucencyReflections; // 0x20 (0x1)
	unsigned char bOverrideLumenSurfaceCacheResolution; // 0x20 (0x1)
	unsigned char unreflected_21[0x3]; // 0x21 (0x3) 
	unsigned char bOverrideRayTracingGI; // 0x24 (0x1)
	unsigned char bOverrideRayTracingGIMaxBounces; // 0x24 (0x1)
	unsigned char bOverrideRayTracingGISamplesPerPixel; // 0x24 (0x1)
	unsigned char bOverridePathTracingMaxBounces; // 0x24 (0x1)
	unsigned char bOverridePathTracingSamplesPerPixel; // 0x24 (0x1)
	unsigned char bOverridePathTracingFilterWidth; // 0x24 (0x1)
	unsigned char bOverridePathTracingEnableEmissive; // 0x24 (0x1)
	unsigned char bOverridePathTracingMaxPathExposure; // 0x24 (0x1)
	unsigned char bOverridePathTracingEnableReferenceDOF; // 0x25 (0x1)
	unsigned char bOverridePathTracingEnableReferenceAtmosphere; // 0x25 (0x1)
	unsigned char bOverridePathTracingEnableDenoiser; // 0x25 (0x1)
	unsigned char unreflected_26[0x2]; // 0x26 (0x2) 
	unsigned char bMobileHQGaussian; // 0x28 (0x1)
	struct TEnumAsByte<EBloomMethod> BloomMethod; // 0x29 (0x1)
	struct TEnumAsByte<EAutoExposureMethod> AutoExposureMethod; // 0x2a (0x1)
	struct TEnumAsByte<ETemperatureMethod> TemperatureType; // 0x2b (0x1)
	float WhiteTemp; // 0x2c (0x4)
	float WhiteTint; // 0x30 (0x4)
	unsigned char unreflected_34[0xc]; // 0x34 (0xc) 
	struct FVector4 ColorSaturation; // 0x40 (0x20)
	struct FVector4 ColorContrast; // 0x60 (0x20)
	struct FVector4 ColorGamma; // 0x80 (0x20)
	struct FVector4 ColorGain; // 0xa0 (0x20)
	struct FVector4 ColorOffset; // 0xc0 (0x20)
	struct FVector4 ColorSaturationShadows; // 0xe0 (0x20)
	struct FVector4 ColorContrastShadows; // 0x100 (0x20)
	struct FVector4 ColorGammaShadows; // 0x120 (0x20)
	struct FVector4 ColorGainShadows; // 0x140 (0x20)
	struct FVector4 ColorOffsetShadows; // 0x160 (0x20)
	struct FVector4 ColorSaturationMidtones; // 0x180 (0x20)
	struct FVector4 ColorContrastMidtones; // 0x1a0 (0x20)
	struct FVector4 ColorGammaMidtones; // 0x1c0 (0x20)
	struct FVector4 ColorGainMidtones; // 0x1e0 (0x20)
	struct FVector4 ColorOffsetMidtones; // 0x200 (0x20)
	struct FVector4 ColorSaturationHighlights; // 0x220 (0x20)
	struct FVector4 ColorContrastHighlights; // 0x240 (0x20)
	struct FVector4 ColorGammaHighlights; // 0x260 (0x20)
	struct FVector4 ColorGainHighlights; // 0x280 (0x20)
	struct FVector4 ColorOffsetHighlights; // 0x2a0 (0x20)
	float ColorCorrectionHighlightsMin; // 0x2c0 (0x4)
	float ColorCorrectionHighlightsMax; // 0x2c4 (0x4)
	float ColorCorrectionShadowsMax; // 0x2c8 (0x4)
	float BlueCorrection; // 0x2cc (0x4)
	float ExpandGamut; // 0x2d0 (0x4)
	float ToneCurveAmount; // 0x2d4 (0x4)
	float FilmSlope; // 0x2d8 (0x4)
	float FilmToe; // 0x2dc (0x4)
	float FilmShoulder; // 0x2e0 (0x4)
	float FilmBlackClip; // 0x2e4 (0x4)
	float FilmWhiteClip; // 0x2e8 (0x4)
	struct FLinearColor SceneColorTint; // 0x2ec (0x10)
	float SceneFringeIntensity; // 0x2fc (0x4)
	float ChromaticAberrationStartOffset; // 0x300 (0x4)
	float BloomIntensity; // 0x304 (0x4)
	float BloomThreshold; // 0x308 (0x4)
	float BloomSizeScale; // 0x30c (0x4)
	float Bloom1Size; // 0x310 (0x4)
	float Bloom2Size; // 0x314 (0x4)
	float Bloom3Size; // 0x318 (0x4)
	float Bloom4Size; // 0x31c (0x4)
	float Bloom5Size; // 0x320 (0x4)
	float Bloom6Size; // 0x324 (0x4)
	struct FLinearColor Bloom1Tint; // 0x328 (0x10)
	struct FLinearColor Bloom2Tint; // 0x338 (0x10)
	struct FLinearColor Bloom3Tint; // 0x348 (0x10)
	struct FLinearColor Bloom4Tint; // 0x358 (0x10)
	struct FLinearColor Bloom5Tint; // 0x368 (0x10)
	struct FLinearColor Bloom6Tint; // 0x378 (0x10)
	float BloomConvolutionScatterDispersion; // 0x388 (0x4)
	float BloomConvolutionSize; // 0x38c (0x4)
	class UTexture2D* BloomConvolutionTexture; // 0x390 (0x8)
	struct FVector2D BloomConvolutionCenterUV; // 0x398 (0x10)
	float BloomConvolutionPreFilterMin; // 0x3a8 (0x4)
	float BloomConvolutionPreFilterMax; // 0x3ac (0x4)
	float BloomConvolutionPreFilterMult; // 0x3b0 (0x4)
	float BloomConvolutionBufferScale; // 0x3b4 (0x4)
	class UTexture* BloomDirtMask; // 0x3b8 (0x8)
	float BloomDirtMaskIntensity; // 0x3c0 (0x4)
	struct FLinearColor BloomDirtMaskTint; // 0x3c4 (0x10)
	struct TEnumAsByte<EDynamicGlobalIlluminationMethod> DynamicGlobalIlluminationMethod; // 0x3d4 (0x1)
	unsigned char unreflected_3d5[0x3]; // 0x3d5 (0x3) 
	struct FLinearColor IndirectLightingColor; // 0x3d8 (0x10)
	float IndirectLightingIntensity; // 0x3e8 (0x4)
	float LumenSceneLightingQuality; // 0x3ec (0x4)
	float LumenSceneDetail; // 0x3f0 (0x4)
	float LumenSceneViewDistance; // 0x3f4 (0x4)
	float LumenSceneLightingUpdateSpeed; // 0x3f8 (0x4)
	float LumenFinalGatherQuality; // 0x3fc (0x4)
	float LumenFinalGatherLightingUpdateSpeed; // 0x400 (0x4)
	float LumenMaxTraceDistance; // 0x404 (0x4)
	float LumenDiffuseColorBoost; // 0x408 (0x4)
	float LumenSkylightLeaking; // 0x40c (0x4)
	float LumenFullSkylightLeakingDistance; // 0x410 (0x4)
	float LumenSurfaceCacheResolution; // 0x414 (0x4)
	enum ERayTracingGlobalIlluminationType RayTracingGIType; // 0x418 (0x1)
	unsigned char unreflected_419[0x3]; // 0x419 (0x3) 
	int RayTracingGIMaxBounces; // 0x41c (0x4)
	int RayTracingGISamplesPerPixel; // 0x420 (0x4)
	struct TEnumAsByte<EReflectionMethod> ReflectionMethod; // 0x424 (0x1)
	enum EReflectionsType ReflectionsType; // 0x425 (0x1)
	unsigned char unreflected_426[0x2]; // 0x426 (0x2) 
	float LumenReflectionQuality; // 0x428 (0x4)
	enum ELumenRayLightingModeOverride LumenRayLightingMode; // 0x42c (0x1)
	unsigned char LumenFrontLayerTranslucencyReflections; // 0x42d (0x1)
	unsigned char unreflected_42e[0x2]; // 0x42e (0x2) 
	float ScreenSpaceReflectionIntensity; // 0x430 (0x4)
	float ScreenSpaceReflectionQuality; // 0x434 (0x4)
	float ScreenSpaceReflectionMaxRoughness; // 0x438 (0x4)
	float RayTracingReflectionsMaxRoughness; // 0x43c (0x4)
	int RayTracingReflectionsMaxBounces; // 0x440 (0x4)
	int RayTracingReflectionsSamplesPerPixel; // 0x444 (0x4)
	enum EReflectedAndRefractedRayTracedShadows RayTracingReflectionsShadows; // 0x448 (0x1)
	unsigned char RayTracingReflectionsTranslucency; // 0x449 (0x1)
	unsigned char unreflected_44a[0x2]; // 0x44a (0x2) 
	struct FLinearColor AmbientCubemapTint; // 0x44c (0x10)
	float AmbientCubemapIntensity; // 0x45c (0x4)
	class UTextureCube* AmbientCubemap; // 0x460 (0x8)
	float CameraShutterSpeed; // 0x468 (0x4)
	float CameraISO; // 0x46c (0x4)
	float DepthOfFieldFstop; // 0x470 (0x4)
	float DepthOfFieldMinFstop; // 0x474 (0x4)
	int DepthOfFieldBladeCount; // 0x478 (0x4)
	float AutoExposureBias; // 0x47c (0x4)
	float AutoExposureBiasBackup; // 0x480 (0x4)
	unsigned char bOverrideAutoExposureBiasBackup; // 0x484 (0x1)
	unsigned char unreflected_485[0x3]; // 0x485 (0x3) 
	unsigned char AutoExposureApplyPhysicalCameraExposure; // 0x488 (0x1)
	unsigned char unreflected_489[0x7]; // 0x489 (0x7) 
	class UCurveFloat* AutoExposureBiasCurve; // 0x490 (0x8)
	class UTexture* AutoExposureMeterMask; // 0x498 (0x8)
	float AutoExposureLowPercent; // 0x4a0 (0x4)
	float AutoExposureHighPercent; // 0x4a4 (0x4)
	float AutoExposureMinBrightness; // 0x4a8 (0x4)
	float AutoExposureMaxBrightness; // 0x4ac (0x4)
	float AutoExposureSpeedUp; // 0x4b0 (0x4)
	float AutoExposureSpeedDown; // 0x4b4 (0x4)
	float HistogramLogMin; // 0x4b8 (0x4)
	float HistogramLogMax; // 0x4bc (0x4)
	float AutoExposureCalibrationConstant; // 0x4c0 (0x4)
	float LocalExposureContrastScale; // 0x4c4 (0x4)
	float LocalExposureHighlightContrastScale; // 0x4c8 (0x4)
	float LocalExposureShadowContrastScale; // 0x4cc (0x4)
	float LocalExposureDetailStrength; // 0x4d0 (0x4)
	float LocalExposureBlurredLuminanceBlend; // 0x4d4 (0x4)
	float LocalExposureBlurredLuminanceKernelSizePercent; // 0x4d8 (0x4)
	float LocalExposureMiddleGreyBias; // 0x4dc (0x4)
	float LensFlareIntensity; // 0x4e0 (0x4)
	struct FLinearColor LensFlareTint; // 0x4e4 (0x10)
	float LensFlareBokehSize; // 0x4f4 (0x4)
	float LensFlareThreshold; // 0x4f8 (0x4)
	unsigned char unreflected_4fc[0x4]; // 0x4fc (0x4) 
	class UTexture* LensFlareBokehShape; // 0x500 (0x8)
	struct FLinearColor LensFlareTints[0x8]; // 0x508 (0x10) (ARRAY) 
	float VignetteIntensity; // 0x588 (0x4)
	float GrainJitter; // 0x58c (0x4)
	float GrainIntensity; // 0x590 (0x4)
	float FilmGrainIntensity; // 0x594 (0x4)
	float FilmGrainIntensityShadows; // 0x598 (0x4)
	float FilmGrainIntensityMidtones; // 0x59c (0x4)
	float FilmGrainIntensityHighlights; // 0x5a0 (0x4)
	float FilmGrainShadowsMax; // 0x5a4 (0x4)
	float FilmGrainHighlightsMin; // 0x5a8 (0x4)
	float FilmGrainHighlightsMax; // 0x5ac (0x4)
	float FilmGrainTexelSize; // 0x5b0 (0x4)
	unsigned char unreflected_5b4[0x4]; // 0x5b4 (0x4) 
	class UTexture2D* FilmGrainTexture; // 0x5b8 (0x8)
	float AmbientOcclusionIntensity; // 0x5c0 (0x4)
	float AmbientOcclusionStaticFraction; // 0x5c4 (0x4)
	float AmbientOcclusionRadius; // 0x5c8 (0x4)
	unsigned char AmbientOcclusionRadiusInWS; // 0x5cc (0x1)
	unsigned char unreflected_5cd[0x3]; // 0x5cd (0x3) 
	float AmbientOcclusionFadeDistance; // 0x5d0 (0x4)
	float AmbientOcclusionFadeRadius; // 0x5d4 (0x4)
	float AmbientOcclusionDistance; // 0x5d8 (0x4)
	float AmbientOcclusionPower; // 0x5dc (0x4)
	float AmbientOcclusionBias; // 0x5e0 (0x4)
	float AmbientOcclusionQuality; // 0x5e4 (0x4)
	float AmbientOcclusionMipBlend; // 0x5e8 (0x4)
	float AmbientOcclusionMipScale; // 0x5ec (0x4)
	float AmbientOcclusionMipThreshold; // 0x5f0 (0x4)
	float AmbientOcclusionTemporalBlendWeight; // 0x5f4 (0x4)
	unsigned char RayTracingAO; // 0x5f8 (0x1)
	unsigned char unreflected_5f9[0x3]; // 0x5f9 (0x3) 
	int RayTracingAOSamplesPerPixel; // 0x5fc (0x4)
	float RayTracingAOIntensity; // 0x600 (0x4)
	float RayTracingAORadius; // 0x604 (0x4)
	float ColorGradingIntensity; // 0x608 (0x4)
	unsigned char unreflected_60c[0x4]; // 0x60c (0x4) 
	class UTexture* ColorGradingLUT; // 0x610 (0x8)
	float DepthOfFieldSensorWidth; // 0x618 (0x4)
	float DepthOfFieldSqueezeFactor; // 0x61c (0x4)
	float DepthOfFieldFocalDistance; // 0x620 (0x4)
	float DepthOfFieldDepthBlurAmount; // 0x624 (0x4)
	float DepthOfFieldDepthBlurRadius; // 0x628 (0x4)
	float DepthOfFieldFocalRegion; // 0x62c (0x4)
	float DepthOfFieldNearTransitionRegion; // 0x630 (0x4)
	float DepthOfFieldFarTransitionRegion; // 0x634 (0x4)
	float DepthOfFieldScale; // 0x638 (0x4)
	float DepthOfFieldNearBlurSize; // 0x63c (0x4)
	float DepthOfFieldFarBlurSize; // 0x640 (0x4)
	float DepthOfFieldOcclusion; // 0x644 (0x4)
	float DepthOfFieldSkyFocusDistance; // 0x648 (0x4)
	float DepthOfFieldVignetteSize; // 0x64c (0x4)
	float MotionBlurAmount; // 0x650 (0x4)
	float MotionBlurMax; // 0x654 (0x4)
	int MotionBlurTargetFPS; // 0x658 (0x4)
	float MotionBlurPerObjectSize; // 0x65c (0x4)
	float LPVIntensity; // 0x660 (0x4)
	float LPVVplInjectionBias; // 0x664 (0x4)
	float LPVSize; // 0x668 (0x4)
	float LPVSecondaryOcclusionIntensity; // 0x66c (0x4)
	float LPVSecondaryBounceIntensity; // 0x670 (0x4)
	float LPVGeometryVolumeBias; // 0x674 (0x4)
	float LPVEmissiveInjectionIntensity; // 0x678 (0x4)
	float LPVDirectionalOcclusionIntensity; // 0x67c (0x4)
	float LPVDirectionalOcclusionRadius; // 0x680 (0x4)
	float LPVDiffuseOcclusionExponent; // 0x684 (0x4)
	float LPVSpecularOcclusionExponent; // 0x688 (0x4)
	float LPVDiffuseOcclusionIntensity; // 0x68c (0x4)
	float LPVSpecularOcclusionIntensity; // 0x690 (0x4)
	enum ETranslucencyType TranslucencyType; // 0x694 (0x1)
	unsigned char unreflected_695[0x3]; // 0x695 (0x3) 
	float RayTracingTranslucencyMaxRoughness; // 0x698 (0x4)
	int RayTracingTranslucencyRefractionRays; // 0x69c (0x4)
	int RayTracingTranslucencySamplesPerPixel; // 0x6a0 (0x4)
	enum EReflectedAndRefractedRayTracedShadows RayTracingTranslucencyShadows; // 0x6a4 (0x1)
	unsigned char RayTracingTranslucencyRefraction; // 0x6a5 (0x1)
	unsigned char unreflected_6a6[0x2]; // 0x6a6 (0x2) 
	int PathTracingMaxBounces; // 0x6a8 (0x4)
	int PathTracingSamplesPerPixel; // 0x6ac (0x4)
	float PathTracingFilterWidth; // 0x6b0 (0x4)
	unsigned char PathTracingEnableEmissive; // 0x6b4 (0x1)
	unsigned char unreflected_6b5[0x3]; // 0x6b5 (0x3) 
	float PathTracingMaxPathExposure; // 0x6b8 (0x4)
	unsigned char PathTracingEnableReferenceDOF; // 0x6bc (0x1)
	unsigned char PathTracingEnableReferenceAtmosphere; // 0x6bc (0x1)
	unsigned char PathTracingEnableDenoiser; // 0x6bc (0x1)
	unsigned char unreflected_6bd[0x3]; // 0x6bd (0x3) 
	float LPVFadeRange; // 0x6c0 (0x4)
	float LPVDirectionalOcclusionFadeRange; // 0x6c4 (0x4)
	float ScreenPercentage; // 0x6c8 (0x4)
	unsigned char unreflected_6cc[0x4]; // 0x6cc (0x4) 
	struct FWeightedBlendables WeightedBlendables; // 0x6d0 (0x10)
};

