// ScriptStruct /Script/Procedural.ProceduralScatterDebugSettings
// Size: 0xc
struct FProceduralScatterDebugSettings
{
	bool bShowDebugPlane; // 0x0 (0x1)
	bool bShowDebugTrace; // 0x1 (0x1)
	bool bShowDebugFootprint; // 0x2 (0x1)
	bool bShowDebugHitNormal; // 0x3 (0x1)
	bool bShowDebugPoints; // 0x4 (0x1)
	bool bShowDebugPivots; // 0x5 (0x1)
	unsigned char unreflected_6[0x2]; // 0x6 (0x2) 
	float DebugMaxCullingDistance; // 0x8 (0x4)
};

