// ScriptStruct /Script/ProceduralMeshComponent.ProcMeshVertex
// Size: 0x98
struct FProcMeshVertex
{
	struct FVector Position; // 0x0 (0x18)
	struct FVector Normal; // 0x18 (0x18)
	struct FProcMeshTangent Tangent; // 0x30 (0x20)
	struct FColor Color; // 0x50 (0x4)
	unsigned char unreflected_54[0x4]; // 0x54 (0x4) 
	struct FVector2D UV0; // 0x58 (0x10)
	struct FVector2D UV1; // 0x68 (0x10)
	struct FVector2D UV2; // 0x78 (0x10)
	struct FVector2D UV3; // 0x88 (0x10)
};

