// ScriptStruct /Script/FortniteGame.QuestCategoryButtonOverrides
// Size: 0x78
struct FQuestCategoryButtonOverrides
{
	struct TWeakObjectPtr<class UObject> BackgroundMaterialOverride; // 0x0 (0x28)
	struct TWeakObjectPtr<class UObject> ExtensionImage; // 0x28 (0x28)
	bool bOverrideHeaderColor; // 0x50 (0x1)
	unsigned char unreflected_51[0x3]; // 0x51 (0x3) 
	struct FLinearColor HeaderColor; // 0x54 (0x10)
	bool bOverrideTimerColor; // 0x64 (0x1)
	unsigned char unreflected_65[0x3]; // 0x65 (0x3) 
	struct FLinearColor TimerColor; // 0x68 (0x10)
};

