// ScriptStruct /Script/FortniteGame.RemoteViewRotSnapshotManager
// Size: 0x48
struct FRemoteViewRotSnapshotManager
{
	int BufferSize; // 0x0 (0x4)
	float TimeDelay; // 0x4 (0x4)
	bool bUseVariableTimeDelay; // 0x8 (0x1)
	unsigned char unreflected_9[0x3]; // 0x9 (0x3) 
	float VariableTimeDelayMultiplier; // 0xc (0x4)
	float TimeBeforeDormant; // 0x10 (0x4)
	float InterpSpeedWhenNoSample; // 0x14 (0x4)
	unsigned char padding_18[0x30]; // 0x18 (0x30)
};

