// ScriptStruct /Script/FortniteGame.ReplicatedAthenaVehicleAttributes
// Size: 0x20
struct FReplicatedAthenaVehicleAttributes
{
	float FrontLateralFrictionScale; // 0x0 (0x4)
	float RearLateralFrictionScale; // 0x4 (0x4)
	float BrakeForceTractionScale; // 0x8 (0x4)
	float ForwardForceTractionScale; // 0xc (0x4)
	float SlopeAntigravityScale; // 0x10 (0x4)
	float TopSpeedScale; // 0x14 (0x4)
	float VehicleGravityScale; // 0x18 (0x4)
	bool bBrakeBeforeReverse; // 0x1c (0x1)
	unsigned char padding_1d[0x3]; // 0x1d (0x3)
};

