// ScriptStruct /Script/FortniteGame.RequestStyleParams
// Size: 0x30
struct FRequestStyleParams
{
	float DurationOverride; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	class UMaterialInstanceDynamic* MaterialInstanceDynamic; // 0x8 (0x8)
	enum EStyleSpecificationMethod StyleSpecificationMethod; // 0x10 (0x1)
	unsigned char unreflected_11[0x7]; // 0x11 (0x7) 
	class UFortMaterialStyleSet* StyleSet; // 0x18 (0x8)
	struct FName StyleName; // 0x20 (0x4)
	unsigned char unreflected_24[0x4]; // 0x24 (0x4) 
	class UFortMaterialStyle* DirectStyleReference; // 0x28 (0x8)
};

