// ScriptStruct /Script/FortniteGame.RidableControlParams
// Size: 0x1e0
struct FRidableControlParams
{
	struct FScalableFloat GroundRotationSpeed; // 0x0 (0x28)
	struct FScalableFloat SprintGroundRotationSpeed; // 0x28 (0x28)
	struct FScalableFloat AirRotationSpeed; // 0x50 (0x28)
	struct FScalableFloat SwimmingRotationSpeed; // 0x78 (0x28)
	struct FScalableFloat TurnInPlaceRotationSpeed; // 0xa0 (0x28)
	struct FScalableFloat HalfDeadzone; // 0xc8 (0x28)
	struct FScalableFloat TurnInPlaceStartAngle; // 0xf0 (0x28)
	struct FScalableFloat TimeBeforeTurnInPlaceAllowed; // 0x118 (0x28)
	struct FScalableFloat TimeBeforeInputsReleasedConsidered; // 0x140 (0x28)
	struct FScalableFloat BackwardsHalfDeadzone; // 0x168 (0x28)
	struct FScalableFloat MinimumInputAnalogModifier; // 0x190 (0x28)
	struct FScalableFloat SprintStopSpeedThreshold; // 0x1b8 (0x28)
};

