// ScriptStruct /Script/ControlRig.RigUnit_NoiseFloat
// Size: 0x28
struct FRigUnit_NoiseFloat : FRigUnit_MathBase
{
	float Value; // 0x8 (0x4)
	float Speed; // 0xc (0x4)
	float Frequency; // 0x10 (0x4)
	float Minimum; // 0x14 (0x4)
	float Maximum; // 0x18 (0x4)
	float Result; // 0x1c (0x4)
	float Time; // 0x20 (0x4)
	unsigned char padding_24[0x4]; // 0x24 (0x4)
};

