// ScriptStruct /Script/ControlRig.RigControlValueStorage
// Size: 0x84
struct FRigControlValueStorage
{
	float Float00; // 0x0 (0x4)
	float Float01; // 0x4 (0x4)
	float Float02; // 0x8 (0x4)
	float Float03; // 0xc (0x4)
	float Float10; // 0x10 (0x4)
	float Float11; // 0x14 (0x4)
	float Float12; // 0x18 (0x4)
	float Float13; // 0x1c (0x4)
	float Float20; // 0x20 (0x4)
	float Float21; // 0x24 (0x4)
	float Float22; // 0x28 (0x4)
	float Float23; // 0x2c (0x4)
	float Float30; // 0x30 (0x4)
	float Float31; // 0x34 (0x4)
	float Float32; // 0x38 (0x4)
	float Float33; // 0x3c (0x4)
	float Float002; // 0x40 (0x4)
	float Float012; // 0x44 (0x4)
	float Float022; // 0x48 (0x4)
	float Float032; // 0x4c (0x4)
	float Float102; // 0x50 (0x4)
	float Float112; // 0x54 (0x4)
	float Float122; // 0x58 (0x4)
	float Float132; // 0x5c (0x4)
	float Float202; // 0x60 (0x4)
	float Float212; // 0x64 (0x4)
	float Float222; // 0x68 (0x4)
	float Float232; // 0x6c (0x4)
	float Float302; // 0x70 (0x4)
	float Float312; // 0x74 (0x4)
	float Float322; // 0x78 (0x4)
	float Float332; // 0x7c (0x4)
	bool bValid; // 0x80 (0x1)
	unsigned char padding_81[0x3]; // 0x81 (0x3)
};

