// ScriptStruct /Script/ControlRig.RigUnit_MathFloatLawOfCosine
// Size: 0x28
struct FRigUnit_MathFloatLawOfCosine : FRigUnit_MathFloatBase
{
	float A; // 0x8 (0x4)
	float B; // 0xc (0x4)
	float C; // 0x10 (0x4)
	float AlphaAngle; // 0x14 (0x4)
	float BetaAngle; // 0x18 (0x4)
	float GammaAngle; // 0x1c (0x4)
	bool bValid; // 0x20 (0x1)
	unsigned char padding_21[0x7]; // 0x21 (0x7)
};

