// ScriptStruct /Script/ControlRig.RigUnit_GetWorldTime
// Size: 0x28
struct FRigUnit_GetWorldTime : FRigUnit_AnimBase
{
	float Year; // 0x8 (0x4)
	float Month; // 0xc (0x4)
	float Day; // 0x10 (0x4)
	float WeekDay; // 0x14 (0x4)
	float Hours; // 0x18 (0x4)
	float Minutes; // 0x1c (0x4)
	float Seconds; // 0x20 (0x4)
	float OverallSeconds; // 0x24 (0x4)
};

