// ScriptStruct /Script/ControlRig.RigUnit_MathDoubleLawOfCosine
// Size: 0x40
struct FRigUnit_MathDoubleLawOfCosine : FRigUnit_MathDoubleBase
{
	double A; // 0x8 (0x8)
	double B; // 0x10 (0x8)
	double C; // 0x18 (0x8)
	double AlphaAngle; // 0x20 (0x8)
	double BetaAngle; // 0x28 (0x8)
	double GammaAngle; // 0x30 (0x8)
	bool bValid; // 0x38 (0x1)
	unsigned char padding_39[0x7]; // 0x39 (0x7)
};

