// ScriptStruct /Script/RockVehicleRuntime.RockVehicleSuspensionConfig
// Size: 0x20
struct FRockVehicleSuspensionConfig
{
	float MaxRaise; // 0x0 (0x4)
	float MaxDrop; // 0x4 (0x4)
	float Stiffness; // 0x8 (0x4)
	float DampingCompression; // 0xc (0x4)
	float DampingRelaxation; // 0x10 (0x4)
	float Strength; // 0x14 (0x4)
	float RockDampingCompression; // 0x18 (0x4)
	float RockDampingRelaxation; // 0x1c (0x4)
};

