// ScriptStruct /Script/FortniteGame.RuntimeSpringsInfo
// Size: 0x20
struct FRuntimeSpringsInfo
{
	float SpringStiffMultiplier; // 0x0 (0x4)
	float SpringDampMultiplier; // 0x4 (0x4)
	float SpringLengthMultiplier; // 0x8 (0x4)
	float RearSpringLengthMultiplier; // 0xc (0x4)
	float TireZOffset; // 0x10 (0x4)
	float TireZOffsetB; // 0x14 (0x4)
	float WheelRadiusF; // 0x18 (0x4)
	float WheelRadiusB; // 0x1c (0x4)
};

