// ScriptStruct /Script/FortniteGame.ScorePlacementTable
// Size: 0xe0
struct FScorePlacementTable
{
	struct TArray<float> Solo; // 0x0 (0x10)
	struct TArray<float> Duos; // 0x10 (0x10)
	struct TArray<float> Squads; // 0x20 (0x10)
	struct TArray<float> FiftyFifty; // 0x30 (0x10)
	struct TArray<float> LargeTeam; // 0x40 (0x10)
	struct TArray<float> MediumTeam; // 0x50 (0x10)
	struct TArray<float> QuickSolo; // 0x60 (0x10)
	struct TArray<float> QuickDuo; // 0x70 (0x10)
	struct TArray<float> QuickSquad; // 0x80 (0x10)
	struct TArray<float> QuickLargeTeam; // 0x90 (0x10)
	struct TArray<float> QuickTwoTeam; // 0xa0 (0x10)
	struct TArray<float> QuickMediumTeam; // 0xb0 (0x10)
	struct TArray<float> SinglePlacement; // 0xc0 (0x10)
	struct TArray<float> Default; // 0xd0 (0x10)
};

