// ScriptStruct /Script/FortniteGame.ScoreMultiplierRow
// Size: 0x88
struct FScoreMultiplierRow : FTableRowBase
{
	float CombatMultiplier; // 0x8 (0x4)
	float BuildingMultiplier; // 0xc (0x4)
	float UtilityMultiplier; // 0x10 (0x4)
	float BadgeMultiplier; // 0x14 (0x4)
	int MonsterKills; // 0x18 (0x4)
	int MonsterDamagePoints; // 0x1c (0x4)
	int PlayerKills; // 0x20 (0x4)
	int WoodGathered; // 0x24 (0x4)
	int StoneGathered; // 0x28 (0x4)
	int MetalGathered; // 0x2c (0x4)
	int Deaths; // 0x30 (0x4)
	int BluGloActivity; // 0x34 (0x4)
	int BuildingsBuilt; // 0x38 (0x4)
	int BuildingsBuiltWood; // 0x3c (0x4)
	int BuildingsBuiltStone; // 0x40 (0x4)
	int BuildingsBuiltMetal; // 0x44 (0x4)
	int BuildingsUpgradedWood2; // 0x48 (0x4)
	int BuildingsUpgradedWood3; // 0x4c (0x4)
	int BuildingsUpgradedStone2; // 0x50 (0x4)
	int BuildingsUpgradedStone3; // 0x54 (0x4)
	int BuildingsUpgradedMetal2; // 0x58 (0x4)
	int BuildingsUpgradedMetal3; // 0x5c (0x4)
	int BuildingsDestroyed; // 0x60 (0x4)
	int RepairWood; // 0x64 (0x4)
	int RepairStone; // 0x68 (0x4)
	int RepairMetal; // 0x6c (0x4)
	int FlagsCaptured; // 0x70 (0x4)
	int FlagsReturned; // 0x74 (0x4)
	int ContainersLooted; // 0x78 (0x4)
	int CraftingPoints; // 0x7c (0x4)
	int TrapPlacementPoints; // 0x80 (0x4)
	int TrapActivationPoints; // 0x84 (0x4)
};

