// ScriptStruct /Script/SlateCore.ScrollBarStyle
// Size: 0x6e0
struct FScrollBarStyle : FSlateWidgetStyle
{
	unsigned char unreflected_8[0x8]; // 0x8 (0x8) 
	struct FSlateBrush HorizontalBackgroundImage; // 0x10 (0xc0)
	struct FSlateBrush VerticalBackgroundImage; // 0xd0 (0xc0)
	struct FSlateBrush VerticalTopSlotImage; // 0x190 (0xc0)
	struct FSlateBrush HorizontalTopSlotImage; // 0x250 (0xc0)
	struct FSlateBrush VerticalBottomSlotImage; // 0x310 (0xc0)
	struct FSlateBrush HorizontalBottomSlotImage; // 0x3d0 (0xc0)
	struct FSlateBrush NormalThumbImage; // 0x490 (0xc0)
	struct FSlateBrush HoveredThumbImage; // 0x550 (0xc0)
	struct FSlateBrush DraggedThumbImage; // 0x610 (0xc0)
	float Thickness; // 0x6d0 (0x4)
	unsigned char padding_6d4[0xc]; // 0x6d4 (0xc)
};

