// ScriptStruct /Script/FortniteGame.ShowdownTournamentEntry
// Size: 0x1e0
struct FShowdownTournamentEntry
{
	struct FString TournamentDisplayId; // 0x0 (0x10)
	struct FString TitleLine1; // 0x10 (0x10)
	struct FString TitleLine2; // 0x20 (0x10)
	struct FString ScheduleInfo; // 0x30 (0x10)
	struct FString PosterFrontImage; // 0x40 (0x10)
	struct FString PosterBackImage; // 0x50 (0x10)
	struct FString FlavorDescription; // 0x60 (0x10)
	struct FString DetailsDescription; // 0x70 (0x10)
	struct FString ShortFormatTitle; // 0x80 (0x10)
	struct FString LongFormatTitle; // 0x90 (0x10)
	struct FString BackgroundTitle; // 0xa0 (0x10)
	int PinScoreRequirement; // 0xb0 (0x4)
	unsigned char unreflected_b4[0x4]; // 0xb4 (0x4) 
	struct FString PinEarnedText; // 0xb8 (0x10)
	struct FString BaseColor; // 0xc8 (0x10)
	struct FString PrimaryColor; // 0xd8 (0x10)
	struct FString SecondaryColor; // 0xe8 (0x10)
	struct FString HighlightColor; // 0xf8 (0x10)
	struct FString TitleColor; // 0x108 (0x10)
	struct FString ShadowColor; // 0x118 (0x10)
	struct FString BackgroundLeftColor; // 0x128 (0x10)
	struct FString BackgroundRightColor; // 0x138 (0x10)
	struct FString BackgroundTextColor; // 0x148 (0x10)
	struct FString PosterFadeColor; // 0x158 (0x10)
	struct FString PlaylistTileImage; // 0x168 (0x10)
	struct FString LoadingScreenImage; // 0x178 (0x10)
	struct FString StyleInfoId; // 0x188 (0x10)
	struct FString AlertText; // 0x198 (0x10)
	struct FString SeriesPointLeaderboardName; // 0x1a8 (0x10)
	struct FString PlaylistDescription; // 0x1b8 (0x10)
	enum EFortTournamentAlertType AlertType; // 0x1c8 (0x1)
	unsigned char unreflected_1c9[0x7]; // 0x1c9 (0x7) 
	struct TArray<struct FText> RoundDisplayNames; // 0x1d0 (0x10)
};

