// ScriptStruct /Script/FortniteGame.SkyTubeAsyncInPersistent
// Size: 0x140
struct FSkyTubeAsyncInPersistent
{
	float MaxTubeSpeed; // 0x0 (0x4)
	float MaxTubeAcceleration; // 0x4 (0x4)
	unsigned char unreflected_8[0x58]; // 0x8 (0x58) 
	struct FSkyTubeSplineComponentData SplineComponentData; // 0x60 (0xd0)
	unsigned char unreflected_130[0x8]; // 0x130 (0x8) 
	unsigned char bMagnetized; // 0x138 (0x1)
	unsigned char bInSkyTube; // 0x138 (0x1)
	unsigned char padding_139[0x7]; // 0x139 (0x7)
};

