// ScriptStruct /Script/UMG.SlateMeshVertex
// Size: 0x3c
struct FSlateMeshVertex
{
	struct FVector2f* Position; // 0x0 (0x8)
	struct FColor Color; // 0x8 (0x4)
	struct FVector2f* UV0; // 0xc (0x8)
	struct FVector2f* UV1; // 0x14 (0x8)
	struct FVector2f* UV2; // 0x1c (0x8)
	struct FVector2f* UV3; // 0x24 (0x8)
	struct FVector2f* UV4; // 0x2c (0x8)
	struct FVector2f* UV5; // 0x34 (0x8)
};

