// ScriptStruct /Script/FortniteGame.SlipperySlopeParams
// Size: 0x230
struct FSlipperySlopeParams
{
	struct FScalableFloat SlopeForceAcceleration; // 0x0 (0x28)
	struct FScalableFloat MaxLateralSpeed; // 0x28 (0x28)
	struct FScalableFloat MaxLateralSpeedMultiplierInWater; // 0x50 (0x28)
	struct FScalableFloat BrakingDecelerationInWater; // 0x78 (0x28)
	struct FScalableFloat BrakingDecelerationFactorOnSlope; // 0xa0 (0x28)
	struct FScalableFloat MaxInhibitingSlopeAngle; // 0xc8 (0x28)
	struct FScalableFloat MaxInhibitingSlopeSpeedFactor; // 0xf0 (0x28)
	struct FScalableFloat MaxVerticalLaunchSpeed; // 0x118 (0x28)
	struct FScalableFloat SlopeLandingForceScalar; // 0x140 (0x28)
	struct FScalableFloat SlopeLandingMaxHorizontalForce; // 0x168 (0x28)
	struct FScalableFloat SlopeLaunchMinRequiredSpeed; // 0x190 (0x28)
	struct FScalableFloat SlopeLaunchMinRequiredAngleChange; // 0x1b8 (0x28)
	struct FScalableFloat SlopeLaunchVerticalVelocityBoost; // 0x1e0 (0x28)
	struct FScalableFloat SlopeLaunchVerticalVelocityBoostMultiplierJumping; // 0x208 (0x28)
};

