// ScriptStruct /Script/SlateCore.SliderStyle
// Size: 0x4a0
struct FSliderStyle : FSlateWidgetStyle
{
	unsigned char unreflected_8[0x8]; // 0x8 (0x8) 
	struct FSlateBrush NormalBarImage; // 0x10 (0xc0)
	struct FSlateBrush HoveredBarImage; // 0xd0 (0xc0)
	struct FSlateBrush DisabledBarImage; // 0x190 (0xc0)
	struct FSlateBrush NormalThumbImage; // 0x250 (0xc0)
	struct FSlateBrush HoveredThumbImage; // 0x310 (0xc0)
	struct FSlateBrush DisabledThumbImage; // 0x3d0 (0xc0)
	float BarThickness; // 0x490 (0x4)
	unsigned char padding_494[0xc]; // 0x494 (0xc)
};

