// ScriptStruct /Script/LauncherSocialTypes.SocialFontStyle
// Size: 0x240
struct FSocialFontStyle
{
	struct FSlateFontInfo FontSmall; // 0x0 (0x58)
	struct FSlateFontInfo FontSmallBold; // 0x58 (0x58)
	struct FSlateFontInfo FontNormal; // 0xb0 (0x58)
	struct FSlateFontInfo FontNormalBold; // 0x108 (0x58)
	struct FSlateFontInfo FontLarge; // 0x160 (0x58)
	struct FSlateFontInfo FontLargeBold; // 0x1b8 (0x58)
	struct FLinearColor DefaultFontColor; // 0x210 (0x10)
	struct FLinearColor InvertedFontColor; // 0x220 (0x10)
	struct FLinearColor DefaultDullFontColor; // 0x230 (0x10)
};

