// ScriptStruct /Script/LauncherSocialTypes.SocialListMargins
// Size: 0x210
struct FSocialListMargins
{
	struct FVector2D UserPresenceImageSize; // 0x0 (0x10)
	struct FMargin HeaderButtonMargin; // 0x10 (0x10)
	struct FMargin FriendsListMargin; // 0x20 (0x10)
	struct FMargin FriendsListNoFriendsMargin; // 0x30 (0x10)
	struct FMargin FriendsListHeaderMargin; // 0x40 (0x10)
	struct FMargin FriendsListHeaderCountMargin; // 0x50 (0x10)
	struct FMargin HeaderButtonContentMargin; // 0x60 (0x10)
	struct FMargin FriendItemMargin; // 0x70 (0x10)
	struct FMargin FriendItemStatusMargin; // 0x80 (0x10)
	struct FMargin FriendTipStatusMargin; // 0x90 (0x10)
	struct FMargin FriendItemPresenceMargin; // 0xa0 (0x10)
	struct FMargin FriendItemPlatformMargin; // 0xb0 (0x10)
	struct FMargin FriendItemTextScrollerMargin; // 0xc0 (0x10)
	struct FMargin ConfirmationBorderMargin; // 0xd0 (0x10)
	struct FMargin ConfirmationButtonMargin; // 0xe0 (0x10)
	struct FMargin ConfirmationButtonContentMargin; // 0xf0 (0x10)
	struct FMargin NoneFriendContentMargin; // 0x100 (0x10)
	float NoneFriendContentHeight; // 0x110 (0x4)
	float NoneFriendIconWidth; // 0x114 (0x4)
	struct FMargin SubMenuBackIconMargin; // 0x118 (0x10)
	struct FMargin SubMenuPageIconMargin; // 0x128 (0x10)
	struct FMargin RadioSettingTitleMargin; // 0x138 (0x10)
	struct FMargin SubMenuSearchIconMargin; // 0x148 (0x10)
	struct FMargin SubMenuSearchTextMargin; // 0x158 (0x10)
	struct FMargin SubMenuBackButtonMargin; // 0x168 (0x10)
	struct FMargin SubMenuSettingButtonMargin; // 0x178 (0x10)
	struct FMargin SubMenuListMargin; // 0x188 (0x10)
	float SubMenuSeperatorThickness; // 0x198 (0x4)
	float PresenceSeperatorThickness; // 0x19c (0x4)
	struct FMargin FriendTipMargin; // 0x1a0 (0x10)
	struct FMargin FriendTipPresenceMargin; // 0x1b0 (0x10)
	struct FMargin FriendTipSeperatorMargin; // 0x1c0 (0x10)
	struct FMargin ToolTipMargin; // 0x1d0 (0x10)
	struct FMargin TipStatusMargin; // 0x1e0 (0x10)
	struct FMargin AddButtonMargin; // 0x1f0 (0x10)
	struct FVector2D AddButtonSpacing; // 0x200 (0x10)
};

