// ScriptStruct /Script/LauncherSocialTypes.SocialListStyle
// Size: 0x3a60
struct FSocialListStyle
{
	struct FButtonStyle GlobalChatButtonStyle; // 0x0 (0x3b0)
	struct FSlateBrush GlobalChatIcon; // 0x3b0 (0xc0)
	struct FButtonStyle FriendItemButtonStyle; // 0x470 (0x3b0)
	struct FButtonStyle ConfirmButtonStyle; // 0x820 (0x3b0)
	struct FButtonStyle CancelButtonStyle; // 0xbd0 (0x3b0)
	struct FSlateColor ButtonContentColor; // 0xf80 (0x14)
	struct FSlateColor ButtonHoverContentColor; // 0xf94 (0x14)
	unsigned char unreflected_fa8[0x8]; // 0xfa8 (0x8) 
	struct FSlateBrush ActionMenuArrowBrush; // 0xfb0 (0xc0)
	struct FSlateBrush ActionMenuArrowRightBrush; // 0x1070 (0xc0)
	struct FSlateColor ActionMenuBackgroundColor; // 0x1130 (0x14)
	unsigned char unreflected_1144[0xc]; // 0x1144 (0xc) 
	struct FSlateBrush ToolTipArrowBrush; // 0x1150 (0xc0)
	struct FButtonStyle BackButtonStyle; // 0x1210 (0x3b0)
	struct FButtonStyle HeaderButtonStyle; // 0x15c0 (0x3b0)
	struct FButtonStyle FriendListActionButtonStyle; // 0x1970 (0x3b0)
	struct FSlateBrush AddFriendButtonContentBrush; // 0x1d20 (0xc0)
	struct FSlateBrush StatusIconBrush; // 0x1de0 (0xc0)
	struct FSlateBrush PCIconBrush; // 0x1ea0 (0xc0)
	struct FSlateBrush ConsoleIconBrush; // 0x1f60 (0xc0)
	struct FSlateBrush MobileIconBrush; // 0x2020 (0xc0)
	struct FSlateBrush FacebookIconBrush; // 0x20e0 (0xc0)
	struct FSlateBrush EpicIconBrush; // 0x21a0 (0xc0)
	struct FSlateBrush FriendImageBrush; // 0x2260 (0xc0)
	struct FSlateBrush OfflineBrush; // 0x2320 (0xc0)
	struct FSlateBrush OnlineBrush; // 0x23e0 (0xc0)
	struct FSlateBrush AwayBrush; // 0x24a0 (0xc0)
	struct FSlateBrush SpectateBrush; // 0x2560 (0xc0)
	struct FSlateBrush FriendsContainerBackground; // 0x2620 (0xc0)
	struct FSlateBrush FriendsListBackground; // 0x26e0 (0xc0)
	struct FEditableTextBoxStyle AddFriendEditableTextStyle; // 0x27a0 (0xd80)
	struct FSlateBrush BackBrush; // 0x3520 (0xc0)
	struct FSlateBrush SelectedOptionBrush; // 0x35e0 (0xc0)
	struct FSlateBrush SettingsBrush; // 0x36a0 (0xc0)
	struct FSlateBrush SeperatorBrush; // 0x3760 (0xc0)
	struct FSlateBrush PresenceSeperatorBrush; // 0x3820 (0xc0)
	struct FSlateBrush FontSizeBrush; // 0x38e0 (0xc0)
	struct FSlateBrush SearchBrush; // 0x39a0 (0xc0)
};

