// ScriptStruct /Script/LauncherSocialTypes.SocialStyle
// Size: 0x9a30
struct FSocialStyle
{
	struct FScrollBarStyle ScrollBarStyle; // 0x0 (0x6e0)
	struct FButtonStyle ActionButtonStyle; // 0x6e0 (0x3b0)
	struct FSocialFontStyle SmallFontStyle; // 0xa90 (0x240)
	struct FSocialFontStyle NormalFontStyle; // 0xcd0 (0x240)
	struct FSocialFontStyle LargeFontStyle; // 0xf10 (0x240)
	struct FSocialFontStyle ChatFontStyle; // 0x1150 (0x240)
	struct FCheckBoxStyle CheckBoxStyle; // 0x1390 (0xa10)
	struct FCheckBoxStyle RadioBoxStyle; // 0x1da0 (0xa10)
	struct FSocialListStyle SocialListStyle; // 0x27b0 (0x3a60)
	struct FSocialListMargins SocialListMargins; // 0x6210 (0x210)
	struct FChatStyle ChatStyle; // 0x6420 (0x1fe0)
	struct FChatColorScheme ChatColorScheme; // 0x8400 (0x120)
	struct FChatChromeStyle ChatChromeStyle; // 0x8520 (0xb50)
	struct FChatChromeMargins ChatChromeMargins; // 0x9070 (0x64)
	struct FChatChromeColorScheme ChatChromeColorScheme; // 0x90d4 (0x50)
	unsigned char unreflected_9124[0xc]; // 0x9124 (0xc) 
	struct FChatMarkupStyle ChatMarkupStyle; // 0x9130 (0x8b0)
	struct FSocialSoundSchema SoundSchema; // 0x99e0 (0x48)
	unsigned char padding_9a28[0x8]; // 0x9a28 (0x8)
};

