// ScriptStruct /Script/HmxCore.SongPos
// Size: 0x4c
struct FSongPos
{
	float Seconds; // 0x0 (0x4)
	float Milliseconds; // 0x4 (0x4)
	int TimeSigNum; // 0x8 (0x4)
	int TimeSigDenom; // 0xc (0x4)
	float Tempo; // 0x10 (0x4)
	int Tick; // 0x14 (0x4)
	float FractionalTick; // 0x18 (0x4)
	int Beat; // 0x1c (0x4)
	float FractionalBeat; // 0x20 (0x4)
	int Measure; // 0x24 (0x4)
	float FractionalMeasure; // 0x28 (0x4)
	int BeatInMeasure; // 0x2c (0x4)
	float FractionalBeatInMeasure; // 0x30 (0x4)
	int TickInMeasure; // 0x34 (0x4)
	float FractionalTickInMeasure; // 0x38 (0x4)
	int TickInBeat; // 0x3c (0x4)
	float FractionalTickInBeat; // 0x40 (0x4)
	int PulseInMeasure; // 0x44 (0x4)
	float FractionalPulseInMeasure; // 0x48 (0x4)
};

