// ScriptStruct /Script/SlateCore.SpinBoxStyle
// Size: 0x590
struct FSpinBoxStyle : FSlateWidgetStyle
{
	unsigned char unreflected_8[0x8]; // 0x8 (0x8) 
	struct FSlateBrush BackgroundBrush; // 0x10 (0xc0)
	struct FSlateBrush ActiveBackgroundBrush; // 0xd0 (0xc0)
	struct FSlateBrush HoveredBackgroundBrush; // 0x190 (0xc0)
	struct FSlateBrush ActiveFillBrush; // 0x250 (0xc0)
	struct FSlateBrush HoveredFillBrush; // 0x310 (0xc0)
	struct FSlateBrush InactiveFillBrush; // 0x3d0 (0xc0)
	struct FSlateBrush ArrowsImage; // 0x490 (0xc0)
	struct FSlateColor ForegroundColor; // 0x550 (0x14)
	struct FMargin TextPadding; // 0x564 (0x10)
	struct FMargin InsetPadding; // 0x574 (0x10)
	unsigned char padding_584[0xc]; // 0x584 (0xc)
};

