// UserDefinedStruct /Game/Characters/Survivors/Struct_SurvivorScriptedAbilities.Struct_SurvivorScriptedAbilities
// Size: 0x24
struct FStruct_SurvivorScriptedAbilities
{
	float SurvivorHelpReminderDuration14F54DDCC9447A56E42EEA23B2F26A82BF; // 0x0 (0x4)
	struct FGameplayTag NPCAbilityNonAttackCowerIndefiniteTrue6F917B44A44D629C4351341967FEDCE08; // 0x4 (0x4)
	struct FGameplayTag NPCAbilityNonAttackCowerIndefiniteFalse7E6F8C1C646C79DEF76809E829DCA289D; // 0x8 (0x4)
	struct FGameplayTag NPCAbilityNonAttackRescueTrue96F9D8205427713C6B3C45D889DF83BE4; // 0xc (0x4)
	struct FGameplayTag NPCAbilityNonAttackRescueFalse11B549D5AB4CBCBCA2155C3FAA098A58D0; // 0x10 (0x4)
	struct FGameplayTag NPCAbilityNonAttackLockInPlaceTrue181FA6565D4BC9F11CB51AC584EFDE6999; // 0x14 (0x4)
	struct FGameplayTag NPCAbilityNonAttackLockInPlaceFalse20B578575C4157F18CAD94EEBB4BA45E71; // 0x18 (0x4)
	struct FGameplayTag NPCAbilityNonAttackRescueStart28F37EAFF4488E12ABFE11299818466044; // 0x1c (0x4)
	struct FGameplayTag NPCAbilityNonAttackRescueFinish297B19BD2348AA524234D34493C53321F3; // 0x20 (0x4)
};

