// ScriptStruct /Script/Serialization.StructSerializerBuiltinTestStruct
// Size: 0xd0
struct FStructSerializerBuiltinTestStruct
{
	struct FGuid Guid; // 0x0 (0x10)
	struct FName Name; // 0x10 (0x4)
	unsigned char unreflected_14[0x4]; // 0x14 (0x4) 
	struct FString String; // 0x18 (0x10)
	struct FText Text; // 0x28 (0x18)
	struct FVector Vector; // 0x40 (0x18)
	unsigned char unreflected_58[0x8]; // 0x58 (0x8) 
	struct FVector4 Vector4; // 0x60 (0x20)
	struct FRotator Rotator; // 0x80 (0x18)
	unsigned char unreflected_98[0x8]; // 0x98 (0x8) 
	struct FQuat Quat; // 0xa0 (0x20)
	struct FColor Color; // 0xc0 (0x4)
	unsigned char padding_c4[0xc]; // 0xc4 (0xc)
};

