// ScriptStruct /Script/Serialization.StructSerializerBooleanTestStruct
// Size: 0x3
struct FStructSerializerBooleanTestStruct
{
	bool BoolFalse; // 0x0 (0x1)
	bool BoolTrue; // 0x1 (0x1)
	unsigned char Bitfield0; // 0x2 (0x1)
	unsigned char Bitfield1; // 0x2 (0x1)
	unsigned char Bitfield2Set; // 0x2 (0x1)
	unsigned char Bitfield3; // 0x2 (0x1)
	unsigned char Bitfield4Set; // 0x2 (0x1)
	unsigned char Bitfield5Set; // 0x2 (0x1)
	unsigned char Bitfield6; // 0x2 (0x1)
	unsigned char Bitfield7Set; // 0x2 (0x1)
};

