// UserDefinedStruct /Game/Effects/Niagara/Blueprints/Struc_NiagaraParameters.Struc_NiagaraParameters
// Size: 0x44
struct FStruc_NiagaraParameters
{
	struct TEnumAsByte<ENUM_NiagaraParameterSetup> ParameterSelection14A6D4854946F722970AD7D0AEC96E4705; // 0x0 (0x1)
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName FloatParameterName176AFBA48F43B44BD1ED9841983BEFA202; // 0x4 (0x4)
	float FloatParameterValue28AC98B6464E1CD803B50B47AEC91741EC; // 0x8 (0x4)
	struct FName VectorParameterName2071917CFB490B3D5D3E0864A3EE90C666; // 0xc (0x4)
	struct FVector VectorParameterValue27248856604659F589FF5D4FA5FF52E013; // 0x10 (0x18)
	struct FName LinearColorparameterName2269C61F8D45C74F98203920856CAD5ADE; // 0x28 (0x4)
	struct FLinearColor LinearColorParameterValue29861B08ED408F0F612BF509A2A94F377F; // 0x2c (0x10)
	struct FName IntegerParameterName2498306BA7452D90289F6EE9954C4F2B1D; // 0x3c (0x4)
	int IntegerParameterValue25BB84ADEA4515AABD3B9AC6A04453D826; // 0x40 (0x4)
};

