// ScriptStruct /Script/Serialization.StructSerializerByteArray
// Size: 0x38
struct FStructSerializerByteArray
{
	int Dummy1; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct TArray<unsigned char> ByteArray; // 0x8 (0x10)
	int Dummy2; // 0x18 (0x4)
	unsigned char unreflected_1c[0x4]; // 0x1c (0x4) 
	struct TArray<int8_t> Int8Array; // 0x20 (0x10)
	int Dummy3; // 0x30 (0x4)
	unsigned char padding_34[0x4]; // 0x34 (0x4)
};

