// UserDefinedStruct /Game/Athena/AI/Pawns/NPC/Parents/Struct_NPC_TargetSlots.Struct_NPC_TargetSlots
// Size: 0x78
struct FStruct_NPC_TargetSlots
{
	struct TEnumAsByte<Enum_NPC_TargetSlots> TargetSlotType6B268C50140F4F849CE916EA5DB4A30E7; // 0x0 (0x1)
	unsigned char unreflected_1[0x7]; // 0x1 (0x7) 
	class UClass* TargetSlotCountingGE7F6007B01441781AB71302C91A1C4CFD2; // 0x8 (0x8)
	struct FScalableFloat AITargetSlotSizeHF8E81162534B067D58D70AE9AC8B4B1F98; // 0x10 (0x28)
	struct FScalableFloat AITargetSlotDurationHF14A9B6ED4D4072D7BB507AA5A14118FA5B; // 0x38 (0x28)
	class UClass* TargetSlotOverrideGE116C40525043B50B2B696580B362A65DB3; // 0x60 (0x8)
	class UClass* TargetSlotOwnerGE1719F50D8848750D3BC118D9BBD861CAA1; // 0x68 (0x8)
	class UClass* TargetSlotCountingMaxedGE19BF1E1EF24CCA642F87D4379BB916F271; // 0x70 (0x8)
};

