// ScriptStruct /Script/AudioMixer.SubmixEffectReverbSettings
// Size: 0x40
struct FSubmixEffectReverbSettings
{
	bool bBypassEarlyReflections; // 0x0 (0x1)
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	float ReflectionsDelay; // 0x4 (0x4)
	float GainHF; // 0x8 (0x4)
	float ReflectionsGain; // 0xc (0x4)
	bool bBypassLateReflections; // 0x10 (0x1)
	unsigned char unreflected_11[0x3]; // 0x11 (0x3) 
	float LateDelay; // 0x14 (0x4)
	float DecayTime; // 0x18 (0x4)
	float Density; // 0x1c (0x4)
	float Diffusion; // 0x20 (0x4)
	float AirAbsorptionGainHF; // 0x24 (0x4)
	float DecayHFRatio; // 0x28 (0x4)
	float LateGain; // 0x2c (0x4)
	float Gain; // 0x30 (0x4)
	float WetLevel; // 0x34 (0x4)
	float DryLevel; // 0x38 (0x4)
	bool bBypass; // 0x3c (0x1)
	unsigned char padding_3d[0x3]; // 0x3d (0x3)
};

