// ScriptStruct /Script/FortniteGame.SynchedActionInfo
// Size: 0x30
struct FSynchedActionInfo
{
	struct FName WarpSyncPoint1Name; // 0x0 (0x4)
	struct FName WarpSyncPointLandingOrientationName; // 0x4 (0x4)
	float DistanceToTarget; // 0x8 (0x4)
	float DistanceToTargetX; // 0xc (0x4)
	float DistanceToTargetY; // 0x10 (0x4)
	float DistanceToTargetZ; // 0x14 (0x4)
	float AngleToTargetHorizontal; // 0x18 (0x4)
	float DistanceWarpPoint1ToWarpPoint2; // 0x1c (0x4)
	float DistanceWarpPoint1ToWarpPoint2X; // 0x20 (0x4)
	float DistanceWarpPoint1ToWarpPoint2Y; // 0x24 (0x4)
	float DistanceWarpPoint1ToWarpPoint2Z; // 0x28 (0x4)
	float StartingGroundAngle; // 0x2c (0x4)
};

