// ScriptStruct /Script/Synthesis.Synth2DSliderStyle
// Size: 0x3e0
struct FSynth2DSliderStyle : FSlateWidgetStyle
{
	unsigned char unreflected_8[0x8]; // 0x8 (0x8) 
	struct FSlateBrush NormalThumbImage; // 0x10 (0xc0)
	struct FSlateBrush DisabledThumbImage; // 0xd0 (0xc0)
	struct FSlateBrush NormalBarImage; // 0x190 (0xc0)
	struct FSlateBrush DisabledBarImage; // 0x250 (0xc0)
	struct FSlateBrush BackgroundImage; // 0x310 (0xc0)
	float BarThickness; // 0x3d0 (0x4)
	unsigned char padding_3d4[0xc]; // 0x3d4 (0xc)
};

