// ScriptStruct /Script/SlateCore.TableColumnHeaderStyle
// Size: 0x6d0
struct FTableColumnHeaderStyle : FSlateWidgetStyle
{
	unsigned char unreflected_8[0x8]; // 0x8 (0x8) 
	struct FSlateBrush SortPrimaryAscendingImage; // 0x10 (0xc0)
	struct FSlateBrush SortPrimaryDescendingImage; // 0xd0 (0xc0)
	struct FSlateBrush SortSecondaryAscendingImage; // 0x190 (0xc0)
	struct FSlateBrush SortSecondaryDescendingImage; // 0x250 (0xc0)
	struct FSlateBrush NormalBrush; // 0x310 (0xc0)
	struct FSlateBrush HoveredBrush; // 0x3d0 (0xc0)
	struct FSlateBrush MenuDropdownImage; // 0x490 (0xc0)
	struct FSlateBrush MenuDropdownNormalBorderBrush; // 0x550 (0xc0)
	struct FSlateBrush MenuDropdownHoveredBorderBrush; // 0x610 (0xc0)
};

