// SparseDelegateFunction /Script/Engine.TakePointDamageSignature__DelegateSignature
// Size: 0x68
struct FTakePointDamageSignature__DelegateSignature
{
	class AActor* DamagedActor; // 0x0 (0x8)
	float Damage; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	class AController* InstigatedBy; // 0x10 (0x8)
	struct FVector HitLocation; // 0x18 (0x18)
	class UPrimitiveComponent* FHitComponent; // 0x30 (0x8)
	struct FName BoneName; // 0x38 (0x4)
	unsigned char unreflected_3c[0x4]; // 0x3c (0x4) 
	struct FVector ShotFromDirection; // 0x40 (0x18)
	class UDamageType* DamageType; // 0x58 (0x8)
	class AActor* DamageCauser; // 0x60 (0x8)
};

