// SparseDelegateFunction /Script/Engine.TakeRadialDamageSignature__DelegateSignature
// Size: 0x120
struct FTakeRadialDamageSignature__DelegateSignature
{
	class AActor* DamagedActor; // 0x0 (0x8)
	float Damage; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	class UDamageType* DamageType; // 0x10 (0x8)
	struct FVector Origin; // 0x18 (0x18)
	struct FHitResult HitInfo; // 0x30 (0xe0)
	class AController* InstigatedBy; // 0x110 (0x8)
	class AActor* DamageCauser; // 0x118 (0x8)
};

