// ScriptStruct /Script/FortniteGame.TieredWaveSetCollectionData
// Size: 0x78
struct FTieredWaveSetCollectionData
{
	struct FText DefenseText; // 0x0 (0x18)
	struct FText LevelText; // 0x18 (0x18)
	struct FText WaveText; // 0x30 (0x18)
	struct FText BreatherText; // 0x48 (0x18)
	int MinLvl; // 0x60 (0x4)
	int MaxLvl; // 0x64 (0x4)
	struct FName BaseWaveLengthRowName; // 0x68 (0x4)
	struct FName BaseNumOfKillsRowName; // 0x6c (0x4)
	struct FName BaseNumOfKillPointsRowName; // 0x70 (0x4)
	struct FName WaveSet; // 0x74 (0x4)
};

