// ScriptStruct /Script/FortniteGame.TireInfo
// Size: 0x1d0
struct FTireInfo
{
	class UStaticMesh* TireStaticMesh; // 0x0 (0x8)
	class UStaticMesh* UndercarriageCollisionStaticMesh; // 0x8 (0x8)
	struct FRuntimeSpringsInfo SpringTuning; // 0x10 (0x20)
	struct FRuntimeTerrainHandlingInfo RoadBehavior; // 0x30 (0x14)
	struct FRuntimeTerrainHandlingInfo DirtBehavior; // 0x44 (0x14)
	struct FRuntimeTerrainHandlingInfo GrassBehavior; // 0x58 (0x14)
	struct FRuntimeTerrainHandlingInfo SnowBehavior; // 0x6c (0x14)
	struct FRuntimeTerrainHandlingInfo IceBehavior; // 0x80 (0x14)
	float PoppedTireSpringLength; // 0x94 (0x4)
	float PoppedTireSpringStiff; // 0x98 (0x4)
	float PoppedTireSpringDamp; // 0x9c (0x4)
	float TireMeshYaw; // 0xa0 (0x4)
	float TireMeshLateralAdjustment; // 0xa4 (0x4)
	float TireMeshScaleFront; // 0xa8 (0x4)
	float TireMeshScaleRear; // 0xac (0x4)
	struct FScalableFloat MaxDriveInclineAngle; // 0xb0 (0x28)
	float UprightRollStiff; // 0xd8 (0x4)
	float UprightRollDamp; // 0xdc (0x4)
	float UprightPitchStiff; // 0xe0 (0x4)
	float UprightPitchDamp; // 0xe4 (0x4)
	float UprightYawStiff; // 0xe8 (0x4)
	float UprightYawDamp; // 0xec (0x4)
	float MidAxleForwardAdjust; // 0xf0 (0x4)
	unsigned char unreflected_f4[0x4]; // 0xf4 (0x4) 
	struct FScalableFloat TireHealth; // 0xf8 (0x28)
	struct FScalableFloat WaterTopSpeedMultiplier; // 0x120 (0x28)
	struct FScalableFloat PontoonScaleRadiusPerTick; // 0x148 (0x28)
	struct TArray<struct FName> CollisionShapeNames; // 0x170 (0x10)
	struct TArray<struct FName> DamageablePartShapeNames; // 0x180 (0x10)
	struct FName PoppedTireBoneName; // 0x190 (0x4)
	struct FName CollisionBoneName; // 0x194 (0x4)
	class USoundWave* TireDirtLoop; // 0x198 (0x8)
	class USoundWave* TireGrassLoop; // 0x1a0 (0x8)
	class USoundWave* TireRoadLoop; // 0x1a8 (0x8)
	class USoundBase* SuspensionLight; // 0x1b0 (0x8)
	class USoundBase* SuspensionMedium; // 0x1b8 (0x8)
	class USoundBase* SuspensionHeavy; // 0x1c0 (0x8)
	class UClass* AppliedGameplayEffect; // 0x1c8 (0x8)
};

