// ScriptStruct /Script/SuperstormRuntime.TornadoConfigEntry
// Size: 0x138
struct FTornadoConfigEntry : FTableRowBase
{
	float EyeBufferDistance; // 0x8 (0x4)
	unsigned char unreflected_c[0x4]; // 0xc (0x4) 
	class UCurveFloat* TargetOrbitRadiusCurve; // 0x10 (0x8)
	float TargetOrbitRadius; // 0x18 (0x4)
	float OrbitStrength; // 0x1c (0x4)
	float TargetTangentVelocity; // 0x20 (0x4)
	float TangentVelocityVariance; // 0x24 (0x4)
	float TangentAcceleration; // 0x28 (0x4)
	float TangentAccelerationVariance; // 0x2c (0x4)
	float TangentAngleOffset; // 0x30 (0x4)
	float TargetHeightVelocity; // 0x34 (0x4)
	float HeightVelocityVariance; // 0x38 (0x4)
	float HeightAcceleration; // 0x3c (0x4)
	float HeightAccelerationVariance; // 0x40 (0x4)
	float TorqueStrength; // 0x44 (0x4)
	float TorqueVariance; // 0x48 (0x4)
	float TimeToForceEject; // 0x4c (0x4)
	float HeightToForceEject; // 0x50 (0x4)
	float DepthToForceEject; // 0x54 (0x4)
	float DistanceToForceEject; // 0x58 (0x4)
	float EjectionBoost; // 0x5c (0x4)
	float MaxDragVelocity; // 0x60 (0x4)
	float DragCoefficient1; // 0x64 (0x4)
	float DragCoefficient2; // 0x68 (0x4)
	unsigned char unreflected_6c[0x4]; // 0x6c (0x4) 
	struct TMap<enum EFortPhysicsSimSize, struct FTornadoObjectForceModifiers> SizeForceModifiers; // 0x70 (0x50)
	struct TMap<enum EFortPhysicsObjectType, struct FTornadoObjectForceModifiers> ObjectTypeForceModifiers; // 0xc0 (0x50)
	float PlayerGravityFloorOffset; // 0x110 (0x4)
	float PlayerGravityFloorWidth; // 0x114 (0x4)
	float PlayerGravityFloorGravityScalar; // 0x118 (0x4)
	float PeriodicDamageToPawns; // 0x11c (0x4)
	float PeriodicDamageToProps; // 0x120 (0x4)
	float BurstDamageToStaticActors; // 0x124 (0x4)
	float ChancePerSecondToApplyBurstDamage; // 0x128 (0x4)
	bool bAllowPickupPlayers; // 0x12c (0x1)
	bool bAllowPickupPawns; // 0x12d (0x1)
	bool bAllowPickupVehicles; // 0x12e (0x1)
	bool bAllowPickupProjectiles; // 0x12f (0x1)
	bool bAffectStaticObjects; // 0x130 (0x1)
	enum EFortPhysicsSimSize MaxAllowedPhysicsObjectSize; // 0x131 (0x1)
	enum EFortPhysicsSimSize MinAllowedPhysicsObjectSize; // 0x132 (0x1)
	unsigned char padding_133[0x5]; // 0x133 (0x5)
};

