// VerseStruct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_L_Ksubtype_Lcomponent_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mstatic__mesh_Mmaterial_R
// Size: 0x88
struct Ftuple_L_Ksubtype_Lcomponent_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mstatic__mesh_Mmaterial_R
{
	struct TArray<class UClass*> verse0x18E3F084Elem0; // 0x0 (0x10)
	struct FSpatialMath_vector3 verse0x7D844C3CElem1; // 0x10 (0x18)
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	struct FVerseRotation verse0x932BF92EElem2; // 0x30 (0x20)
	struct FSpatialMath_vector3 verse0xF64C4596Elem3; // 0x50 (0x18)
	unsigned char verse0x4F74920BElem4_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UAssets_static_mesh* verse0x2A132EB3Elem5; // 0x78 (0x8)
	class UAssets_material* verse0xC4BC9BA1Elem6; // 0x80 (0x8)
};

