// ScriptStruct /Script/FortniteGame.UrgentQuestData
// Size: 0x1a0
struct FUrgentQuestData
{
	struct FGameplayTag EventTag; // 0x0 (0x4)
	float TotalEventTime; // 0x4 (0x4)
	bool bQuestCompleteOnTimeExpiration; // 0x8 (0x1)
	bool bDisplayHUDData; // 0x9 (0x1)
	unsigned char unreflected_a[0x6]; // 0xa (0x6) 
	struct FText EventTitle; // 0x10 (0x18)
	struct FText EventSubtitle; // 0x28 (0x18)
	struct FText EventSubtitleSecondary; // 0x40 (0x18)
	struct FText EventDescription; // 0x58 (0x18)
	struct FText EventDescriptionGamepad; // 0x70 (0x18)
	struct FText EventDescriptionTouch; // 0x88 (0x18)
	struct TArray<struct FUrgentQuestDataDescOverrides> EventDescriptionOverrides; // 0xa0 (0x10)
	struct FGameplayTag EventDescriptionOverrideTag; // 0xb0 (0x4)
	int SortPriority; // 0xb4 (0x4)
	bool bHideQuestProgressBar; // 0xb8 (0x1)
	unsigned char unreflected_b9[0x7]; // 0xb9 (0x7) 
	struct FText QuestProgressTextFormat; // 0xc0 (0x18)
	bool bReverseProgressBar; // 0xd8 (0x1)
	bool bShowBountyThreatInformation; // 0xd9 (0x1)
	bool bShowBountyPriceAndDistance; // 0xda (0x1)
	bool bDisplayStartedEventUI; // 0xdb (0x1)
	bool bIsSharedUrgentQuest; // 0xdc (0x1)
	unsigned char unreflected_dd[0x3]; // 0xdd (0x3) 
	class AFortPlayerStateAthena* DisplayPlayer; // 0xe0 (0x8)
	class AFortPlayerStateAthena* AcceptingPlayer; // 0xe8 (0x8)
	struct TWeakObjectPtr<class UTexture2D> SocialAvatarBrushPtr; // 0xf0 (0x28)
	class UObject* BountyPriceImage; // 0x118 (0x8)
	struct TWeakObjectPtr<class UObject> AlertIcon; // 0x120 (0x28)
	struct TWeakObjectPtr<class USoundBase> SpecialEventStartedSound; // 0x148 (0x28)
	struct FDateTime* EventStartTime; // 0x170 (0x8)
	struct FTimerHandle* EventTimerHandle; // 0x178 (0x8)
	struct FLinearColor AlertIconBorderColor; // 0x180 (0x10)
	struct FVector2D AlertIconBrushSize; // 0x190 (0x10)
};

