// ScriptStruct /Script/FortniteGame.UserOptionMigrateLegacyDataConfig
// Size: 0xa
struct FUserOptionMigrateLegacyDataConfig
{
	bool bForceCreateDefinition; // 0x0 (0x1)
	bool bMigrateOptionsContainerData; // 0x1 (0x1)
	bool bMigrateDescription; // 0x2 (0x1)
	bool bMigrateCategoryTags; // 0x3 (0x1)
	bool bMigrateContextTags; // 0x4 (0x1)
	bool bMigrateMenuListType; // 0x5 (0x1)
	bool bMigrateEditWidget; // 0x6 (0x1)
	bool bMigrateRequireExplicitOverride; // 0x7 (0x1)
	bool bMigrateValueRange; // 0x8 (0x1)
	bool bMigrateValueData; // 0x9 (0x1)
};

