// ScriptStruct /Script/FortniteGame.VehicleEffectsPontoonParamSet
// Size: 0x28
struct FVehicleEffectsPontoonParamSet
{
	struct FName PontoonName; // 0x0 (0x4)
	struct FName EffectsName; // 0x4 (0x4)
	struct FName ImpulseParamName; // 0x8 (0x4)
	struct FName LocationParamName; // 0xc (0x4)
	struct FName RotationParamName; // 0x10 (0x4)
	struct FName WaterBodyIndex; // 0x14 (0x4)
	struct FName WaterHeightParamName; // 0x18 (0x4)
	struct FName DepthParamName; // 0x1c (0x4)
	struct FName WaterPlaneLocation; // 0x20 (0x4)
	struct FName WaterPlaneNormal; // 0x24 (0x4)
};

