// ScriptStruct /Script/FortniteGame.VehicleRuntimeModifiers
// Size: 0x18
struct FVehicleRuntimeModifiers
{
	unsigned char DataVersion; // 0x0 (0x1)
	unsigned char bHasInfiniteFuel; // 0x1 (0x1)
	unsigned char bSupportCosmeticWrap; // 0x1 (0x1)
	unsigned char unreflected_2[0x2]; // 0x2 (0x2) 
	float WaterDestructionDelay; // 0x4 (0x4)
	float SelfDestructTime; // 0x8 (0x4)
	float MaxTimeExplosion; // 0xc (0x4)
	float MaxTimeZeroHealth; // 0x10 (0x4)
	float MaxTimeSelfDestructCleanup; // 0x14 (0x4)
};

