// VerseStruct /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_move_response
// Size: 0x50
struct FVerseMovement_move_response
{
	struct FSpatialMath_vector3 verse0x0464FDB1Vector; // 0x0 (0x18)
	double verse0xA6A970E7Magnitude; // 0x18 (0x8)
	unsigned char verse0x9D526629MagnitudeCurve_20[0x8]; // 0x20 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	enum VerseMovement_move_response_type verse0x72E298E9Type; // 0x28 (0x1)
	enum VerseMovement_move_response_frame verse0x08A22912Frame; // 0x29 (0x1)
	enum VerseMovement_move_response_effect verse0xCDC901A6Effect; // 0x2a (0x1)
	enum VerseMovement_move_response_modifier verse0xCDC9EFBDModifier; // 0x2b (0x1)
	unsigned char unreflected_2c[0x4]; // 0x2c (0x4) 
	struct FSpatialMath_vector3 verse0x7B949B4BClampVector; // 0x30 (0x18)
	enum VerseMovement_move_response_frame verse0x3B045791ClampFrame; // 0x48 (0x1)
	unsigned char padding_49[0x7]; // 0x49 (0x7)
};

