// ScriptStruct /Script/Niagara.VersionedNiagaraEmitterData
// Size: 0x2e8
struct FVersionedNiagaraEmitterData
{
	struct FNiagaraAssetVersion Version; // 0x0 (0x1c)
	bool bDeprecated; // 0x1c (0x1)
	unsigned char unreflected_1d[0x3]; // 0x1d (0x3) 
	struct FText DeprecationMessage; // 0x20 (0x18)
	bool bLocalSpace; // 0x38 (0x1)
	bool bDeterminism; // 0x39 (0x1)
	unsigned char unreflected_3a[0x2]; // 0x3a (0x2) 
	int RandomSeed; // 0x3c (0x4)
	unsigned char bInterpolatedSpawning; // 0x40 (0x1)
	unsigned char unreflected_41[0x3]; // 0x41 (0x3) 
	enum ENiagaraSimTarget SimTarget; // 0x44 (0x1)
	enum ENiagaraEmitterCalculateBoundMode CalculateBoundsMode; // 0x45 (0x1)
	unsigned char unreflected_46[0x2]; // 0x46 (0x2) 
	struct FBox FixedBounds; // 0x48 (0x38)
	unsigned char bRequiresPersistentIDs; // 0x80 (0x1)
	unsigned char bCombineEventSpawn; // 0x80 (0x1)
	unsigned char unreflected_81[0x7]; // 0x81 (0x7) 
	struct TArray<struct FNiagaraEventScriptProperties> EventHandlerScriptProps; // 0x88 (0x10)
	struct FNiagaraPlatformSet Platforms; // 0x98 (0x30)
	struct FNiagaraEmitterScalabilityOverrides ScalabilityOverrides; // 0xc8 (0x10)
	unsigned char bLimitDeltaTime; // 0xd8 (0x1)
	unsigned char unreflected_d9[0x3]; // 0xd9 (0x3) 
	int MaxGPUParticlesSpawnPerFrame; // 0xdc (0x4)
	float MaxDeltaTimePerTick; // 0xe0 (0x4)
	enum EParticleAllocationMode AllocationMode; // 0xe4 (0x1)
	unsigned char unreflected_e5[0x3]; // 0xe5 (0x3) 
	int PreAllocationCount; // 0xe8 (0x4)
	unsigned char unreflected_ec[0x4]; // 0xec (0x4) 
	struct FNiagaraEmitterScriptProperties UpdateScriptProps; // 0xf0 (0x28)
	struct FNiagaraEmitterScriptProperties SpawnScriptProps; // 0x118 (0x28)
	struct FNiagaraParameterStore RendererBindings; // 0x140 (0x88)
	struct TArray<class UNiagaraRendererProperties*> RendererProperties; // 0x1c8 (0x10)
	struct TArray<class UNiagaraSimulationStageBase*> SimulationStages; // 0x1d8 (0x10)
	class UNiagaraScript* GPUComputeScript; // 0x1e8 (0x8)
	struct TArray<struct FName> SharedEventGeneratorIds; // 0x1f0 (0x10)
	struct FNiagaraEmitterScalabilitySettings CurrentScalabilitySettings; // 0x200 (0x38)
	unsigned char padding_238[0xb0]; // 0x238 (0xb0)
};

