// VerseStruct /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_DebugDraw_sphere_draw_params
// Size: 0x48
struct FVGameplayRst_DebugDraw_sphere_draw_params
{
	double verse0xE34F9FACRadius; // 0x0 (0x8)
	double verse0x652D1E0ANumSegments; // 0x8 (0x8)
	struct FColors_color verse0x65678AC7Color; // 0x10 (0x18)
	double verse0x6C915C14Thickness; // 0x28 (0x8)
	enum VGameplayRst_DebugDraw_draw_duration_policy verse0x0DBBEBBFDrawDurationPolicy; // 0x30 (0x1)
	unsigned char unreflected_31[0x7]; // 0x31 (0x7) 
	unsigned char verse0xFC2FBF02Duration_38[0x9]; // 0x38 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char padding_41[0x7]; // 0x41 (0x7)
};

