// VerseStruct /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_DebugDraw_cone_draw_params
// Size: 0x58
struct FVGameplayRst_DebugDraw_cone_draw_params
{
	double verse0x32A63D0CHeight; // 0x0 (0x8)
	double verse0x48019537NumSides; // 0x8 (0x8)
	double verse0x75E7ED0AAngleWidth; // 0x10 (0x8)
	double verse0xA92ED403AngleHeight; // 0x18 (0x8)
	struct FColors_color verse0x65678AC7Color; // 0x20 (0x18)
	double verse0x6C915C14Thickness; // 0x38 (0x8)
	enum VGameplayRst_DebugDraw_draw_duration_policy verse0x0DBBEBBFDrawDurationPolicy; // 0x40 (0x1)
	unsigned char unreflected_41[0x7]; // 0x41 (0x7) 
	unsigned char verse0xFC2FBF02Duration_48[0x9]; // 0x48 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char padding_51[0x7]; // 0x51 (0x7)
};

