// ScriptStruct /Script/FortniteGame.WaterControlParams
// Size: 0x690
struct FWaterControlParams
{
	struct FScalableFloat MinImmersionDepth; // 0x0 (0x28)
	struct FScalableFloat TargetImmersionDepth; // 0x28 (0x28)
	struct FScalableFloat MaxImmersionDepth; // 0x50 (0x28)
	struct FScalableFloat CancelCrouchImmersionDepth; // 0x78 (0x28)
	struct FScalableFloat DBNOSwimImmersionDepth; // 0xa0 (0x28)
	struct FScalableFloat MaxAcceleration; // 0xc8 (0x28)
	struct FScalableFloat MaxAccelerationSprinting; // 0xf0 (0x28)
	struct FScalableFloat BrakingDeceleration; // 0x118 (0x28)
	struct FScalableFloat MaxNormalSpeed; // 0x140 (0x28)
	struct FScalableFloat MaxSprintSpeed; // 0x168 (0x28)
	struct FScalableFloat MinSprintJumpSpeed; // 0x190 (0x28)
	struct FScalableFloat SprintJumpAirAccelAngleLimit; // 0x1b8 (0x28)
	struct FScalableFloat SprintRetriggerDelay; // 0x1e0 (0x28)
	struct FScalableFloat SprintDelayAfterFiring; // 0x208 (0x28)
	struct FScalableFloat MaxTargetingSpeed; // 0x230 (0x28)
	struct FScalableFloat BackwardsSpeedMultiplier; // 0x258 (0x28)
	struct FScalableFloat BackwardsSpeedCosAngle; // 0x280 (0x28)
	struct FScalableFloat AngledSpeedMultiplier; // 0x2a8 (0x28)
	struct FScalableFloat AngledSpeedCosAngle; // 0x2d0 (0x28)
	struct FScalableFloat Friction; // 0x2f8 (0x28)
	struct FScalableFloat FrictionSprinting; // 0x320 (0x28)
	struct FScalableFloat FrictionDirectionChangeDot; // 0x348 (0x28)
	struct FScalableFloat FrictionDirectionChangeMultiplier; // 0x370 (0x28)
	struct FScalableFloat MaxSpeedUp; // 0x398 (0x28)
	struct FScalableFloat MaxSpeedDown; // 0x3c0 (0x28)
	struct FScalableFloat MaxHorizontalEntrySpeed; // 0x3e8 (0x28)
	struct FScalableFloat WaterForceMultiplier; // 0x410 (0x28)
	struct FScalableFloat WaterForceSecondMultiplier; // 0x438 (0x28)
	struct FScalableFloat MaxWaterForce; // 0x460 (0x28)
	struct FScalableFloat WaterVelocityDepthForMax; // 0x488 (0x28)
	struct FScalableFloat WaterVelocityMinMultiplier; // 0x4b0 (0x28)
	struct FScalableFloat WaterSimMaxTimeStep; // 0x4d8 (0x28)
	struct FScalableFloat WaterSimSubStepTime; // 0x500 (0x28)
	struct FScalableFloat BobbingMaxForce; // 0x528 (0x28)
	struct FScalableFloat BobbingIdealDepthTolerance; // 0x550 (0x28)
	struct FScalableFloat BobbingFrictionDown; // 0x578 (0x28)
	struct FScalableFloat BobbingExpDragDown; // 0x5a0 (0x28)
	struct FScalableFloat BobbingFrictionDownSubmerged; // 0x5c8 (0x28)
	struct FScalableFloat BobbingExpDragDownSubmerged; // 0x5f0 (0x28)
	struct FScalableFloat BobbingFrictionUp; // 0x618 (0x28)
	struct FScalableFloat BobbingExpDragUp; // 0x640 (0x28)
	struct FScalableFloat BoostDragMultiplier; // 0x668 (0x28)
};

