// ScriptStruct /Script/FortniteGame.WorkerSetBonusData
// Size: 0x38
struct FWorkerSetBonusData
{
	struct FGameplayTag SetBonusTypeTag; // 0x0 (0x4)
	unsigned char unreflected_4[0x4]; // 0x4 (0x4) 
	struct FText DisplayName; // 0x8 (0x18)
	int RequiredWorkersCount; // 0x20 (0x4)
	unsigned char unreflected_24[0x4]; // 0x24 (0x4) 
	class UClass* SetBonusEffect; // 0x28 (0x8)
	int SelectionWeight; // 0x30 (0x4)
	int PowerPoints; // 0x34 (0x4)
};

