// Class /Script/GameplayAbilities.AbilitySystemTestAttributeSet
// Size: 0x70
class UAbilitySystemTestAttributeSet : public UAttributeSet
{
	float MaxHealth; // 0x30 (0x4)
	float Health; // 0x34 (0x4)
	float Mana; // 0x38 (0x4)
	float MaxMana; // 0x3c (0x4)
	float Damage; // 0x40 (0x4)
	float SpellDamage; // 0x44 (0x4)
	float PhysicalDamage; // 0x48 (0x4)
	float CritChance; // 0x4c (0x4)
	float CritMultiplier; // 0x50 (0x4)
	float ArmorDamageReduction; // 0x54 (0x4)
	float DodgeChance; // 0x58 (0x4)
	float LifeSteal; // 0x5c (0x4)
	float Strength; // 0x60 (0x4)
	float StackingAttribute1; // 0x64 (0x4)
	float StackingAttribute2; // 0x68 (0x4)
	float NoStackAttribute; // 0x6c (0x4)
};

