// Class /Script/GameplayAbilities.AbilitySystemComponent
// Size: 0x1398
class UAbilitySystemComponent : public UGameplayTasksComponent
{
	unsigned char unreflected_118[0x10]; // 0x118 (0x10) 
	struct TArray<struct FAttributeDefaults> DefaultStartingData; // 0x128 (0x10)
	struct FName AffectedAnimInstanceTag; // 0x138 (0x4)
	unsigned char unreflected_13c[0x19c]; // 0x13c (0x19c) 
	float OutgoingDuration; // 0x2d8 (0x4)
	float IncomingDuration; // 0x2dc (0x4)
	unsigned char unreflected_2e0[0x20]; // 0x2e0 (0x20) 
	struct TArray<struct FString> ClientDebugStrings; // 0x300 (0x10)
	struct TArray<struct FString> ServerDebugStrings; // 0x310 (0x10)
	unsigned char unreflected_320[0x60]; // 0x320 (0x60) 
	bool UserAbilityActivationInhibited; // 0x380 (0x1)
	bool ReplicationProxyEnabled; // 0x381 (0x1)
	bool bSuppressGrantAbility; // 0x382 (0x1)
	bool bSuppressGameplayCues; // 0x383 (0x1)
	unsigned char unreflected_384[0x4]; // 0x384 (0x4) 
	struct TArray<class AGameplayAbilityTargetActor*> SpawnedTargetActors; // 0x388 (0x10)
	unsigned char unreflected_398[0x28]; // 0x398 (0x28) 
	class AActor* OwnerActor; // 0x3c0 (0x8)
	class AActor* AvatarActor; // 0x3c8 (0x8)
	unsigned char unreflected_3d0[0x10]; // 0x3d0 (0x10) 
	struct FGameplayAbilitySpecContainer ActivatableAbilities; // 0x3e0 (0x120)
	unsigned char unreflected_500[0x30]; // 0x500 (0x30) 
	struct TArray<class UGameplayAbility*> AllReplicatedInstancedAbilities; // 0x530 (0x10)
	unsigned char unreflected_540[0x210]; // 0x540 (0x210) 
	struct FGameplayAbilityRepAnimMontage RepAnimMontageInfo; // 0x750 (0x38)
	bool bCachedIsNetSimulated; // 0x788 (0x1)
	bool bPendingMontageRep; // 0x789 (0x1)
	unsigned char unreflected_78a[0x6]; // 0x78a (0x6) 
	struct FGameplayAbilityLocalAnimMontage LocalAnimMontageInfo; // 0x790 (0x30)
	unsigned char unreflected_7c0[0xa0]; // 0x7c0 (0xa0) 
	struct FActiveGameplayEffectsContainer ActiveGameplayEffects; // 0x860 (0x478)
	struct FActiveGameplayCueContainer ActiveGameplayCues; // 0xcd8 (0x128)
	struct FActiveGameplayCueContainer MinimalReplicationGameplayCues; // 0xe00 (0x128)
	unsigned char unreflected_f28[0x128]; // 0xf28 (0x128) 
	struct TArray<unsigned char> BlockedAbilityBindings; // 0x1050 (0x10)
	unsigned char unreflected_1060[0x128]; // 0x1060 (0x128) 
	struct FMinimalReplicationTagCountMap MinimalReplicationTags; // 0x1188 (0x60)
	struct TArray<class UAttributeSet*> SpawnedAttributes; // 0x11e8 (0x10)
	unsigned char unreflected_11f8[0x10]; // 0x11f8 (0x10) 
	struct FMinimalReplicationTagCountMap ReplicatedLooseTags; // 0x1208 (0x60)
	unsigned char unreflected_1268[0x8]; // 0x1268 (0x8) 
	struct FReplicatedPredictionKeyMap ReplicatedPredictionKeyMap; // 0x1270 (0x118)
	unsigned char padding_1388[0x10]; // 0x1388 (0x10)

	/* Functions */

	// Function /Script/GameplayAbilities.AbilitySystemComponent.UpdateActiveGameplayEffectSetByCallerMagnitudes (Underlying native function: UpdateActiveGameplayEffectSetByCallerMagnitudes 0x6aead94)
	void UpdateActiveGameplayEffectSetByCallerMagnitudes(struct FActiveGameplayEffectHandle*& ActiveHandle, struct TMap<struct FGameplayTag, float>& NewSetByCallerValues); // (BlueprintAuthorityOnly | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/GameplayAbilities.AbilitySystemComponent.UpdateActiveGameplayEffectSetByCallerMagnitude (Underlying native function: UpdateActiveGameplayEffectSetByCallerMagnitude 0x6aeac90)
	void UpdateActiveGameplayEffectSetByCallerMagnitude(struct FActiveGameplayEffectHandle*& ActiveHandle, struct FGameplayTag& SetByCallerTag, float& NewValue); // (BlueprintAuthorityOnly | Native | Public | BlueprintCallable)

