// Class /Script/Engine.AnimInstance
// Size: 0x350
class UAnimInstance : public UObject
{
	class USkeleton* CurrentSkeleton; // 0x28 (0x8)
	struct TEnumAsByte<ERootMotionMode> RootMotionMode; // 0x30 (0x1)
	unsigned char bUseMultiThreadedAnimationUpdate; // 0x31 (0x1)
	unsigned char bUsingCopyPoseFromMesh; // 0x31 (0x1)
	unsigned char bReceiveNotifiesFromLinkedInstances; // 0x31 (0x1)
	unsigned char bPropagateNotifiesToLinkedInstances; // 0x31 (0x1)
	unsigned char bUseMainInstanceMontageEvaluationData; // 0x31 (0x1)
	unsigned char bQueueMontageEvents; // 0x31 (0x1)
	unsigned char unreflected_32[0x6]; // 0x32 (0x6) 
	struct FMulticastInlineDelegate OnMontageBlendingOut; // 0x38 (0x10)
	struct FMulticastInlineDelegate OnMontageStarted; // 0x48 (0x10)
	struct FMulticastInlineDelegate OnMontageEnded; // 0x58 (0x10)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68 (0x10)
	unsigned char unreflected_78[0xd8]; // 0x78 (0xd8) 
	struct FAnimNotifyQueue NotifyQueue; // 0x150 (0x70)
	struct TArray<struct FAnimNotifyEvent> ActiveAnimNotifyState; // 0x1c0 (0x10)
	struct TArray<struct FAnimNotifyEventReference> ActiveAnimNotifyEventReference; // 0x1d0 (0x10)
	unsigned char padding_1e0[0x170]; // 0x1e0 (0x170)

	/* Functions */

	// Function /Script/Engine.AnimInstance.WasAnimNotifyTriggeredInStateMachine (Underlying native function: WasAnimNotifyTriggeredInStateMachine 0x9c620b0)
	bool WasAnimNotifyTriggeredInStateMachine(int& MachineIndex, class UClass*& AnimNotifyType); // (Final | Native | Public | BlueprintCallable | BlueprintPure)

	// Function /Script/Engine.AnimInstance.WasAnimNotifyTriggeredInSourceState (Underlying native function: WasAnimNotifyTriggeredInSourceState 0x9c61f80)
	bool WasAnimNotifyTriggeredInSourceState(int& MachineIndex, int& StateIndex, class UClass*& AnimNotifyType); // (Final | Native | Public | BlueprintCallable | BlueprintPure)

	// Function /Script/Engine.AnimInstance.WasAnimNotifyTriggeredInAnyState (Underlying native function: WasAnimNotifyTriggeredInAnyState 0x9c61ed8)
	bool WasAnimNotifyTriggeredInAnyState(class UClass*& AnimNotifyType); // (Final | Native | Public | BlueprintCallable | BlueprintPure)

