// Class /Script/AugmentedReality.ARTrackableNotifyComponent
// Size: 0x1f0
class UARTrackableNotifyComponent : public UActorComponent
{
	struct FMulticastInlineDelegate OnAddTrackedGeometry; // 0xa0 (0x10)
	struct FMulticastInlineDelegate OnUpdateTrackedGeometry; // 0xb0 (0x10)
	struct FMulticastInlineDelegate OnRemoveTrackedGeometry; // 0xc0 (0x10)
	struct FMulticastInlineDelegate OnAddTrackedPlane; // 0xd0 (0x10)
	struct FMulticastInlineDelegate OnUpdateTrackedPlane; // 0xe0 (0x10)
	struct FMulticastInlineDelegate OnRemoveTrackedPlane; // 0xf0 (0x10)
	struct FMulticastInlineDelegate OnAddTrackedPoint; // 0x100 (0x10)
	struct FMulticastInlineDelegate OnUpdateTrackedPoint; // 0x110 (0x10)
	struct FMulticastInlineDelegate OnRemoveTrackedPoint; // 0x120 (0x10)
	struct FMulticastInlineDelegate OnAddTrackedImage; // 0x130 (0x10)
	struct FMulticastInlineDelegate OnUpdateTrackedImage; // 0x140 (0x10)
	struct FMulticastInlineDelegate OnRemoveTrackedImage; // 0x150 (0x10)
	struct FMulticastInlineDelegate OnAddTrackedFace; // 0x160 (0x10)
	struct FMulticastInlineDelegate OnUpdateTrackedFace; // 0x170 (0x10)
	struct FMulticastInlineDelegate OnRemoveTrackedFace; // 0x180 (0x10)
	struct FMulticastInlineDelegate OnAddTrackedEnvProbe; // 0x190 (0x10)
	struct FMulticastInlineDelegate OnUpdateTrackedEnvProbe; // 0x1a0 (0x10)
	struct FMulticastInlineDelegate OnRemoveTrackedEnvProbe; // 0x1b0 (0x10)
	struct FMulticastInlineDelegate OnAddTrackedObject; // 0x1c0 (0x10)
	struct FMulticastInlineDelegate OnUpdateTrackedObject; // 0x1d0 (0x10)
	struct FMulticastInlineDelegate OnRemoveTrackedObject; // 0x1e0 (0x10)
};

