// VerseClass /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset
// Size: 0xe8
class UAssets_asset : public UVerseAssetPtr
{
	unsigned char unreflected_90[0x48]; // 0x90 (0x48) 
	unsigned char verse0xD636D109AssetPath_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char verse0x9702F5DAL2fVerse2eorg2fAssets2fassetNRAsyncLoad_a0[0x10]; // 0xa0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b0[0x10]; // 0xb0 (0x10) 
	unsigned char verse0xE0CBA11BL2fVerse2eorg2fAssets2fassetNRGetAssetType_c0[0x10]; // 0xc0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x78F21562L2fVerse2eorg2fAssets2fassetNRGetAsyncLoadEvent_b0[0x10]; // 0xb0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xFD8E69ACL2fVerse2eorg2fAssets2fassetNRSyncLoad_90[0x10]; // 0x90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_a0[0x48]; // 0xa0 (0x48)

	/* Functions */

	// Function /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RSyncLoad (Underlying native function: _L_2fVerse_2eorg_2fAssets_2fasset_N_RSyncLoad 0x6d33d18)
	unsigned char L2fVerse2eorg2fAssets2fassetNRSyncLoad(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAsyncLoadEvent (Underlying native function: _L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAsyncLoadEvent 0x6d33d10)
	void L2fVerse2eorg2fAssets2fassetNRGetAsyncLoadEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAssetType (Underlying native function: _L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAssetType 0x6d33d08)
	void L2fVerse2eorg2fAssets2fassetNRGetAssetType(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RAsync__Load (Underlying native function: _L_2fVerse_2eorg_2fAssets_2fasset_N_RAsync__Load 0x6d33d00)
	void L2fVerse2eorg2fAssets2fassetNRAsyncLoad(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

