// Class /Script/FortniteUI.AthenaBroadcastKillFeedItemBase
// Size: 0x3b8
class UAthenaBroadcastKillFeedItemBase : public UFortHUDElementWidget
{
	unsigned char unreflected_2d0[0x8]; // 0x2d0 (0x8) 
	struct TWeakObjectPtr<class UMaterialInterface> EliminationIcon; // 0x2d8 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> StormIcon; // 0x300 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> FallDamageIcon; // 0x328 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> ExplosionIcon; // 0x350 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> DbnoIcon; // 0x378 (0x28)
	class UCommonTextBlock* TextInstigatorName; // 0x3a0 (0x8)
	class UCommonTextBlock* TextVictimName; // 0x3a8 (0x8)
	class UImage* ImageEntryIcon; // 0x3b0 (0x8)
};

