// Class /Script/FortniteGame.AthenaSeasonItemDefinition
// Size: 0x838
class UAthenaSeasonItemDefinition : public UFortAccountItemDefinition
{
	bool bXpOnlySeason; // 0x420 (0x1)
	bool bCapFreeBattlePassLevels; // 0x421 (0x1)
	bool bUseSeasonCurveForBattlePassRewards; // 0x422 (0x1)
	unsigned char unreflected_423[0x5]; // 0x423 (0x5) 
	class UDataTable* SeasonXpOnlyExtendedCurve; // 0x428 (0x8)
	class UFortMedalsPunchCardItemDefinition* DailyPunchCard; // 0x430 (0x8)
	class UFortRepeatableDailiesCardItemDefinition* RepeatableDailiesCard; // 0x438 (0x8)
	class UDataTable* RestedXpCatchupProgression; // 0x440 (0x8)
	class UFortPlayerAugmentsAccountItemDefinition* PlayerAugmentDefinition; // 0x448 (0x8)
	int SeasonStartCalendarOffsetDays; // 0x450 (0x4)
	int SeasonNumber; // 0x454 (0x4)
	int NumSeasonLevels; // 0x458 (0x4)
	int SeasonLevelPurchaseMax; // 0x45c (0x4)
	class UDataTable* SeasonXpCurve; // 0x460 (0x8)
	struct FString SeasonStorefront; // 0x468 (0x10)
	struct FString BattlePassOfferId; // 0x478 (0x10)
	struct FString BattlePassBundleOfferId; // 0x488 (0x10)
	struct FString BattlePassLevelOfferId; // 0x498 (0x10)
	int BattlePassLevelOfferMaxLevel; // 0x4a8 (0x4)
	unsigned char unreflected_4ac[0x4]; // 0x4ac (0x4) 
	struct FString BattlePassLevelBundleOfferID; // 0x4b0 (0x10)
	int BattlePassLevelBundleOfferMaxLevel; // 0x4c0 (0x4)
	int BattlePassLevelBundleOfferNumLevels; // 0x4c4 (0x4)
	struct FCurveTableRowHandle LogFireRestXPCap; // 0x4c8 (0x10)
	struct TArray<struct FPrimaryAssetId*> FreeTokenItemPrimaryAssetIds; // 0x4d8 (0x10)
	struct FAthenaRewardSchedule SeasonXpScheduleFree; // 0x4e8 (0x10)
	struct FAthenaSeasonBannerLevelSchedule SeasonBannerSchedule; // 0x4f8 (0x10)
	class UFortChallengeBundleItemDefinition* SeasonalGlyphChallengeBundle; // 0x508 (0x8)
	struct FString GlyphTokenTemplateId; // 0x510 (0x10)
	class UDataTable* SeasonalGlyphRewards; // 0x520 (0x8)
	class UFortChallengeBundleScheduleDefinition* ChallengeSchedulePaid; // 0x528 (0x8)
	struct TArray<class UFortChallengeBundleScheduleDefinition*> ChallengeSchedulesAlwaysShown; // 0x530 (0x10)
	class UAthenaRewardScheduleLevelDataAsset* SeasonGrantsToEveryoneDataAsset; // 0x540 (0x8)
	struct FAthenaRewardScheduleLevel SeasonGrantsToEveryone; // 0x548 (0x10)
	struct FAthenaRewardScheduleLevel SeasonFirstWinRewards; // 0x558 (0x10)
	struct FAthenaRewardScheduleLevel BattleStarSubstitutionReward; // 0x568 (0x10)
	struct FGameplayTag FreeSeasonItemContentTag; // 0x578 (0x4)
	struct FGameplayTag SeasonGrantsToEveryoneItemContentTag; // 0x57c (0x4)
	struct FGameplayTag SeasonFirstWinItemContentTag; // 0x580 (0x4)
	unsigned char unreflected_584[0x4]; // 0x584 (0x4) 
	struct TArray<struct FXpDisplayConversion> XpDisplayOverride; // 0x588 (0x10)
	struct TWeakObjectPtr<class UFortItemDefinition> XpItemDef; // 0x598 (0x28)
	struct TWeakObjectPtr<class UFortItemDefinition> LevelUpItemDef; // 0x5c0 (0x28)
	struct TArray<struct FSeasonCurrencyMcpData> SeasonCurrencyMcpDataList; // 0x5e8 (0x10)
	struct TArray<struct TWeakObjectPtr<class UFortItemDefinition>> ExpiringRewardTypes; // 0x5f8 (0x10)
	class UAthenaProfileItemsToRemoveAtSeasonEndDataAsset* ProfileItemsToRemoveAtSeasonEndDataAsset; // 0x608 (0x8)
	struct TArray<struct TWeakObjectPtr<class UFortItemDefinition>> TokensToRemoveAtSeasonEnd; // 0x610 (0x10)
	class UAthenaMidSeasonUpdatesDataAsset* MidSeasonUpdatesDataAsset; // 0x620 (0x8)
	struct TArray<struct FAthenaMidSeasonUpdate> MidSeasonUpdates; // 0x628 (0x10)
	bool bRemoveAllDailyQuestsAtSeasonEnd; // 0x638 (0x1)
	bool bRemoveAllTransientQuestsAtSeasonEnd; // 0x639 (0x1)
	unsigned char unreflected_63a[0x6]; // 0x63a (0x6) 
	struct TWeakObjectPtr<class UFortTokenType> NoBattleBundleToken; // 0x640 (0x28)
	struct TWeakObjectPtr<class UFortCollectionsDataTable> CollectionsDataTable; // 0x668 (0x28)
	class UDataTable* NPCConversationQuests; // 0x690 (0x8)
	struct TMap<struct FGameplayTag, class UDataTable*> SeasonDataTables; // 0x698 (0x50)
	struct TMap<struct FGameplayTag, class UDataAsset*> SeasonDataAssets; // 0x6e8 (0x50)
	struct TArray<struct FGameplayTag> FirstTimeTrackedBitFlags; // 0x738 (0x10)
	struct TArray<class UAthenaSeasonItemData*> AdditionalSeasonData; // 0x748 (0x10)
	struct FAthenaRewardSchedule BookXpScheduleFree; // 0x758 (0x10)
	struct FGameplayTag BattlePassFreeItemContentTag; // 0x768 (0x4)
	unsigned char unreflected_76c[0x4]; // 0x76c (0x4) 
	struct FAthenaRewardSchedule BookXpSchedulePaid; // 0x770 (0x10)
	struct FGameplayTag BattlePassPaidItemContentTag; // 0x780 (0x4)
	unsigned char unreflected_784[0x4]; // 0x784 (0x4) 
	struct FAthenaRewardSchedule AdditionalBookSchedule; // 0x788 (0x10)
	struct FGameplayTag BattlePassAdditionalItemContentTag; // 0x798 (0x4)
	unsigned char unreflected_79c[0x4]; // 0x79c (0x4) 
	struct TArray<int> FreeLevelsThatNavigateToBattlePass; // 0x7a0 (0x10)
	struct TArray<struct FTrackCategory> TrackCategories; // 0x7b0 (0x10)
	class UDataTable* BookXpCurve; // 0x7c0 (0x8)
	int NumBookLevels; // 0x7c8 (0x4)
	int NumAdditionalBookLevels; // 0x7cc (0x4)
	class UFortSharedQuestData* SharedQuestData; // 0x7d0 (0x8)
	unsigned char padding_7d8[0x60]; // 0x7d8 (0x60)
};

