// Class /Script/FortniteUI.AthenaSpectatorPlayerListEntryBase
// Size: 0x3c8
class UAthenaSpectatorPlayerListEntryBase : public UAthenaSpectatorPlayerWidgetBase
{
	class UCommonBorder* BorderSquadColor; // 0x378 (0x8)
	class UCommonTextBlock* TextSquadId; // 0x380 (0x8)
	class UCommonTextBlock* TextPlayerName; // 0x388 (0x8)
	class UCommonTextBlock* TextKillScore; // 0x390 (0x8)
	class UAthenaSpectatorHitPointBarBase* HitPointHealthBar; // 0x398 (0x8)
	class UAthenaSpectatorHitPointBarBase* HitPointShieldBar; // 0x3a0 (0x8)
	class UCommonTextBlock* TextEventScore; // 0x3a8 (0x8)
	class UImage* ImageRecordingPlayerIcon; // 0x3b0 (0x8)
	class UImage* ImageFollowedPlayerIcon; // 0x3b8 (0x8)
	class UCommonButtonLegacy* Button; // 0x3c0 (0x8)
};

