// Class /Script/FortniteUI.AthenaSpatialStyleChallengeScreen
// Size: 0x4c0
class UAthenaSpatialStyleChallengeScreen : public UAthenaSpatialItemPreviewScreen
{
	class UCommonButtonLegacy* ButtonPrevious; // 0x480 (0x8)
	class UCommonButtonLegacy* ButtonNext; // 0x488 (0x8)
	class UCommonTextBlock* TextTitle; // 0x490 (0x8)
	class UCommonTextBlock* TextDescription; // 0x498 (0x8)
	class UDynamicEntryBox* EntryBoxCharacterChoices; // 0x4a0 (0x8)
	class UCommonButtonGroupLegacy* ButtonGroupCharacterChoices; // 0x4a8 (0x8)
	class UAthenaSpatialStyleChallengeDetails* ChallengeDetailsCharacterDetails; // 0x4b0 (0x8)
	class UAthenaSpatialStyleChallengeScreenData* StyleChallengeData; // 0x4b8 (0x8)

	/* Functions */

	// Function /Script/FortniteUI.AthenaSpatialStyleChallengeScreen.OnShowFirstTimeInfo (Has no native function)
	void OnShowFirstTimeInfo(); // (Event | Protected | BlueprintEvent)
};

