// Class /Script/FortniteUI.AthenaSpatialItemPreviewScreen
// Size: 0x480
class UAthenaSpatialItemPreviewScreen : public UAthenaSpatialScreen
{
	class UFortItemView* ItemViewObject; // 0x438 (0x8)
	struct FName ItemPreviewActorTag; // 0x440 (0x4)
	unsigned char unreflected_444[0x14]; // 0x444 (0x14) 
	struct FDataTableRowHandle ItemPreviewRotateInputAction; // 0x458 (0x10)
	bool bEnableItemPreviewRotation; // 0x468 (0x1)
	unsigned char unreflected_469[0x7]; // 0x469 (0x7) 
	class UAnimationAsset* IdleAnimation; // 0x470 (0x8)
	bool bLooping; // 0x478 (0x1)
	unsigned char padding_479[0x7]; // 0x479 (0x7)
};

