// Class /Script/FortniteUI.AthenaMapPlayerEliminationsWidget
// Size: 0x2c8
class UAthenaMapPlayerEliminationsWidget : public UCommonUserWidget
{
	unsigned char unreflected_290[0x8]; // 0x290 (0x8) 
	struct FName ParamNamePlayerIconTexture; // 0x298 (0x4)
	struct FName ParamNamePlayerIconBackgroundColor; // 0x29c (0x4)
	bool bIsLocalPlayer; // 0x2a0 (0x1)
	unsigned char unreflected_2a1[0x7]; // 0x2a1 (0x7) 
	class UImage* ImagePlayerIcon; // 0x2a8 (0x8)
	class UCommonTextBlock* TextPlayerName; // 0x2b0 (0x8)
	class UCommonTextBlock* TextElimCount; // 0x2b8 (0x8)
	unsigned char padding_2c0[0x8]; // 0x2c0 (0x8)
};

