// Class /Script/FortniteUI.AthenaChallengeSetListView
// Size: 0x3c0
class UAthenaChallengeSetListView : public UAthenaChallengeListViewBase
{
	struct FAthenaChallengeListVisualOptions ListVisualOptions; // 0x368 (0xc)
	bool bHideHeaders; // 0x374 (0x1)
	bool bHideCompletionRewards; // 0x375 (0x1)
	bool bHideQuestRewards; // 0x376 (0x1)
	bool bUseCompactActionInfo; // 0x377 (0x1)
	bool bAllowFocus; // 0x378 (0x1)
	unsigned char unreflected_379[0x2f]; // 0x379 (0x2f) 
	class UClass* SectionHeaderEntryClass; // 0x3a8 (0x8)
	class UClass* CompletionRewardEntryClass; // 0x3b0 (0x8)
	class UClass* SpecialOfferEntryClass; // 0x3b8 (0x8)
};

