// WidgetBlueprintGeneratedClass /Game/UI/Foundation/Modals/ControllerDisconnectedModal/Athena_ControllerDisconnectedModal.Athena_ControllerDisconnectedModal_C
// Size: 0x400
class UAthena_ControllerDisconnectedModal_C : public UAthenaControllerDisconnectedModal
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x3c0 (0x8)
	class UWidgetAnimation* Intro; // 0x3c8 (0x8)
	class UCommonActionWidget* CommonActionWidget164; // 0x3d0 (0x8)
	class UImage* Image66; // 0x3d8 (0x8)
	class UImage* ImageSeparatorDown; // 0x3e0 (0x8)
	class UImage* ImageSeparatorUp; // 0x3e8 (0x8)
	class ULightbox_C* Lightbox; // 0x3f0 (0x8)
	class UImage* ProgressSpinner; // 0x3f8 (0x8)

	/* Functions */

	// Function /Game/UI/Foundation/Modals/ControllerDisconnectedModal/Athena_ControllerDisconnectedModal.Athena_ControllerDisconnectedModal_C.BP_OnActivated (Has no native function)
	void BPOnActivated(); // (Event | Protected | BlueprintEvent)

	// Function /Game/UI/Foundation/Modals/ControllerDisconnectedModal/Athena_ControllerDisconnectedModal.Athena_ControllerDisconnectedModal_C.ExecuteUbergraph_Athena_ControllerDisconnectedModal (Has no native function)
	void ExecuteUbergraphAthenaControllerDisconnectedModal(int& EntryPoint, class UUMGSequencePlayer*& CallFuncPlayAnimationForwardReturnValue); // (Final | 0x00008000)
};

