// Class /Script/FortniteAI.AthenaAIServicePlayerBots
// Size: 0xe10
class UAthenaAIServicePlayerBots : public UAthenaAIService
{
	unsigned char unreflected_78[0x8]; // 0x78 (0x8) 
	class UFortAthenaAISpawnerDataComponentList* DefaultAISpawnerDataComponentList; // 0x80 (0x8)
	class UFortAthenaAISpawnerDataComponent_SpawnParamsBase* DefaultAISpawnComponent; // 0x88 (0x8)
	struct TArray<struct FFortServerBotInfo> DeadBots; // 0x90 (0x10)
	struct TArray<struct FFortServerBotInfo> PlayerBotsRestartLeft; // 0xa0 (0x10)
	struct FVector ZiplineOctreeCenter; // 0xb0 (0x18)
	struct FScalableFloat ZiplineOctreeRadius; // 0xc8 (0x28)
	struct FScalableFloat UseZiplines; // 0xf0 (0x28)
	unsigned char unreflected_118[0x138]; // 0x118 (0x138) 
	struct FDebugMinimapData DebugMinimapData; // 0x250 (0x1b0)
	struct FName MarkPlayerBotsAggressiveStencilName; // 0x400 (0x4)
	struct FName MarkPlayerBotsDefensiveStencilName; // 0x404 (0x4)
	bool bBotHostileToHumanPlayersOnly; // 0x408 (0x1)
	unsigned char unreflected_409[0x7]; // 0x409 (0x7) 
	struct FScalableFloat UseAllBattleBusPOIsSquadRatio; // 0x410 (0x28)
	class UCurveFloat* TagQueryWeightChance; // 0x438 (0x8)
	struct TWeakObjectPtr<class UEnvQuery> FindLocationsAroundPOIQuery; // 0x440 (0x28)
	struct TArray<struct FBattleBusPOI> BattleBusTagQueryPOIList; // 0x468 (0x10)
	struct TArray<struct FBattleBusPOI> SecondaryBattleBusTagQueryPOIList; // 0x478 (0x10)
	unsigned char unreflected_488[0x8]; // 0x488 (0x8) 
	struct TArray<struct FNavigationPOI> OnGroundTagQueryPOIList; // 0x490 (0x10)
	struct FConstructionBuildingInfo ConstructionBuildingInfo[0x6]; // 0x4a0 (0x18) (ARRAY) 
	struct FScalableFloat UseCustomSupportedItemList; // 0x530 (0x28)
	class UDataTable* BotItemDataTable; // 0x558 (0x8)
	struct FName AugmentsRegistryName; // 0x560 (0x4)
	unsigned char unreflected_564[0x4]; // 0x564 (0x4) 
	struct FScalableFloat UseRegionalNameList; // 0x568 (0x28)
	struct FScalableFloat MaxAnonymousBotCount; // 0x590 (0x28)
	struct TWeakObjectPtr<class UFortAthenaAIBotNameDataAsset> BotNameDataAsset; // 0x5b8 (0x28)
	struct FScalableFloat CosmeticVariationCount; // 0x5e0 (0x28)
	struct FScalableFloat ThankBusDriverProbability; // 0x608 (0x28)
	struct FScalableFloat ThankBusDriverMinTime; // 0x630 (0x28)
	struct FScalableFloat ThankBusDriverMaxTime; // 0x658 (0x28)
	struct FScalableFloat ShowSeasonLevelProbability; // 0x680 (0x28)
	struct FScalableFloat SpectateOthersOnDeath; // 0x6a8 (0x28)
	struct FScalableFloat MaxNumberOfBotsToSpawnAroundPlayer; // 0x6d0 (0x28)
	float MaxAroundBotDistanceToSearchPOIToLand; // 0x6f8 (0x4)
	unsigned char unreflected_6fc[0x4]; // 0x6fc (0x4) 
	struct FScalableFloat BackfillEnabled; // 0x700 (0x28)
	struct FScalableFloat UsePlayerCosmeticForBackfill; // 0x728 (0x28)
	struct FScalableFloat UsePlayerInventoryForBackfill; // 0x750 (0x28)
	struct FScalableFloat OnlyUseBackfillDuringSafezones; // 0x778 (0x28)
	struct TWeakObjectPtr<class UClass> BackfillSpawnerData; // 0x7a0 (0x28)
	struct FGameplayTagContainer SupportedItemTags; // 0x7c8 (0x20)
	struct TArray<struct FCachedPOIVolumeLocations> CachedValidPOIVolumeLocations; // 0x7e8 (0x10)
	struct TArray<class ABuildingFoundation*> CachedBuildingFoundations; // 0x7f8 (0x10)
	struct TArray<struct FFortBotAugmentsDataTableRow> CachedSupportedAugments; // 0x808 (0x10)
	unsigned char unreflected_818[0x150]; // 0x818 (0x150) 
	class AFortPlayerStartWarmup* LastTeamPlayerStart; // 0x968 (0x8)
	unsigned char unreflected_970[0x8]; // 0x970 (0x8) 
	struct TMap<int, class UCacheSafeZoneLocation*> CacheSafeZoneLocationsMap; // 0x978 (0x50)
	float DeadBotCleanupMinDelay; // 0x9c8 (0x4)
	unsigned char unreflected_9cc[0xc]; // 0x9cc (0xc) 
	struct TSet<struct FString> ReservedPlayerNames; // 0x9d8 (0x50)
	unsigned char unreflected_a28[0x8]; // 0xa28 (0x8) 
	struct TArray<int> LocationsInSafeZoneFreeIndices; // 0xa30 (0x10)
	unsigned char unreflected_a40[0x50]; // 0xa40 (0x50) 
	class AFortTeamInfoAthena* CurrentFillingTeam; // 0xa90 (0x8)
	unsigned char unreflected_a98[0x58]; // 0xa98 (0x58) 
	struct FScalableFloat BotsUniqueIDUseValidAccountID; // 0xaf0 (0x28)
	int CurrentBotControllerUID; // 0xb18 (0x4)
	unsigned char unreflected_b1c[0x4]; // 0xb1c (0x4) 
	struct TArray<class UFortAthenaBeaconComponent*> BeaconList; // 0xb20 (0x10)
	unsigned char bWaitForNavmeshToBeLoaded; // 0xb30 (0x1)
	unsigned char bDoSpawnBotFlow; // 0xb30 (0x1)
	unsigned char bDoMapSampling; // 0xb31 (0x1)
	enum EAthenaGamePhase GamePhaseToStartSpawning; // 0xb32 (0x1)
	unsigned char unreflected_b33[0x5]; // 0xb33 (0x5) 
	class UClass* DefaultBotAISpawnerData; // 0xb38 (0x8)
	unsigned char unreflected_b40[0x10]; // 0xb40 (0x10) 
	struct TWeakObjectPtr<class UEnvQuery> EQSMapSampling; // 0xb50 (0x28)
	unsigned char unreflected_b78[0x30]; // 0xb78 (0x30) 
	struct FScalableFloat CanReviveDownedSquad; // 0xba8 (0x28)
	class UAthenaAIPopulationTracker* CachedAIPopulationTracker; // 0xbd0 (0x8)
	struct TArray<struct FFortServerBotInfo> PlayerBots; // 0xbd8 (0x10)
	struct TArray<struct FFortServerBotInfo> NonAthenaParticipantBots; // 0xbe8 (0x10)
	unsigned char unreflected_bf8[0x88]; // 0xbf8 (0x88) 
	struct TWeakObjectPtr<class UDataTable> MMRSpawnTable; // 0xc80 (0x28)
	struct FMMRSpawningPlayerBotsRuntimeInfo CachedMMRSpawningInfo; // 0xca8 (0x38)
	unsigned char unreflected_ce0[0x20]; // 0xce0 (0x20) 
	struct FScalableFloat OverridePOISpreadingSquadCount; // 0xd00 (0x28)
	unsigned char unreflected_d28[0xb8]; // 0xd28 (0xb8) 
	struct FScalableFloat OnlyPickPOIsInSafeZone; // 0xde0 (0x28)
	unsigned char padding_e08[0x8]; // 0xe08 (0x8)

	/* Functions */

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.SpawnAI (Underlying native function: SpawnAI 0xa3e4930)
	class APawn* SpawnAI(struct FVector& InSpawnLocation, struct FRotator& InSpawnRotation, class UFortAthenaAISpawnerDataComponentList*& AISpawnerComponentList); // (Final | 0x00000002 | Native | Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.OnServerGameMemberRemoved (Underlying native function: OnServerGameMemberRemoved 0xa3e4264)
	void OnServerGameMemberRemoved(unsigned char& InSquadId, unsigned char& InTeamIndex, class AFortPlayerStateAthena*& ChangedPS); // (Final | Native | Private)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.OnSafeZoneUpdated (Underlying native function: OnSafeZoneUpdated 0xa3e4250)
	void OnSafeZoneUpdated(); // (Final | Native | Private)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.OnPlaylistDataReady (Underlying native function: OnPlaylistDataReady 0xa3e4128)
	void OnPlaylistDataReady(class AFortGameStateAthena*& GameState, class UFortPlaylist*& Playlist, struct FGameplayTagContainer& PlaylistContextTags); // (Final | Native | Protected | HasOutParms)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.OnPawnSpawned (Underlying native function: OnPawnSpawned 0xa3e3ef0)
	void OnPawnSpawned(class APawn*& Pawn, int& RequestId, bool& bIsRespawn); // (Final | Native | Private)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.OnGamePhaseChanged (Underlying native function: OnGamePhaseChanged 0xa3e3874)
	void OnGamePhaseChanged(enum EAthenaGamePhase& NewPhase); // (0x00000002 | Native | Protected)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.OnAgentGameOver (Underlying native function: OnAgentGameOver 0xa3e33f8)
	void OnAgentGameOver(class AFortAthenaAIBotController*& AIBotController, class AFortPawn*& Pawn, class AController*& Instigator); // (Final | Native | Private)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.KillBots (Underlying native function: KillBots 0xa3e3078)
	void KillBots(bool& bKillPlayers, bool& bKillNoneParticipants, unsigned char& TeamIndex, class AActor*& BotOwner); // (Final | 0x00000002 | Native | Public | BlueprintCallable)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.JoinTeam (Underlying native function: JoinTeam 0xa3e2dcc)
	void JoinTeam(class AController*& SourceTeamController, class AController*& DestinationTeamController); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.IsWeaponSupported (Underlying native function: IsWeaponSupported 0xa3e2c9c)
	bool IsWeaponSupported(class AFortWeapon*& FortWeapon); // (Final | BlueprintAuthorityOnly | Native | Public | BlueprintCallable)

	// Function /Script/FortniteAI.AthenaAIServicePlayerBots.FetchNextCustomBotCosmeticVariantID (Underlying native function: FetchNextCustomBotCosmeticVariantID 0xa3e2008)
	int FetchNextCustomBotCosmeticVariantID(class AFortPlayerPawnAthena*& BotPawn); // (Final | Native | Public | BlueprintCallable)
};

