// Class /Script/FortniteUI.BacchusBoundActionButton
// Size: 0x1440
class UBacchusBoundActionButton : public UCommonBoundActionButton
{
	class UClass* KeyboardStyle; // 0x13f8 (0x8)
	class UClass* LargeKeyboardStyle; // 0x1400 (0x8)
	class UClass* GamepadStyle; // 0x1408 (0x8)
	class UClass* LargeGamepadStyle; // 0x1410 (0x8)
	bool bUseAdditionalStyle; // 0x1418 (0x1)
	unsigned char unreflected_1419[0x7]; // 0x1419 (0x7) 
	class UClass* KeyboardAdditionalStyle; // 0x1420 (0x8)
	class UClass* LargeKeyboardAdditionalStyle; // 0x1428 (0x8)
	class UClass* GamepadAdditionalStyle; // 0x1430 (0x8)
	class UClass* LargeGamepadAdditionalStyle; // 0x1438 (0x8)
};

