// AnimBlueprintGeneratedClass /Game/Weapons/FORT_BuildingTools/Meshes/Blueprint_Paper_VIM.Blueprint_Paper_VIM_C
// Size: 0x19e0
class UBlueprint_Paper_VIM_C : public UFortAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x530 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x538 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x540 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x548 (0x20)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNodeMeshRefPose; // 0x568 (0x10)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0x578 (0x20)
	unsigned char unreflected_598[0x8]; // 0x598 (0x8) 
	struct FAnimNode_AnimDynamics AnimGraphNodeAnimDynamics3; // 0x5a0 (0x510)
	struct FAnimNode_AnimDynamics AnimGraphNodeAnimDynamics2; // 0xab0 (0x510)
	struct FAnimNode_AnimDynamics AnimGraphNodeAnimDynamics1; // 0xfc0 (0x510)
	struct FAnimNode_AnimDynamics AnimGraphNodeAnimDynamics; // 0x14d0 (0x510)

	/* Functions */

	// Function /Game/Weapons/FORT_BuildingTools/Meshes/Blueprint_Paper_VIM.Blueprint_Paper_VIM_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Weapons/FORT_BuildingTools/Meshes/Blueprint_Paper_VIM.Blueprint_Paper_VIM_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Blueprint_Paper_VIM_AnimGraphNode_AnimDynamics_9E5EF2534AF35AEF656F7798016DF75B (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphBlueprintPaperVIMAnimGraphNodeAnimDynamics9E5EF2534AF35AEF656F7798016DF75B(); // (BlueprintEvent)

	// Function /Game/Weapons/FORT_BuildingTools/Meshes/Blueprint_Paper_VIM.Blueprint_Paper_VIM_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Blueprint_Paper_VIM_AnimGraphNode_AnimDynamics_3AF159404BD341EBBF1D83916A014149 (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphBlueprintPaperVIMAnimGraphNodeAnimDynamics3AF159404BD341EBBF1D83916A014149(); // (BlueprintEvent)

	// Function /Game/Weapons/FORT_BuildingTools/Meshes/Blueprint_Paper_VIM.Blueprint_Paper_VIM_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Blueprint_Paper_VIM_AnimGraphNode_AnimDynamics_ADC4973B4FF994FAB62509B5C600BF73 (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphBlueprintPaperVIMAnimGraphNodeAnimDynamicsADC4973B4FF994FAB62509B5C600BF73(); // (BlueprintEvent)

	// Function /Game/Weapons/FORT_BuildingTools/Meshes/Blueprint_Paper_VIM.Blueprint_Paper_VIM_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Blueprint_Paper_VIM_AnimGraphNode_AnimDynamics_BCA43E284168E0AB05BB9E98D217441B (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphBlueprintPaperVIMAnimGraphNodeAnimDynamicsBCA43E284168E0AB05BB9E98D217441B(); // (BlueprintEvent)

	// Function /Game/Weapons/FORT_BuildingTools/Meshes/Blueprint_Paper_VIM.Blueprint_Paper_VIM_C.ExecuteUbergraph_Blueprint_Paper_VIM (Has no native function)
	void ExecuteUbergraphBlueprintPaperVIM(int& EntryPoint, double& CallFuncAddDoubleDoubleReturnValue, float& K2NodeStructMemberSetAlphaImplicitCast, float& K2NodeStructMemberSetAlphaImplicitCast1, float& K2NodeStructMemberSetAlphaImplicitCast2, float& K2NodeStructMemberSetAlphaImplicitCast3); // (Final | 0x00008000)
};

