// AnimBlueprintGeneratedClass /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C
// Size: 0x5b88
class UBoarRidingPlayerLayerAnimBP_C : public UFortVehicleLayerAnimInstance_Riding
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0xac0 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0xac8 (0x90)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0xb58 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0xb60 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0xb68 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0xb88 (0xc0)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone8; // 0xc48 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone7; // 0xd70 (0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace1; // 0xe98 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace1; // 0xeb8 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone6; // 0xed8 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone5; // 0x1000 (0x128)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive5; // 0x1128 (0xc8)
	struct FAnimNode_LegIK AnimGraphNodeLegIK1; // 0x11f0 (0xf8)
	struct FAnimNode_LegIK AnimGraphNodeLegIK; // 0x12e8 (0xf8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer9; // 0x13e0 (0x70)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x1450 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0x1470 (0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose2; // 0x1530 (0x100)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace; // 0x1630 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0x1650 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool17; // 0x1670 (0x48)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone4; // 0x16b8 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone3; // 0x17e0 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone2; // 0x1908 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone1; // 0x1a30 (0x128)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult62; // 0x1b58 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult61; // 0x1b80 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult60; // 0x1ba8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult59; // 0x1bd0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult58; // 0x1bf8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult57; // 0x1c20 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult56; // 0x1c48 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult55; // 0x1c70 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult54; // 0x1c98 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult53; // 0x1cc0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult52; // 0x1ce8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult51; // 0x1d10 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult50; // 0x1d38 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult49; // 0x1d60 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult48; // 0x1d88 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult47; // 0x1db0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult46; // 0x1dd8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult45; // 0x1e00 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer43; // 0x1e28 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer42; // 0x1e70 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool16; // 0x1eb8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult41; // 0x1f00 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer41; // 0x1f20 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer40; // 0x1f68 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool15; // 0x1fb0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult40; // 0x1ff8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer39; // 0x2018 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool14; // 0x2060 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer38; // 0x20a8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer37; // 0x20f0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool13; // 0x2138 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult39; // 0x2180 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer36; // 0x21a0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult38; // 0x21e8 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer8; // 0x2208 (0x70)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer35; // 0x2278 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive4; // 0x22c0 (0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool12; // 0x2388 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer34; // 0x23d0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult37; // 0x2418 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer33; // 0x2438 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult36; // 0x2480 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult44; // 0x24a0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult43; // 0x24c8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult42; // 0x24f0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult41; // 0x2518 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult40; // 0x2540 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult39; // 0x2568 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult38; // 0x2590 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult37; // 0x25b8 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer32; // 0x25e0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult35; // 0x2628 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer31; // 0x2648 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult34; // 0x2690 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer30; // 0x26b0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult33; // 0x26f8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer29; // 0x2718 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult32; // 0x2760 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult36; // 0x2780 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine9; // 0x27a8 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult31; // 0x2870 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer28; // 0x2890 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult30; // 0x28d8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer27; // 0x28f8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult29; // 0x2940 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer26; // 0x2960 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult28; // 0x29a8 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult35; // 0x29c8 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine8; // 0x29f0 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult27; // 0x2ab8 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult34; // 0x2ad8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult33; // 0x2b00 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer25; // 0x2b28 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult26; // 0x2b70 (0x20)
	struct FAnimNode_StateResult AnimGraphNodeStateResult25; // 0x2b90 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine7; // 0x2bb0 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive3; // 0x2c78 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer7; // 0x2d40 (0x70)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer24; // 0x2db0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer23; // 0x2df8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool11; // 0x2e40 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool10; // 0x2e88 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer6; // 0x2ed0 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive2; // 0x2f40 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult24; // 0x3008 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer22; // 0x3028 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult23; // 0x3070 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine6; // 0x3090 (0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend1; // 0x3158 (0xe0)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose5; // 0x3238 (0x28)
	struct FAnimNode_Inertialization AnimGraphNodeInertialization; // 0x3260 (0x100)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace2; // 0x3360 (0x118)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend; // 0x3478 (0xe0)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult32; // 0x3558 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult31; // 0x3580 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult30; // 0x35a8 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose4; // 0x35d0 (0x28)
	struct FAnimNode_StateResult AnimGraphNodeStateResult22; // 0x35f8 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer5; // 0x3618 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult21; // 0x3688 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose3; // 0x36a8 (0x28)
	struct FAnimNode_StateResult AnimGraphNodeStateResult20; // 0x36d0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine5; // 0x36f0 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0x37b8 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x38b8 (0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x38e0 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x39e0 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x3a08 (0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace1; // 0x3a30 (0x118)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive1; // 0x3b48 (0xd0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace; // 0x3c18 (0x118)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult29; // 0x3d30 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult28; // 0x3d58 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult27; // 0x3d80 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult26; // 0x3da8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult25; // 0x3dd0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult24; // 0x3df8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult23; // 0x3e20 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult22; // 0x3e48 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult21; // 0x3e70 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult20; // 0x3e98 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult19; // 0x3ec0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult18; // 0x3ee8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult17; // 0x3f10 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult16; // 0x3f38 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult15; // 0x3f60 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult14; // 0x3f88 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult13; // 0x3fb0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult12; // 0x3fd8 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer21; // 0x4000 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer20; // 0x4048 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool9; // 0x4090 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult19; // 0x40d8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer19; // 0x40f8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer18; // 0x4140 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool8; // 0x4188 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult18; // 0x41d0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer17; // 0x41f0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult17; // 0x4238 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer16; // 0x4258 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer15; // 0x42a0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool7; // 0x42e8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult16; // 0x4330 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult11; // 0x4350 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult10; // 0x4378 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult9; // 0x43a0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult8; // 0x43c8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult7; // 0x43f0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult6; // 0x4418 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult5; // 0x4440 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult4; // 0x4468 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer14; // 0x4490 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult15; // 0x44d8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer13; // 0x44f8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult14; // 0x4540 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer12; // 0x4560 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult13; // 0x45a8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer11; // 0x45c8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult12; // 0x4610 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult3; // 0x4630 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine4; // 0x4658 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult11; // 0x4720 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer10; // 0x4740 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult10; // 0x4788 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer9; // 0x47a8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult9; // 0x47f0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer8; // 0x4810 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult8; // 0x4858 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult2; // 0x4878 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine3; // 0x48a0 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult7; // 0x4968 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0x4988 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult6; // 0x49d0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0x49f0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool6; // 0x4a38 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0x4a80 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x4ac8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x4b10 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult5; // 0x4b58 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x4b78 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult4; // 0x4bc0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x4be0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x4c28 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x4c70 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer4; // 0x4cb8 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x4d28 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult3; // 0x4d70 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine2; // 0x4d90 (0xc8)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone; // 0x4e58 (0x128)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0x4f80 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x4fa8 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x4fd0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult2; // 0x5018 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose1; // 0x5038 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x5048 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine1; // 0x5068 (0xc8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive; // 0x5130 (0xd0)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive1; // 0x5200 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer3; // 0x52c8 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive; // 0x5338 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer2; // 0x5400 (0x70)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose; // 0x5470 (0x10)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x5480 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x54c8 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x5510 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x5580 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x55f0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x5638 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x5658 (0xc8)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x5720 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0x5740 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0x5800 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x58c0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x58e0 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x59a0 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x5a60 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x5b20 (0x20)
	class AFortPlayerPawn* FortPlayer; // 0x5b40 (0x8)
	class AFortPawn* WildlifePawn; // 0x5b48 (0x8)
	bool StateRuleMovingIdle; // 0x5b50 (0x1)
	bool IsJumping; // 0x5b51 (0x1)
	bool IsFalling; // 0x5b52 (0x1)
	bool IsSurfaceSwimming; // 0x5b53 (0x1)
	unsigned char unreflected_5b54[0x4]; // 0x5b54 (0x4) 
	double BodyRoll; // 0x5b58 (0x8)
	double BoarSpeed2D; // 0x5b60 (0x8)
	bool IsMovingBackwards; // 0x5b68 (0x1)
	bool IsBoosting; // 0x5b69 (0x1)
	bool CanTransitionFallToMoving; // 0x5b6a (0x1)
	bool CanTransitionFallToIdle; // 0x5b6b (0x1)
	bool CanTransitionIdleToMoving; // 0x5b6c (0x1)
	bool IsTurninginPlace; // 0x5b6d (0x1)
	unsigned char unreflected_5b6e[0x2]; // 0x5b6e (0x2) 
	double TurninPlaceAngleDelta; // 0x5b70 (0x8)
	bool ShouldPlayStopBackwards; // 0x5b78 (0x1)
	bool PlayLandAdditive; // 0x5b79 (0x1)
	bool WasTurningRight; // 0x5b7a (0x1)
	unsigned char unreflected_5b7b[0x5]; // 0x5b7b (0x5) 
	double BackwardsPlayRate; // 0x5b80 (0x8)

	/* Functions */

	// Function /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleFinalPoseOverride (Has no native function)
	void VehicleFinalPoseOverride(struct FPoseLink& InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleFullBodyOverride (Has no native function)
	void VehicleFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleLowerBodyOverride (Has no native function)
	void VehicleLowerBodyOverride(struct FPoseLink& InPoseLowerBodyDefault, struct FPoseLink& InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleSplitBodyOverride (Has no native function)
	void VehicleSplitBodyOverride(struct FPoseLink& InPoseSplitBody, struct FPoseLink& InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace& TurnInPlace, struct FPoseLink& InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.GetMainAnimBPData_Boar (Has no native function)
	void GetMainAnimBPDataBoar(class UObject*& AnimInstance, class UBurt_AnimBP_C*& K2NodeDynamicCastAsBurtAnimBP, bool& K2NodeDynamicCastbSuccess, bool& CallFuncIsValidReturnValue, double& K2NodeVariableSetBackwardsPlayRateImplicitCast, double& K2NodeVariableSetBodyRollImplicitCast, double& K2NodeVariableSetTurninPlaceAngleDeltaImplicitCast, double& K2NodeVariableSetBoarSpeed2DImplicitCast); // (Public | BlueprintCallable | BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BoarRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_3AC2A6BB409F97D93A87FE8016464FEE (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphBoarRidingPlayerLayerAnimBPAnimGraphNodeBlendListByBool3AC2A6BB409F97D93A87FE8016464FEE(); // (BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.BlueprintCollectRidableAnimBPData (Has no native function)
	void BlueprintCollectRidableAnimBPData(class UAnimInstance*& RidableAnimInstance); // (Event | Protected | BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.ExecuteUbergraph_BoarRidingPlayerLayerAnimBP (Has no native function)
	void ExecuteUbergraphBoarRidingPlayerLayerAnimBP(int& EntryPoint, bool& CallFuncGreaterDoubleDoubleReturnValue, class UAnimInstance*& K2NodeEventRidableAnimInstance); // (Final | 0x00008000)
};

