// AnimBlueprintGeneratedClass /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C
// Size: 0x4610
class UBurt_AnimBP_C : public UFortAIFaunaAnimInstance_Burt
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x780 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x788 (0x68)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x7f0 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x7f8 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x800 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x820 (0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool12; // 0x8e0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer35; // 0x928 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer34; // 0x970 (0x48)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x9b8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x9d8 (0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer33; // 0xa98 (0x48)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0xae0 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult53; // 0xb00 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult52; // 0xb28 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult51; // 0xb50 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult50; // 0xb78 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult49; // 0xba0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult48; // 0xbc8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult47; // 0xbf0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult46; // 0xc18 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult45; // 0xc40 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult44; // 0xc68 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult43; // 0xc90 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult42; // 0xcb8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult41; // 0xce0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult40; // 0xd08 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult39; // 0xd30 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult38; // 0xd58 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult37; // 0xd80 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult36; // 0xda8 (0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer9; // 0xdd0 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive11; // 0xe40 (0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer32; // 0xf08 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer31; // 0xf50 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool11; // 0xf98 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult30; // 0xfe0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer30; // 0x1000 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult29; // 0x1048 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer29; // 0x1068 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult28; // 0x10b0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer28; // 0x10d0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult27; // 0x1118 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult35; // 0x1138 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult34; // 0x1160 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer27; // 0x1188 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult26; // 0x11d0 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose3; // 0x11f0 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult25; // 0x1200 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine7; // 0x1220 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive10; // 0x12e8 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive9; // 0x13b0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer8; // 0x1478 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer7; // 0x14e8 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult24; // 0x1558 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x1578 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool10; // 0x15a0 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend; // 0x15e8 (0xe0)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool9; // 0x16c8 (0x48)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x1710 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer26; // 0x1738 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer25; // 0x1780 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive8; // 0x17c8 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer6; // 0x1890 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult23; // 0x1900 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine6; // 0x1920 (0xc8)
	struct FAnimNode_Slot AnimGraphNodeSlot1; // 0x19e8 (0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace; // 0x1a30 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0x1a50 (0x20)
	struct FAnimNode_Slot AnimGraphNodeSlot; // 0x1a70 (0x48)
	struct FAnimNode_LegIK AnimGraphNodeLegIK; // 0x1ab8 (0xf8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive7; // 0x1bb0 (0xc8)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult33; // 0x1c78 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult32; // 0x1ca0 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer24; // 0x1cc8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult22; // 0x1d10 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose2; // 0x1d30 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult21; // 0x1d40 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine5; // 0x1d60 (0xc8)
	struct FFortAnimNode_QuadrupedSlopeWarping FortAnimGraphNodeQuadrupedSlopeWarping; // 0x1e28 (0x5c8)
	struct FFortAnimNode_WeightedLookAt FortAnimGraphNodeWeightedLookAt; // 0x23f0 (0x250)
	struct FAnimNode_Inertialization AnimGraphNodeInertialization; // 0x2640 (0x100)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer; // 0x2740 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x2808 (0x100)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool8; // 0x2908 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer23; // 0x2950 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool7; // 0x2998 (0x48)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult31; // 0x29e0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult30; // 0x2a08 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult29; // 0x2a30 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult28; // 0x2a58 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult27; // 0x2a80 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult26; // 0x2aa8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult25; // 0x2ad0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult24; // 0x2af8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult23; // 0x2b20 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult22; // 0x2b48 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult21; // 0x2b70 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult20; // 0x2b98 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult19; // 0x2bc0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult18; // 0x2be8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult17; // 0x2c10 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult16; // 0x2c38 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult15; // 0x2c60 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult14; // 0x2c88 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool6; // 0x2cb0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer22; // 0x2cf8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer21; // 0x2d40 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult20; // 0x2d88 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult13; // 0x2da8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult12; // 0x2dd0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult11; // 0x2df8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult10; // 0x2e20 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult9; // 0x2e48 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult8; // 0x2e70 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult7; // 0x2e98 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult6; // 0x2ec0 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer20; // 0x2ee8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult19; // 0x2f30 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer19; // 0x2f50 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult18; // 0x2f98 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer18; // 0x2fb8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult17; // 0x3000 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer17; // 0x3020 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult16; // 0x3068 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult5; // 0x3088 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine4; // 0x30b0 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult15; // 0x3178 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer16; // 0x3198 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult14; // 0x31e0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer15; // 0x3200 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult13; // 0x3248 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer14; // 0x3268 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult12; // 0x32b0 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult4; // 0x32d0 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine3; // 0x32f8 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult11; // 0x33c0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer13; // 0x33e0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer12; // 0x3428 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x3470 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult10; // 0x34b8 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x34d8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer11; // 0x3520 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer5; // 0x3568 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive6; // 0x35d8 (0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer10; // 0x36a0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer9; // 0x36e8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x3730 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult9; // 0x3778 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer8; // 0x3798 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer4; // 0x37e0 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive5; // 0x3850 (0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x3918 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0x3960 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult8; // 0x39a8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0x39c8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult7; // 0x3a10 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0x3a30 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult6; // 0x3a78 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer3; // 0x3a98 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive4; // 0x3b08 (0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x3bd0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x3c18 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer2; // 0x3c60 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive3; // 0x3cd0 (0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x3d98 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x3de0 (0x48)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult3; // 0x3e28 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult2; // 0x3e50 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x3e78 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult5; // 0x3ec0 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose1; // 0x3ee0 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult4; // 0x3ef0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine2; // 0x3f10 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive2; // 0x3fd8 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive1; // 0x40a0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x4168 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x41d8 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult3; // 0x4248 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x4268 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult2; // 0x42b0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine1; // 0x42d0 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive; // 0x4398 (0xc8)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0x4460 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x4488 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x44b0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x44f8 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose; // 0x4518 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x4528 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x4548 (0xc8)

	/* Functions */

	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.Fauna IdleTurn (Has no native function)
	void FaunaIdleTurn(struct FPoseLink& InPoseIdleTurn, struct FPoseLink& FaunaIdleTurn); // (HasOutParms | BlueprintCallable)

	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.Fauna Idle (Has no native function)
	void FaunaIdle(struct FPoseLink& InPoseIdle, struct FPoseLink& FaunaIdle); // (HasOutParms | BlueprintCallable)

	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Burt_AnimBP_AnimGraphNode_BlendSpacePlayer_2DD8FBAB4C767B0770C81BBB25A41BD3 (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphBurtAnimBPAnimGraphNodeBlendSpacePlayer2DD8FBAB4C767B0770C81BBB25A41BD3(); // (BlueprintEvent)

	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimNotify_FallExit (Has no native function)
	void AnimNotifyFallExit(); // (BlueprintCallable | BlueprintEvent)

	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimNotify_LandAddExit (Has no native function)
	void AnimNotifyLandAddExit(); // (BlueprintCallable | BlueprintEvent)

	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimNotify_LandEnter (Has no native function)
	void AnimNotifyLandEnter(); // (BlueprintCallable | BlueprintEvent)

	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.ExecuteUbergraph_Burt_AnimBP (Has no native function)
	void ExecuteUbergraphBurtAnimBP(int& EntryPoint, double& CallFuncDivideDoubleDoubleReturnValue, double& CallFuncDivideDoubleDoubleAImplicitCast, float& K2NodeStructMemberSetFloatProperty3ImplicitCast); // (Final | 0x00008000)
};

