// Class /Script/FortniteGame.CCP_AnimInstance_Body_MaleRaptorKnightLowMs
// Size: 0x770
class UCCP_AnimInstance_Body_MaleRaptorKnightLowMs : public UCustomCharacterPartAnimInstance
{
	struct FVector GravityOverride; // 0x6e8 (0x18)
	struct FVector SlopeRootTrans; // 0x700 (0x18)
	struct FRotator SlopeFootRot; // 0x718 (0x18)
	float ArmLiftRAlpha; // 0x730 (0x4)
	bool bIsAimingRifle; // 0x734 (0x1)
	unsigned char unreflected_735[0x3]; // 0x735 (0x3) 
	float ArmLiftRInRangeA; // 0x738 (0x4)
	float ArmLiftRInRangeB; // 0x73c (0x4)
	float ArmLiftROutRangeA; // 0x740 (0x4)
	float ArmLiftROutRangeB; // 0x744 (0x4)
	bool bIsSkydivingAny; // 0x748 (0x1)
	bool bIsJumpingOrFalling; // 0x749 (0x1)
	unsigned char unreflected_74a[0x2]; // 0x74a (0x2) 
	float IsNotFrontEndAlpha; // 0x74c (0x4)
	float IsFrontEndAlpha; // 0x750 (0x4)
	float IsFrontEndSwordConstraintsAlpha; // 0x754 (0x4)
	float IsPlayingFullBodySlotInFrontEndAlpha; // 0x758 (0x4)
	float IsSkyDivingAlpha; // 0x75c (0x4)
	float IsAimingRifleAlpha; // 0x760 (0x4)
	bool bSwordPassEnabled0; // 0x764 (0x1)
	bool bSwordPassEnabled1; // 0x765 (0x1)
	bool bSwordPassEnabled2; // 0x766 (0x1)
	bool bSwordPassEnabled3; // 0x767 (0x1)
	unsigned char padding_768[0x8]; // 0x768 (0x8)
};

