// Class /Script/FortniteGame.CCP_AnimInstance_Body_CubeQueen
// Size: 0x750
class UCCP_AnimInstance_Body_CubeQueen : public UCustomCharacterPartAnimInstance
{
	bool bIsCrouchMoving; // 0x6e8 (0x1)
	bool bIsCrouchIdling; // 0x6e9 (0x1)
	unsigned char unreflected_6ea[0x2]; // 0x6ea (0x2) 
	float ClavL; // 0x6ec (0x4)
	float ClavR; // 0x6f0 (0x4)
	float CrouchMovingAlpha; // 0x6f4 (0x4)
	float CrouchSprintingAlpha; // 0x6f8 (0x4)
	float RigidBodyEnabledAlpha; // 0x6fc (0x4)
	float CrouchMovingAlphaTrue; // 0x700 (0x4)
	float CrouchMovingAlphaFalse; // 0x704 (0x4)
	float CrouchMovingAlphaInterpSpeed; // 0x708 (0x4)
	float CrouchSprintingAlphaTrue; // 0x70c (0x4)
	float CrouchSprintingAlphaFalse; // 0x710 (0x4)
	float RigidBodyEnabledAlphaTrue; // 0x714 (0x4)
	float RigidBodyEnabledAlphaFalse; // 0x718 (0x4)
	float ClavRInRangeA; // 0x71c (0x4)
	float ClavRInRangeB; // 0x720 (0x4)
	float ClavROutRangeA; // 0x724 (0x4)
	float ClavROutRangeB; // 0x728 (0x4)
	float ClavLInRangeA; // 0x72c (0x4)
	float ClavLInRangeB; // 0x730 (0x4)
	float ClavLOutRangeA; // 0x734 (0x4)
	float ClavLOutRangeB; // 0x738 (0x4)
	struct FName ClavRSourceBone; // 0x73c (0x4)
	struct FName ClavRBaseBone; // 0x740 (0x4)
	struct FName ClavLSourceBone; // 0x744 (0x4)
	struct FName ClavLBaseBone; // 0x748 (0x4)
	unsigned char padding_74c[0x4]; // 0x74c (0x4)
};

