// Class /Script/FortniteGame.CCP_AnimInstance_FaceAcc_CubeQueen
// Size: 0x740
class UCCP_AnimInstance_FaceAcc_CubeQueen : public UCustomCharacterPartAnimInstance
{
	bool bSnapBack; // 0x6e8 (0x1)
	bool bWearingBackbling; // 0x6e9 (0x1)
	bool bBackblingGlider; // 0x6ea (0x1)
	unsigned char unreflected_6eb[0x1]; // 0x6eb (0x1) 
	float IsTargeting; // 0x6ec (0x4)
	float BackblingAlpha; // 0x6f0 (0x4)
	float IsWearingCape; // 0x6f4 (0x4)
	float CapeAlpha; // 0x6f8 (0x4)
	unsigned char unreflected_6fc[0x4]; // 0x6fc (0x4) 
	struct FGameplayTagContainer BackpackGliderTags; // 0x700 (0x20)
	float LongBackblingThreshold; // 0x720 (0x4)
	float CapeAlphaScaler; // 0x724 (0x4)
	float IsTargetingValueTrue; // 0x728 (0x4)
	float IsTargetingValueFalse; // 0x72c (0x4)
	float BackblingAlphaTrue; // 0x730 (0x4)
	float BackblingAlphaFalse; // 0x734 (0x4)
	unsigned char padding_738[0x8]; // 0x738 (0x8)
};

