// Class /Script/FortniteGame.CCP_AnimInstance_GalaticNew
// Size: 0x7f0
class UCCP_AnimInstance_GalaticNew : public UCustomCharacterPartAnimInstance
{
	float ThighRotL; // 0x6e8 (0x4)
	float ThighRotR; // 0x6ec (0x4)
	bool bHair; // 0x6f0 (0x1)
	unsigned char unreflected_6f1[0x3]; // 0x6f1 (0x3) 
	float ThighRotUpR; // 0x6f4 (0x4)
	float ThighRotInrR; // 0x6f8 (0x4)
	float ThighRotOtrR; // 0x6fc (0x4)
	float ThighRotUpL; // 0x700 (0x4)
	float ThighRotInrL; // 0x704 (0x4)
	float ThighRotOtrL; // 0x708 (0x4)
	float JumpingAlpha; // 0x70c (0x4)
	float IsNotCrouchRunning; // 0x710 (0x4)
	float ParachuteAlpha; // 0x714 (0x4)
	float SkydiveAlpha; // 0x718 (0x4)
	float BwdMovement; // 0x71c (0x4)
	float RightMovement; // 0x720 (0x4)
	float LeftMovement; // 0x724 (0x4)
	struct FName ThighLBoneName; // 0x728 (0x4)
	struct FName ThighRBoneName; // 0x72c (0x4)
	struct FName PelvisBoneName; // 0x730 (0x4)
	unsigned char unreflected_734[0x4]; // 0x734 (0x4) 
	struct FVector2D ThighAlphaInputRange; // 0x738 (0x10)
	struct FVector2D ThighAlphaOutputRange; // 0x748 (0x10)
	struct FVector ThighAlphaTwistAngle; // 0x758 (0x18)
	struct TEnumAsByte<EAlphaFromDeltaTypes> ThighRotationDeltaComponentType; // 0x770 (0x1)
	unsigned char unreflected_771[0x3]; // 0x771 (0x3) 
	float ThighRotRUpInRangeA; // 0x774 (0x4)
	float ThighRotRUpInRangeB; // 0x778 (0x4)
	float ThighRotRInrInRangeA; // 0x77c (0x4)
	float ThighRotRInrInRangeB; // 0x780 (0x4)
	float ThighRotROtrInRangeA; // 0x784 (0x4)
	float ThighRotROtrInRangeB; // 0x788 (0x4)
	float ThighRotLUpInRangeA; // 0x78c (0x4)
	float ThighRotLUpInRangeB; // 0x790 (0x4)
	float ThighRotLInrInRangeA; // 0x794 (0x4)
	float ThighRotLInrInRangeB; // 0x798 (0x4)
	float ThighRotLOtrInRangeA; // 0x79c (0x4)
	float ThighRotLOtrInRangeB; // 0x7a0 (0x4)
	float PawnVelocityZThreshold; // 0x7a4 (0x4)
	float XMovementMultiplyer; // 0x7a8 (0x4)
	float YMovementMultiplyer; // 0x7ac (0x4)
	float InRangeABwdMovement; // 0x7b0 (0x4)
	float InRangeBBwdMovement; // 0x7b4 (0x4)
	float OutRangeABwdMovement; // 0x7b8 (0x4)
	float OutRangeBBwdMovement; // 0x7bc (0x4)
	float InRangeADirMovement; // 0x7c0 (0x4)
	float InRangeBDirMovement; // 0x7c4 (0x4)
	float OutRangeADirMovement; // 0x7c8 (0x4)
	float OutRangeBDirMovement; // 0x7cc (0x4)
	float InRangeAXMovementRightClamp; // 0x7d0 (0x4)
	float InRangeBXMovementRightClamp; // 0x7d4 (0x4)
	float OutRangeAXMovementRightClamp; // 0x7d8 (0x4)
	float OutRangeBXMovementRightClamp; // 0x7dc (0x4)
	float InRangeAXMovementLeftClamp; // 0x7e0 (0x4)
	float InRangeBXMovementLeftClamp; // 0x7e4 (0x4)
	float OutRangeAXMovementLeftClamp; // 0x7e8 (0x4)
	float OutRangeBXMovementLeftClamp; // 0x7ec (0x4)

	/* Functions */

	// Function /Script/FortniteGame.CCP_AnimInstance_GalaticNew.UpdatePostPlayerMovement (Underlying native function: UpdatePostPlayerMovement 0x8815d48)
	void UpdatePostPlayerMovement(float& XMovement, float& YMovement); // (Final | Native | Public | BlueprintCallable)
};

