// Class /Script/FortniteGame.CCP_AnimInstance_Dark_Minion
// Size: 0x970
class UCCP_AnimInstance_Dark_Minion : public UCustomCharacterPartAnimInstance
{
	float CrouchFloat; // 0x6e8 (0x4)
	float LegOutR; // 0x6ec (0x4)
	float LegUpL; // 0x6f0 (0x4)
	float LegUpStrapL; // 0x6f4 (0x4)
	float LegUpStrapR; // 0x6f8 (0x4)
	float SubLegL; // 0x6fc (0x4)
	float LegUpClothL; // 0x700 (0x4)
	float LegOutClothL; // 0x704 (0x4)
	float SubLegHighL; // 0x708 (0x4)
	float LegUpClothR; // 0x70c (0x4)
	bool bIsWearingJumpBoots; // 0x710 (0x1)
	unsigned char unreflected_711[0x3]; // 0x711 (0x3) 
	struct FGameplayTag JumpBootsTag; // 0x714 (0x4)
	struct FName ThighLBoneName; // 0x718 (0x4)
	struct FName ThighRBoneName; // 0x71c (0x4)
	struct FName PelvisBoneName; // 0x720 (0x4)
	struct TEnumAsByte<EAlphaFromDeltaTypes> LegUpLDeltaComponentType; // 0x724 (0x1)
	unsigned char unreflected_725[0x3]; // 0x725 (0x3) 
	struct FVector2D LegUpLInputRange; // 0x728 (0x10)
	struct FVector2D LegUpLOutputRange; // 0x738 (0x10)
	struct FVector LegUpLTwistAxis; // 0x748 (0x18)
	struct TEnumAsByte<EAlphaFromDeltaTypes> LegUpStrapLDeltaComponentType; // 0x760 (0x1)
	unsigned char unreflected_761[0x7]; // 0x761 (0x7) 
	struct FVector2D LegUpStrapLInputRange; // 0x768 (0x10)
	struct FVector2D LegUpStrapLOutputRange; // 0x778 (0x10)
	struct FVector LegUpStrapLTwistAxis; // 0x788 (0x18)
	struct TEnumAsByte<EAlphaFromDeltaTypes> LegUpClothLDeltaComponentType; // 0x7a0 (0x1)
	unsigned char unreflected_7a1[0x7]; // 0x7a1 (0x7) 
	struct FVector2D LegUpClothLInputRange; // 0x7a8 (0x10)
	struct FVector2D LegUpClothLOutputRange; // 0x7b8 (0x10)
	struct FVector LegUpClothLTwistAxis; // 0x7c8 (0x18)
	struct TEnumAsByte<EAlphaFromDeltaTypes> LegOutClothLDeltaComponentType; // 0x7e0 (0x1)
	unsigned char unreflected_7e1[0x7]; // 0x7e1 (0x7) 
	struct FVector2D LegOutClothLInputRange; // 0x7e8 (0x10)
	struct FVector2D LegOutClothLOutputRange; // 0x7f8 (0x10)
	struct FVector LegOutClothLTwistAxis; // 0x808 (0x18)
	struct TEnumAsByte<EAlphaFromDeltaTypes> LegUpClothRDeltaComponentType; // 0x820 (0x1)
	unsigned char unreflected_821[0x7]; // 0x821 (0x7) 
	struct FVector2D LegUpClothRInputRange; // 0x828 (0x10)
	struct FVector2D LegUpClothROutputRange; // 0x838 (0x10)
	struct FVector LegUpClothRTwistAxis; // 0x848 (0x18)
	struct TEnumAsByte<EAlphaFromDeltaTypes> LegUpStrapRDeltaComponentType; // 0x860 (0x1)
	unsigned char unreflected_861[0x7]; // 0x861 (0x7) 
	struct FVector2D LegUpStrapRInputRange; // 0x868 (0x10)
	struct FVector2D LegUpStrapROutputRange; // 0x878 (0x10)
	struct FVector LegUpStrapRTwistAxis; // 0x888 (0x18)
	struct TEnumAsByte<EAlphaFromDeltaTypes> LegOutRDeltaComponentType; // 0x8a0 (0x1)
	unsigned char unreflected_8a1[0x7]; // 0x8a1 (0x7) 
	struct FVector2D LegOutRInputRange; // 0x8a8 (0x10)
	struct FVector2D LegOutROutputRange; // 0x8b8 (0x10)
	struct FVector LegOutRTwistAxis; // 0x8c8 (0x18)
	float LegUpStrapLIsJumpingTargetMult; // 0x8e0 (0x4)
	float LegUpStrapLIsJumpingInterpSpeed; // 0x8e4 (0x4)
	struct TEnumAsByte<EAlphaFromDeltaTypes> SubLegLDeltaComponentType; // 0x8e8 (0x1)
	unsigned char unreflected_8e9[0x7]; // 0x8e9 (0x7) 
	struct FVector2D SubLegLInputRange; // 0x8f0 (0x10)
	struct FVector2D SubLegLOutputRange; // 0x900 (0x10)
	struct FVector SubLegLTwistAxis; // 0x910 (0x18)
	struct TEnumAsByte<EAlphaFromDeltaTypes> SubLegHighLDeltaComponentType; // 0x928 (0x1)
	unsigned char unreflected_929[0x7]; // 0x929 (0x7) 
	struct FVector2D SubLegHighLInputRange; // 0x930 (0x10)
	struct FVector2D SubLegHighLOutputRange; // 0x940 (0x10)
	struct FVector SubLegHighLTwistAxis; // 0x950 (0x18)
	float LegUpLCrouching; // 0x968 (0x4)
	float SubLegLNotCrouching; // 0x96c (0x4)

	/* Functions */

	// Function /Script/FortniteGame.CCP_AnimInstance_Dark_Minion.OnGravityOverrideUpdate (Has no native function)
	void OnGravityOverrideUpdate(); // (Event | Public | BlueprintEvent)
};

