// Class /Script/FortniteGame.CCP_AnimInstance_Body_FemaleLargeBlonde
// Size: 0x830
class UCCP_AnimInstance_Body_FemaleLargeBlonde : public UCustomCharacterPartAnimInstance
{
	struct FVector GravityOverride; // 0x6e8 (0x18)
	float RigidsAlpha; // 0x700 (0x4)
	float FootRotate; // 0x704 (0x4)
	float LookUpRCollar; // 0x708 (0x4)
	float LookDownRCollar; // 0x70c (0x4)
	float LookUpLCollar; // 0x710 (0x4)
	float LookDownLCollar; // 0x714 (0x4)
	float ExtraLiftRCollar; // 0x718 (0x4)
	float ExtraLiftLCollar; // 0x71c (0x4)
	float ChestPushInR; // 0x720 (0x4)
	float ChestPushInRCorr; // 0x724 (0x4)
	float CollarPopRight; // 0x728 (0x4)
	float CollarPop; // 0x72c (0x4)
	struct FVector GravityOverrideNormal; // 0x730 (0x18)
	struct FVector GravityOverrideParachuteOpened; // 0x748 (0x18)
	struct FName BallRightBoneName; // 0x760 (0x4)
	float FootRotateInRangeA; // 0x764 (0x4)
	float FootRotateInRangeB; // 0x768 (0x4)
	float FootRotateOutRangeA; // 0x76c (0x4)
	float FootRotateOutRangeB; // 0x770 (0x4)
	float LookUpRCollarInRangeA; // 0x774 (0x4)
	float LookUpRCollarInRangeB; // 0x778 (0x4)
	float LookUpRCollarOutRangeA; // 0x77c (0x4)
	float LookUpRCollarOutRangeB; // 0x780 (0x4)
	float LookDownRCollarInRangeA; // 0x784 (0x4)
	float LookDownRCollarInRangeB; // 0x788 (0x4)
	float LookDownRCollarOutRangeA; // 0x78c (0x4)
	float LookDownRCollarOutRangeB; // 0x790 (0x4)
	float LookUpLCollarInRangeA; // 0x794 (0x4)
	float LookUpLCollarInRangeB; // 0x798 (0x4)
	float LookUpLCollarOutRangeA; // 0x79c (0x4)
	float LookUpLCollarOutRangeB; // 0x7a0 (0x4)
	float LookDownLCollarInRangeA; // 0x7a4 (0x4)
	float LookDownLCollarInRangeB; // 0x7a8 (0x4)
	float LookDownLCollarOutRangeA; // 0x7ac (0x4)
	float LookDownLCollarOutRangeB; // 0x7b0 (0x4)
	float ExtraLiftRCollarInRangeA; // 0x7b4 (0x4)
	float ExtraLiftRCollarInRangeB; // 0x7b8 (0x4)
	float ExtraLiftRCollarOutRangeA; // 0x7bc (0x4)
	float ExtraLiftRCollarOutRangeB; // 0x7c0 (0x4)
	float ExtraLiftLCollarInRangeA; // 0x7c4 (0x4)
	float ExtraLiftLCollarInRangeB; // 0x7c8 (0x4)
	float ExtraLiftLCollarOutRangeA; // 0x7cc (0x4)
	float ExtraLiftLCollarOutRangeB; // 0x7d0 (0x4)
	float ChestPushInRInRangeA; // 0x7d4 (0x4)
	float ChestPushInRInRangeB; // 0x7d8 (0x4)
	float ChestPushInROutRangeA; // 0x7dc (0x4)
	float ChestPushInROutRangeB; // 0x7e0 (0x4)
	float ChestPushInRCorrInRangeA; // 0x7e4 (0x4)
	float ChestPushInRCorrInRangeB; // 0x7e8 (0x4)
	float ChestPushInRCorrOutRangeA; // 0x7ec (0x4)
	float ChestPushInRCorrOutRangeB; // 0x7f0 (0x4)
	float CollarPopRightInRangeA; // 0x7f4 (0x4)
	float CollarPopRightInRangeB; // 0x7f8 (0x4)
	float CollarPopRightOutRangeA; // 0x7fc (0x4)
	float CollarPopRightOutRangeB; // 0x800 (0x4)
	float CollarPopInRangeA; // 0x804 (0x4)
	float CollarPopInRangeB; // 0x808 (0x4)
	float CollarPopOutRangeA; // 0x80c (0x4)
	float CollarPopOutRangeB; // 0x810 (0x4)
	float SkydivingRigidBodyAlpha; // 0x814 (0x4)
	bool bIsJumpingOrFalling; // 0x818 (0x1)
	unsigned char unreflected_819[0x3]; // 0x819 (0x3) 
	float IsNotCrouchingAlpha; // 0x81c (0x4)
	float IsCrouchSprintingAlpha; // 0x820 (0x4)
	float IsInFrontEndAlpha; // 0x824 (0x4)
	unsigned char padding_828[0x8]; // 0x828 (0x8)
};

