// Class /Script/FortniteGame.CCP_AnimInstance_CyberKarate
// Size: 0x710
class UCCP_AnimInstance_CyberKarate : public UCustomCharacterPartAnimInstance
{
	float BackblingAlpha; // 0x6e8 (0x4)
	bool bSkydiving; // 0x6ec (0x1)
	unsigned char unreflected_6ed[0x3]; // 0x6ed (0x3) 
	float FrontendSkirtAlpha; // 0x6f0 (0x4)
	float FrontendNoEmote; // 0x6f4 (0x4)
	bool bSkyDivingModeOrSkyDiving; // 0x6f8 (0x1)
	unsigned char unreflected_6f9[0x3]; // 0x6f9 (0x3) 
	float FrontendSkirtAlphaRangeA; // 0x6fc (0x4)
	float FrontendSkirtAlphaRangeB; // 0x700 (0x4)
	float FrontendInterpSpeed; // 0x704 (0x4)
	float BackblingAlphaA; // 0x708 (0x4)
	float BackblingAlphaB; // 0x70c (0x4)
};

