// VerseClass /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl
// Size: 0x260
class UCharacters_fort_character_impl : public UVerseFortniteCharacter
{
	unsigned char unreflected_50[0x1d0]; // 0x50 (0x1d0) 
	class UVerseEngine_subscribable_event* verse0x4DE1175CDamagedHealthEventInternal; // 0x220 (0x8)
	class UVerseEngine_subscribable_event* verse0x3EFD7EEDDamagedShieldEventInternal; // 0x228 (0x8)
	class UVerseEngine_subscribable_event* verse0xF4EDADDBHealedHealthEventInternal; // 0x230 (0x8)
	class UVerseEngine_subscribable_event* verse0x87F1C46AHealedShieldEventInternal; // 0x238 (0x8)
	class UVerseEngine_subscribable_event* verse0x0008931FCrouchedEventInternal; // 0x240 (0x8)
	class UVerseEngine_subscribable_event* verse0xCE63A4CBJumpedEventInternal; // 0x248 (0x8)
	class UVerseEngine_subscribable_event* verse0x242DF4E0SprintedEventInternal; // 0x250 (0x8)
	class UVerseEngine_subscribable_event* verse0x5587B813EliminatedEventInternal; // 0x258 (0x8)
	unsigned char verse0xBCC8CFC8L2fFortnite2ecom2fGame2fdamageableNRDamageLNdamageargsR_180[0x10]; // 0x180 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x919B3D8BL2fFortnite2ecom2fGame2fdamageableNRDamageLNfloatR_170[0x10]; // 0x170 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_180[0x10]; // 0x180 (0x10) 
	unsigned char verse0x7782AD90L2fFortnite2ecom2fGame2fdamageableNRDamagedEvent_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xC92ABB7DL2fFortnite2ecom2fCharacters2ffortcharacterNRCrouchedEvent_80[0x10]; // 0x80 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x1B4AAA99L2fFortnite2ecom2fCharacters2ffortcharacterNREliminatedEvent_60[0x10]; // 0x60 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE3EB0E33L2fFortnite2ecom2fCharacters2ffortcharacterNRGetPlayer_50[0x10]; // 0x50 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_60[0x40]; // 0x60 (0x40) 
	unsigned char verse0xA4895306L2fFortnite2ecom2fCharacters2ffortcharacterNRIsDown_a0[0x10]; // 0xa0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD3C45C5BL2fFortnite2ecom2fCharacters2ffortcharacterNRIsDownButNotOut_b0[0x10]; // 0xb0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_c0[0x40]; // 0xc0 (0x40) 
	unsigned char verse0x9084EF8EL2fFortnite2ecom2fCharacters2ffortcharacterNRIsVulnerable_100[0x10]; // 0x100 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x454A4B2CL2fFortnite2ecom2fCharacters2ffortcharacterNRJumpedEvent_70[0x10]; // 0x70 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_80[0x40]; // 0x80 (0x40) 
	unsigned char verse0x0337C666L2fFortnite2ecom2fCharacters2ffortcharacterNRPutInStasisLNstasisargsR_c0[0x10]; // 0xc0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x33C4CAA3L2fFortnite2ecom2fCharacters2ffortcharacterNRReleaseFromStasis_d0[0x10]; // 0xd0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xF0CE5A10L2fFortnite2ecom2fCharacters2ffortcharacterNRSetVisibleLNlogicR_e0[0x10]; // 0xe0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x2A43A893L2fFortnite2ecom2fCharacters2ffortcharacterNRSetVulnerabilityLNlogicR_f0[0x10]; // 0xf0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD90058E7L2fFortnite2ecom2fCharacters2ffortcharacterNRSprintedEvent_90[0x10]; // 0x90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_a0[0x150]; // 0xa0 (0x150) 
	unsigned char verse0xF6BFDA59L2fFortnite2ecom2fGame2fhealableNRHealLNhealingargsR_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3579A169L2fFortnite2ecom2fGame2fhealableNRHealLNfloatR_1e0[0x10]; // 0x1e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1f0[0x10]; // 0x1f0 (0x10) 
	unsigned char verse0xF8CC989CL2fFortnite2ecom2fGame2fhealableNRHealedEvent_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x641F6E2BL2fFortnite2ecom2fGame2fhealthfulNRGetHealth_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1b0[0x10]; // 0x1b0 (0x10) 
	unsigned char verse0x3244305DL2fFortnite2ecom2fGame2fhealthfulNRGetMaxHealth_1c0[0x10]; // 0x1c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xF2F0AAD0L2fFortnite2ecom2fGame2fhealthfulNRSetHealthLNfloatR_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1c0[0x10]; // 0x1c0 (0x10) 
	unsigned char verse0x339B570DL2fFortnite2ecom2fGame2fhealthfulNRSetMaxHealthLNfloatR_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1e0[0x30]; // 0x1e0 (0x30) 
	unsigned char verse0x6B57E438L2fFortnite2ecom2fGame2fpositionalNRGetTransform_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xF6DD1D2EL2fFortnite2ecom2fGame2fshieldableNRDamagedShieldEvent_150[0x10]; // 0x150 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x26941A48L2fFortnite2ecom2fGame2fshieldableNRGetMaxShield_130[0x10]; // 0x130 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x48326568L2fFortnite2ecom2fGame2fshieldableNRGetShield_110[0x10]; // 0x110 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_120[0x40]; // 0x120 (0x40) 
	unsigned char verse0xDCD5C88EL2fFortnite2ecom2fGame2fshieldableNRHealedShieldEvent_160[0x10]; // 0x160 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x4BA33B47L2fFortnite2ecom2fGame2fshieldableNRSetMaxShieldLNfloatR_140[0x10]; // 0x140 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8B41548FL2fFortnite2ecom2fGame2fshieldableNRSetShieldLNfloatR_120[0x10]; // 0x120 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_130[0x130]; // 0x130 (0x130)

	/* Functions */

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fCharacters2ffortcharacterNRSprintedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R (Underlying native function: _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R 0x52d39f0)
	void L2fFortnite2ecom2fCharacters2ffortcharacterNRSetVulnerabilityLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVisible_L_Nlogic_R (Underlying native function: _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVisible_L_Nlogic_R 0x52d39e0)
	void L2fFortnite2ecom2fCharacters2ffortcharacterNRSetVisibleLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R 0x52d3b80)
	void L2fFortnite2ecom2fGame2fshieldableNRSetShieldLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R 0x52d3b70)
	void L2fFortnite2ecom2fGame2fshieldableNRSetMaxShieldLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R 0x52d3b10)
	void L2fFortnite2ecom2fGame2fhealthfulNRSetMaxHealthLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R 0x52d3af0)
	void L2fFortnite2ecom2fGame2fhealthfulNRSetHealthLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis (Underlying native function: _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis 0x52d39d0)
	void L2fFortnite2ecom2fCharacters2ffortcharacterNRReleaseFromStasis(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R (Underlying native function: _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R 0x52d39c0)
	void L2fFortnite2ecom2fCharacters2ffortcharacterNRPutInStasisLNstasisargsR(struct FCharacters_stasis_args& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fCharacters2ffortcharacterNRJumpedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable (Underlying native function: _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable 0x52d39b0)
	void L2fFortnite2ecom2fCharacters2ffortcharacterNRIsVulnerable(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut (Underlying native function: _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut 0x7066d88)
	void L2fFortnite2ecom2fCharacters2ffortcharacterNRIsDownButNotOut(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDown (Underlying native function: _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDown 0x7066d90)
	void L2fFortnite2ecom2fCharacters2ffortcharacterNRIsDown(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fGame2fshieldableNRHealedShieldEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fGame2fhealableNRHealedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R 0x52d3aa0)
	void L2fFortnite2ecom2fGame2fhealableNRHealLNhealingargsR(struct FGame_healing_args& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R 0x52d3a90)
	void L2fFortnite2ecom2fGame2fhealableNRHealLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform 0x52d3b30)
	struct FSpatialMath_transform L2fFortnite2ecom2fGame2fpositionalNRGetTransform(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield 0x52d3b60)
	double L2fFortnite2ecom2fGame2fshieldableNRGetShield(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetPlayer (Underlying native function: _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetPlayer 0x7066d80)
	void L2fFortnite2ecom2fCharacters2ffortcharacterNRGetPlayer(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield 0x52d3b50)
	double L2fFortnite2ecom2fGame2fshieldableNRGetMaxShield(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth 0x52d3ad0)
	double L2fFortnite2ecom2fGame2fhealthfulNRGetMaxHealth(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth 0x52d3ab0)
	double L2fFortnite2ecom2fGame2fhealthfulNRGetHealth(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fCharacters2ffortcharacterNREliminatedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fGame2fshieldableNRDamagedShieldEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fGame2fdamageableNRDamagedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R 0x52d3a50)
	void L2fFortnite2ecom2fGame2fdamageableNRDamageLNdamageargsR(struct FGame_damage_args& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R 0x52d3a70)
	void L2fFortnite2ecom2fGame2fdamageableNRDamageLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fCharacters2ffortcharacterNRCrouchedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_fort_character_impl.$InitCDO (Has no native function)
	void $InitCDO(class UVerseEngine_subscribable_event*& $ExprResult0, uint64_t& $InstancingGraph1, class UVerseEngine_subscribable_event*& $ExprResult2, uint64_t& $InstancingGraph3, class UVerseEngine_subscribable_event*& $ExprResult4, uint64_t& $InstancingGraph5, class UVerseEngine_subscribable_event*& $ExprResult6, uint64_t& $InstancingGraph7, class UVerseEngine_subscribable_event*& $ExprResult8, uint64_t& $InstancingGraph9, class UVerseEngine_subscribable_event*& $ExprResult10, uint64_t& $InstancingGraph11, class UVerseEngine_subscribable_event*& $ExprResult12, uint64_t& $InstancingGraph13, class UVerseEngine_subscribable_event*& $ExprResult14, uint64_t& $InstancingGraph15); // (HasDefaults)
};

