// Class /Script/ChaosCloth.ChaosClothConfig
// Size: 0x118
class UChaosClothConfig : public UClothConfigCommon
{
	enum EClothMassMode MassMode; // 0x28 (0x1)
	unsigned char unreflected_29[0x3]; // 0x29 (0x3) 
	float UniformMass; // 0x2c (0x4)
	float TotalMass; // 0x30 (0x4)
	float Density; // 0x34 (0x4)
	float MinPerParticleMass; // 0x38 (0x4)
	struct FChaosClothWeightedValue* EdgeStiffnessWeighted; // 0x3c (0x8)
	struct FChaosClothWeightedValue* BendingStiffnessWeighted; // 0x44 (0x8)
	bool bUseBendingElements; // 0x4c (0x1)
	unsigned char unreflected_4d[0x3]; // 0x4d (0x3) 
	float BucklingRatio; // 0x50 (0x4)
	struct FChaosClothWeightedValue* BucklingStiffnessWeighted; // 0x54 (0x8)
	struct FChaosClothWeightedValue* AreaStiffnessWeighted; // 0x5c (0x8)
	float VolumeStiffness; // 0x64 (0x4)
	struct FChaosClothWeightedValue* TetherStiffness; // 0x68 (0x8)
	struct FChaosClothWeightedValue* TetherScale; // 0x70 (0x8)
	bool bUseGeodesicDistance; // 0x78 (0x1)
	unsigned char unreflected_79[0x3]; // 0x79 (0x3) 
	float ShapeTargetStiffness; // 0x7c (0x4)
	float CollisionThickness; // 0x80 (0x4)
	float FrictionCoefficient; // 0x84 (0x4)
	bool bUseCCD; // 0x88 (0x1)
	bool bUseSelfCollisions; // 0x89 (0x1)
	unsigned char unreflected_8a[0x2]; // 0x8a (0x2) 
	float SelfCollisionThickness; // 0x8c (0x4)
	float SelfCollisionFriction; // 0x90 (0x4)
	bool bUseSelfIntersections; // 0x94 (0x1)
	bool bUseLegacyBackstop; // 0x95 (0x1)
	unsigned char unreflected_96[0x2]; // 0x96 (0x2) 
	float DampingCoefficient; // 0x98 (0x4)
	float LocalDampingCoefficient; // 0x9c (0x4)
	bool bUsePointBasedWindModel; // 0xa0 (0x1)
	unsigned char unreflected_a1[0x3]; // 0xa1 (0x3) 
	struct FChaosClothWeightedValue* Drag; // 0xa4 (0x8)
	struct FChaosClothWeightedValue* Lift; // 0xac (0x8)
	bool bUseGravityOverride; // 0xb4 (0x1)
	unsigned char unreflected_b5[0x3]; // 0xb5 (0x3) 
	float GravityScale; // 0xb8 (0x4)
	unsigned char unreflected_bc[0x4]; // 0xbc (0x4) 
	struct FVector Gravity; // 0xc0 (0x18)
	struct FChaosClothWeightedValue* Pressure; // 0xd8 (0x8)
	struct FChaosClothWeightedValue* AnimDriveStiffness; // 0xe0 (0x8)
	struct FChaosClothWeightedValue* AnimDriveDamping; // 0xe8 (0x8)
	struct FVector LinearVelocityScale; // 0xf0 (0x18)
	float AngularVelocityScale; // 0x108 (0x4)
	float FictitiousAngularScale; // 0x10c (0x4)
	bool bUseTetrahedralConstraints; // 0x110 (0x1)
	bool bUseThinShellVolumeConstraints; // 0x111 (0x1)
	bool bUseContinuousCollisionDetection; // 0x112 (0x1)
	unsigned char padding_113[0x5]; // 0x113 (0x5)
};

