// VerseClass /Verse/_Verse/VNI/Verse.Colors_NamedColors
// Size: 0xdd8
class UColors_NamedColors : public UObject
{
	struct FColors_color verse0x9FBDE6AEAliceBlue; // 0x28 (0x18)
	struct FColors_color verse0xB3F7599DAntiqueWhite; // 0x40 (0x18)
	struct FColors_color verse0x37EE68B4Aqua; // 0x58 (0x18)
	struct FColors_color verse0xA52EBB79Aquamarine; // 0x70 (0x18)
	struct FColors_color verse0xD06EFB2AAzure; // 0x88 (0x18)
	struct FColors_color verse0x8CE5D6D0Beige; // 0xa0 (0x18)
	struct FColors_color verse0xC6B3972ABisque; // 0xb8 (0x18)
	struct FColors_color verse0x65E4346FBlack; // 0xd0 (0x18)
	struct FColors_color verse0x513D3B5FBlanchedAlmond; // 0xe8 (0x18)
	struct FColors_color verse0x80217580Blue; // 0x100 (0x18)
	struct FColors_color verse0x31D0653DBlueViolet; // 0x118 (0x18)
	struct FColors_color verse0xAD308F8FBrown; // 0x130 (0x18)
	struct FColors_color verse0xED3A42A8Burlywood; // 0x148 (0x18)
	struct FColors_color verse0x921A6303CadetBlue; // 0x160 (0x18)
	struct FColors_color verse0x9E2BDE1BChartreuse; // 0x178 (0x18)
	struct FColors_color verse0x082AED19Chocolate; // 0x190 (0x18)
	struct FColors_color verse0x196BEF87Coral; // 0x1a8 (0x18)
	struct FColors_color verse0xC6BCD84FCornflowerBlue; // 0x1c0 (0x18)
	struct FColors_color verse0xEE818697Cornsilk; // 0x1d8 (0x18)
	struct FColors_color verse0x6733DEF7Crimson; // 0x1f0 (0x18)
	struct FColors_color verse0x2D925695Cyan; // 0x208 (0x18)
	struct FColors_color verse0x935B7248DarkBlue; // 0x220 (0x18)
	struct FColors_color verse0x3EE8515DDarkCyan; // 0x238 (0x18)
	struct FColors_color verse0x5817F032DarkGoldenrod; // 0x250 (0x18)
	struct FColors_color verse0x916F3C35DarkGray; // 0x268 (0x18)
	struct FColors_color verse0x37F798B1DarkGreen; // 0x280 (0x18)
	struct FColors_color verse0x6B6176B1DarkGrey; // 0x298 (0x18)
	struct FColors_color verse0x9A5F61FBDarkKhaki; // 0x2b0 (0x18)
	struct FColors_color verse0x97899EDFDarkMagenta; // 0x2c8 (0x18)
	struct FColors_color verse0xC2E62C73DarkOliveGreen; // 0x2e0 (0x18)
	struct FColors_color verse0x7431D49DDarkOrange; // 0x2f8 (0x18)
	struct FColors_color verse0xA0C47F58DarkOrchid; // 0x310 (0x18)
	struct FColors_color verse0xA3246E28DarkRed; // 0x328 (0x18)
	struct FColors_color verse0x5A06EB6CDarkSalmon; // 0x340 (0x18)
	struct FColors_color verse0xF141484EDarkSeaGreen; // 0x358 (0x18)
	struct FColors_color verse0x4167AB57DarkSlateBlue; // 0x370 (0x18)
	struct FColors_color verse0x4353E52ADarkSlateGray; // 0x388 (0x18)
	struct FColors_color verse0xB95DAFAEDarkSlateGrey; // 0x3a0 (0x18)
	struct FColors_color verse0x26DA5155DarkTurquoise; // 0x3b8 (0x18)
	struct FColors_color verse0x3E781A05DarkViolet; // 0x3d0 (0x18)
	struct FColors_color verse0x53E148EADeepPink; // 0x3e8 (0x18)
	struct FColors_color verse0xA474CD21DeepSkyBlue; // 0x400 (0x18)
	struct FColors_color verse0xEC312FE8DimGray; // 0x418 (0x18)
	struct FColors_color verse0x163F656CDimGrey; // 0x430 (0x18)
	struct FColors_color verse0x617B6862DodgerBlue; // 0x448 (0x18)
	struct FColors_color verse0xC636E104Firebrick; // 0x460 (0x18)
	struct FColors_color verse0x06164DB2FloralWhite; // 0x478 (0x18)
	struct FColors_color verse0x4939E624ForestGreen; // 0x490 (0x18)
	struct FColors_color verse0x8069E472Fuchsia; // 0x4a8 (0x18)
	struct FColors_color verse0x71D0705FGainsboro; // 0x4c0 (0x18)
	struct FColors_color verse0x1EDD5A5BGhostWhite; // 0x4d8 (0x18)
	struct FColors_color verse0x0363FA56Gold; // 0x4f0 (0x18)
	struct FColors_color verse0x13A0B098Goldenrod; // 0x508 (0x18)
	struct FColors_color verse0x82153BFDGray; // 0x520 (0x18)
	struct FColors_color verse0x853EAC70Green; // 0x538 (0x18)
	struct FColors_color verse0x94CAEBA0GreenYellow; // 0x550 (0x18)
	struct FColors_color verse0x781B7179Grey; // 0x568 (0x18)
	struct FColors_color verse0x6FB30324Honeydew; // 0x580 (0x18)
	struct FColors_color verse0x2D404B19Hotpink; // 0x598 (0x18)
	struct FColors_color verse0x2CE09720IndianRed; // 0x5b0 (0x18)
	struct FColors_color verse0x180B2901Indigo; // 0x5c8 (0x18)
	struct FColors_color verse0x1086E2ECIvory; // 0x5e0 (0x18)
	struct FColors_color verse0x2896553AKhaki; // 0x5f8 (0x18)
	struct FColors_color verse0xB93AFCDCLavender; // 0x610 (0x18)
	struct FColors_color verse0x4CF8F931LavenderBlush; // 0x628 (0x18)
	struct FColors_color verse0x08B4792ELawnGreen; // 0x640 (0x18)
	struct FColors_color verse0xCC22276FLemonChiffon; // 0x658 (0x18)
	struct FColors_color verse0x607C97F4LightBlue; // 0x670 (0x18)
	struct FColors_color verse0x89B3D40ELightCoral; // 0x688 (0x18)
	struct FColors_color verse0xCDCFB4E1LightCyan; // 0x6a0 (0x18)
	struct FColors_color verse0x6C11FD65LightGoldenrodYellow; // 0x6b8 (0x18)
	struct FColors_color verse0x6248D989LightGray; // 0x6d0 (0x18)
	struct FColors_color verse0x15E697F9LightGreen; // 0x6e8 (0x18)
	struct FColors_color verse0x9846930DLightGrey; // 0x700 (0x18)
	struct FColors_color verse0xC34ABDCCLightPink; // 0x718 (0x18)
	struct FColors_color verse0xC57DAB84LightSalmon; // 0x730 (0x18)
	struct FColors_color verse0x0FE57B41LightSeaGreen; // 0x748 (0x18)
	struct FColors_color verse0x4077C098LightSkyBlue; // 0x760 (0x18)
	struct FColors_color verse0xCABFF9F6LightSlateGray; // 0x778 (0x18)
	struct FColors_color verse0x30B1B372LightSlateGrey; // 0x790 (0x18)
	struct FColors_color verse0xEFD2DF75LightSteelBlue; // 0x7a8 (0x18)
	struct FColors_color verse0x5732C477LightYellow; // 0x7c0 (0x18)
	struct FColors_color verse0xA58A0A97Lime; // 0x7d8 (0x18)
	struct FColors_color verse0xC8D6E552LimeGreen; // 0x7f0 (0x18)
	struct FColors_color verse0xD014B08FLinen; // 0x808 (0x18)
	struct FColors_color verse0xC5065659Magenta; // 0x820 (0x18)
	struct FColors_color verse0x2C6B6225Maroon; // 0x838 (0x18)
	struct FColors_color verse0x603DC640MediumAquamarine; // 0x850 (0x18)
	struct FColors_color verse0x03344EDDMediumBlue; // 0x868 (0x18)
	struct FColors_color verse0xEB235F60MediumOrchid; // 0x880 (0x18)
	struct FColors_color verse0x80AC62AFMediumPurple; // 0x898 (0x18)
	struct FColors_color verse0xA2F1456AMediumSeaGreen; // 0x8b0 (0x18)
	struct FColors_color verse0x81A3E0C2MediumSlateBlue; // 0x8c8 (0x18)
	struct FColors_color verse0x8259C923MediumSpringGreen; // 0x8e0 (0x18)
	struct FColors_color verse0xE61E1AC0MediumTurquoise; // 0x8f8 (0x18)
	struct FColors_color verse0x750A73D1MediumVioletRed; // 0x910 (0x18)
	struct FColors_color verse0x54B068FDMidnightBlue; // 0x928 (0x18)
	struct FColors_color verse0x2D5517E3MintCream; // 0x940 (0x18)
	struct FColors_color verse0xC9B38859MistyRose; // 0x958 (0x18)
	struct FColors_color verse0x045E548DMoccasin; // 0x970 (0x18)
	struct FColors_color verse0x66A473BANavajoWhite; // 0x988 (0x18)
	struct FColors_color verse0x621CB82DNavy; // 0x9a0 (0x18)
	struct FColors_color verse0x4433768EOldLace; // 0x9b8 (0x18)
	struct FColors_color verse0x4ADCED0BOlive; // 0x9d0 (0x18)
	struct FColors_color verse0x662F5053OliveDrab; // 0x9e8 (0x18)
	struct FColors_color verse0x7B1B98E3Orange; // 0xa00 (0x18)
	struct FColors_color verse0x31DF128EOrangeRed; // 0xa18 (0x18)
	struct FColors_color verse0xAFEE3326Orchid; // 0xa30 (0x18)
	struct FColors_color verse0xA90612F2PaleGoldenrod; // 0xa48 (0x18)
	struct FColors_color verse0x6494F519PaleGreen; // 0xa60 (0x18)
	struct FColors_color verse0xD7CBB395PaleTurquoise; // 0xa78 (0x18)
	struct FColors_color verse0xBC04EB9CPaleVioletred; // 0xa90 (0x18)
	struct FColors_color verse0x1267A5CEPapayaWhip; // 0xaa8 (0x18)
	struct FColors_color verse0x5B815063PeachPuff; // 0xac0 (0x18)
	struct FColors_color verse0x6A5E8726Peru; // 0xad8 (0x18)
	struct FColors_color verse0x23175FB8Pink; // 0xaf0 (0x18)
	struct FColors_color verse0x92124624Plum; // 0xb08 (0x18)
	struct FColors_color verse0x315A9690PowderBlue; // 0xb20 (0x18)
	struct FColors_color verse0xC4610EE9Purple; // 0xb38 (0x18)
	struct FColors_color verse0x77CCDA87Red; // 0xb50 (0x18)
	struct FColors_color verse0xFB01846BRosyBrown; // 0xb68 (0x18)
	struct FColors_color verse0xA95C80D8RoyalBlue; // 0xb80 (0x18)
	struct FColors_color verse0xFCC2BB8CSaddleBrown; // 0xb98 (0x18)
	struct FColors_color verse0x552CA712Salmon; // 0xbb0 (0x18)
	struct FColors_color verse0xE1C22521SandyBrown; // 0xbc8 (0x18)
	struct FColors_color verse0x36A1DDC2SeaGreen; // 0xbe0 (0x18)
	struct FColors_color verse0x58B624CBSeaShell; // 0xbf8 (0x18)
	struct FColors_color verse0x013650B1Sienna; // 0xc10 (0x18)
	struct FColors_color verse0xFA47F979Silver; // 0xc28 (0x18)
	struct FColors_color verse0x1EAB27FDSkyBlue; // 0xc40 (0x18)
	struct FColors_color verse0x0AD0EBFDSlateBlue; // 0xc58 (0x18)
	struct FColors_color verse0x08E4A580SlateGray; // 0xc70 (0x18)
	struct FColors_color verse0xF2EAEF04SlateGrey; // 0xc88 (0x18)
	struct FColors_color verse0xE7A26A33Snow; // 0xca0 (0x18)
	struct FColors_color verse0x2CD5AEB9SpringGreen; // 0xcb8 (0x18)
	struct FColors_color verse0x2D898303SteelBlue; // 0xcd0 (0x18)
	struct FColors_color verse0x303C932DTeal; // 0xce8 (0x18)
	struct FColors_color verse0x303F6677Thistle; // 0xd00 (0x18)
	struct FColors_color verse0x4DC64808Tomato; // 0xd18 (0x18)
	struct FColors_color verse0x6D6D11FFTurquoise; // 0xd30 (0x18)
	struct FColors_color verse0x3152567BViolet; // 0xd48 (0x18)
	struct FColors_color verse0x13A81039Wheat; // 0xd60 (0x18)
	struct FColors_color verse0x27EAE4E0White; // 0xd78 (0x18)
	struct FColors_color verse0xBE90A762WhiteSmoke; // 0xd90 (0x18)
	struct FColors_color verse0xC763C8E1Yellow; // 0xda8 (0x18)
	struct FColors_color verse0xF10B434AYellowGreen; // 0xdc0 (0x18)

	/* Functions */

	// Function /Verse/_Verse/VNI/Verse.Colors_NamedColors.$InitCDO (Has no native function)
	void $InitCDO(struct FColors_color& $ExprResultStack0, ); // (HasDefaults)
};

