// Class /Script/CommonUI.CommonButtonInternalBase
// Size: 0x610
class UCommonButtonInternalBase : public UButton
{
	unsigned char unreflected_5a0[0x8]; // 0x5a0 (0x8) 
	struct FMulticastInlineDelegate OnDoubleClicked; // 0x5a8 (0x10)
	unsigned char unreflected_5b8[0x20]; // 0x5b8 (0x20) 
	int MinWidth; // 0x5d8 (0x4)
	int MinHeight; // 0x5dc (0x4)
	bool bButtonEnabled; // 0x5e0 (0x1)
	bool bInteractionEnabled; // 0x5e1 (0x1)
	unsigned char padding_5e2[0x2e]; // 0x5e2 (0x2e)
};

