// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component
// Size: 0x118
class UCompanionAI_ping_component : public UPingComponentBase
{
	unsigned char unreflected_98[0x70]; // 0x98 (0x70) 
	class UVerseEngine_multicast_delegate* verse0xC18257FDConvertedEventInternal; // 0x108 (0x8)
	class UVerseEngine_multicast_delegate* verse0x0E297686UnconvertedEventInternal; // 0x110 (0x8)
	unsigned char verse0x4A0C11E4L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRAreNPCCommandsEnabled_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_a8[0x40]; // 0xa8 (0x40) 
	unsigned char verse0xC34E89EFL2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRConvertedEvent_e8[0x10]; // 0xe8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA8918968L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRDeclineNPCCommandLNlogicR_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xFCB4C0C9L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNREnableCommandWheelLNlogicR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD6588DA4L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRGetCurrentNPCCommand_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x68114BBAOnNPCCommand_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_d8[0x20]; // 0xd8 (0x20) 
	unsigned char verse0x19DD9F60L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRUnconvertedEvent_f8[0x10]; // 0xf8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_108[0x10]; // 0x108 (0x10)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RUnconvertedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRUnconvertedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component.OnNPCCommand (Has no native function)
	class UConcurrency_task* OnNPCCommand(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand 0x72129d4)
	void L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRGetCurrentNPCCommand(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R 0x72129cc)
	void L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNREnableCommandWheelLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R 0x72129c4)
	void L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRDeclineNPCCommandLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRConvertedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled 0x72129bc)
	unsigned char L2fFortnite2ecom2fAI2fCompanionAI2ffortpinginterfaceNRAreNPCCommandsEnabled(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_component.$InitCDO (Has no native function)
	void $InitCDO(class UVerseEngine_multicast_delegate*& $ExprResult0, uint64_t& $InstancingGraph1, class UVerseEngine_multicast_delegate*& $ExprResult2, uint64_t& $InstancingGraph3); // (HasDefaults)
};

