// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai
// Size: 0x3b0
class UCompanionAI_companion_ai : public UVerseAIBase_ai_behavior
{
	unsigned char verse0xE1D221D8NPCMovementInterface_110[0x8]; // 0x110 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x4645AA12PingActionsInterface_118[0x8]; // 0x118 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x83124E52NPCActionsInterface_120[0x8]; // 0x120 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0xCC490D1FWeaponActionsInterface_128[0x8]; // 0x128 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x93DA469BThreatPerceptionInterface_130[0x8]; // 0x130 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0xC410E5F5ObstaclePerceptionInterface_138[0x8]; // 0x138 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UDiagnostics_log* verse0xF524C2ACLogger; // 0x140 (0x8)
	unsigned char verse0x4222121EDebugDisplay; // 0x148 (0x1)
	unsigned char unreflected_149[0x7]; // 0x149 (0x7) 
	struct FColors_color verse0x71320F52DebugScreenColor; // 0x150 (0x18)
	double verse0x2D4D6684DebugScreenDuration; // 0x168 (0x8)
	double verse0x5155C58DGoToLeashDistance; // 0x170 (0x8)
	double verse0x4D92C49BGoToAttackTargetDistance; // 0x178 (0x8)
	double verse0x8D041DABHoldPositionLeashDistance; // 0x180 (0x8)
	double verse0x5EF17E77BackToMeMovementThreshold; // 0x188 (0x8)
	unsigned char verse0xFD71F6F9CrouchService_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x42EEAE4CCrouchUntilHit_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x4611DC7EDrawSphereLNvector3MNfloatMNcolorR_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xAAC24BD9GameLoop_1c0[0x10]; // 0x1c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x0C45B447GetNewObstacle_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x2E34E338GetNewTargetPerception_1e0[0x10]; // 0x1e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x0CD61383GetNewThreat_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8CAF1B4FGetObstacle_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x088B6B1EGetThreat_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x55602A55GoToAndAttackTaskLNfortthreatinfoR_220[0x10]; // 0x220 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9B25A3B0GoToPositionTaskLNvector3MNQfortcharacterMNlogicMNnavigationrequestparametersR_230[0x10]; // 0x230 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xCDB7A2EBHandleBackToMeCommandLNpinginfoR_240[0x10]; // 0x240 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA6BE52A1HandleGoToLNpinginfoR_250[0x10]; // 0x250 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xDA8C4382HandleGoToCommandLNpinginfoR_260[0x10]; // 0x260 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x732222FFHandleHoldPositionCommandLNpinginfoR_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x598CA1A6HandleNPCCommandLNpinginfoR_280[0x10]; // 0x280 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6FDBE601HandleObstacleTaskLNQentityR_290[0x10]; // 0x290 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x76F49D7BHandleReviveCommandLNpinginfoR_2a0[0x10]; // 0x2a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3ED65A6DL2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNRLogAndDisplayOnScreenLNKcharR_2b0[0x10]; // 0x2b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB0983B50LookAroundTaskLNvector3MNfloatMNfloatR_2c0[0x10]; // 0x2c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x62AFAEFELookAtOrAttackTarget_2d0[0x10]; // 0x2d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3F6E3D53LookAtThreatTask_2e0[0x10]; // 0x2e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x77AE90F1L2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNROnConvertedLNanyRNvoid_2f0[0x10]; // 0x2f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x49F41DF3L2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNROnConverted_300[0x10]; // 0x300 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xC72BE77DL2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNROnUnconvertedLNanyRNvoid_310[0x10]; // 0x310 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x11CAF1E5L2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNROnUnconverted_320[0x10]; // 0x320 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE121C3A4ReviveCommandLNfortcharacterR_330[0x10]; // 0x330 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD09E21A2SetLeashPositionLNvector3MNfloatMNentityR_340[0x10]; // 0x340 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xDBC1E5D6ShootTargetServiceLNfloatR_350[0x10]; // 0x350 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xED5B1563SprintService_360[0x10]; // 0x360 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x10E1DFC8TacticalSprintService_370[0x10]; // 0x370 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA967E878WaitForCharacterMovementLNfortcharacterMNfloatR_380[0x10]; // 0x380 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x76BD3EE2WaitForDamage_390[0x10]; // 0x390 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x866FD0D5WaitForTargetInVehicleLNfortcharacterR_3a0[0x10]; // 0x3a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.WaitForTargetInVehicle_L_Nfort__character_R (Has no native function)
	class UConcurrency_task* WaitForTargetInVehicleLNfortcharacterR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, class UObject*& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.WaitForDamage (Has no native function)
	class UConcurrency_task* WaitForDamage(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.WaitForCharacterMovement_L_Nfort__character_M_Nfloat_R (Has no native function)
	class UConcurrency_task* WaitForCharacterMovementLNfortcharacterMNfloatR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_Lfort__character_Mfloat_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.TacticalSprintService (Has no native function)
	class UConcurrency_task* TacticalSprintService(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.SprintService (Has no native function)
	class UConcurrency_task* SprintService(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.ShootTargetService_L_Nfloat_R (Has no native function)
	class UConcurrency_task* ShootTargetServiceLNfloatR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, double& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.SetLeashPosition_L_Nvector3_M_Nfloat_M_Nentity_R (Has no native function)
	class UConcurrency_task* SetLeashPositionLNvector3MNfloatMNentityR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_Lvector3_Mfloat_Mentity_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.ReviveCommand_L_Nfort__character_R (Has no native function)
	class UConcurrency_task* ReviveCommandLNfortcharacterR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, class UObject*& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai_N_ROnUnconverted (Has no native function)
	void L2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNROnUnconverted(struct Ftuple_L_R& verse0xB2CDDD72Argument, class UObject*& verse0xB4DBB24FPingActions1, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai_N_ROnUnconverted_L_Nany_R_Nvoid (Has no native function)
	void L2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNROnUnconvertedLNanyRNvoid(); // (Public | HasDefaults | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai_N_ROnConverted (Has no native function)
	void L2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNROnConverted(struct Ftuple_L_R& verse0xB2CDDD72Argument, class UObject*& verse0xB4DBB24FPingActions1, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai_N_ROnConverted_L_Nany_R_Nvoid (Has no native function)
	void L2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNROnConvertedLNanyRNvoid(); // (Public | HasDefaults | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.OnBegin (Has no native function)
	class UConcurrency_task* OnBegin(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.LookAtThreatTask (Has no native function)
	class UConcurrency_task* LookAtThreatTask(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.LookAtOrAttackTarget (Has no native function)
	class UConcurrency_task* LookAtOrAttackTarget(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R (Has no native function)
	class UConcurrency_task* LookAroundTaskLNvector3MNfloatMNfloatR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_Lvector3_Mfloat_Mfloat_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai_N_RLogAndDisplayOnScreen_L_N_Kchar_R (Has no native function)
	void L2fFortnite2ecom2fAI2fCompanionAI2fcompanionaiNRLogAndDisplayOnScreenLNKcharR(); // (Public | HasDefaults | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.HandleReviveCommand_L_Nping__info_R (Has no native function)
	class UConcurrency_task* HandleReviveCommandLNpinginfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FCompanionAI_ping_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.HandleObstacleTask_L_N_Qentity_R (Has no native function)
	void HandleObstacleTaskLNQentityR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, ); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.HandleNPCCommand_L_Nping__info_R (Has no native function)
	class UConcurrency_task* HandleNPCCommandLNpinginfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FCompanionAI_ping_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.HandleHoldPositionCommand_L_Nping__info_R (Has no native function)
	class UConcurrency_task* HandleHoldPositionCommandLNpinginfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FCompanionAI_ping_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.HandleGoToCommand_L_Nping__info_R (Has no native function)
	class UConcurrency_task* HandleGoToCommandLNpinginfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FCompanionAI_ping_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.HandleGoTo_L_Nping__info_R (Has no native function)
	class UConcurrency_task* HandleGoToLNpinginfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FCompanionAI_ping_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.HandleBackToMeCommand_L_Nping__info_R (Has no native function)
	class UConcurrency_task* HandleBackToMeCommandLNpinginfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FCompanionAI_ping_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.GoToPositionTask_L_Nvector3_M_N_Qfort__character_M_Nlogic_M_Nnavigation__request__parameters_R (Has no native function)
	class UConcurrency_task* GoToPositionTaskLNvector3MNQfortcharacterMNlogicMNnavigationrequestparametersR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_Lvector3_M_Qfort__character_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.GoToAndAttackTask_L_Nfort__threat__info_R (Has no native function)
	class UConcurrency_task* GoToAndAttackTaskLNfortthreatinfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FVerseAIBase_fort_threat_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.GetThreat (Has no native function)
	class UConcurrency_task* GetThreat(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.GetObstacle (Has no native function)
	class UConcurrency_task* GetObstacle(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.GetNewThreat (Has no native function)
	class UConcurrency_task* GetNewThreat(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.GetNewTargetPerception (Has no native function)
	class UConcurrency_task* GetNewTargetPerception(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.GetNewObstacle (Has no native function)
	class UConcurrency_task* GetNewObstacle(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.GameLoop (Has no native function)
	class UConcurrency_task* GameLoop(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R (Has no native function)
	class UConcurrency_task* DrawSphereLNvector3MNfloatMNcolorR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_Lvector3_Mfloat_Mcolor_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.CrouchUntilHit (Has no native function)
	class UConcurrency_task* CrouchUntilHit(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.CrouchService (Has no native function)
	class UConcurrency_task* CrouchService(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.$Block (Has no native function)
	void $Block(); // ()

	// Function /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_companion_ai.$InitCDO (Has no native function)
	void $InitCDO(class UDiagnostics_log*& $ExprResult0, uint64_t& $InstancingGraph1); // (HasDefaults)
};

