// VerseClass /Solaris/_Verse/VNI/VerseNative.Concurrency_task
// Size: 0x148
class UConcurrency_task : public UObject
{
	unsigned char unreflected_28[0x10]; // 0x28 (0x10) 
	unsigned char verse0xBD7FB920L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRActive_38[0x10]; // 0x38 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_48[0x70]; // 0x48 (0x70) 
	unsigned char verse0xAFD0D344L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRCancel_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xFE8CA748L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRCancelled_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x1321A804L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRCancelling_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8F0684E8L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRCompleted_48[0x10]; // 0x48 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_58[0x50]; // 0x58 (0x50) 
	unsigned char verse0x2C72A17DL2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRInterrupted_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xBB33978AL2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRSettled_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x07A4A432L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRUninterrupted_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x2C6C9D8AL2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRUnsettled_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_88[0x40]; // 0x88 (0x40) 
	unsigned char verse0x8DE7DBE5Await_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_d8[0x70]; // 0xd8 (0x70)

	/* Functions */

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task._L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RUnsettled (Underlying native function: _L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RUnsettled 0x6a23858)
	void L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRUnsettled(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task._L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RUninterrupted (Underlying native function: _L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RUninterrupted 0x6a23850)
	void L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRUninterrupted(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task._L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RSettled (Underlying native function: _L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RSettled 0x6a23848)
	void L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRSettled(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task._L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RInterrupted (Underlying native function: _L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RInterrupted 0x6a23840)
	void L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRInterrupted(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task._L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RCompleted (Underlying native function: _L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RCompleted 0x6a23838)
	void L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRCompleted(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task._L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RCancelling (Underlying native function: _L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RCancelling 0x6a23830)
	void L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRCancelling(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task._L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RCancelled (Underlying native function: _L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RCancelled 0x6a23828)
	void L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRCancelled(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task._L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RCancel (Underlying native function: _L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RCancel 0x6a23820)
	void L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRCancel(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task.Await (Has no native function)
	class UConcurrency_task* Await(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task._L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RActive (Underlying native function: _L_2fVerse_2eorg_2fConcurrency_2ftask_2ftask_Lt_R_N_RActive 0x6a23818)
	void L2fVerse2eorg2fConcurrency2ftask2ftaskLtRNRActive(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task.$Block (Has no native function)
	void $Block(); // ()

	// Function /Solaris/_Verse/VNI/VerseNative.Concurrency_task.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

