// Class /Script/SentryRuntime.CreativeSentryAnimInstance
// Size: 0x5b0
class UCreativeSentryAnimInstance : public UFortDefenderAnimInstance
{
	float RotateAimAnimationPitch; // 0x588 (0x4)
	float CounterRotateAimAnimationPitch; // 0x58c (0x4)
	bool bIsRelaxedLevel1OrNotTargeting; // 0x590 (0x1)
	unsigned char unreflected_591[0x3]; // 0x591 (0x3) 
	float RightHandIKAlpha; // 0x594 (0x4)
	float OneMinusLeftHandFK; // 0x598 (0x4)
	float LeftHandIKAlpha; // 0x59c (0x4)
	float RetargetHandIKBonesToFKPositionWeight; // 0x5a0 (0x4)
	unsigned char padding_5a4[0xc]; // 0x5a4 (0xc)
};

