// BlueprintGeneratedClass /RidingContent/Components/CreatureBaseRidableComponent.CreatureBaseRidableComponent_C
// Size: 0xb50
class UCreatureBaseRidableComponent_C : public UControllableRidableComponent
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x5b0 (0x8)
	struct FGameplayTagContainer TCreatureIsBeingRidden; // 0x5b8 (0x20)
	class UClass* GECreatureIsBeingRidden; // 0x5d8 (0x8)
	class UClass* GECreatureIsBeingRiddenPassive; // 0x5e0 (0x8)
	bool bDebugDisplay; // 0x5e8 (0x1)
	unsigned char unreflected_5e9[0x7]; // 0x5e9 (0x7) 
	double DebugTickRate; // 0x5f0 (0x8)
	struct FVector DebugServerRiderLocation; // 0x5f8 (0x18)
	double CapsuleRadiusOffset; // 0x610 (0x8)
	double CapsuleHalfHeightOffset; // 0x618 (0x8)
	struct FGameplayTagContainer TRidingSpecialAbility; // 0x620 (0x20)
	class UAnimSequence* IdleAnimAdd; // 0x640 (0x8)
	class UAnimSequence* RunAnimAdd; // 0x648 (0x8)
	class UBlendSpace* TurnBS; // 0x650 (0x8)
	double MinSpeedToRun; // 0x658 (0x8)
	double RunRampIntoSpeed; // 0x660 (0x8)
	double RunRampIntoSpeedADS; // 0x668 (0x8)
	double RunPlayRate; // 0x670 (0x8)
	double RunPlayRateADS; // 0x678 (0x8)
	double SpringAlpha; // 0x680 (0x8)
	double SpringAlphaADS; // 0x688 (0x8)
	double IdleAlpha; // 0x690 (0x8)
	double IdleAlphaADS; // 0x698 (0x8)
	double RunAlpha; // 0x6a0 (0x8)
	double RunAlphaADS; // 0x6a8 (0x8)
	double TurnAlpha; // 0x6b0 (0x8)
	double TurnAlphaADS; // 0x6b8 (0x8)
	class UAnimSequence* ClampAnimPoseLastResort; // 0x6c0 (0x8)
	struct FRotator ClampFootRAdjust; // 0x6c8 (0x18)
	struct FRotator ClampFootLAdjust; // 0x6e0 (0x18)
	double CapsuleRadiusOffsetEmote; // 0x6f8 (0x8)
	double CapsuleHalfHeightOffsetEmote; // 0x700 (0x8)
	struct FVector ClampLocationOffset; // 0x708 (0x18)
	struct FRotator ClampRotationOffset; // 0x720 (0x18)
	struct FVector ClampScaleAdjust; // 0x738 (0x18)
	struct FName RidableSocketName; // 0x750 (0x4)
	unsigned char unreflected_754[0x4]; // 0x754 (0x4) 
	double RidableSocketAlpha; // 0x758 (0x8)
	class UClass* GECooldownOverride; // 0x760 (0x8)
	struct FGameplayTagContainer TCreatureOverrideCooldown; // 0x768 (0x20)
	struct TMap<struct TEnumAsByte<ECollisionChannel>, struct TEnumAsByte<ECollisionResponse>> OriginalCollisionResponseMap; // 0x788 (0x50)
	struct FSoundIndicatorIconPicker RidingSoundIndicatorIconOverride; // 0x7d8 (0x28)
	struct FMulticastInlineDelegate AudioOnJump; // 0x800 (0x10)
	struct FMulticastInlineDelegate AudioOnJumpApex; // 0x810 (0x10)
	unsigned char MovementMode; // 0x820 (0x1)
	bool bFalling; // 0x821 (0x1)
	unsigned char unreflected_822[0x6]; // 0x822 (0x6) 
	struct FScalableFloat RidingAbilityEnableHF; // 0x828 (0x28)
	double JumpAttachGroundHeightMin; // 0x850 (0x8)
	double JumpAttachGroundHeightBuffer; // 0x858 (0x8)
	bool UseAltRidingMessage; // 0x860 (0x1)
	unsigned char unreflected_861[0x7]; // 0x861 (0x7) 
	struct FText RidingInteractionText; // 0x868 (0x18)
	double currentEnergyValue; // 0x880 (0x8)
	class UPlayerRiderComponent_C* PlayerRiderComponentRef; // 0x888 (0x8)
	class ANPC_Pawn_Wildlife_Parent_C* NPCPawnWildlifeRef; // 0x890 (0x8)
	double previousTimeTracked; // 0x898 (0x8)
	double energyTrackingDeltaTime; // 0x8a0 (0x8)
	bool ShouldHaveEnergy; // 0x8a8 (0x1)
	unsigned char unreflected_8a9[0x7]; // 0x8a9 (0x7) 
	double EnergyRateOfDecayStopped; // 0x8b0 (0x8)
	bool allowUpdateEnergyTrackingTick; // 0x8b8 (0x1)
	bool lastBeingRiddenState; // 0x8b9 (0x1)
	unsigned char unreflected_8ba[0x6]; // 0x8ba (0x6) 
	struct FCurveTableRowHandle EnergyRateOfDecayMoving; // 0x8c0 (0x10)
	struct FCurveTableRowHandle EnergyRateOfDecaySprinting; // 0x8d0 (0x10)
	double CurrentEnergyRateOfRecharge; // 0x8e0 (0x8)
	struct FCurveTableRowHandle ExhaustedEnergyRateOfRecharge; // 0x8e8 (0x10)
	double EnergyWarningThreshold; // 0x8f8 (0x8)
	double EnergyCriticalThreshold; // 0x900 (0x8)
	bool energyWarningActive; // 0x908 (0x1)
	bool energyCriticalActive; // 0x909 (0x1)
	unsigned char unreflected_90a[0x6]; // 0x90a (0x6) 
	double minMovementSpeedTreshold; // 0x910 (0x8)
	bool IsJumping; // 0x918 (0x1)
	unsigned char unreflected_919[0x7]; // 0x919 (0x7) 
	double EnergyRegenThreshold; // 0x920 (0x8)
	bool AlwaysRegenWhenNotRidden; // 0x928 (0x1)
	unsigned char unreflected_929[0x7]; // 0x929 (0x7) 
	class UClass* GEEnergyWarning; // 0x930 (0x8)
	class UClass* GEEnergyCritical; // 0x938 (0x8)
	class UClass* GEEnergyDepleted; // 0x940 (0x8)
	struct FGameplayTagContainer TEnergyWarning; // 0x948 (0x20)
	struct FGameplayTagContainer TEnergyCritical; // 0x968 (0x20)
	struct FGameplayTagContainer TEnergyDepleted; // 0x988 (0x20)
	struct FGameplayTagContainer TCannotRideBucket; // 0x9a8 (0x20)
	class UClass* GameplayEffect; // 0x9c8 (0x8)
	struct FGameplayTag SprintingAbilityTag; // 0x9d0 (0x4)
	unsigned char unreflected_9d4[0x4]; // 0x9d4 (0x4) 
	class UClass* GEEatToRefuel; // 0x9d8 (0x8)
	struct FSlateBrush IconBrush; // 0x9e0 (0xc0)
	class UClass* GECreatureSprint; // 0xaa0 (0x8)
	class USoundLibrary* RidingFoleySoundLibrary; // 0xaa8 (0x8)
	struct FGameplayTagContainer TagsPreventSprinting; // 0xab0 (0x20)
	struct FMulticastInlineDelegate RidableUIStart; // 0xad0 (0x10)
	struct FMulticastInlineDelegate RidableUIUpdateEnergy; // 0xae0 (0x10)
	struct FGameplayTag OutOfEnergySoundLibTag; // 0xaf0 (0x4)
	struct FGameplayTag SprintStartSoundLibTag; // 0xaf4 (0x4)
	struct TEnumAsByte<TInteractionType> RidingInteractionType; // 0xaf8 (0x1)
	unsigned char unreflected_af9[0x7]; // 0xaf9 (0x7) 
	double StartInAirTimestamp; // 0xb00 (0x8)
	struct FTimerHandle* RetryJumpExitTimerHandle; // 0xb08 (0x8)
	struct FGameplayTag MountLandedCueTag; // 0xb10 (0x4)
	unsigned char unreflected_b14[0x4]; // 0xb14 (0x4) 
	class UClass* GEBlockCreatureAttackOnDismount; // 0xb18 (0x8)
	bool EnergyRegenActive; // 0xb20 (0x1)
	unsigned char unreflected_b21[0x7]; // 0xb21 (0x7) 
	struct FGameplayTagContainer BlockPettingTagContainer; // 0xb28 (0x20)
	bool infiniteStaminaBuffEnabled; // 0xb48 (0x1)
	unsigned char unreflected_b49[0x3]; // 0xb49 (0x3) 
	struct FGameplayTag InfiniteStaminaEffectGameplayCueTag; // 0xb4c (0x4)

	/* Functions */

	// Function /RidingContent/Components/CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.GetRidingInfoFromTarget (Has no native function)
	void GetRidingInfoFromTarget(double& JumpAttachGroundHeightMin, double& JumpAttachGroundHeightBuffer, bool& UsesAltRidingMessage); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /RidingContent/Components/CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.SetInfiniteStaminaBuff (Has no native function)
	void SetInfiniteStaminaBuff(bool& Enabled, class AActor*& CallFuncGetOwnerReturnValue, struct FGameplayCueParameters& CallFuncMakeGameplayCueParametersReturnValue, struct FGameplayCueParameters& CallFuncMakeGameplayCueParametersReturnValue1, class AActor*& CallFuncGetOwnerReturnValue1); // (Public | HasDefaults | BlueprintCallable | BlueprintEvent)

