// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_BlackWidow_F
// Size: 0xd60
class UCustomCharacterPartAnimInstance_BlackWidow_F : public UCustomCharacterPartAnimInstance
{
	struct FRotator BackpackRotator; // 0x6e8 (0x18)
	struct FName BackpackRotatorBoneName; // 0x700 (0x4)
	struct FName BackpackRotatorBaseName; // 0x704 (0x4)
	struct FVector2D BackpackRotatorMapInputRange; // 0x708 (0x10)
	struct FVector2D BackpackRotatorMapOutputRange; // 0x718 (0x10)
	float PawnSpeedRange; // 0x728 (0x4)
	unsigned char unreflected_72c[0x4]; // 0x72c (0x4) 
	struct FVector2D PawnSpeedMapInputRange; // 0x730 (0x10)
	struct FVector2D PawnSpeedMapOutputRange; // 0x740 (0x10)
	struct FVector FallingAnimDynamicsUpForce; // 0x750 (0x18)
	struct FVector2D FallingAnimDynamicsPerlinNoiseMapRange; // 0x768 (0x10)
	float FallingAnimDynamicsForceGliderMultiplier; // 0x778 (0x4)
	float FallingAnimDynamicsForceGlobalMultiplier; // 0x77c (0x4)
	struct FRotator LegTop01Rotation; // 0x780 (0x18)
	struct FRotator LegTop02Rotation; // 0x798 (0x18)
	struct FRotator LegTop03Rotation; // 0x7b0 (0x18)
	struct FRotator LegTop04Rotation; // 0x7c8 (0x18)
	struct FRotator LegMid01Rotation; // 0x7e0 (0x18)
	struct FRotator LegMid03Rotation; // 0x7f8 (0x18)
	struct FRotator LegMid04Rotation; // 0x810 (0x18)
	struct FRotator LegBot01Rotation; // 0x828 (0x18)
	struct FRotator LegBot02Rotation; // 0x840 (0x18)
	struct FRotator LegBot03Rotation; // 0x858 (0x18)
	float LegRotationScaleDownRateADS; // 0x870 (0x4)
	float Legs01PoseTargetAlpha; // 0x874 (0x4)
	float Legs02PoseTargetAlpha; // 0x878 (0x4)
	float Legs03PoseTargetAlpha; // 0x87c (0x4)
	float Legs04PoseTargetAlpha; // 0x880 (0x4)
	float CollapseLegsTimeSeconds; // 0x884 (0x4)
	float CollapsingLegs01PoseFullAlphaDelay; // 0x888 (0x4)
	float CollapsingLegs02PoseFullAlphaDelay; // 0x88c (0x4)
	float CollapsingLegs03PoseFullAlphaDelay; // 0x890 (0x4)
	float CollapsingLegs04PoseFullAlphaDelay; // 0x894 (0x4)
	float TopLegsAlpha; // 0x898 (0x4)
	float MidLegsAlpha; // 0x89c (0x4)
	float BotLegsAlpha; // 0x8a0 (0x4)
	float LegSinAnimationFrequency; // 0x8a4 (0x4)
	struct FBlackWidowLegSinAnimationRotator LegTop01SinAnimation; // 0x8a8 (0x78)
	struct FBlackWidowLegSinAnimationRotator LegTop02SinAnimation; // 0x920 (0x78)
	struct FBlackWidowLegSinAnimationRotator LegTop03SinAnimation; // 0x998 (0x78)
	struct FBlackWidowLegSinAnimationRotator LegTop04SinAnimation; // 0xa10 (0x78)
	struct FBlackWidowLegSinAnimationRotator LegMid01SinAnimation; // 0xa88 (0x78)
	struct FBlackWidowLegSinAnimationRotator LegMid03SinAnimation; // 0xb00 (0x78)
	struct FBlackWidowLegSinAnimationRotator LegMid04SinAnimation; // 0xb78 (0x78)
	struct FBlackWidowLegSinAnimationRotator LegBot01SinAnimation; // 0xbf0 (0x78)
	struct FBlackWidowLegSinAnimationRotator LegBot02SinAnimation; // 0xc68 (0x78)
	struct FBlackWidowLegSinAnimationRotator LegBot03SinAnimation; // 0xce0 (0x78)
	unsigned char padding_d58[0x8]; // 0xd58 (0x8)
};

