// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_HoneydewSwoleBody
// Size: 0x730
class UCustomCharacterPartAnimInstance_HoneydewSwoleBody : public UCustomCharacterPartAnimInstance
{
	struct TWeakObjectPtr<class UAnimMontage> MusclesLobbyMontage; // 0x6e8 (0x28)
	float ThighRotationLeft; // 0x710 (0x4)
	float ThighRotationRight; // 0x714 (0x4)
	float ElbowRotationLeft; // 0x718 (0x4)
	float ElbowRotationRight; // 0x71c (0x4)
	float UpperarmRotationLeft; // 0x720 (0x4)
	float UpperarmRotationRight; // 0x724 (0x4)
	float EmoteAlpha; // 0x728 (0x4)
	float MusclesPosition; // 0x72c (0x4)
};

