// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_DonutCupCape
// Size: 0x830
class UCustomCharacterPartAnimInstance_DonutCupCape : public UCustomCharacterPartAnimInstance
{
	struct FVector WindVector; // 0x6e8 (0x18)
	struct FVector PelvisLocation; // 0x700 (0x18)
	struct FVector ThighLeftLocation; // 0x718 (0x18)
	struct FVector ThighRightLocation; // 0x730 (0x18)
	struct FVector CalfLeftLocation; // 0x748 (0x18)
	struct FVector CalfRightLocation; // 0x760 (0x18)
	struct FVector BodyRootLocation; // 0x778 (0x18)
	struct FRotator PelvisRotation; // 0x790 (0x18)
	struct FRotator ThighLeftRotation; // 0x7a8 (0x18)
	struct FRotator ThighRightRotation; // 0x7c0 (0x18)
	struct FRotator CalfLeftRotation; // 0x7d8 (0x18)
	struct FRotator CalfRightRotation; // 0x7f0 (0x18)
	struct FRotator BodyRootRotation; // 0x808 (0x18)
	float RigidBodyAlpha; // 0x820 (0x4)
	unsigned char padding_824[0xc]; // 0x824 (0xc)
};

