// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_ColumbusBody
// Size: 0x750
class UCustomCharacterPartAnimInstance_ColumbusBody : public UCustomCharacterPartAnimInstance
{
	struct FVector2D SpinePositivePitchInputRange; // 0x6e8 (0x10)
	float ThighRotationRightDynamicsAlpha; // 0x6f8 (0x4)
	float ThighRotationLeftDynamicsAlpha; // 0x6fc (0x4)
	float ThighRotationRightAlpha; // 0x700 (0x4)
	float ThighRotationLeftAlpha; // 0x704 (0x4)
	float ClavicleRotationRightAlpha; // 0x708 (0x4)
	float ClavicleRotationLeftAlpha; // 0x70c (0x4)
	float PickaxeSwingPositionLeftPositiveAlpha; // 0x710 (0x4)
	float PickaxeSwingPositionLeftNegativeAlpha; // 0x714 (0x4)
	float PickaxeSwingPositionRightPositiveAlpha; // 0x718 (0x4)
	float PickaxeSwingPositionRightNegativeAlpha; // 0x71c (0x4)
	float ChestArmorDynamicsAlpha; // 0x720 (0x4)
	float ChestArmorDynamicsInvAlpha; // 0x724 (0x4)
	float ChestArmorDynamicsClavicleLeftInvAlpha; // 0x728 (0x4)
	float ChestArmorDynamicsClavicleRightInvAlpha; // 0x72c (0x4)
	float CrouchMoveAlpha; // 0x730 (0x4)
	float UpperArmLeftSwingAlpha; // 0x734 (0x4)
	float SkydivingAlpha; // 0x738 (0x4)
	float SpinePositivePitchAlpha; // 0x73c (0x4)
	bool bChestDynamicsDisableRB; // 0x740 (0x1)
	bool bIsCrouchMoving; // 0x741 (0x1)
	bool bIsAboveLODThreshold; // 0x742 (0x1)
	bool bShouldResetDynamics; // 0x743 (0x1)
	unsigned char padding_744[0xc]; // 0x744 (0xc)
};

