// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_JerkySpaceBody
// Size: 0x860
class UCustomCharacterPartAnimInstance_JerkySpaceBody : public UCustomCharacterPartAnimInstance
{
	struct FVector WindVector; // 0x6e8 (0x18)
	float SkydiveAlpha; // 0x700 (0x4)
	bool bDisableRigidBodies; // 0x704 (0x1)
	unsigned char unreflected_705[0x3]; // 0x705 (0x3) 
	struct FRotator CrouchRootRotation; // 0x708 (0x18)
	struct FVector CoatScale; // 0x720 (0x18)
	struct FVector CoatLocationOffset; // 0x738 (0x18)
	struct FVector WorldGravityOverride; // 0x750 (0x18)
	struct FRotator CoatRotation0; // 0x768 (0x18)
	struct FRotator CoatRotation1; // 0x780 (0x18)
	struct FRotator CoatRotation2; // 0x798 (0x18)
	struct FRotator CoatRotation4; // 0x7b0 (0x18)
	struct FRotator CoatRotation3; // 0x7c8 (0x18)
	struct FRotator CoatRotation5; // 0x7e0 (0x18)
	struct FRotator CoatRotation6; // 0x7f8 (0x18)
	struct FRotator CoatRotationFoot0; // 0x810 (0x18)
	struct FRotator CoatRotationFoot1; // 0x828 (0x18)
	struct FRotator CoatRotationFoot2; // 0x840 (0x18)
	float HeadTwistLeftAlpha; // 0x858 (0x4)
	unsigned char padding_85c[0x4]; // 0x85c (0x4)
};

