// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_HightowerTapasBody
// Size: 0x750
class UCustomCharacterPartAnimInstance_HightowerTapasBody : public UCustomCharacterPartAnimInstance
{
	struct TWeakObjectPtr<class UAnimMontage> TapasDanceMontage; // 0x6e8 (0x28)
	struct FVector WindVector; // 0x710 (0x18)
	float crouchingAlpha; // 0x728 (0x4)
	float ElbowRightAlpha; // 0x72c (0x4)
	float ElbowLeftAlpha; // 0x730 (0x4)
	float LatStretchRightAlpha; // 0x734 (0x4)
	float IsWearingCapeAlpha; // 0x738 (0x4)
	float HalfIsWearingCapeAlpha; // 0x73c (0x4)
	float TapasMontageAlpha; // 0x740 (0x4)
	unsigned char padding_744[0xc]; // 0x744 (0xc)
};

