// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_GoldenSkeletonBody
// Size: 0x750
class UCustomCharacterPartAnimInstance_GoldenSkeletonBody : public UCustomCharacterPartAnimInstance
{
	struct FRotator WristLeftRotation; // 0x6e8 (0x18)
	struct FRotator WristRightRotation; // 0x700 (0x18)
	struct FVector GravityOverride; // 0x718 (0x18)
	float ArmRightUpAlpha; // 0x730 (0x4)
	float CrouchAlpha; // 0x734 (0x4)
	float ArmLeftUpAlpha; // 0x738 (0x4)
	float HeadUpAlpha; // 0x73c (0x4)
	float CrouchInverseAlpha; // 0x740 (0x4)
	unsigned char padding_744[0xc]; // 0x744 (0xc)
};

