// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_BaseTail
// Size: 0x780
class UCustomCharacterPartAnimInstance_BaseTail : public UCustomCharacterPartAnimInstance
{
	struct FFortAnimInput_Skydiving SkydivingState; // 0x6e8 (0x78)
	float TailSkydiveLean; // 0x760 (0x4)
	float TailDiveSpeed; // 0x764 (0x4)
	float TailSkydiveYaw; // 0x768 (0x4)
	float SpeedAdjustedPlayrate; // 0x76c (0x4)
	unsigned char bIsInShoppingCartSprinting; // 0x770 (0x1)
	unsigned char bIsInShoppingCartMoving; // 0x770 (0x1)
	unsigned char bIsInShoppingCartCoasting; // 0x770 (0x1)
	unsigned char bIsInShoppingCartInAir; // 0x770 (0x1)
	unsigned char bIsHoverboardJumping; // 0x770 (0x1)
	unsigned char bIsHoverboardLanding; // 0x770 (0x1)
	unsigned char bIsWearingCape; // 0x770 (0x1)
	unsigned char bBlendInBackwardPose; // 0x770 (0x1)
	unsigned char unreflected_771[0x3]; // 0x771 (0x3) 
	unsigned char bTransitionIdleLocomotion; // 0x774 (0x1)
	unsigned char bTransitionLocomotionIdle; // 0x774 (0x1)
	unsigned char bTransitionIdleSkydive; // 0x774 (0x1)
	unsigned char bTransitionIdleCrouching; // 0x774 (0x1)
	unsigned char bTransitionSkyDiveIdle; // 0x774 (0x1)
	unsigned char bTransitionStartJumpSkyDive; // 0x774 (0x1)
	unsigned char bTransitionJumpLoopIdle; // 0x774 (0x1)
	unsigned char bTransitionDownSightsConduitDownSightsToIdle; // 0x774 (0x1)
	unsigned char bTransitionCrouchingLocomotion; // 0x775 (0x1)
	unsigned char bShoppingCartSprintOrSprint; // 0x775 (0x1)
	unsigned char bIsFallingOrIsJumpingOrIsShoppingCartInAir; // 0x775 (0x1)
	unsigned char bIsFallingOrIsHoverboardJumping; // 0x775 (0x1)
	unsigned char padding_776[0xa]; // 0x776 (0xa)
};

