// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_HoneydewBody
// Size: 0x710
class UCustomCharacterPartAnimInstance_HoneydewBody : public UCustomCharacterPartAnimInstance
{
	float ThighRotationLeft; // 0x6e8 (0x4)
	float ThighRotationRight; // 0x6ec (0x4)
	float HeadRotation; // 0x6f0 (0x4)
	float ClavicleLeft; // 0x6f4 (0x4)
	float ClavicleRight; // 0x6f8 (0x4)
	float SkirtDynAlpha; // 0x6fc (0x4)
	float IsCrouchingAndStillAlpha; // 0x700 (0x4)
	unsigned char padding_704[0xc]; // 0x704 (0xc)
};

