// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_Dragon_Mask
// Size: 0x710
class UCustomCharacterPartAnimInstance_Dragon_Mask : public UCustomCharacterPartAnimInstance
{
	float ShortsAlpha; // 0x6e8 (0x4)
	float ArmUpR; // 0x6ec (0x4)
	float ArmBackR; // 0x6f0 (0x4)
	float ArmUpMoreR; // 0x6f4 (0x4)
	float HeadRotBack; // 0x6f8 (0x4)
	float CalfRotBackR; // 0x6fc (0x4)
	float CalfRotBackL; // 0x700 (0x4)
	unsigned char padding_704[0xc]; // 0x704 (0xc)
};

