// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_BlackKnightBody
// Size: 0x830
class UCustomCharacterPartAnimInstance_BlackKnightBody : public UCustomCharacterPartAnimInstance
{
	struct FRotator ShldrPadRightRotator; // 0x6e8 (0x18)
	struct FRotator ShldrPadLeftRotator; // 0x700 (0x18)
	struct FRotator ShldrPadLeftAimRotator; // 0x718 (0x18)
	struct FRotator ShldrPadRightAimRotator; // 0x730 (0x18)
	struct FRotator ShldrPadLeftRollRot; // 0x748 (0x18)
	struct FVector ShldrPadLeftTrans; // 0x760 (0x18)
	struct FVector ShldrPadLeftAimTrans; // 0x778 (0x18)
	struct FVector ShldrPadRightAimTrans; // 0x790 (0x18)
	struct FVector ShldrPadLeftRollTrans; // 0x7a8 (0x18)
	struct FVector ShldrPadRightPackTrans; // 0x7c0 (0x18)
	struct FVector ShldrPadRightTrans; // 0x7d8 (0x18)
	float ShldrLeftRifleAlpha; // 0x7f0 (0x4)
	float CollarFrontAlpha; // 0x7f4 (0x4)
	float ShldrLeftAlpha; // 0x7f8 (0x4)
	float ShldrRightAlpha; // 0x7fc (0x4)
	float ShldrLeftRollAlpha; // 0x800 (0x4)
	float ShldrRightRollAlpha; // 0x804 (0x4)
	float KneeBendRightAlpha; // 0x808 (0x4)
	float KneeBendLeftAlpha; // 0x80c (0x4)
	float ThighRotLeft; // 0x810 (0x4)
	float ThighKnifeFix; // 0x814 (0x4)
	float ShldrLeftTwistAlpha; // 0x818 (0x4)
	float WristRotLeft; // 0x81c (0x4)
	float WristRotRight; // 0x820 (0x4)
	unsigned char padding_824[0xc]; // 0x824 (0xc)
};

