// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_BoneSnakeFace
// Size: 0x760
class UCustomCharacterPartAnimInstance_BoneSnakeFace : public UCustomCharacterPartAnimInstance
{
	struct FRotator TongueRotationA; // 0x6e8 (0x18)
	struct FRotator TongueRotationB; // 0x700 (0x18)
	struct FRotator TongueRotationC; // 0x718 (0x18)
	struct FVector TongueScale; // 0x730 (0x18)
	float ShoulderLeftAlpha; // 0x748 (0x4)
	float ShoulderRightAlpha; // 0x74c (0x4)
	float HeadForwardAlpha; // 0x750 (0x4)
	float LifeSpan; // 0x754 (0x4)
	unsigned char padding_758[0x8]; // 0x758 (0x8)
};

