// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_RhinoBackpack
// Size: 0x750
class UCustomCharacterPartAnimInstance_RhinoBackpack : public UCustomCharacterPartAnimInstance
{
	struct FVector Piston1Movement; // 0x6e8 (0x18)
	struct FVector Piston2Movement; // 0x700 (0x18)
	struct FVector Piston3Movement; // 0x718 (0x18)
	float Piston1SinOffset; // 0x730 (0x4)
	float Piston2SinOffset; // 0x734 (0x4)
	float Piston3SinOffset; // 0x738 (0x4)
	float DefaultPistonSpeed; // 0x73c (0x4)
	float FastPistonSpeed; // 0x740 (0x4)
	float FastPistonThreshold; // 0x744 (0x4)
	unsigned char padding_748[0x8]; // 0x748 (0x8)
};

