// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_Rebirth_Soldier_M
// Size: 0x720
class UCustomCharacterPartAnimInstance_Rebirth_Soldier_M : public UCustomCharacterPartAnimInstance
{
	float ArmRightRotAlpha; // 0x6e8 (0x4)
	float ArmLeftRotAlpha; // 0x6ec (0x4)
	float ClavicleRightRotAlpha; // 0x6f0 (0x4)
	float ClavicleLeftRotAlpha; // 0x6f4 (0x4)
	float HeadRotAlpha; // 0x6f8 (0x4)
	float CalfRightRotAlpha; // 0x6fc (0x4)
	float CalfLeftRotAlpha; // 0x700 (0x4)
	float ThighRightRotAlpha; // 0x704 (0x4)
	float ThighLeftRotAlpha; // 0x708 (0x4)
	float WeaponRaisedAlpha; // 0x70c (0x4)
	bool bIsWearingBackbling; // 0x710 (0x1)
	unsigned char padding_711[0xf]; // 0x711 (0xf)
};

