// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_ProfPupBody
// Size: 0x750
class UCustomCharacterPartAnimInstance_ProfPupBody : public UCustomCharacterPartAnimInstance_SyncedPart
{
	struct FRotator WheelRotator; // 0x6f8 (0x18)
	float WheelAngle; // 0x710 (0x4)
	float SkydiveReduceAlpha; // 0x714 (0x4)
	float DynamicsAlpha; // 0x718 (0x4)
	float VehicleOrSkydivingOffAlpha; // 0x71c (0x4)
	float CatBodyAlpha; // 0x720 (0x4)
	float MechBodyAlpha; // 0x724 (0x4)
	float AdditiveIdleAlpha; // 0x728 (0x4)
	float ModifyTailAlpha; // 0x72c (0x4)
	float TraversalEmoteTime; // 0x730 (0x4)
	float CurrentLODValue; // 0x734 (0x4)
	float BaseWheelSpeed; // 0x738 (0x4)
	float TreadmillBaseSpeed; // 0x73c (0x4)
	bool bTurnOnBreaklight; // 0x740 (0x1)
	bool bLongBackbling; // 0x741 (0x1)
	bool bShortBackbling; // 0x742 (0x1)
	bool bIsBlendingTraversalEmote; // 0x743 (0x1)
	unsigned char padding_744[0xc]; // 0x744 (0xc)
};

