// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_DJBackpack
// Size: 0x730
class UCustomCharacterPartAnimInstance_DJBackpack : public UCustomCharacterPartAnimInstance
{
	bool bIsKillCelebrationActive; // 0x6e8 (0x1)
	unsigned char unreflected_6e9[0x3]; // 0x6e9 (0x3) 
	int KillCountLastFrame; // 0x6ec (0x4)
	int KillCount; // 0x6f0 (0x4)
	float CurrentSpinRate; // 0x6f4 (0x4)
	struct FRotator BallRotator; // 0x6f8 (0x18)
	float BaseSpinRate; // 0x710 (0x4)
	float SpinRateMultiplier; // 0x714 (0x4)
	float DefaultSpinRate; // 0x718 (0x4)
	float DefaultSpinRateInterpSpeed; // 0x71c (0x4)
	float KillCelebrationSpinRate; // 0x720 (0x4)
	float KillCelebrationSpinRateInterpSpeed; // 0x724 (0x4)
	unsigned char padding_728[0x8]; // 0x728 (0x8)
};

