// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_Angel
// Size: 0x710
class UCustomCharacterPartAnimInstance_Angel : public UCustomCharacterPartAnimInstance
{
	float SkydivingAlpha; // 0x6e8 (0x4)
	float CrouchAlpha; // 0x6ec (0x4)
	float RearClothAlpha; // 0x6f0 (0x4)
	float ClothAlpha; // 0x6f4 (0x4)
	float FrontClothAlpha; // 0x6f8 (0x4)
	float FeatherAlpha; // 0x6fc (0x4)
	float CrouchSkirtAlpha; // 0x700 (0x4)
	float FrontClothCrouchAlpha; // 0x704 (0x4)
	float SpineRotLeft; // 0x708 (0x4)
	unsigned char padding_70c[0x4]; // 0x70c (0x4)
};

