// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_DesertOpsCamoHair
// Size: 0x740
class UCustomCharacterPartAnimInstance_DesertOpsCamoHair : public UCustomCharacterPartAnimInstance
{
	unsigned char unreflected_6f0[0x30]; // 0x6f0 (0x30) 
	class AFortPlayerMannequin* MannequinOwner; // 0x720 (0x8)
	float HeadSwingAlpha; // 0x728 (0x4)
	float HeadTwistRightAlpha; // 0x72c (0x4)
	float HeadTwistLeftAlpha; // 0x730 (0x4)
	float HeadRotBackAlpha; // 0x734 (0x4)
	float SkydivingFrontAlpha; // 0x738 (0x4)
	float SkydivingBackAlpha; // 0x73c (0x4)
};

