// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_HightowerTapasCape
// Size: 0xa70
class UCustomCharacterPartAnimInstance_HightowerTapasCape : public UCustomCharacterPartAnimInstance
{
	struct FVector PelvisLocation; // 0x6e8 (0x18)
	struct FVector ThighLeftLocation; // 0x700 (0x18)
	struct FVector ThighRightLocation; // 0x718 (0x18)
	struct FVector CalfLeftLocation; // 0x730 (0x18)
	struct FVector CalfRightLocation; // 0x748 (0x18)
	struct FVector BodyRootLocation; // 0x760 (0x18)
	struct FVector Spine05Location; // 0x778 (0x18)
	struct FVector ClavicleRightLocation; // 0x790 (0x18)
	struct FVector ClavicleLeftLocation; // 0x7a8 (0x18)
	struct FVector UpperarmLeftLocation; // 0x7c0 (0x18)
	struct FVector UpperarmRightLocation; // 0x7d8 (0x18)
	struct FVector LowerarmLeftLocation; // 0x7f0 (0x18)
	struct FVector LowerarmRightLocation; // 0x808 (0x18)
	struct FVector Spine01Location; // 0x820 (0x18)
	struct FVector Spine02Location; // 0x838 (0x18)
	struct FVector Spine03Location; // 0x850 (0x18)
	struct FVector Spine04Location; // 0x868 (0x18)
	struct FVector FinalGravity; // 0x880 (0x18)
	struct FVector CompLinearAccelarationScale; // 0x898 (0x18)
	struct FVector CompLinearVelocityScale; // 0x8b0 (0x18)
	struct FRotator PelvisRotation; // 0x8c8 (0x18)
	struct FRotator ThighLeftRotation; // 0x8e0 (0x18)
	struct FRotator ThighRightRotation; // 0x8f8 (0x18)
	struct FRotator CalfLeftRotation; // 0x910 (0x18)
	struct FRotator CalfRightRotation; // 0x928 (0x18)
	struct FRotator BodyRootRotation; // 0x940 (0x18)
	struct FRotator Spine05Rotation; // 0x958 (0x18)
	struct FRotator ClavicleRightRotation; // 0x970 (0x18)
	struct FRotator ClavicleLeftRotation; // 0x988 (0x18)
	struct FRotator UpperarmLeftRotation; // 0x9a0 (0x18)
	struct FRotator UpperarmRightRotation; // 0x9b8 (0x18)
	struct FRotator LowerarmLeftRotation; // 0x9d0 (0x18)
	struct FRotator LowerarmRightRotation; // 0x9e8 (0x18)
	struct FRotator Spine01Rotation; // 0xa00 (0x18)
	struct FRotator Spine02Rotation; // 0xa18 (0x18)
	struct FRotator Spine03Rotation; // 0xa30 (0x18)
	struct FRotator Spine04Rotation; // 0xa48 (0x18)
	float RigidBodyAlpha; // 0xa60 (0x4)
	unsigned char padding_a64[0xc]; // 0xa64 (0xc)
};

