// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_StrawberryPilotBody
// Size: 0x710
class UCustomCharacterPartAnimInstance_StrawberryPilotBody : public UCustomCharacterPartAnimInstance
{
	float LegRightSwingAlpha; // 0x6e8 (0x4)
	float LegLeftSwingAlpha; // 0x6ec (0x4)
	float RigidBodyCrouchAlpha; // 0x6f0 (0x4)
	float CrouchSpeedAlpha; // 0x6f4 (0x4)
	float ArmRightSwingAlpha; // 0x6f8 (0x4)
	float ArmRightSwingTargetingAlpha; // 0x6fc (0x4)
	float ArmLeftSwingAlpha; // 0x700 (0x4)
	float HeadSwingAlpha; // 0x704 (0x4)
	float HeadRightTwistAlpha; // 0x708 (0x4)
	float HeadLeftTwistAlpha; // 0x70c (0x4)
};

