// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_JerkyBody
// Size: 0x720
class UCustomCharacterPartAnimInstance_JerkyBody : public UCustomCharacterPartAnimInstance
{
	struct FVector WindVector; // 0x6e8 (0x18)
	float SkydiveAlpha; // 0x700 (0x4)
	float crouchingAlpha; // 0x704 (0x4)
	float ShoulderRightScaleAlpha; // 0x708 (0x4)
	float ShoulderLeftScaleAlpha; // 0x70c (0x4)
	float BicepLeftLengthAlpha; // 0x710 (0x4)
	float BicepRightLengthAlpha; // 0x714 (0x4)
	bool bShouldDisableRigidBodies; // 0x718 (0x1)
	unsigned char padding_719[0x7]; // 0x719 (0x7)
};

