// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_Islander
// Size: 0x7a0
class UCustomCharacterPartAnimInstance_Islander : public UCustomCharacterPartAnimInstance
{
	struct FVector GravityOverrideSwimSprinting; // 0x6e8 (0x18)
	struct FVector GravityOverrideSkyDiving; // 0x700 (0x18)
	struct FVector GravityOverrideNormalGravity; // 0x718 (0x18)
	struct FVector2D ThighRotationUpRightMinMax; // 0x730 (0x10)
	struct FVector2D ThighRotationUpLeftMinMax; // 0x740 (0x10)
	struct FVector2D KneeRotationUpRightMinMax; // 0x750 (0x10)
	struct FVector2D KneeRotationUpLeftMinMax; // 0x760 (0x10)
	float ThighRotationUpRight; // 0x770 (0x4)
	float ThighRotationUpLeft; // 0x774 (0x4)
	float KneeRotationUpRight; // 0x778 (0x4)
	float KneeRotationUpLeft; // 0x77c (0x4)
	struct FVector GravityOverride; // 0x780 (0x18)
	unsigned char padding_798[0x8]; // 0x798 (0x8)
};

