// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_CavalryBanditBody
// Size: 0x720
class UCustomCharacterPartAnimInstance_CavalryBanditBody : public UCustomCharacterPartAnimInstance
{
	struct FVector FinalGravity; // 0x6e8 (0x18)
	float SkydiveSpineSpace; // 0x700 (0x4)
	float SkydiveRootSpace; // 0x704 (0x4)
	float CrouchRootSpace; // 0x708 (0x4)
	float CrouchSpineSpace; // 0x70c (0x4)
	float FinalRootSpace; // 0x710 (0x4)
	float FinalSpineSpace; // 0x714 (0x4)
	unsigned char padding_718[0x8]; // 0x718 (0x8)
};

