// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_HightowerWasabiBody
// Size: 0x710
class UCustomCharacterPartAnimInstance_HightowerWasabiBody : public UCustomCharacterPartAnimInstance
{
	float RightArmDistanceBICEPAlpha; // 0x6e8 (0x4)
	float LeftArmDistanceBICEPAlpha; // 0x6ec (0x4)
	float RightPecAimPosAlpha; // 0x6f0 (0x4)
	float RightPecStretchAlpha; // 0x6f4 (0x4)
	float LeftPecStretchAlpha; // 0x6f8 (0x4)
	float RightLatStretchAlpha; // 0x6fc (0x4)
	float RightKneeAlpha; // 0x700 (0x4)
	float LeftKneeAlpha; // 0x704 (0x4)
	float LeftTrapsStretchAlpha; // 0x708 (0x4)
	float RightTrapsStretchAlpha; // 0x70c (0x4)
};

