// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_HightowerMangoBody
// Size: 0x730
class UCustomCharacterPartAnimInstance_HightowerMangoBody : public UCustomCharacterPartAnimInstance
{
	struct FVector GravityOverride; // 0x6e8 (0x18)
	struct FVector VectorForce; // 0x700 (0x18)
	float ClothAlpha; // 0x718 (0x4)
	float FrontEndRearAlpha; // 0x71c (0x4)
	float ThighRotationLeft; // 0x720 (0x4)
	float ThighRotationRight; // 0x724 (0x4)
	bool bIsWearingLongCape; // 0x728 (0x1)
	unsigned char padding_729[0x7]; // 0x729 (0x7)
};

