// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_KayakCape
// Size: 0x7b0
class UCustomCharacterPartAnimInstance_KayakCape : public UCustomCharacterPartAnimInstance
{
	class USkeletalMeshComponent* HeadMesh; // 0x6f0 (0x8)
	struct FVector CapeTrailFakeVelocityLowLeft; // 0x6f8 (0x18)
	struct FVector CapeTrailFakeVelocityMidLeft; // 0x710 (0x18)
	struct FVector CapeTrailFakeVelocityMidRight; // 0x728 (0x18)
	struct FVector CapeTrailFakeVelocityLowRight; // 0x740 (0x18)
	struct FVector CapeGravityOverride; // 0x758 (0x18)
	struct FVector HoodGravityOverride; // 0x770 (0x18)
	struct FRotator HeadRotation; // 0x788 (0x18)
	float CapeTrailRelaxSpeedScale; // 0x7a0 (0x4)
	float PlayerForwardAcceleration; // 0x7a4 (0x4)
	float UpperArmRightAlpha; // 0x7a8 (0x4)
	float UpperArmLeftAlpha; // 0x7ac (0x4)
};

