// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_PhotographerBody
// Size: 0x720
class UCustomCharacterPartAnimInstance_PhotographerBody : public UCustomCharacterPartAnimInstance
{
	class UAnimMontage* MatchingMontage; // 0x6e8 (0x8)
	unsigned char unreflected_6f0[0x4]; // 0x6f0 (0x4) 
	float crouchingAlpha; // 0x6f4 (0x4)
	float InverseDancingAlpha; // 0x6f8 (0x4)
	float SpineUpAlpha; // 0x6fc (0x4)
	float BackblingAlpha; // 0x700 (0x4)
	float PelvisForwardAlpha; // 0x704 (0x4)
	float InverseBackblingAlpha; // 0x708 (0x4)
	float TraversalAlpha; // 0x70c (0x4)
	float SkydiveAlpha; // 0x710 (0x4)
	bool bPlayingPhotoTraversalEmote; // 0x714 (0x1)
	unsigned char padding_715[0xb]; // 0x715 (0xb)
};

