// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_Shapeshifter_Medusa
// Size: 0x7c0
class UCustomCharacterPartAnimInstance_Shapeshifter_Medusa : public UCustomCharacterPartAnimInstance
{
	struct FMulticastInlineDelegate ActivateTargeting; // 0x6e8 (0x10)
	struct FVector GravityOverride; // 0x6f8 (0x18)
	struct FVector HairBandScale; // 0x710 (0x18)
	struct FVector HairScale; // 0x728 (0x18)
	struct FVector HairScaleInterp; // 0x740 (0x18)
	struct FVector SnakeBandScale; // 0x758 (0x18)
	struct FVector SnakeHairScale; // 0x770 (0x18)
	struct FVector SnakeHairScaleInterp; // 0x788 (0x18)
	float BackblingAlpha; // 0x7a0 (0x4)
	float HairRbanAlpha; // 0x7a4 (0x4)
	float HairRbanAlphaInterp; // 0x7a8 (0x4)
	float PawnMovementDirectionAzimuth2; // 0x7ac (0x4)
	float RigidsAlpha; // 0x7b0 (0x4)
	float ScaleAnimExplicitTime; // 0x7b4 (0x4)
	bool bDisableSnakes; // 0x7b8 (0x1)
	bool bIsReactivePreviewSnakesFromAds; // 0x7b9 (0x1)
	bool bIsMedusaTargeting; // 0x7ba (0x1)
	unsigned char padding_7bb[0x5]; // 0x7bb (0x5)
};

