// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_StrawberryPilotFace
// Size: 0x7b0
class UCustomCharacterPartAnimInstance_StrawberryPilotFace : public UCustomCharacterPartAnimInstance
{
	float HeadSwingDeltaValue; // 0x6e8 (0x4)
	float ArmSwingDeltaLValue; // 0x6ec (0x4)
	float ArmSwingDeltaRValue; // 0x6f0 (0x4)
	float HeadTwistLValue; // 0x6f4 (0x4)
	float HeadTwistRValue; // 0x6f8 (0x4)
	float HeadSwingDeltaTargetLValue; // 0x6fc (0x4)
	float HeadSwingDeltaTargetRValue; // 0x700 (0x4)
	unsigned char unreflected_704[0x4]; // 0x704 (0x4) 
	struct FVector2D ArmSwingDeltaLInRange; // 0x708 (0x10)
	struct FVector2D ArmSwingDeltaLOutRange; // 0x718 (0x10)
	struct FVector2D ArmSwingDeltaRInRange; // 0x728 (0x10)
	struct FVector2D ArmSwingDeltaROutRange; // 0x738 (0x10)
	struct FVector2D HeadSwingDeltaInRange; // 0x748 (0x10)
	struct FVector2D HeadSwingDeltaOutRange; // 0x758 (0x10)
	struct FVector2D HeadTwistRInRange; // 0x768 (0x10)
	struct FVector2D HeadTwistROutRange; // 0x778 (0x10)
	struct FVector2D HeadTwistLInRange; // 0x788 (0x10)
	struct FVector2D HeadTwistLOutRange; // 0x798 (0x10)
	unsigned char padding_7a8[0x8]; // 0x7a8 (0x8)
};

