// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_SRDriftBody
// Size: 0x790
class UCustomCharacterPartAnimInstance_SRDriftBody : public UCustomCharacterPartAnimInstance
{
	struct FVector WeaponKickupExternalForce; // 0x6f0 (0x18)
	struct FVector WeaponKickupExternalForceLeft; // 0x708 (0x18)
	struct FRotator DiveJiggleRotation; // 0x720 (0x18)
	struct FVector FallingAnimDynamicsUpForce; // 0x738 (0x18)
	float RightFootJacketBackDistanceAlpha; // 0x750 (0x4)
	float LeftFootJacketBackDistanceAlpha; // 0x754 (0x4)
	float LegJacketFrontAlpha; // 0x758 (0x4)
	float CrouchJacketFrontRightAlpha; // 0x75c (0x4)
	float AnimDynamicsAlpha; // 0x760 (0x4)
	float CrouchJacketBackRightAlpha; // 0x764 (0x4)
	float CrouchJacketFrontLeftAlpha; // 0x768 (0x4)
	float JacketCopyBoneAlpha; // 0x76c (0x4)
	float JacketRightSleeveDynamicAlpha; // 0x770 (0x4)
	float JacketLeftSleeveDynamicAlpha; // 0x774 (0x4)
	float JacketTailGroundAlpha; // 0x778 (0x4)
	float ThighLeftAlpha; // 0x77c (0x4)
	float ThighRightAlpha; // 0x780 (0x4)
	unsigned char padding_784[0xc]; // 0x784 (0xc)
};

