// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_JerkyUniverseBody
// Size: 0x7c0
class UCustomCharacterPartAnimInstance_JerkyUniverseBody : public UCustomCharacterPartAnimInstance
{
	struct FVector WindVector; // 0x6e8 (0x18)
	float SkydiveAlpha; // 0x700 (0x4)
	unsigned char unreflected_704[0x4]; // 0x704 (0x4) 
	struct FRotator RotCoat0; // 0x708 (0x18)
	struct FRotator RotCoat1; // 0x720 (0x18)
	struct FRotator RotCoat2; // 0x738 (0x18)
	struct FRotator RotCoat3; // 0x750 (0x18)
	struct FRotator RotCoat4; // 0x768 (0x18)
	struct FRotator RotCoat5; // 0x780 (0x18)
	struct FRotator RotCoat6; // 0x798 (0x18)
	bool bDisableRigidBodies; // 0x7b0 (0x1)
	unsigned char unreflected_7b1[0x3]; // 0x7b1 (0x3) 
	float LOD2MovingAndCrouchAlpha; // 0x7b4 (0x4)
	float SkydivingVectorForceMultiplier; // 0x7b8 (0x4)
	unsigned char padding_7bc[0x4]; // 0x7bc (0x4)
};

