// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_GalileoOutriggerBody
// Size: 0x710
class UCustomCharacterPartAnimInstance_GalileoOutriggerBody : public UCustomCharacterPartAnimInstance
{
	float UpperArmRightYaw; // 0x6e8 (0x4)
	float UpperArmLeftYaw; // 0x6ec (0x4)
	float LegLeftPitch; // 0x6f0 (0x4)
	float LegLeftYaw; // 0x6f4 (0x4)
	float LegRightYaw; // 0x6f8 (0x4)
	float LegRightPitch; // 0x6fc (0x4)
	float crouchingAlpha; // 0x700 (0x4)
	float ShoulderLeftPitch; // 0x704 (0x4)
	float ShoulderRightPitch; // 0x708 (0x4)
	unsigned char padding_70c[0x4]; // 0x70c (0x4)
};

