// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_SnufflesLeaderFace
// Size: 0x7b0
class UCustomCharacterPartAnimInstance_SnufflesLeaderFace : public UCustomCharacterPartAnimInstance
{
	class USkeletalMeshComponent* MeshToCopy; // 0x6e8 (0x8)
	struct FVector EyebrowsNoiseVector; // 0x6f0 (0x18)
	struct FVector EarbrowNoiseVectorA; // 0x708 (0x18)
	struct FVector EarbrowNoiseVectorB; // 0x720 (0x18)
	struct FVector HitBoneScale; // 0x738 (0x18)
	struct FVector HashTagBoneScale; // 0x750 (0x18)
	struct FVector CheekLineBoneScale; // 0x768 (0x18)
	struct FVector EarlineBoneScale; // 0x780 (0x18)
	float DynamicsDisabledAlpha; // 0x798 (0x4)
	float HeadForwardAlpha; // 0x79c (0x4)
	float PlayerHealth; // 0x7a0 (0x4)
	unsigned char padding_7a4[0xc]; // 0x7a4 (0xc)
};

