// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_SheathBody
// Size: 0x710
class UCustomCharacterPartAnimInstance_SheathBody : public UCustomCharacterPartAnimInstance
{
	float CrouchSpeedAlpha; // 0x6e8 (0x4)
	float CrouchAlpha; // 0x6ec (0x4)
	float LegUpLeftAlpha; // 0x6f0 (0x4)
	float LegUpRightAlpha; // 0x6f4 (0x4)
	float LeftLegCrossAlpha; // 0x6f8 (0x4)
	float RightLeftCrossAlpha; // 0x6fc (0x4)
	float JumpAlpha; // 0x700 (0x4)
	float SkydivingAlpha; // 0x704 (0x4)
	unsigned char padding_708[0x8]; // 0x708 (0x8)
};

