// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_Houston_Cape_M
// Size: 0x790
class UCustomCharacterPartAnimInstance_Houston_Cape_M : public UCustomCharacterPartAnimInstance
{
	struct FVector CapeTrailFakeVelocityLowLeft; // 0x6e8 (0x18)
	struct FVector CapeTrailFakeVelocityMidLeft; // 0x700 (0x18)
	struct FVector CapeTrailFakeVelocityMidRight; // 0x718 (0x18)
	struct FVector CapeTrailFakeVelocityLowRight; // 0x730 (0x18)
	unsigned char unreflected_748[0x18]; // 0x748 (0x18) 
	float SprintSpeedAlpha; // 0x760 (0x4)
	float RunSpeedAlpha; // 0x764 (0x4)
	float PlayerForwardAcceleration; // 0x768 (0x4)
	float PlayerSidewaysAcceleration; // 0x76c (0x4)
	float SkyDiveTrailAlpha; // 0x770 (0x4)
	float CapeTrailRelaxSpeedScale; // 0x774 (0x4)
	float DBNOAdditiveAlpha; // 0x778 (0x4)
	float DBNOTrailAlpha; // 0x77c (0x4)
	float ShoulderCorrectionAlpha; // 0x780 (0x4)
	unsigned char unreflected_784[0x4]; // 0x784 (0x4) 
	bool bIsPlayingBlackMondayEmote; // 0x788 (0x1)
	unsigned char padding_789[0x7]; // 0x789 (0x7)
};

