// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_Buffet_Shard_F
// Size: 0xa30
class UCustomCharacterPartAnimInstance_Buffet_Shard_F : public UCustomCharacterPartAnimInstance_Buffet_F
{
	struct FVector floatA; // 0x8e8 (0x18)
	struct FVector floatB; // 0x900 (0x18)
	float skirtMidJntConstraintAlpha; // 0x918 (0x4)
	unsigned char unreflected_91c[0x4]; // 0x91c (0x4) 
	struct FBuffetWaveVectorInput WaveA; // 0x920 (0x80)
	struct FBuffetWaveVectorInput WaveB; // 0x9a0 (0x80)
	float PawnVelocityZLimit; // 0xa20 (0x4)
	float PawnYawRotationRateLimit; // 0xa24 (0x4)
	unsigned char padding_a28[0x8]; // 0xa28 (0x8)
};

