// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_TeriyakiWarriorBackpack
// Size: 0x7b0
class UCustomCharacterPartAnimInstance_TeriyakiWarriorBackpack : public UCustomCharacterPartAnimInstance
{
	struct FVector PistonJitterA; // 0x6e8 (0x18)
	struct FVector PistonJitterB; // 0x700 (0x18)
	struct FVector PistonJitterC; // 0x718 (0x18)
	struct FVector PistonJitterD; // 0x730 (0x18)
	struct FVector StretchA; // 0x748 (0x18)
	struct FVector StretchB; // 0x760 (0x18)
	struct FVector StretchC; // 0x778 (0x18)
	struct FVector StretchD; // 0x790 (0x18)
	float FallingAlpha; // 0x7a8 (0x4)
	unsigned char padding_7ac[0x4]; // 0x7ac (0x4)
};

