// Class /Script/FortniteGame.CustomCharacterPartAnimInstance_HightowerTapasTop
// Size: 0x740
class UCustomCharacterPartAnimInstance_HightowerTapasTop : public UCustomCharacterPartAnimInstance
{
	struct TWeakObjectPtr<class UAnimMontage> PickaxeMontage; // 0x6e8 (0x28)
	struct FVector WindVector; // 0x710 (0x18)
	float IsSkyDivingAlpha; // 0x728 (0x4)
	float HeadLookUpAlpha; // 0x72c (0x4)
	float IsPickaxingAlpha; // 0x730 (0x4)
	float InvHeadLookUpAlpha; // 0x734 (0x4)
	bool bRigidsEnabled; // 0x738 (0x1)
	unsigned char padding_739[0x7]; // 0x739 (0x7)
};

