// Class /Script/DataAssetDirectory.DataAssetDirectoryTestPODAsset
// Size: 0x78
class UDataAssetDirectoryTestPODAsset : public UObject
{
	struct FString AssetName; // 0x28 (0x10)
	enum EDataAssetDirectoryTestEnum EnumProperty; // 0x38 (0x1)
	unsigned char unreflected_39[0x3]; // 0x39 (0x3) 
	int IntProperty; // 0x3c (0x4)
	float FloatProperty; // 0x40 (0x4)
	bool BoolProperty; // 0x44 (0x1)
	unsigned char unreflected_45[0x3]; // 0x45 (0x3) 
	struct FString StringProperty; // 0x48 (0x10)
	struct FName NameProperty; // 0x58 (0x4)
	unsigned char unreflected_5c[0x4]; // 0x5c (0x4) 
	struct FText TextProperty; // 0x60 (0x18)
};

