// VerseClass /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller
// Size: 0x160
class UDevices_CreativeAnimation_animation_controller : public UObject
{
	unsigned char unreflected_28[0xd0]; // 0x28 (0xd0) 
	class UDiagnostics_log* verse0x63A8D5FADebugLog; // 0xf8 (0x8)
	class UObject* verse0x1A3A2D49KeyframeReachedEvent; // 0x100 (0x8)
	class UObject* verse0xEC8DE8C6MovementCompleteEvent; // 0x108 (0x8)
	class UObject* verse0xDE60FD58StateChangedEvent; // 0x110 (0x8)
	unsigned char verse0x053E8BA6AwaitNextKeyframe_38[0x10]; // 0x38 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_48[0x60]; // 0x48 (0x60) 
	unsigned char verse0x4A2A0F34L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRGetState_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xDCA25E7BL2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRIsValid_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x0E85E6FAL2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRLogPlayStopPauseResultIfErrorLNKcharMNplaystoppauseresultR_28[0x10]; // 0x28 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_38[0x40]; // 0x38 (0x40) 
	unsigned char verse0x1E385FBFL2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRPause_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x1A1EC93EL2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRPauseInternal_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6B727DF3L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRPlay_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x5D81E59FL2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRPlayInternal_48[0x10]; // 0x48 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_58[0x90]; // 0x58 (0x90) 
	unsigned char verse0x25C48BD2L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRSetAnimationLNKkeyframedeltaMNanimationmodeR_e8[0x10]; // 0xe8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x2DAABA8BL2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRSetAnimationInternalLNKkeyframedeltaMNanimationmodeR_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x230023B8L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRStop_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xDF78CD56L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRStopInternal_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_98[0x40]; // 0x98 (0x40) 
	unsigned char verse0x30521B48L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRToStringLNsetanimationresultR_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_e8[0x78]; // 0xe8 (0x78)

	/* Functions */

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R (Has no native function)
	void L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRToStringLNsetanimationresultR(enum Devices_CreativeAnimation_set_animation_result& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal (Underlying native function: _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal 0x6d4c2ec)
	enum Devices_CreativeAnimation_playstoppause_result L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRStopInternal(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop (Has no native function)
	void L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRStop(struct Ftuple_L_R& verse0xB2CDDD72Argument, enum Devices_CreativeAnimation_playstoppause_result& verse0x95D09D0EResult1, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_Nanimation__mode_R (Underlying native function: _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_Nanimation__mode_R 0x6d4c2e4)
	enum Devices_CreativeAnimation_set_animation_result L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRSetAnimationInternalLNKkeyframedeltaMNanimationmodeR(struct Ftuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_Nanimation__mode_R (Has no native function)
	void L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRSetAnimationLNKkeyframedeltaMNanimationmodeR(struct Ftuple_L_Kkeyframe__delta_M_QMode_Nanimation__mode_R& verse0xB2CDDD72Argument, enum Devices_CreativeAnimation_set_animation_result& verse0x95D09D0EResult1, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal (Underlying native function: _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal 0x6d4c2dc)
	enum Devices_CreativeAnimation_playstoppause_result L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRPlayInternal(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay (Has no native function)
	void L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRPlay(struct Ftuple_L_R& verse0xB2CDDD72Argument, enum Devices_CreativeAnimation_playstoppause_result& verse0x95D09D0EResult1, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal (Underlying native function: _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal 0x6d4c2d4)
	enum Devices_CreativeAnimation_playstoppause_result L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRPauseInternal(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause (Has no native function)
	void L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRPause(struct Ftuple_L_R& verse0xB2CDDD72Argument, enum Devices_CreativeAnimation_playstoppause_result& verse0x95D09D0EResult1, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R (Has no native function)
	void L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRLogPlayStopPauseResultIfErrorLNKcharMNplaystoppauseresultR(struct Ftuple_L_Kchar_Mplaystoppause__result_R& verse0xB2CDDD72Argument, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid (Underlying native function: _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid 0x6d4c2cc)
	void L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRIsValid(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState (Underlying native function: _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState 0x6d4c2c4)
	enum Devices_CreativeAnimation_animation_controller_state L2fFortnite2ecom2fDevices2fCreativeAnimation2fanimationcontrollerNRGetState(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller.AwaitNextKeyframe (Has no native function)
	class UConcurrency_task* AwaitNextKeyframe(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_animation_controller.$InitCDO (Has no native function)
	void $InitCDO(class UDiagnostics_log*& $ExprResult0, uint64_t& $InstancingGraph1, class UVerseEngine_multicast_delegate*& $ExprResult2, uint64_t& $InstancingGraph3, class UVerseEngine_multicast_delegate*& $ExprResult4, uint64_t& $InstancingGraph5, class UVerseEngine_multicast_delegate*& $ExprResult6, uint64_t& $InstancingGraph7); // (HasDefaults)
};

