// Class /Script/VKDownloadOnDemandUI.DownloadOnDemandProjectTileImage
// Size: 0x2a0
class UDownloadOnDemandProjectTileImage : public UUserWidget
{
	class UTexture* EmptyProjectTexture; // 0x268 (0x8)
	unsigned char bOverrideGrayScale; // 0x270 (0x1)
	unsigned char unreflected_271[0x3]; // 0x271 (0x3) 
	float GreyScaleOverride; // 0x274 (0x4)
	class UDownloadOnDemandProject* Project; // 0x278 (0x8)
	unsigned char unreflected_280[0x10]; // 0x280 (0x10) 
	class UImage* ImageProjectPreview; // 0x290 (0x8)
	class UImage* ImageLoadingImageSpinner; // 0x298 (0x8)
};

