// Class /Script/Engine.EdGraphPin_Deprecated
// Size: 0x108
class UEdGraphPin_Deprecated : public UObject
{
	struct FString PinName; // 0x28 (0x10)
	struct FString PinToolTip; // 0x38 (0x10)
	struct TEnumAsByte<EEdGraphPinDirection> Direction; // 0x48 (0x1)
	unsigned char unreflected_49[0x7]; // 0x49 (0x7) 
	struct FEdGraphPinType PinType; // 0x50 (0x48)
	struct FString DefaultValue; // 0x98 (0x10)
	struct FString AutogeneratedDefaultValue; // 0xa8 (0x10)
	class UObject* DefaultObject; // 0xb8 (0x8)
	struct FText DefaultTextValue; // 0xc0 (0x18)
	struct TArray<class UEdGraphPin_Deprecated*> LinkedTo; // 0xd8 (0x10)
	struct TArray<class UEdGraphPin_Deprecated*> SubPins; // 0xe8 (0x10)
	class UEdGraphPin_Deprecated* ParentPin; // 0xf8 (0x8)
	class UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x100 (0x8)
};

