// Class /Script/EmporiumRuntime.EmporiumAssetsPaths
// Size: 0x4b0
class UEmporiumAssetsPaths : public UObject
{
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMIOpaque; // 0x28 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMIOpaqueClearcoat; // 0x50 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMIOpaqueSheen; // 0x78 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMIOpaqueUnlit; // 0xa0 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMITranslucent; // 0xc8 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMITranslucentClearcoat; // 0xf0 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMITransmission; // 0x118 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMIOpaqueTS; // 0x140 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMIOpaqueClearcoatTS; // 0x168 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMIOpaqueSheenTS; // 0x190 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMIOpaqueUnlitTS; // 0x1b8 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMITranslucentTS; // 0x1e0 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMITranslucentClearcoatTS; // 0x208 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMITransmissionTS; // 0x230 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMIOpaque; // 0x258 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMIOpaqueClearcoat; // 0x280 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMIOpaqueSheen; // 0x2a8 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMITranslucent; // 0x2d0 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMITranslucentClearcoat; // 0x2f8 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMITransmission; // 0x320 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMIOpaqueTS; // 0x348 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMIOpaqueClearcoatTS; // 0x370 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMIOpaqueSheenTS; // 0x398 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMITranslucentTS; // 0x3c0 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMITranslucentClearcoatTS; // 0x3e8 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMITransmissionTS; // 0x410 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> SGMIFoliageTS; // 0x438 (0x28)
	struct TWeakObjectPtr<class UMaterialInstanceConstant> MRMIFoliageTS; // 0x460 (0x28)
	struct TWeakObjectPtr<class UStaticMesh> PlaceholderSphere; // 0x488 (0x28)
};

