// Class /Script/Engine.Engine
// Size: 0xef8
class UEngine : public UObject
{
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	class UFont* TinyFont; // 0x30 (0x8)
	struct FSoftObjectPath TinyFontName; // 0x38 (0x18)
	class UFont* SmallFont; // 0x50 (0x8)
	struct FSoftObjectPath SmallFontName; // 0x58 (0x18)
	class UFont* MediumFont; // 0x70 (0x8)
	struct FSoftObjectPath MediumFontName; // 0x78 (0x18)
	class UFont* LargeFont; // 0x90 (0x8)
	struct FSoftObjectPath LargeFontName; // 0x98 (0x18)
	class UFont* SubtitleFont; // 0xb0 (0x8)
	struct FSoftObjectPath SubtitleFontName; // 0xb8 (0x18)
	struct TArray<class UFont*> AdditionalFonts; // 0xd0 (0x10)
	struct TArray<struct FString> AdditionalFontNames; // 0xe0 (0x10)
	class UClass* ConsoleClass; // 0xf0 (0x8)
	struct FSoftClassPath ConsoleClassName; // 0xf8 (0x18)
	class UClass* GameViewportClientClass; // 0x110 (0x8)
	struct FSoftClassPath GameViewportClientClassName; // 0x118 (0x18)
	class UClass* LocalPlayerClass; // 0x130 (0x8)
	struct FSoftClassPath LocalPlayerClassName; // 0x138 (0x18)
	class UClass* WorldSettingsClass; // 0x150 (0x8)
	struct FSoftClassPath WorldSettingsClassName; // 0x158 (0x18)
	struct FSoftClassPath NavigationSystemClassName; // 0x170 (0x18)
	class UClass* NavigationSystemClass; // 0x188 (0x8)
	struct FSoftClassPath NavigationSystemConfigClassName; // 0x190 (0x18)
	class UClass* NavigationSystemConfigClass; // 0x1a8 (0x8)
	struct FSoftClassPath AvoidanceManagerClassName; // 0x1b0 (0x18)
	class UClass* AvoidanceManagerClass; // 0x1c8 (0x8)
	struct FSoftClassPath AIControllerClassName; // 0x1d0 (0x18)
	class UClass* PhysicsCollisionHandlerClass; // 0x1e8 (0x8)
	struct FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1f0 (0x18)
	struct FSoftClassPath GameUserSettingsClassName; // 0x208 (0x18)
	class UClass* GameUserSettingsClass; // 0x220 (0x8)
	class UGameUserSettings* GameUserSettings; // 0x228 (0x8)
	class UClass* LevelScriptActorClass; // 0x230 (0x8)
	struct FSoftClassPath LevelScriptActorClassName; // 0x238 (0x18)
	struct FSoftClassPath DefaultBlueprintBaseClassName; // 0x250 (0x18)
	struct FSoftClassPath GameSingletonClassName; // 0x268 (0x18)
	class UObject* GameSingleton; // 0x280 (0x8)
	struct FSoftClassPath AssetManagerClassName; // 0x288 (0x18)
	class UAssetManager* AssetManager; // 0x2a0 (0x8)
	class UTexture2D* DefaultTexture; // 0x2a8 (0x8)
	struct FSoftObjectPath DefaultTextureName; // 0x2b0 (0x18)
	class UTexture* DefaultDiffuseTexture; // 0x2c8 (0x8)
	struct FSoftObjectPath DefaultDiffuseTextureName; // 0x2d0 (0x18)
	class UTexture2D* DefaultBSPVertexTexture; // 0x2e8 (0x8)
	struct FSoftObjectPath DefaultBSPVertexTextureName; // 0x2f0 (0x18)
	class UTexture2D* HighFrequencyNoiseTexture; // 0x308 (0x8)
	struct FSoftObjectPath HighFrequencyNoiseTextureName; // 0x310 (0x18)
	class UTexture2D* DefaultBokehTexture; // 0x328 (0x8)
	struct FSoftObjectPath DefaultBokehTextureName; // 0x330 (0x18)
	class UTexture2D* DefaultBloomKernelTexture; // 0x348 (0x8)
	struct FSoftObjectPath DefaultBloomKernelTextureName; // 0x350 (0x18)
	class UTexture2D* DefaultFilmGrainTexture; // 0x368 (0x8)
	struct FSoftObjectPath DefaultFilmGrainTextureName; // 0x370 (0x18)
	class UMaterial* WireframeMaterial; // 0x388 (0x8)
	struct FString WireframeMaterialName; // 0x390 (0x10)
	class UMaterial* DebugMeshMaterial; // 0x3a0 (0x8)
	struct FSoftObjectPath DebugMeshMaterialName; // 0x3a8 (0x18)
	class UMaterial* EmissiveMeshMaterial; // 0x3c0 (0x8)
	struct FSoftObjectPath EmissiveMeshMaterialName; // 0x3c8 (0x18)
	class UMaterial* LevelColorationLitMaterial; // 0x3e0 (0x8)
	struct FString LevelColorationLitMaterialName; // 0x3e8 (0x10)
	class UMaterial* LevelColorationUnlitMaterial; // 0x3f8 (0x8)
	struct FString LevelColorationUnlitMaterialName; // 0x400 (0x10)
	class UMaterial* LightingTexelDensityMaterial; // 0x410 (0x8)
	struct FString LightingTexelDensityName; // 0x418 (0x10)
	class UMaterial* ShadedLevelColorationLitMaterial; // 0x428 (0x8)
	struct FString ShadedLevelColorationLitMaterialName; // 0x430 (0x10)
	class UMaterial* ShadedLevelColorationUnlitMaterial; // 0x440 (0x8)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x448 (0x10)
	class UMaterial* RemoveSurfaceMaterial; // 0x458 (0x8)
	struct FSoftObjectPath RemoveSurfaceMaterialName; // 0x460 (0x18)
	class UMaterial* VertexColorMaterial; // 0x478 (0x8)
	struct FString VertexColorMaterialName; // 0x480 (0x10)
	class UMaterial* VertexColorViewModeMaterialColorOnly; // 0x490 (0x8)
	struct FString VertexColorViewModeMaterialNameColorOnly; // 0x498 (0x10)
	class UMaterial* VertexColorViewModeMaterialAlphaAsColor; // 0x4a8 (0x8)
	struct FString VertexColorViewModeMaterialNameAlphaAsColor; // 0x4b0 (0x10)
	class UMaterial* VertexColorViewModeMaterialRedOnly; // 0x4c0 (0x8)
	struct FString VertexColorViewModeMaterialNameRedOnly; // 0x4c8 (0x10)
	class UMaterial* VertexColorViewModeMaterialGreenOnly; // 0x4d8 (0x8)
	struct FString VertexColorViewModeMaterialNameGreenOnly; // 0x4e0 (0x10)
	class UMaterial* VertexColorViewModeMaterialBlueOnly; // 0x4f0 (0x8)
	struct FString VertexColorViewModeMaterialNameBlueOnly; // 0x4f8 (0x10)
	struct FSoftObjectPath DebugEditorMaterialName; // 0x508 (0x18)
	class UMaterial* ConstraintLimitMaterial; // 0x520 (0x8)
	class UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x528 (0x8)
	class UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x530 (0x8)
	class UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x538 (0x8)
	class UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x540 (0x8)
	class UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x548 (0x8)
	class UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x550 (0x8)
	class UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x558 (0x8)
	class UMaterial* InvalidLightmapSettingsMaterial; // 0x560 (0x8)
	struct FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x568 (0x18)
	class UMaterial* PreviewShadowsIndicatorMaterial; // 0x580 (0x8)
	struct FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x588 (0x18)
	class UMaterial* ArrowMaterial; // 0x5a0 (0x8)
	class UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x5a8 (0x8)
	struct FSoftObjectPath ArrowMaterialName; // 0x5b0 (0x18)
	struct FLinearColor LightingOnlyBrightness; // 0x5c8 (0x10)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x5d8 (0x10)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x5e8 (0x10)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x5f8 (0x10)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x608 (0x10)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x618 (0x10)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0x628 (0x10)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x638 (0x10)
	struct FLinearColor GPUSkinCacheVisualizationExcludedColor; // 0x648 (0x10)
	struct FLinearColor GPUSkinCacheVisualizationIncludedColor; // 0x658 (0x10)
	struct FLinearColor GPUSkinCacheVisualizationRecomputeTangentsColor; // 0x668 (0x10)
	float GPUSkinCacheVisualizationLowMemoryThresholdInMB; // 0x678 (0x4)
	float GPUSkinCacheVisualizationHighMemoryThresholdInMB; // 0x67c (0x4)
	struct FLinearColor GPUSkinCacheVisualizationLowMemoryColor; // 0x680 (0x10)
	struct FLinearColor GPUSkinCacheVisualizationMidMemoryColor; // 0x690 (0x10)
	struct FLinearColor GPUSkinCacheVisualizationHighMemoryColor; // 0x6a0 (0x10)
	struct TArray<struct FLinearColor> GPUSkinCacheVisualizationRayTracingLODOffsetColors; // 0x6b0 (0x10)
	float MaxPixelShaderAdditiveComplexityCount; // 0x6c0 (0x4)
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x6c4 (0x4)
	float MinLightMapDensity; // 0x6c8 (0x4)
	float IdealLightMapDensity; // 0x6cc (0x4)
	float MaxLightMapDensity; // 0x6d0 (0x4)
	unsigned char bRenderLightMapDensityGrayscale; // 0x6d4 (0x1)
	unsigned char unreflected_6d5[0x3]; // 0x6d5 (0x3) 
	float RenderLightMapDensityGrayscaleScale; // 0x6d8 (0x4)
	float RenderLightMapDensityColorScale; // 0x6dc (0x4)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x6e0 (0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x6f0 (0x10)
	struct TArray<struct FStatColorMapping> StatColorMappings; // 0x700 (0x10)
	class UPhysicalMaterial* DefaultPhysMaterial; // 0x710 (0x8)
	struct FSoftObjectPath DefaultPhysMaterialName; // 0x718 (0x18)
	class UPhysicalMaterial* DefaultDestructiblePhysMaterial; // 0x730 (0x8)
	struct FSoftObjectPath DefaultDestructiblePhysMaterialName; // 0x738 (0x18)
	struct TArray<struct FGameNameRedirect*> ActiveGameNameRedirects; // 0x750 (0x10)
	struct TArray<struct FClassRedirect> ActiveClassRedirects; // 0x760 (0x10)
	struct TArray<struct FPluginRedirect> ActivePluginRedirects; // 0x770 (0x10)
	struct TArray<struct FStructRedirect*> ActiveStructRedirects; // 0x780 (0x10)
	class UTexture2D* PreIntegratedSkinBRDFTexture; // 0x790 (0x8)
	struct FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x798 (0x18)
	class UTexture2D* BlueNoiseScalarTexture; // 0x7b0 (0x8)
	class UTexture2D* BlueNoiseVec2Texture; // 0x7b8 (0x8)
	struct FSoftObjectPath BlueNoiseScalarTextureName; // 0x7c0 (0x18)
	struct FSoftObjectPath BlueNoiseVec2TextureName; // 0x7d8 (0x18)
	class UTexture2D* MiniFontTexture; // 0x7f0 (0x8)
	struct FSoftObjectPath MiniFontTextureName; // 0x7f8 (0x18)
	class UTexture* WeightMapPlaceholderTexture; // 0x810 (0x8)
	struct FSoftObjectPath WeightMapPlaceholderTextureName; // 0x818 (0x18)
	class UTexture2D* LightMapDensityTexture; // 0x830 (0x8)
	struct FSoftObjectPath LightMapDensityTextureName; // 0x838 (0x18)
	unsigned char unreflected_850[0x8]; // 0x850 (0x8) 
	class UGameViewportClient* GameViewport; // 0x858 (0x8)
	struct TArray<struct FString> DeferredCommands; // 0x860 (0x10)
	float NearClipPlane; // 0x870 (0x4)
	unsigned char bSubtitlesEnabled; // 0x874 (0x1)
	unsigned char bSubtitlesForcedOff; // 0x874 (0x1)
	unsigned char unreflected_875[0x3]; // 0x875 (0x3) 
	int MaximumLoopIterationCount; // 0x878 (0x4)
	unsigned char bCanBlueprintsTickByDefault; // 0x87c (0x1)
	unsigned char bOptimizeAnimBlueprintMemberVariableAccess; // 0x87c (0x1)
	unsigned char bAllowMultiThreadedAnimationUpdate; // 0x87c (0x1)
	unsigned char bEnableEditorPSysRealtimeLOD; // 0x87c (0x1)
	unsigned char bSmoothFrameRate; // 0x87c (0x1)
	unsigned char bUseFixedFrameRate; // 0x87c (0x1)
	unsigned char unreflected_87d[0x3]; // 0x87d (0x3) 
	float FixedFrameRate; // 0x880 (0x4)
	struct FFloatRange SmoothedFrameRateRange; // 0x884 (0x10)
	unsigned char unreflected_894[0x4]; // 0x894 (0x4) 
	class UEngineCustomTimeStep* CustomTimeStep; // 0x898 (0x8)
	unsigned char unreflected_8a0[0x20]; // 0x8a0 (0x20) 
	struct FSoftClassPath CustomTimeStepClassName; // 0x8c0 (0x18)
	class UTimecodeProvider* TimecodeProvider; // 0x8d8 (0x8)
	unsigned char unreflected_8e0[0x20]; // 0x8e0 (0x20) 
	struct FSoftClassPath TimecodeProviderClassName; // 0x900 (0x18)
	bool bGenerateDefaultTimecode; // 0x918 (0x1)
	unsigned char unreflected_919[0x3]; // 0x919 (0x3) 
	struct FFrameRate* GenerateDefaultTimecodeFrameRate; // 0x91c (0x8)
	float GenerateDefaultTimecodeFrameDelay; // 0x924 (0x4)
	unsigned char bCheckForMultiplePawnsSpawnedInAFrame; // 0x928 (0x1)
	unsigned char unreflected_929[0x3]; // 0x929 (0x3) 
	int NumPawnsAllowedToBeSpawnedInAFrame; // 0x92c (0x4)
	unsigned char bShouldGenerateLowQualityLightmaps; // 0x930 (0x1)
	unsigned char unreflected_931[0x3]; // 0x931 (0x3) 
	struct FColor CWorldBox; // 0x934 (0x4)
	struct FColor CBrushWire; // 0x938 (0x4)
	struct FColor CAddWire; // 0x93c (0x4)
	struct FColor CSubtractWire; // 0x940 (0x4)
	struct FColor CSemiSolidWire; // 0x944 (0x4)
	struct FColor CNonSolidWire; // 0x948 (0x4)
	struct FColor CWireBackground; // 0x94c (0x4)
	struct FColor CScaleBoxHi; // 0x950 (0x4)
	struct FColor CVolumeCollision; // 0x954 (0x4)
	struct FColor CBSPCollision; // 0x958 (0x4)
	struct FColor COrthoBackground; // 0x95c (0x4)
	struct FColor CVolume; // 0x960 (0x4)
	struct FColor CBrushShape; // 0x964 (0x4)
	float StreamingDistanceFactor; // 0x968 (0x4)
	unsigned char unreflected_96c[0x4]; // 0x96c (0x4) 
	struct FDirectoryPath GameScreenshotSaveDirectory; // 0x970 (0x10)
	bool UseStaticMeshMinLODPerQualityLevels; // 0x980 (0x1)
	bool UseSkeletalMeshMinLODPerQualityLevels; // 0x981 (0x1)
	bool UseGrassVarityPerQualityLevels; // 0x982 (0x1)
	enum ETransitionType TransitionType; // 0x983 (0x1)
	unsigned char unreflected_984[0x4]; // 0x984 (0x4) 
	struct FString TransitionDescription; // 0x988 (0x10)
	struct FString TransitionGameMode; // 0x998 (0x10)
	unsigned char bAllowMatureLanguage; // 0x9a8 (0x1)
	unsigned char unreflected_9a9[0x3]; // 0x9a9 (0x3) 
	float CameraRotationThreshold; // 0x9ac (0x4)
	float CameraTranslationThreshold; // 0x9b0 (0x4)
	float PrimitiveProbablyVisibleTime; // 0x9b4 (0x4)
	float MaxOcclusionPixelsFraction; // 0x9b8 (0x4)
	unsigned char bPauseOnLossOfFocus; // 0x9bc (0x1)
	unsigned char unreflected_9bd[0x3]; // 0x9bd (0x3) 
	int MaxParticleResize; // 0x9c0 (0x4)
	int MaxParticleResizeWarn; // 0x9c4 (0x4)
	struct TArray<struct FDropNoteInfo> PendingDroppedNotes; // 0x9c8 (0x10)
	float NetClientTicksPerSecond; // 0x9d8 (0x4)
	float DisplayGamma; // 0x9dc (0x4)
	float MinDesiredFrameRate; // 0x9e0 (0x4)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x9e4 (0x10)
	struct FLinearColor SelectedMaterialColor; // 0x9f4 (0x10)
	struct FLinearColor SelectionOutlineColor; // 0xa04 (0x10)
	struct FLinearColor SubduedSelectionOutlineColor; // 0xa14 (0x10)
	struct FLinearColor SelectedMaterialColorOverride; // 0xa24 (0x10)
	bool bIsOverridingSelectedColor; // 0xa34 (0x1)
	unsigned char unreflected_a35[0x3]; // 0xa35 (0x3) 
	unsigned char bEnableOnScreenDebugMessages; // 0xa38 (0x1)
	unsigned char bEnableOnScreenDebugMessagesDisplay; // 0xa38 (0x1)
	unsigned char bSuppressMapWarnings; // 0xa38 (0x1)
	unsigned char bDisableAILogging; // 0xa38 (0x1)
	unsigned char unreflected_a39[0x3]; // 0xa39 (0x3) 
	uint32_t bEnableVisualLogRecordingOnStart; // 0xa3c (0x4)
	int ScreenSaverInhibitorSemaphore; // 0xa40 (0x4)
	unsigned char bLockReadOnlyLevels; // 0xa44 (0x1)
	unsigned char unreflected_a45[0x3]; // 0xa45 (0x3) 
	struct FString ParticleEventManagerClassPath; // 0xa48 (0x10)
	float SelectionHighlightIntensity; // 0xa58 (0x4)
	float BSPSelectionHighlightIntensity; // 0xa5c (0x4)
	float SelectionHighlightIntensityBillboards; // 0xa60 (0x4)
	unsigned char unreflected_a64[0x294]; // 0xa64 (0x294) 
	uint32_t GlobalNetTravelCount; // 0xcf8 (0x4)
	unsigned char unreflected_cfc[0x4]; // 0xcfc (0x4) 
	struct TArray<struct FNetDriverDefinition> NetDriverDefinitions; // 0xd00 (0x10)
	struct TArray<struct FIrisNetDriverConfig> IrisNetDriverConfigs; // 0xd10 (0x10)
	struct TArray<struct FString> ServerActors; // 0xd20 (0x10)
	struct TArray<struct FString> RuntimeServerActors; // 0xd30 (0x10)
	float NetErrorLogInterval; // 0xd40 (0x4)
	unsigned char bStartedLoadMapMovie; // 0xd44 (0x1)
	unsigned char unreflected_d45[0x1b]; // 0xd45 (0x1b) 
	int NextWorldContextHandle; // 0xd60 (0x4)
	unsigned char padding_d64[0x194]; // 0xd64 (0x194)
};

