// Class /Script/Engine.EngineMessage
// Size: 0xa8
class UEngineMessage : public ULocalMessage
{
	struct FString FailedPlaceMessage; // 0x28 (0x10)
	struct FString MaxedOutMessage; // 0x38 (0x10)
	struct FString EnteredMessage; // 0x48 (0x10)
	struct FString LeftMessage; // 0x58 (0x10)
	struct FString GlobalNameChange; // 0x68 (0x10)
	struct FString SpecEnteredMessage; // 0x78 (0x10)
	struct FString NewPlayerMessage; // 0x88 (0x10)
	struct FString NewSpecMessage; // 0x98 (0x10)
};

