// Class /Script/FortniteGame.FortCheatManager
// Size: 0x158
class UFortCheatManager : public UCheatManager
{
	unsigned char unreflected_88[0x10]; // 0x88 (0x10) 
	unsigned char bDebugInteractTrace; // 0x98 (0x1)
	unsigned char bDebugPickupSpline; // 0x98 (0x1)
	unsigned char bEnableScoreboard; // 0x98 (0x1)
	unsigned char bDebugBounceCurve; // 0x98 (0x1)
	unsigned char bDebugBeautyMode; // 0x98 (0x1)
	unsigned char bDisplayWindDebugging; // 0x98 (0x1)
	unsigned char bDebugStructuralSupportSystem; // 0x98 (0x1)
	unsigned char bInfiniteStamina; // 0x98 (0x1)
	unsigned char bShowGameDifficultyHUD; // 0x99 (0x1)
	unsigned char bShowIntensityHUD; // 0x99 (0x1)
	unsigned char bShowMaxAIHUD; // 0x99 (0x1)
	unsigned char bShowItemIDsOnCards; // 0x99 (0x1)
	unsigned char bEnableContextMenus; // 0x99 (0x1)
	unsigned char bUnlimitedHealth; // 0x99 (0x1)
	unsigned char bCanExitWorld; // 0x99 (0x1)
	unsigned char bUnlimitedAIHealth; // 0x99 (0x1)
	unsigned char bFreezeAILOD; // 0x9a (0x1)
	unsigned char bForceAILOD; // 0x9a (0x1)
	unsigned char unreflected_9b[0x1]; // 0x9b (0x1) 
	int AbilitySystemCycleCounter; // 0x9c (0x4)
	enum EFortAILODLevel ForcedAILODValue; // 0xa0 (0x1)
	unsigned char unreflected_a1[0x7]; // 0xa1 (0x7) 
	struct TWeakObjectPtr<class UBuildingTextureData> TransparentTextureData; // 0xa8 (0x28)
	unsigned char padding_d0[0x88]; // 0xd0 (0x88)

	/* Functions */

	// Function /Script/FortniteGame.FortCheatManager.WriteSharedPersistenceValue (Underlying native function: WriteSharedPersistenceValue 0x26daa0c)
	void WriteSharedPersistenceValue(); // (Final | Exec | Native | Protected)

	// Function /Script/FortniteGame.FortCheatManager.WriteLootReport (Underlying native function: WriteLootReport 0x26daa0c)
	void WriteLootReport(); // (Final | BlueprintAuthorityOnly | Exec | Native | Protected)

	// Function /Script/FortniteGame.FortCheatManager.WriteLevelSaveComponentsToDisk (Underlying native function: WriteLevelSaveComponentsToDisk 0x26daa0c)
	void WriteLevelSaveComponentsToDisk(); // (Final | Exec | Native | Protected)

	// Function /Script/FortniteGame.FortCheatManager.WargameDebug (Underlying native function: WargameDebug 0x71a6cc4)
	void WargameDebug(bool& Value); // (Final | Exec | Native | Protected)

