// Class /Script/FortniteUI.FortPinGrantCodeInfoWidget
// Size: 0x2e8
class UFortPinGrantCodeInfoWidget : public UCommonUserWidget
{
	unsigned char unreflected_290[0x10]; // 0x290 (0x10) 
	class UCommonButtonBase* ButtonGenerateCode; // 0x2a0 (0x8)
	class UCommonTextBlock* TextPinCode; // 0x2a8 (0x8)
	class UCommonTextBlock* TextErrorMsg; // 0x2b0 (0x8)
	class UCommonTextBlock* TextActivationURL; // 0x2b8 (0x8)
	class UCommonTextBlock* TextCodeExpiringTime; // 0x2c0 (0x8)
	class UCommonTextBlock* TextInfo; // 0x2c8 (0x8)
	class UCommonTextBlock* TextPinPromptTypeTitle; // 0x2d0 (0x8)
	class UVerticalBox* ContainerActivationURL; // 0x2d8 (0x8)
	class UCircularThrobber* ThrobberGettingPinCode; // 0x2e0 (0x8)
};

