// Class /Script/FortniteGame.FortNonPlayerConversationParticipantComponent
// Size: 0x488
class UFortNonPlayerConversationParticipantComponent : public UConversationParticipantComponent
{
	unsigned char unreflected_1a0[0x8]; // 0x1a0 (0x8) 
	struct FMulticastInlineDelegate OnDialogMarkerInteractionStateChanged; // 0x1a8 (0x10)
	struct FMulticastInlineDelegate OnReceivedLocalClientConversationMessage; // 0x1b8 (0x10)
	unsigned char unreflected_1c8[0x18]; // 0x1c8 (0x18) 
	struct FMulticastInlineDelegate OnConversationEnded; // 0x1e0 (0x10)
	unsigned char unreflected_1f0[0x18]; // 0x1f0 (0x18) 
	struct FGameplayTag ConversationEntryTag; // 0x208 (0x4)
	struct FGameplayTag InteractorParticipantTag; // 0x20c (0x4)
	struct FGameplayTag SelfParticipantTag; // 0x210 (0x4)
	struct FGameplayTag ServiceProviderIDTag; // 0x214 (0x4)
	bool bShowNameWhenInRange; // 0x218 (0x1)
	bool bShowIndicatorBubble; // 0x219 (0x1)
	bool bShowNameplateOnPreview; // 0x21a (0x1)
	bool bShowConversationText; // 0x21b (0x1)
	unsigned char unreflected_21c[0x24]; // 0x21c (0x24) 
	enum EFortQuestObjectiveStatEvent InitiateConversationStatEventType; // 0x240 (0x1)
	unsigned char unreflected_241[0x7]; // 0x241 (0x7) 
	class UFortConversationMemoryComponent* ConversationMemoryComponent; // 0x248 (0x8)
	class UDataTable* Gifts; // 0x250 (0x8)
	struct FGameplayTag GiftsSeasonDataTableTag; // 0x258 (0x4)
	unsigned char unreflected_25c[0x4]; // 0x25c (0x4) 
	class UFortConversationGiftTypeDefinitions* GiftTypeDefinitions; // 0x260 (0x8)
	struct FGameplayTag GiftTypeDefinitionsSeasonDataAssetTag; // 0x268 (0x4)
	unsigned char unreflected_26c[0x4]; // 0x26c (0x4) 
	class UDataTable* GiftItemInventory; // 0x270 (0x8)
	struct FGameplayTag GiftItemInventorySeasonDataTableTag; // 0x278 (0x4)
	int MaxServices; // 0x27c (0x4)
	class UDataTable* Services; // 0x280 (0x8)
	struct FGameplayTag ServicesOverride; // 0x288 (0x4)
	unsigned char unreflected_28c[0x4]; // 0x28c (0x4) 
	class UDataTable* SalesInventory; // 0x290 (0x8)
	struct FGameplayTag SalesInventoryOverride; // 0x298 (0x4)
	unsigned char unreflected_29c[0x4]; // 0x29c (0x4) 
	class UDataTable* DiscountTable; // 0x2a0 (0x8)
	bool bQuestsRequireProviderTagMatch; // 0x2a8 (0x1)
	unsigned char unreflected_2a9[0x3]; // 0x2a9 (0x3) 
	int MaxQuestsToSupportFromSingleProvider; // 0x2ac (0x4)
	bool bOverrideParticipantDisplayName; // 0x2b0 (0x1)
	unsigned char unreflected_2b1[0x7]; // 0x2b1 (0x7) 
	struct FText ParticipantDisplayNameOverride; // 0x2b8 (0x18)
	struct TWeakObjectPtr<class UClass> CustomDialogMarkerSoftClass; // 0x2d0 (0x28)
	bool bOverrideRelativeLocation; // 0x2f8 (0x1)
	unsigned char unreflected_2f9[0x7]; // 0x2f9 (0x7) 
	struct FVector RelativeLocationOverride; // 0x300 (0x18)
	bool bOverrideMaxDrawDistance; // 0x318 (0x1)
	unsigned char unreflected_319[0x3]; // 0x319 (0x3) 
	float MaxDrawDistanceOverride; // 0x31c (0x4)
	bool bDialogMarkerBoundsAdjustmentEnabled; // 0x320 (0x1)
	unsigned char unreflected_321[0x7]; // 0x321 (0x7) 
	struct TWeakObjectPtr<class UTexture2D> DialogMarkerIndicatorSoftIcon; // 0x328 (0x28)
	struct TArray<struct TWeakObjectPtr<class UFortQuestItemDefinition_Athena>> SupportedQuests; // 0x350 (0x10)
	struct FGameplayTagContainer SupportedServices; // 0x360 (0x20)
	struct TArray<struct FNPCSaleInventoryRow> SupportedSales; // 0x380 (0x10)
	struct TArray<struct FNPCConversationGiftRow> SupportedGiftTypes; // 0x390 (0x10)
	struct TArray<struct FNPCGiftItemInventoryRow> SupportedGiftItems; // 0x3a0 (0x10)
	struct TArray<struct FName> HideUIIndicatorReasons; // 0x3b0 (0x10)
	class UClass* CustomDialogMarkerClass; // 0x3c0 (0x8)
	class UFortConversationGiftTypeDefinitions* ResolvedGiftTypeDefinitions; // 0x3c8 (0x8)
	bool bServiceDataInitialized; // 0x3d0 (0x1)
	unsigned char unreflected_3d1[0x7]; // 0x3d1 (0x7) 
	struct TMap<struct FGameplayTag, float> GiftCooldownTimestamps; // 0x3d8 (0x50)
	unsigned char padding_428[0x60]; // 0x428 (0x60)

	/* Functions */

	// Function /Script/FortniteGame.FortNonPlayerConversationParticipantComponent.TossItems (Underlying native function: TossItems 0x872654c)
	void TossItems(struct TArray<struct FNPCChosenItemData>& ItemsToGive, struct FVector& SpawnPickupLocation, struct FVector& TossDirection, float& TossSpeed, float& TossAngleVarianceDegrees); // (Final | BlueprintAuthorityOnly | Native | Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /Script/FortniteGame.FortNonPlayerConversationParticipantComponent.StartConversation (Underlying native function: StartConversation 0x8726468)
	void StartConversation(struct FGameplayTag& InConversationEntryTag, class AActor*& Instigator, class AActor*& Target); // (Final | 0x00000002 | Native | Public | BlueprintCallable | Const)

	// Function /Script/FortniteGame.FortNonPlayerConversationParticipantComponent.ShowMessage (Underlying native function: ShowMessage 0x87263a8)
	void ShowMessage(struct FText& message); // (Final | 0x00000002 | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortNonPlayerConversationParticipantComponent.SelectItemsToGive (Underlying native function: SelectItemsToGive 0x723b5f8)
	void SelectItemsToGive(struct TArray<struct FNPCChosenItemData>& OutItemsSelectedData); // (Final | BlueprintAuthorityOnly | Native | Public | HasOutParms | BlueprintCallable | Const)

	// Function /Script/FortniteGame.FortNonPlayerConversationParticipantComponent.RemoveHideUIIndicatorReason (Underlying native function: RemoveHideUIIndicatorReason 0x8726030)
	void RemoveHideUIIndicatorReason(struct FName& Reason); // (Final | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortNonPlayerConversationParticipantComponent.HasHideUIIndicatorReasons (Underlying native function: HasHideUIIndicatorReasons 0x8725b34)
	bool HasHideUIIndicatorReasons(); // (Final | 0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortNonPlayerConversationParticipantComponent.GiveItemsToPlayer (Underlying native function: GiveItemsToPlayer 0x87259b0)
	void GiveItemsToPlayer(class AFortPlayerController*& RecipientPlayerController, struct TArray<struct FNPCChosenItemData>& ItemsToGive); // (Final | BlueprintAuthorityOnly | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortNonPlayerConversationParticipantComponent.CanStartConversationWith (Underlying native function: CanStartConversationWith 0x872567c)
	bool CanStartConversationWith(class AFortPlayerController*& PlayerController); // (0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortNonPlayerConversationParticipantComponent.AddHideUIIndicatorReason (Underlying native function: AddHideUIIndicatorReason 0x87255b8)
	void AddHideUIIndicatorReason(struct FName& Reason); // (Final | Native | Public | HasOutParms | BlueprintCallable)
};

