// Class /Script/SaveTheWorldUI.FortLlamaStoreData
// Size: 0x70
class UFortLlamaStoreData : public UPrimaryDataAsset
{
	struct TArray<struct FText> RandomLoadingTexts; // 0x30 (0x10)
	struct FName NotEnoughCurrencyDialogCloseAction; // 0x40 (0x4)
	unsigned char unreflected_44[0x4]; // 0x44 (0x4) 
	class UClass* InspectWidgetClass; // 0x48 (0x8)
	float ShowOfferDelay; // 0x50 (0x4)
	unsigned char unreflected_54[0x4]; // 0x54 (0x4) 
	class UClass* StoreOpeningCardPackClass; // 0x58 (0x8)
	class UClass* UnopenedCardpacksModalClass; // 0x60 (0x8)
	class UClass* UnopenedCardpacksModalClassLegacy; // 0x68 (0x8)
};

