// Class /Script/FortniteGame.FortWorldItemDefinition
// Size: 0x8f0
class UFortWorldItemDefinition : public UFortItemDefinition
{
	struct FGameplayTagContainer RequiredEquipTags; // 0x3a8 (0x20)
	struct TArray<struct FFortPickupRestrictionLists> PickupRestrictionListEntry; // 0x3c8 (0x10)
	enum EWorldItemDropBehavior DropBehavior; // 0x3d8 (0x1)
	unsigned char bIgnoreRespawningForDroppingAsPickup; // 0x3d9 (0x1)
	unsigned char bCanAutoEquipByClass; // 0x3d9 (0x1)
	unsigned char bPersistInInventoryWhenFinalStackEmpty; // 0x3d9 (0x1)
	unsigned char bSupportsQuickbarFocus; // 0x3d9 (0x1)
	unsigned char bSupportsQuickbarFocusForGamepadOnly; // 0x3d9 (0x1)
	unsigned char bShouldActivateWhenFocused; // 0x3d9 (0x1)
	unsigned char bForceFocusWhenAdded; // 0x3d9 (0x1)
	unsigned char bForceIntoOverflow; // 0x3d9 (0x1)
	unsigned char bForceStayInOverflow; // 0x3da (0x1)
	unsigned char bDropCurrentItemOnOverflow; // 0x3da (0x1)
	unsigned char bShouldShowItemToast; // 0x3da (0x1)
	unsigned char bShowDirectionalArrowWhenFarOff; // 0x3da (0x1)
	unsigned char bCanBeDropped; // 0x3da (0x1)
	unsigned char bCanBeReplacedByPickup; // 0x3da (0x1)
	unsigned char bItemCanBeStolen; // 0x3da (0x1)
	unsigned char bCanBeDepositedInStorageVault; // 0x3da (0x1)
	unsigned char bItemHasDurability; // 0x3db (0x1)
	unsigned char bAllowedToBeLockedInInventory; // 0x3db (0x1)
	unsigned char bOverridePickupMeshTransform; // 0x3db (0x1)
	unsigned char bAlwaysCountForCollectionQuest; // 0x3db (0x1)
	unsigned char bDropOnDeath; // 0x3db (0x1)
	unsigned char bDropOnLogout; // 0x3db (0x1)
	unsigned char bDropOnDBNO; // 0x3db (0x1)
	unsigned char bDoesNotNeedSourceSchematic; // 0x3db (0x1)
	unsigned char bUsesGoverningTags; // 0x3dc (0x1)
	unsigned char bIsPickupASpecialActor; // 0x3dc (0x1)
	unsigned char bDrawCompassDistanceText; // 0x3dc (0x1)
	unsigned char NumberOfSlotsToTake; // 0x3dd (0x1)
	unsigned char unreflected_3de[0x2]; // 0x3de (0x2) 
	int DropCount; // 0x3e0 (0x4)
	float MiniMapViewableDistance; // 0x3e4 (0x4)
	unsigned char unreflected_3e8[0x8]; // 0x3e8 (0x8) 
	struct FSlateBrush MiniMapIconBrush; // 0x3f0 (0xc0)
	struct FText OwnerPickupText; // 0x4b0 (0x18)
	struct FDataTableCategoryHandle LootLevelData; // 0x4c8 (0x10)
	struct FGameplayTag SpecialActorPickupTag; // 0x4d8 (0x4)
	struct FName PickupSpecialActorUniqueID; // 0x4dc (0x4)
	struct FTransform PickupMeshTransform; // 0x4e0 (0x60)
	struct TArray<struct FSpecialActorSingleStatData> SpecialActorPickupStatList; // 0x540 (0x10)
	struct FSlateBrush PickupMinimapIconBrush; // 0x550 (0xc0)
	struct FVector2D PickupMinimapIconScale; // 0x610 (0x10)
	struct FSlateBrush PickupCompassIconBrush; // 0x620 (0xc0)
	struct FVector2D PickupCompassIconScale; // 0x6e0 (0x10)
	float PickupCompassRenderDistance; // 0x6f0 (0x4)
	unsigned char unreflected_6f4[0x4]; // 0x6f4 (0x4) 
	struct FScalableFloat PickupDespawnTime; // 0x6f8 (0x28)
	struct FScalableFloat InStormPickupDespawnTime; // 0x720 (0x28)
	struct FScalableFloat NetworkCullDistanceOverride; // 0x748 (0x28)
	struct TArray<class USoundLibrary*> PickupSoundLibraries; // 0x770 (0x10)
	struct TWeakObjectPtr<class UStaticMesh> PickupStaticMesh; // 0x780 (0x28)
	struct TWeakObjectPtr<class USkeletalMesh> PickupSkeletalMesh; // 0x7a8 (0x28)
	struct TWeakObjectPtr<class UClass> PickupEffectOverride; // 0x7d0 (0x28)
	struct TWeakObjectPtr<class USoundBase> PickupSound; // 0x7f8 (0x28)
	struct TWeakObjectPtr<class USoundBase> PickupByNearbyPawnSound; // 0x820 (0x28)
	struct TWeakObjectPtr<class USoundBase> DropSound; // 0x848 (0x28)
	struct TWeakObjectPtr<class USoundBase> DroppedLoopSound; // 0x870 (0x28)
	struct TWeakObjectPtr<class USoundBase> LandedSound; // 0x898 (0x28)
	struct FDataTableRowHandle DisassembleRecipe; // 0x8c0 (0x10)
	float DisassembleDurabilityDegradeMinLootPercent; // 0x8d0 (0x4)
	float DisassembleDurabilityDegradeMaxLootPercent; // 0x8d4 (0x4)
	int PreferredQuickbarSlot; // 0x8d8 (0x4)
	int MinLevel; // 0x8dc (0x4)
	int MaxLevel; // 0x8e0 (0x4)
	unsigned char padding_8e4[0xc]; // 0x8e4 (0xc)

	/* Functions */

	// Function /Script/FortniteGame.FortWorldItemDefinition.GetMaxDurability (Underlying native function: GetMaxDurability 0x8a92adc)
	float GetMaxDurability(int& ItemLevel); // (0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortWorldItemDefinition.GetInitialAmmo (Underlying native function: GetInitialAmmo 0x8a92a20)
	int GetInitialAmmo(int& ItemLevel); // (0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortWorldItemDefinition.GetDPSAtLevel (Underlying native function: GetDPSAtLevel 0x8a92894)
	float GetDPSAtLevel(int& ItemLevel); // (Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortWorldItemDefinition.GetDamageAtLevel (Underlying native function: GetDamageAtLevel 0x8a92928)
	float GetDamageAtLevel(int& ItemLevel); // (Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortWorldItemDefinition.GetAmmoWorldItemDefinition_BP (Underlying native function: GetAmmoWorldItemDefinition_BP 0x8a9279c)
	class UFortWorldItemDefinition* GetAmmoWorldItemDefinitionBP(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortWorldItemDefinition.CanBeDisassembled (Underlying native function: CanBeDisassembled 0x8a9247c)
	bool CanBeDisassembled(); // (Final | 0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)
};

