// Class /Script/FortniteUI.FortEventTeamMatchHistoryEntry
// Size: 0x14a0
class UFortEventTeamMatchHistoryEntry : public UCommonButtonLegacy
{
	unsigned char unreflected_1430[0x8]; // 0x1430 (0x8) 
	class UCommonTextBlock* TextMatchNumber; // 0x1438 (0x8)
	class UCommonTextBlock* TextTimeAlive; // 0x1440 (0x8)
	class UCommonTextBlock* TextStat; // 0x1448 (0x8)
	class UCommonTextBlock* TextPlacement; // 0x1450 (0x8)
	class UCommonTextBlock* TextCreativeScore; // 0x1458 (0x8)
	class UOverlay* OverlayOnlineStatus; // 0x1460 (0x8)
	class UCommonBorder* BorderInteractionContent; // 0x1468 (0x8)
	class UImage* ImageEliminations; // 0x1470 (0x8)
	class UImage* ImageAlternativeStat; // 0x1478 (0x8)
	class UImage* ImagePlacement; // 0x1480 (0x8)
	class UImage* ImageCreativeScore; // 0x1488 (0x8)
	class UFortEventTeamMatchHistoryEntryData* MatchData; // 0x1490 (0x8)
	unsigned char padding_1498[0x8]; // 0x1498 (0x8)
};

