// Class /Script/FortniteGame.FortContextualTutorialDefinition_Interaction
// Size: 0x118
class UFortContextualTutorialDefinition_Interaction : public UFortContextualTutorialDefinition
{
	struct FGameplayTag AbilityTagToTrigger; // 0x100 (0x4)
	struct FGameplayTag ActorGamePlayTag; // 0x104 (0x4)
	bool bFireOnSuccess; // 0x108 (0x1)
	bool bFireOnFail; // 0x109 (0x1)
	unsigned char unreflected_10a[0x2]; // 0x10a (0x2) 
	struct FGameplayTag RessourceTag; // 0x10c (0x4)
	int RessourceNeeded; // 0x110 (0x4)
	unsigned char padding_114[0x4]; // 0x114 (0x4)
};

