// Class /Script/FortniteUI.FortMobileHUDElementProxy
// Size: 0x378
class UFortMobileHUDElementProxy : public UFortMobileHUDElement
{
	struct FText WidgetName; // 0x2f8 (0x18)
	bool AppendWidgetAndBehaviorNames; // 0x310 (0x1)
	unsigned char unreflected_311[0x3]; // 0x311 (0x3) 
	struct FLinearColor InBoundsHighlightColor; // 0x314 (0x10)
	struct FLinearColor OutOfBoundsProxyHighlightColor; // 0x324 (0x10)
	unsigned char unreflected_334[0x34]; // 0x334 (0x34) 
	class UImage* ImageSelectionHighlight; // 0x368 (0x8)
	class UImage* ImageOutOfBoundsIndicator; // 0x370 (0x8)
};

