// Class /Script/FortniteGame.FortCurieFXSettings
// Size: 0x4f0
class UFortCurieFXSettings : public UDataAsset
{
	struct FNativeCurieFXTypeSettings ElectricityNativeFXTypeSettings; // 0x30 (0x120)
	struct FNativeCurieFXTypeSettings FireNativeFXTypeSettings; // 0x150 (0x120)
	struct FNativeCurieFXTypeSettings CharredNativeFXTypeSettings; // 0x270 (0x120)
	struct TArray<class UStaticMesh*> ElectricityArcMeshes; // 0x390 (0x10)
	class UNiagaraSystem* ElectricityArcImpactSystem; // 0x3a0 (0x8)
	class USoundBase* ElectricityArcSound; // 0x3a8 (0x8)
	class USoundBase* ElectricityAmbientSound; // 0x3b0 (0x8)
	class UMaterialParameterCollection* MaterialParameterCollection; // 0x3b8 (0x8)
	class UNiagaraSystem* PlayerWorldFireSystem; // 0x3c0 (0x8)
	class USoundBase* FireAmbientSound; // 0x3c8 (0x8)
	class UTextureRenderTarget2D* LandscapeCharRenderTarget; // 0x3d0 (0x8)
	struct FName PlayerWorldFireSystemLightScalabilityParamName; // 0x3d8 (0x4)
	int GlowElementIdxPrimitiveDataIdx; // 0x3dc (0x4)
	int GlowLerpDataIdx; // 0x3e0 (0x4)
	int CharredEffectPrimitiveDataIdx; // 0x3e4 (0x4)
	int ElectricityArcTilingDivisorPrimitiveDataIdx; // 0x3e8 (0x4)
	int ElectricityArcStartTimestampPrimitiveDataIdx; // 0x3ec (0x4)
	int ElectricityArcJumpDurationPrimitiveDataIdx; // 0x3f0 (0x4)
	int ElectricityArcDurationBeforeFadeoutPrimitiveDataIdx; // 0x3f4 (0x4)
	int ElectricityArcWPONoisePrimitiveDataIdx; // 0x3f8 (0x4)
	int ElectricityArcWPONoiseWorldTileScalePrimitiveDataIdx; // 0x3fc (0x4)
	int ElectricityArcWPONoiseScalePrimitiveDataIdx; // 0x400 (0x4)
	int ElectricityArcSplineWidthPrimitiveDataIdx; // 0x404 (0x4)
	int ElectricityArcColorScalePrimitiveDataIdx; // 0x408 (0x4)
	float ElectricityArcMaxPropagationLength; // 0x40c (0x4)
	struct FVector ElectricityArcRandScaleMin; // 0x410 (0x18)
	struct FVector ElectricityArcRandScaleMax; // 0x428 (0x18)
	struct FVector2D ElectricityArcTilingDivisorRand; // 0x440 (0x10)
	float ElectricityArcJumpDuration; // 0x450 (0x4)
	float ElectricityArcLifetime; // 0x454 (0x4)
	float ElectricityArcFadeoutDuration; // 0x458 (0x4)
	unsigned char unreflected_45c[0x4]; // 0x45c (0x4) 
	struct FVector ElectricityArcWPONoiseRandMin; // 0x460 (0x18)
	struct FVector ElectricityArcWPONoiseRandMax; // 0x478 (0x18)
	struct FVector2D ElectricityArcWPONoiseWorldTileScaleRand; // 0x490 (0x10)
	struct FVector2D ElectricityArcWPONoiseScaleRand; // 0x4a0 (0x10)
	float ElectricityArcSplineWidthFirstIteration; // 0x4b0 (0x4)
	float ElectricityArcSplineWidthSubsequentIteration; // 0x4b4 (0x4)
	float ElectricityArcColorScaleFirstIteration; // 0x4b8 (0x4)
	float ElectricityArcColorScaleSubsequentIteration; // 0x4bc (0x4)
	float ElectricityArcRetriggerDelay; // 0x4c0 (0x4)
	float ElectricityArcImpactFXDelay; // 0x4c4 (0x4)
	float CharredStateInterpSpeed; // 0x4c8 (0x4)
	float CharredStateFireAttachedFinalAlpha; // 0x4cc (0x4)
	float CharredStateNearFireFinalAlpha; // 0x4d0 (0x4)
	float LandscapeCharredStateInterpSpeed; // 0x4d4 (0x4)
	float MinLandscapeFireSphericalBounds; // 0x4d8 (0x4)
	float MaxLandscapeFireSphericalBounds; // 0x4dc (0x4)
	float LandscapeFireRandomLocationRadius; // 0x4e0 (0x4)
	float AmbientAudioFadeTime; // 0x4e4 (0x4)
	struct FName NativeFXHandlerRegistryName; // 0x4e8 (0x4)
	unsigned char padding_4ec[0x4]; // 0x4ec (0x4)
};

