// Class /Script/FortniteUI.FortUIManager
// Size: 0x220
class UFortUIManager : public UObject
{
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	struct TWeakObjectPtr<class UClass> LayoutClass; // 0x30 (0x28)
	bool bUseLegacyInputSystem; // 0x58 (0x1)
	unsigned char unreflected_59[0x7]; // 0x59 (0x7) 
	struct TArray<struct FFortRootViewportLayoutInfo> RootViewportLayouts; // 0x60 (0x10)
	unsigned char unreflected_70[0x8]; // 0x70 (0x8) 
	struct TWeakObjectPtr<class UClass> UIManagerClass; // 0x78 (0x28)
	unsigned char padding_a0[0x180]; // 0xa0 (0x180)
};

