// Class /Script/FortniteGame.FortWalkAnimInstance
// Size: 0xb50
class UFortWalkAnimInstance : public UFortLocomotionAnimInstance
{
	struct FCachedAnimStateArray TurnInitiatingStates; // 0x668 (0x18)
	struct FCachedAnimStateArray TurnTransitionStates; // 0x680 (0x18)
	float MeleeTwistCurveValue; // 0x698 (0x4)
	struct FFortAnimInput_AdjustedAim AdjustedAim; // 0x69c (0x23c)
	struct FFortAnimSetLocomotion CurrentLocomotionAnimSet; // 0x8d8 (0xf8)
	struct FFortAnimInput_SpeedWarping StartSpeedWarping; // 0x9d0 (0x30)
	struct FFortAnimInput_SpeedWarping SpeedWarping; // 0xa00 (0x30)
	struct FVector ActorSpaceVelocityDirPreTurn; // 0xa30 (0x18)
	float LeanAdditiveAlpha; // 0xa48 (0x4)
	float LeanAngle; // 0xa4c (0x4)
	float Speed2D; // 0xa50 (0x4)
	float LocalVelocityYawAngle; // 0xa54 (0x4)
	float LocalVelocityYawAngleMinusMeleeTwist; // 0xa58 (0x4)
	float StopAnimDeltaAngle; // 0xa5c (0x4)
	float TransitionPlayRate; // 0xa60 (0x4)
	float StartAnimDeltaAngleNorth; // 0xa64 (0x4)
	float StartAnimDeltaAngleEast; // 0xa68 (0x4)
	float StartAnimDeltaAngleSouth; // 0xa6c (0x4)
	float StartAnimDeltaAngleWest; // 0xa70 (0x4)
	float StartSpeedWarpingAlpha; // 0xa74 (0x4)
	float PostPivotAnimDeltaAngle; // 0xa78 (0x4)
	float PrePivotTimer; // 0xa7c (0x4)
	float PrePivotAnimDeltaAngle; // 0xa80 (0x4)
	enum EFortCardinalDirection StopCardinalDirection; // 0xa84 (0x1)
	enum EFortCardinalDirection PrePivotCardinalDirection; // 0xa85 (0x1)
	enum EFortCardinalDirection LocomotionCardinalDirection; // 0xa86 (0x1)
	enum EFortCardinalDirection PostPivotCardinalDirection; // 0xa87 (0x1)
	struct FVector StandardIdlePelvisOffset; // 0xa88 (0x18)
	struct FVector IdlePelvisOffset; // 0xaa0 (0x18)
	float IdlePelvisOffsetAlpha; // 0xab8 (0x4)
	unsigned char unreflected_abc[0x4]; // 0xabc (0x4) 
	struct FFortAnimInput_TurnInPlace TurnInPlaceInput; // 0xac0 (0x78)
	float YawDeltaSmoothed; // 0xb38 (0x4)
	float AbsYawDeltaSmoothed; // 0xb3c (0x4)
	unsigned char bIsPlayingMeleeAnim; // 0xb40 (0x1)
	unsigned char bDisableUpperBodySlotOnLowerBodyInIdle; // 0xb40 (0x1)
	unsigned char bIsTargeting; // 0xb40 (0x1)
	unsigned char bIsSurfaceSwimming; // 0xb40 (0x1)
	unsigned char bShouldPlayStopTransition; // 0xb40 (0x1)
	unsigned char bShouldEarlyOutStopState; // 0xb40 (0x1)
	unsigned char bShouldPlayPivotTransition; // 0xb40 (0x1)
	unsigned char bShouldEarlyOutPivotState; // 0xb40 (0x1)
	unsigned char bShouldWalkRightFootFwd; // 0xb41 (0x1)
	unsigned char bShouldPlayPostPivotTransition; // 0xb41 (0x1)
	unsigned char bShouldPlayStartTransition; // 0xb41 (0x1)
	unsigned char bShouldEarlyOutStartState; // 0xb41 (0x1)
	unsigned char bLocomotionIdlestoTurns; // 0xb41 (0x1)
	unsigned char bEarlyOutLowerbodyTurns; // 0xb41 (0x1)
	unsigned char bTransitionLowerBodyMovement; // 0xb41 (0x1)
	unsigned char bTransitionLowerBodyShuffle; // 0xb41 (0x1)
	unsigned char bIsWaterJump; // 0xb42 (0x1)
	unsigned char padding_b43[0xd]; // 0xb43 (0xd)
};

