// Class /Script/FortniteGame.FortAthenaJackalVehicleConfigs
// Size: 0x9d8
class UFortAthenaJackalVehicleConfigs : public UFortPhysicsVehicleConfigs
{
	float BoostTopSpeedMultiplier; // 0x890 (0x4)
	float BoostTopSpeedForceMultiplier; // 0x894 (0x4)
	float BoostSteeringMultiplier; // 0x898 (0x4)
	float BoostMinPushForce; // 0x89c (0x4)
	float BoostSteeringMultiplierRampTime; // 0x8a0 (0x4)
	float BoostCameraAdditionalOffset; // 0x8a4 (0x4)
	float SprintTopSpeedMultiplier; // 0x8a8 (0x4)
	float SprintTopSpeedForceMultiplier; // 0x8ac (0x4)
	float SprintMinPushForce; // 0x8b0 (0x4)
	float AutoSprintDelay; // 0x8b4 (0x4)
	float MaxCombatSpeed; // 0x8b8 (0x4)
	float CombatTransitionDragCoefficient; // 0x8bc (0x4)
	float CombatTransitionDragCoefficient2; // 0x8c0 (0x4)
	float SprintCameraAdditionalOffset; // 0x8c4 (0x4)
	float TurnInPlaceSpeed; // 0x8c8 (0x4)
	float AsyncTurnInPlaceSpeed; // 0x8cc (0x4)
	float MaxSpeedForTurnInPlaceKmH; // 0x8d0 (0x4)
	float BlendOutExtraSpeedTurnInPlaceKmH; // 0x8d4 (0x4)
	float LandTopSpeedMultiplier; // 0x8d8 (0x4)
	float MinJumpForce; // 0x8dc (0x4)
	float MaxJumpForce; // 0x8e0 (0x4)
	float JumpChargeRate; // 0x8e4 (0x4)
	float JumpChargeLossRate; // 0x8e8 (0x4)
	float MinJumpChargeToActivate; // 0x8ec (0x4)
	float JumpRequiredVerticalAngle; // 0x8f0 (0x4)
	float JumpCooldown; // 0x8f4 (0x4)
	float EmptyDragCoefficient; // 0x8f8 (0x4)
	float EmptyDragCoefficient2; // 0x8fc (0x4)
	float MaxEmptyDragSpeed; // 0x900 (0x4)
	float ForwardAlphaDeadZone; // 0x904 (0x4)
	float ForwardInputCutoffForSharpTurn; // 0x908 (0x4)
	float MinRightInputForSharpTurn; // 0x90c (0x4)
	float SharpTurnLateralFrictionRuntimeMultiplier; // 0x910 (0x4)
	float MinForwardAlphaForLeftAnalogTurn; // 0x914 (0x4)
	float EmptyLateralFrictionRuntimeMultiplier; // 0x918 (0x4)
	float BumpForce; // 0x91c (0x4)
	float InPlaceForwardPushForce; // 0x920 (0x4)
	float MaxSpeedForInPlaceForwardPush; // 0x924 (0x4)
	float TorsionRollStiff; // 0x928 (0x4)
	float TorsionRollDamp; // 0x92c (0x4)
	float TorsionRollAirStiff; // 0x930 (0x4)
	float TorsionRollAirDamp; // 0x934 (0x4)
	float TorsionRollStrength; // 0x938 (0x4)
	float SteerRollFactor; // 0x93c (0x4)
	float VehicleMaxRollAccel; // 0x940 (0x4)
	float CorrectionalYawMinVelocitySq; // 0x944 (0x4)
	float CorrectionalYawDotToleranceStart; // 0x948 (0x4)
	float CorrectionalYawDotToleranceEnd; // 0x94c (0x4)
	float CorrectionalYawStiff; // 0x950 (0x4)
	float CorrectionalYawDamp; // 0x954 (0x4)
	float CorrectionalYawMaxAccel; // 0x958 (0x4)
	float MaxYawCorrectionIncline; // 0x95c (0x4)
	float AimSteeringMultiplier; // 0x960 (0x4)
	float AimSteeringTurnMultiplier; // 0x964 (0x4)
	float AimSteeringStrafeMultiplier; // 0x968 (0x4)
	bool bUseCameraAssistWhenADS; // 0x96c (0x1)
	bool bJumpForceWorldVertical; // 0x96d (0x1)
	bool bAutoSprintGamepadToggle; // 0x96e (0x1)
	unsigned char unreflected_96f[0x1]; // 0x96f (0x1) 
	float JumpPercentWorldUpForPureVertical; // 0x970 (0x4)
	float JumpPercentSurfaceNormal; // 0x974 (0x4)
	bool bJumpInstantlyFullCharge; // 0x978 (0x1)
	bool bHolsterWeaponDuringBoostOnServer; // 0x979 (0x1)
	bool bHolsterWeaponDuringBoostOnClient; // 0x97a (0x1)
	bool bPlayHolsterAnimsOnClient; // 0x97b (0x1)
	bool bSwapDriveTagsDuringBoost; // 0x97c (0x1)
	bool bDisableReticleDuringBoost; // 0x97d (0x1)
	bool bUseViewRotationDuringSprint; // 0x97e (0x1)
	bool bAlwaysConstrainViewDuringCombat; // 0x97f (0x1)
	bool bAlwaysConstrainViewDuringCombatADS; // 0x980 (0x1)
	unsigned char unreflected_981[0x3]; // 0x981 (0x3) 
	float GroundForwardToUpTolerance; // 0x984 (0x4)
	float GroundRightToUpTolerance; // 0x988 (0x4)
	float TurnRateExponent; // 0x98c (0x4)
	float MinSpeedMaxSteeringAngle; // 0x990 (0x4)
	float MaxSpeedMaxSteeringAngle; // 0x994 (0x4)
	float AllowSharpTurnForwardAlpha; // 0x998 (0x4)
	float SharpTurnSwitchOffAlpha; // 0x99c (0x4)
	bool bUseLookAheadTraceInAir; // 0x9a0 (0x1)
	unsigned char unreflected_9a1[0x3]; // 0x9a1 (0x3) 
	float VehicleCameraLeftAnalogMultiplierInAir; // 0x9a4 (0x4)
	float MaxAutoFlipVelocitySquared; // 0x9a8 (0x4)
	float AutoFlipCooldown; // 0x9ac (0x4)
	float BalloonPitchStrengthModifier; // 0x9b0 (0x4)
	float MinSpeedSquaredForCameraFollowInAir; // 0x9b4 (0x4)
	float JumpChargeSteeringMultiplier; // 0x9b8 (0x4)
	float VerticalOnGroundEjectCooldown; // 0x9bc (0x4)
	float OnSideOnGroundEjectCooldown; // 0x9c0 (0x4)
	float MaxForwardSpeedForTurnInPlaceDrag; // 0x9c4 (0x4)
	float TurnInPlaceDragCoefficient; // 0x9c8 (0x4)
	float TurnInPlaceDrag2Coefficient; // 0x9cc (0x4)
	float VehicleAirCameraYawStrength; // 0x9d0 (0x4)
	float MaxPitchForCameraSteer; // 0x9d4 (0x4)
};

