// Class /Script/FortniteAI.FortAthenaAIBotEvaluator_AimDownSight
// Size: 0xb8
class UFortAthenaAIBotEvaluator_AimDownSight : public UFortAthenaAIBotEvaluator
{
	struct FName WeaponKeyName; // 0x88 (0x4)
	struct FName ThrowableAttacksName; // 0x8c (0x4)
	struct FName TargetActorName; // 0x90 (0x4)
	struct FName UrgentMovementName; // 0x94 (0x4)
	bool bSkipTargetChecks; // 0x98 (0x1)
	unsigned char unreflected_99[0x7]; // 0x99 (0x7) 
	class UFortAthenaAIBotAimingDigestedSkillSet* CacheAimingDigestedSkillSet; // 0xa0 (0x8)
	unsigned char padding_a8[0x10]; // 0xa8 (0x10)
};

