// Class /Script/FortniteGame.FortPlayerProceduralAdjustmentsAnimInstance
// Size: 0xe30
class UFortPlayerProceduralAdjustmentsAnimInstance : public UFortBaseLayerAnimInstance
{
	struct FRotator FreeFallPelvisModRot; // 0x440 (0x18)
	struct FFortAnimInput_SpringGlider SpringGlider; // 0x458 (0xc0)
	struct FFortAnimInput_PlayerGliderAnimAsset CurrentGliderAnimSet; // 0x518 (0x268)
	enum EFortPlayerAnimBodyType AnimBodyType; // 0x780 (0x1)
	bool bFreeFallUseDiveAngleMod; // 0x781 (0x1)
	unsigned char bIsBeingInterrogated; // 0x782 (0x1)
	unsigned char unreflected_783[0x1]; // 0x783 (0x1) 
	float RightHandIKAlpha; // 0x784 (0x4)
	struct FFortAnimInput_Skydiving Skydiving; // 0x788 (0x78)
	unsigned char bIsFemale; // 0x800 (0x1)
	unsigned char unreflected_801[0x7]; // 0x801 (0x7) 
	struct FFortAnimInput_DBNOCarried DBNOCarriedInput; // 0x808 (0xf8)
	unsigned char bIsDBNOCarried; // 0x900 (0x1)
	unsigned char bIsInCannon; // 0x900 (0x1)
	unsigned char unreflected_901[0x7]; // 0x901 (0x7) 
	struct FFortAnimInput_JackalVehicle JackalVehicleInput; // 0x908 (0x240)
	float UpperBodyNoAdditivesMaskWeight; // 0xb48 (0x4)
	float SlopeWarpingAlpha; // 0xb4c (0x4)
	struct FFortAnimInput_TurnInPlace TurnInPlaceInput; // 0xb50 (0x78)
	struct FRotator TurnPelvisRotationOffset; // 0xbc8 (0x18)
	struct FVector SlopeWarpingFloorOffset; // 0xbe0 (0x18)
	unsigned char bUseCustomFloorOffset; // 0xbf8 (0x1)
	unsigned char bUseFloorOffsetInterpolator; // 0xbf8 (0x1)
	unsigned char unreflected_bf9[0x7]; // 0xbf9 (0x7) 
	struct FVector TurnPelvisTranslationOffset; // 0xc00 (0x18)
	unsigned char bIsPlayingEmote; // 0xc18 (0x1)
	unsigned char unreflected_c19[0x3]; // 0xc19 (0x3) 
	float EmoteForcedRootYaw; // 0xc1c (0x4)
	struct FVector WholeAnimOffset; // 0xc20 (0x18)
	float IdlePelvisOffsetAlpha; // 0xc38 (0x4)
	float LegIKAlpha; // 0xc3c (0x4)
	float RootSlopeRotationAlpha; // 0xc40 (0x4)
	unsigned char unreflected_c44[0x4]; // 0xc44 (0x4) 
	struct FRotator RootSlopeRotationOffset; // 0xc48 (0x18)
	unsigned char bHideWeaponForEmptyHands; // 0xc60 (0x1)
	unsigned char unreflected_c61[0x3]; // 0xc61 (0x3) 
	float LeftHandIKAlpha; // 0xc64 (0x4)
	unsigned char unreflected_c68[0x8]; // 0xc68 (0x8) 
	struct FFortAnimInput_BowWeapon BowWeaponInput; // 0xc70 (0xe0)
	struct FFortAnimInput_HandIK HandIKInput; // 0xd50 (0x1c)
	unsigned char unreflected_d6c[0x4]; // 0xd6c (0x4) 
	struct FFortAnimInput_PelvisAdjustment PelvisAdjustmentInput; // 0xd70 (0x50)
	float PelvisAdjustmentCrouchAlpha; // 0xdc0 (0x4)
	float SnapWeaponLHandAlphaSwitch; // 0xdc4 (0x4)
	float FreeFallDiveAngleInterpSpeed; // 0xdc8 (0x4)
	float ProceduralAdjustmentsAlpha; // 0xdcc (0x4)
	struct FVector EmoteAnimOffset; // 0xdd0 (0x18)
	unsigned char bIsCrouching; // 0xde8 (0x1)
	unsigned char bIsCrouchMoving; // 0xde8 (0x1)
	unsigned char bIsCrouchSprinting; // 0xde8 (0x1)
	unsigned char bIsRiding; // 0xde8 (0x1)
	unsigned char padding_de9[0x47]; // 0xde9 (0x47)
};

