// Class /Script/FortniteAI.FortAthenaAIBotEvaluator_PatrolAround
// Size: 0x260
class UFortAthenaAIBotEvaluator_PatrolAround : public UFortAthenaAIBotEvaluator_Movement
{
	class UClass* NavigationQueryFilterClass; // 0x230 (0x8)
	struct FName PatrolDestinationName; // 0x238 (0x4)
	struct FName PatrolExecutionStatusName; // 0x23c (0x4)
	struct FName PatrolMovementStateName; // 0x240 (0x4)
	struct FName BestTargetActorName; // 0x244 (0x4)
	unsigned char unreflected_248[0x8]; // 0x248 (0x8) 
	class AFortGameModeAthena* CacheAthenaGameMode; // 0x250 (0x8)
	unsigned char padding_258[0x8]; // 0x258 (0x8)
};

