// Class /Script/DiscoveryBrowserUI.FortActivityCategoryPageView
// Size: 0x5f0
class UFortActivityCategoryPageView : public UFortActivityPlayerBrowserView
{
	unsigned char unreflected_5b0[0x8]; // 0x5b0 (0x8) 
	class UCommonRichTextBlock* TextCategoryTitle; // 0x5b8 (0x8)
	class UCommonButtonBase* ButtonBackToTop; // 0x5c0 (0x8)
	class UCommonButtonBase* ButtonMobileClose; // 0x5c8 (0x8)
	class UCommonButtonBase* ButtonMobileAccept; // 0x5d0 (0x8)
	class UCommonButtonBase* ButtonBack; // 0x5d8 (0x8)
	class UCommonButtonBase* ButtonMobileShowGameDetails; // 0x5e0 (0x8)
	unsigned char padding_5e8[0x8]; // 0x5e8 (0x8)
};

