// Class /Script/FortniteGame.FortAnimWorldStriderComponent
// Size: 0x2b8
class UFortAnimWorldStriderComponent : public UActorComponent
{
	struct FFortDistanceCurve* DistanceCurve; // 0xa0 (0x8)
	struct FFortAnimInput_TurnCorrection PivotTurnCorrection; // 0xa8 (0x34)
	struct FFortCachedFloatCurve* PlayRateSpeedWarpAlphaCurve; // 0xdc (0x8)
	float PlayRateSpeedWarpAlpha; // 0xe4 (0x4)
	struct FCachedAnimStateData PivotStateData; // 0xe8 (0x14)
	unsigned char unreflected_fc[0x4]; // 0xfc (0x4) 
	class UAnimSequence* PivotAnimationLeft; // 0x100 (0x8)
	class UAnimSequence* PivotAnimationRight; // 0x108 (0x8)
	float PivotEarlyOutAngleThreshold; // 0x110 (0x4)
	struct FFortAnimInput_TurnCorrection StartTurnCorrection; // 0x114 (0x34)
	struct FCachedAnimStateData StartStateData; // 0x148 (0x14)
	unsigned char unreflected_15c[0x4]; // 0x15c (0x4) 
	struct FFortDirectionalAnimRef DirectionalStartAnims; // 0x160 (0x28)
	float StartEarlyOutThresold; // 0x188 (0x4)
	unsigned char bIgnoreStartTransitionSettings; // 0x18c (0x1)
	unsigned char unreflected_18d[0x3]; // 0x18d (0x3) 
	struct FCachedAnimStateData MovementStateData; // 0x190 (0x14)
	float LocomotionDeadZoneAngle; // 0x1a4 (0x4)
	float OverallSpeedRateMaxValue; // 0x1a8 (0x4)
	float WalkPlayRateValue; // 0x1ac (0x4)
	float WalkSpeedWarpingValue; // 0x1b0 (0x4)
	float Speed2D; // 0x1b4 (0x4)
	unsigned char bIsOnGround; // 0x1b8 (0x1)
	unsigned char bIsMoving2D; // 0x1b8 (0x1)
	unsigned char bWasMoving2DLastFrame; // 0x1b8 (0x1)
	unsigned char unreflected_1b9[0x7]; // 0x1b9 (0x7) 
	struct FVector PivotLocation; // 0x1c0 (0x18)
	struct FVector PivotInitialFacingDir2D; // 0x1d8 (0x18)
	class UAnimSequence* PivotAnimation; // 0x1f0 (0x8)
	float PivotAnimPosition; // 0x1f8 (0x4)
	unsigned char bPivotTransitionTriggered; // 0x1fc (0x1)
	unsigned char bPivotEarlyOut; // 0x1fc (0x1)
	unsigned char bStartTransitionTriggered; // 0x1fc (0x1)
	unsigned char bStartEarlyOut; // 0x1fc (0x1)
	unsigned char unreflected_1fd[0x3]; // 0x1fd (0x3) 
	float StartAnimDistanceFromMarker; // 0x200 (0x4)
	float ActualDistanceFromMarker; // 0x204 (0x4)
	float StartAnimTimeElapsed; // 0x208 (0x4)
	float StartTurnDirection; // 0x20c (0x4)
	float StartInitialAccelYaw; // 0x210 (0x4)
	float StartAnimPosition; // 0x214 (0x4)
	struct FVector StartAnimLocation; // 0x218 (0x18)
	enum EFortCardinalDirection StartCardinalDirection; // 0x230 (0x1)
	unsigned char unreflected_231[0x7]; // 0x231 (0x7) 
	class UAnimSequenceBase* StartAnimation; // 0x238 (0x8)
	float LocalVelocityYawAngle; // 0x240 (0x4)
	float LocalAccelerationYawAngle; // 0x244 (0x4)
	enum EFortCardinalDirection LocomotionCardinalDirection; // 0x248 (0x1)
	unsigned char unreflected_249[0x3]; // 0x249 (0x3) 
	struct FFloatRK4SpringInterpolator* LocalVelocityYawAngleInterpolator; // 0x24c (0x8)
	unsigned char unreflected_254[0x1c]; // 0x254 (0x1c) 
	float LocalVelocityYawAngleInterpolated; // 0x270 (0x4)
	unsigned char unreflected_274[0x4]; // 0x274 (0x4) 
	struct FRotator ActorRotationLastTick; // 0x278 (0x18)
	struct FRotator ActorRotation; // 0x290 (0x18)
	unsigned char padding_2a8[0x10]; // 0x2a8 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.FortAnimWorldStriderComponent.UpdateStartTransition (Underlying native function: UpdateStartTransition 0x82362e0)
	float UpdateStartTransition(float& DeltaTime, class UAnimSequenceBase*& InStartAnimation); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortAnimWorldStriderComponent.InitializeStartTransition (Underlying native function: InitializeStartTransition 0x8235e08)
	void InitializeStartTransition(class UAnimSequenceBase*& InStartAnimation); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortAnimWorldStriderComponent.GetWalkSpeedWarpingValue (Underlying native function: GetWalkSpeedWarpingValue 0x8235df0)
	float GetWalkSpeedWarpingValue(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAnimWorldStriderComponent.GetWalkPlayRateValue (Underlying native function: GetWalkPlayRateValue 0x8235dd8)
	float GetWalkPlayRateValue(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAnimWorldStriderComponent.ChooseStartAnimationFromSettings (Underlying native function: ChooseStartAnimationFromSettings 0x8235d38)
	void ChooseStartAnimationFromSettings(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortAnimWorldStriderComponent.CalculateSpeedWarpingValues (Underlying native function: CalculateSpeedWarpingValues 0x8235c74)
	void CalculateSpeedWarpingValues(float& InRateWarpAlpha, float& InOverallSpeedRate); // (Final | Native | Public | BlueprintCallable)
};

