// Class /Script/FortniteGame.FortAnimNotifyState_SpawnEmoteEmitter
// Size: 0x90
class UFortAnimNotifyState_SpawnEmoteEmitter : public UAnimNotifyState
{
	struct FName SocketName; // 0x30 (0x4)
	unsigned char unreflected_34[0x4]; // 0x34 (0x4) 
	struct FVector LocationOffset; // 0x38 (0x18)
	struct FRotator RotationOffset; // 0x50 (0x18)
	struct FVector Scale; // 0x68 (0x18)
	class UParticleSystem* EmitterTemplate; // 0x80 (0x8)
	int EmitterId; // 0x88 (0x4)
	unsigned char padding_8c[0x4]; // 0x8c (0x4)
};

