// Class /Script/FortniteGame.FortPlaylist
// Size: 0x410
class UFortPlaylist : public UPrimaryDataAsset
{
	unsigned char unreflected_30[0x8]; // 0x30 (0x8) 
	int PlaylistId; // 0x38 (0x4)
	struct FName PlaylistName; // 0x3c (0x4)
	enum EFortGameType GameType; // 0x40 (0x4)
	int MinPlayers; // 0x44 (0x4)
	int MaxPlayers; // 0x48 (0x4)
	bool bUnderfillMatchmaking; // 0x4c (0x1)
	unsigned char unreflected_4d[0x3]; // 0x4d (0x3) 
	int UnderfilledMaxPlayers; // 0x50 (0x4)
	bool bOverrideMaxPlayers; // 0x54 (0x1)
	unsigned char unreflected_55[0x3]; // 0x55 (0x3) 
	int MaxHumanAndBotParticipants; // 0x58 (0x4)
	int MaxTeamCount; // 0x5c (0x4)
	int MaxTeamSize; // 0x60 (0x4)
	int MaxSocialPartySize; // 0x64 (0x4)
	int MaxSquadSize; // 0x68 (0x4)
	int MaxSquads; // 0x6c (0x4)
	bool EnforceSquadFill; // 0x70 (0x1)
	bool bAllowSquadFillOption; // 0x71 (0x1)
	bool bShouldFillWhenNoSquadFillOption; // 0x72 (0x1)
	bool bAllowJoinInProgress; // 0x73 (0x1)
	unsigned char unreflected_74[0x4]; // 0x74 (0x4) 
	struct FText JoinInProgressMatchType; // 0x78 (0x18)
	int EndOfMatchXpFirstElim; // 0x90 (0x4)
	int EndOfMatchXpMultiplier; // 0x94 (0x4)
	class UPlaylistUserOptions* UserOptions; // 0x98 (0x8)
	bool bEnableBackfillDuringWarmupPhase; // 0xa0 (0x1)
	unsigned char unreflected_a1[0x3]; // 0xa1 (0x3) 
	float TimeAfterWarmupToDisableBackfill; // 0xa4 (0x4)
	struct FName RichPresenceAssetName; // 0xa8 (0x4)
	bool bAllowKeepPlayingTogether; // 0xac (0x1)
	bool bAllowPartyRift; // 0xad (0x1)
	bool bAllowSquadSizeTracking; // 0xae (0x1)
	unsigned char unreflected_af[0x1]; // 0xaf (0x1) 
	struct TWeakObjectPtr<class UWorld> PreloadPersistentLevel; // 0xb0 (0x28)
	struct TArray<struct TWeakObjectPtr<class UWorld>> AdditionalLevels; // 0xd8 (0x10)
	struct TArray<struct TWeakObjectPtr<class UWorld>> AdditionalLevelsServerOnly; // 0xe8 (0x10)
	struct TArray<struct FString> BuiltInGameFeaturePluginsToLoad; // 0xf8 (0x10)
	struct FString OverrideLinkIdToDownload; // 0x108 (0x10)
	struct FString GameFeaturePluginToActivateUntilDownloadedContentIsPresent; // 0x118 (0x10)
	unsigned char DefaultFirstTeam; // 0x128 (0x1)
	unsigned char DefaultLastTeam; // 0x129 (0x1)
	unsigned char unreflected_12a[0x6]; // 0x12a (0x6) 
	struct FGameplayTagContainer GameplayTagContainer; // 0x130 (0x20)
	enum EFriendlyFireType FriendlyFireType; // 0x150 (0x1)
	bool bUseFriendlyFireAimAssist; // 0x151 (0x1)
	unsigned char unreflected_152[0x2]; // 0x152 (0x2) 
	int LootLevel; // 0x154 (0x4)
	struct FGameplayTagQuery LootTagQuery; // 0x158 (0x48)
	int BuildingLevelOverride; // 0x1a0 (0x4)
	enum EDBNOType DBNOType; // 0x1a4 (0x1)
	unsigned char unreflected_1a5[0x3]; // 0x1a5 (0x3) 
	struct FScalableFloat SpawnImmunityTime; // 0x1a8 (0x28)
	struct TArray<enum EAthenaGamePhaseStep> SkippedGamePhaseNotification; // 0x1d0 (0x10)
	struct TArray<struct TWeakObjectPtr<class UFortGameplayModifierItemDefinition>> ModifierList; // 0x1e0 (0x10)
	struct TWeakObjectPtr<class UClass> TimeOfDayManager; // 0x1f0 (0x28)
	bool bIgnoreWeatherEvents; // 0x218 (0x1)
	unsigned char unreflected_219[0x7]; // 0x219 (0x7) 
	struct TArray<class UFortItemDefinition*> ItemsToFullyLoad; // 0x220 (0x10)
	class UFortSharedAssetGroup* SharedAssetGroup; // 0x230 (0x8)
	class UFortConditionalAssetGroup* ConditionalAssetGroup; // 0x238 (0x8)
	bool bIsDefaultPlaylist; // 0x240 (0x1)
	unsigned char unreflected_241[0x7]; // 0x241 (0x7) 
	struct FText UIDisplayName; // 0x248 (0x18)
	struct FText UIDescription; // 0x260 (0x18)
	struct FGameplayTagContainer HUDElementsToHide; // 0x278 (0x20)
	bool bUseCustomInGameState; // 0x298 (0x1)
	unsigned char unreflected_299[0x7]; // 0x299 (0x7) 
	struct TWeakObjectPtr<class UDataTable> LootTierData; // 0x2a0 (0x28)
	struct TWeakObjectPtr<class UDataTable> LootPackages; // 0x2c8 (0x28)
	struct TArray<struct FFortPlaylistBaseCurveTableOverride> BaseCurveTableOverrides; // 0x2f0 (0x10)
	struct TArray<struct FFortPlaylistBaseDataTableOverride> BaseDataTablesOverride; // 0x300 (0x10)
	struct TWeakObjectPtr<class UDataTable> RangedWeapons; // 0x310 (0x28)
	struct TWeakObjectPtr<class UCurveTable> GameData; // 0x338 (0x28)
	struct TWeakObjectPtr<class UCurveTable> ResourceRates; // 0x360 (0x28)
	struct TWeakObjectPtr<class USoundBase> SkydiveMusic; // 0x388 (0x28)
	struct TWeakObjectPtr<class USoundBase> SkydiveMusicOutroStinger; // 0x3b0 (0x28)
	struct TWeakObjectPtr<class USoundBase> RespawnStinger; // 0x3d8 (0x28)
	float GarbageCollectionFrequency; // 0x400 (0x4)
	float ServerPerformanceEventFrequency; // 0x404 (0x4)
	float ServerMetricsEventFrequency; // 0x408 (0x4)
	bool bUseLocalizationService; // 0x40c (0x1)
	unsigned char padding_40d[0x3]; // 0x40d (0x3)
};

