// Class /Script/FortniteGame.FortPlayerAnimInstance_ATVDriver
// Size: 0x1d00
class UFortPlayerAnimInstance_ATVDriver : public UFortPlayerAnimInstance
{
	struct FFortAnimInput_Quad QuadBikeInput; // 0x1a18 (0x80)
	struct FFortAnimInput_VelocityImpact VelocityImpact; // 0x1a98 (0xf0)
	struct FVector ImpactDisplacement; // 0x1b88 (0x18)
	float AbsSteerAngle; // 0x1ba0 (0x4)
	unsigned char unreflected_1ba4[0x4]; // 0x1ba4 (0x4) 
	bool bInAir; // 0x1ba8 (0x1)
	bool bIsInRollAngleThreshold; // 0x1ba9 (0x1)
	bool bIsDriveStarting; // 0x1baa (0x1)
	unsigned char unreflected_1bab[0x5]; // 0x1bab (0x5) 
	struct FVector LocalLeftOffset; // 0x1bb0 (0x18)
	struct FVector WorldPosLeft; // 0x1bc8 (0x18)
	struct FRotator LocalRotLeftOffset; // 0x1be0 (0x18)
	struct FRotator WorldRotLeft; // 0x1bf8 (0x18)
	struct FVector LocalRightOffset; // 0x1c10 (0x18)
	struct FVector WorldPosRight; // 0x1c28 (0x18)
	struct FRotator LocalRotRightOffset; // 0x1c40 (0x18)
	struct FRotator WorldRotRight; // 0x1c58 (0x18)
	bool bIsSteeringRotating; // 0x1c70 (0x1)
	bool bIsStopped; // 0x1c71 (0x1)
	bool bIsSlowingDown; // 0x1c72 (0x1)
	bool bIsDrivingFast; // 0x1c73 (0x1)
	bool bIsTurningRightHard; // 0x1c74 (0x1)
	bool bIsTurningLeftHard; // 0x1c75 (0x1)
	bool bIsBraking; // 0x1c76 (0x1)
	unsigned char unreflected_1c77[0x1]; // 0x1c77 (0x1) 
	bool bIsBoosting; // 0x1c78 (0x1)
	bool bIsJumpTrick; // 0x1c79 (0x1)
	unsigned char unreflected_1c7a[0x2]; // 0x1c7a (0x2) 
	float JumpPlayRate; // 0x1c7c (0x4)
	bool bIsJumpFlipping; // 0x1c80 (0x1)
	bool bShouldEnableAO; // 0x1c81 (0x1)
	bool bIsBodyDragging; // 0x1c82 (0x1)
	unsigned char unreflected_1c83[0x1]; // 0x1c83 (0x1) 
	float FallDistanceJumpingThreshold; // 0x1c84 (0x4)
	float FallDistanceJumpTrickThreshold; // 0x1c88 (0x4)
	float RollAngleThreshold; // 0x1c8c (0x4)
	float StartSpeedThreshold; // 0x1c90 (0x4)
	float SlowingSpeedThreshold; // 0x1c94 (0x4)
	float FastSpeedThreshold; // 0x1c98 (0x4)
	float BrakingDeltaThreshold; // 0x1c9c (0x4)
	float SteerHardAngleThreshold; // 0x1ca0 (0x4)
	float GroundTraceUpOffset; // 0x1ca4 (0x4)
	float GroundTraceLength; // 0x1ca8 (0x4)
	unsigned char unreflected_1cac[0x4]; // 0x1cac (0x4) 
	struct FVector2D JumpPlayRateInRange; // 0x1cb0 (0x10)
	struct FVector2D JumpPlayRateOutRange; // 0x1cc0 (0x10)
	bool bIsJumpingAndNotRolling; // 0x1cd0 (0x1)
	bool bIsOnGroundAndNotRolling; // 0x1cd1 (0x1)
	bool bIsOnGroundAndBoosting; // 0x1cd2 (0x1)
	bool bPlayPivotOnGroundAndNotBoosting; // 0x1cd3 (0x1)
	unsigned char unreflected_1cd4[0x4]; // 0x1cd4 (0x4) 
	struct FVector2D LandStartPosInRange; // 0x1cd8 (0x10)
	struct FVector2D LandStartPosOutRange; // 0x1ce8 (0x10)
	float LandStartPosition; // 0x1cf8 (0x4)
	unsigned char padding_1cfc[0x4]; // 0x1cfc (0x4)

	/* Functions */

	// Function /Script/FortniteGame.FortPlayerAnimInstance_ATVDriver.AnimNotify_JumpEntered (Underlying native function: AnimNotify_JumpEntered 0x82649f4)
	void AnimNotifyJumpEntered(); // (Final | Native | Public)
};

