// Class /Script/FortniteUI.FortMobileHUDLayoutToolV2_ControlPanel
// Size: 0x370
class UFortMobileHUDLayoutToolV2_ControlPanel : public UCommonUserWidget
{
	float PanelOpacityWhenDragedOver; // 0x290 (0x4)
	unsigned char unreflected_294[0x8c]; // 0x294 (0x8c) 
	class UHUDLayoutToolV2_Button* ButtonSave; // 0x320 (0x8)
	class UHUDLayoutToolV2_Button* ButtonRevertAll; // 0x328 (0x8)
	class UHUDLayoutToolV2_Button* ButtonExit; // 0x330 (0x8)
	class UHUDLayoutToolV2_Button* ButtonOpenProfileSelectionPanel; // 0x338 (0x8)
	class UHUDLayoutToolV2_Button* ButtonSwitchContexts; // 0x340 (0x8)
	class UHUDLayoutToolV2_Button* ButtonSwitchProperties; // 0x348 (0x8)
	class UHUDLayoutToolV2_GridSnap* GridSnapOptionControls; // 0x350 (0x8)
	class UCommonActivatableWidgetSwitcher* SwitcherControls; // 0x358 (0x8)
	class UHUDLayoutToolV2_ContextSelector* ContextSelectorContextLayouts; // 0x360 (0x8)
	class UHUDLayoutToolV2_PropertyPanel* PropertyPanelWidgetProperties; // 0x368 (0x8)
};

