// Class /Script/FortniteGame.FortWeaponAttrSet
// Size: 0x260
class UFortWeaponAttrSet : public UFortAttributeSet
{
	struct FFortGameplayAttributeData WeaponChanceToNotConsumeAmmo; // 0x30 (0x28)
	struct FFortGameplayAttributeData AccumulatedWeaponChanceToNotConsumeAmmo; // 0x58 (0x28)
	struct FFortGameplayAttributeData WeaponRateOfFire; // 0x80 (0x28)
	struct FFortGameplayAttributeData WeaponHorizontalRecoil; // 0xa8 (0x28)
	struct FFortGameplayAttributeData WeaponVerticalRecoil; // 0xd0 (0x28)
	struct FFortGameplayAttributeData WeaponSpreadReduction; // 0xf8 (0x28)
	struct FFortGameplayAttributeData WeaponReloadSpeed; // 0x120 (0x28)
	struct FFortGameplayAttributeData WeaponAmmoClipSize; // 0x148 (0x28)
	struct FFortGameplayAttributeData WeaponChargeRate; // 0x170 (0x28)
	struct FFortGameplayAttributeData WeaponOverheatMultiplier; // 0x198 (0x28)
	struct FFortGameplayAttributeData WeaponOverheatMaxMultiplier; // 0x1c0 (0x28)
	struct FFortGameplayAttributeData WeaponOverheatCoolingMultiplier; // 0x1e8 (0x28)
	struct FFortGameplayAttributeData WeaponOverheatCooldownMultiplier; // 0x210 (0x28)
	struct FFortGameplayAttributeData CharacterItemDurabilityDecayModifier; // 0x238 (0x28)

	/* Functions */

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponVerticalRecoil (Underlying native function: OnRep_WeaponVerticalRecoil 0x85a98c8)
	void OnRepWeaponVerticalRecoil(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponSpreadReduction (Underlying native function: OnRep_WeaponSpreadReduction 0x85a97fc)
	void OnRepWeaponSpreadReduction(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponReloadSpeed (Underlying native function: OnRep_WeaponReloadSpeed 0x85a9664)
	void OnRepWeaponReloadSpeed(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponRateOfFire (Underlying native function: OnRep_WeaponRateOfFire 0x85a9598)
	void OnRepWeaponRateOfFire(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponOverheatMultiplier (Underlying native function: OnRep_WeaponOverheatMultiplier 0x85a94cc)
	void OnRepWeaponOverheatMultiplier(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponOverheatMaxMultiplier (Underlying native function: OnRep_WeaponOverheatMaxMultiplier 0x85a9400)
	void OnRepWeaponOverheatMaxMultiplier(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponOverheatCoolingMultiplier (Underlying native function: OnRep_WeaponOverheatCoolingMultiplier 0x85a9334)
	void OnRepWeaponOverheatCoolingMultiplier(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponOverheatCooldownMultiplier (Underlying native function: OnRep_WeaponOverheatCooldownMultiplier 0x85a9268)
	void OnRepWeaponOverheatCooldownMultiplier(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponHorizontalRecoil (Underlying native function: OnRep_WeaponHorizontalRecoil 0x85a919c)
	void OnRepWeaponHorizontalRecoil(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponChargeRate (Underlying native function: OnRep_WeaponChargeRate 0x85a90d0)
	void OnRepWeaponChargeRate(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponChanceToNotConsumeAmmo (Underlying native function: OnRep_WeaponChanceToNotConsumeAmmo 0x85a9004)
	void OnRepWeaponChanceToNotConsumeAmmo(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_WeaponAmmoClipSize (Underlying native function: OnRep_WeaponAmmoClipSize 0x85a8f38)
	void OnRepWeaponAmmoClipSize(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_CharacterItemDurabilityDecayModifier (Underlying native function: OnRep_CharacterItemDurabilityDecayModifier 0x85a46a0)
	void OnRepCharacterItemDurabilityDecayModifier(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)

	// Function /Script/FortniteGame.FortWeaponAttrSet.OnRep_AccumulatedWeaponChanceToNotConsumeAmmo (Underlying native function: OnRep_AccumulatedWeaponChanceToNotConsumeAmmo 0x1f74ec8)
	void OnRepAccumulatedWeaponChanceToNotConsumeAmmo(struct FFortGameplayAttributeData& OldValue); // (Final | Native | Public | HasOutParms)
};

