// Class /Script/FortniteAI.FortAthenaNpcEvaluator_FollowPatrolPath
// Size: 0x268
class UFortAthenaNpcEvaluator_FollowPatrolPath : public UFortAthenaAIBotEvaluator_Movement
{
	struct FName FollowPatrolPathKeyName; // 0x230 (0x4)
	struct FName FollowPatrolPathMovementStateKeyName; // 0x234 (0x4)
	struct FName FollowPatrolPathDestinationKeyName; // 0x238 (0x4)
	unsigned char unreflected_23c[0x8]; // 0x23c (0x8) 
	float ChanceToTakeABreak; // 0x244 (0x4)
	float BreakDurationMin; // 0x248 (0x4)
	float BreakDurationMax; // 0x24c (0x4)
	unsigned char padding_250[0x18]; // 0x250 (0x18)
};

