// Class /Script/FortniteAI.FortQueryTest_HasNearbyBuildings
// Size: 0x208
class UFortQueryTest_HasNearbyBuildings : public UEnvQueryTest
{
	unsigned char bIncludeCenter; // 0x1f8 (0x1)
	unsigned char bIncludeFloors; // 0x1f8 (0x1)
	unsigned char bIncludeFloorsAbove; // 0x1f8 (0x1)
	unsigned char bIncludeWalls; // 0x1f8 (0x1)
	unsigned char unreflected_1f9[0x3]; // 0x1f9 (0x3) 
	int ExtentXY; // 0x1fc (0x4)
	int ExtentZ; // 0x200 (0x4)
	unsigned char padding_204[0x4]; // 0x204 (0x4)
};

