// Class /Script/FortniteEngineLoadingScreen.FortniteUserInterfaceSettings
// Size: 0x580
class UFortniteUserInterfaceSettings : public UDeveloperSettings
{
	struct FRuntimeFloatCurve WidthScaleCurve; // 0x30 (0x88)
	struct FRuntimeFloatCurve HeightScaleCurve; // 0xb8 (0x88)
	struct FRuntimeFloatCurve WidthScaleCurveiOSInGame; // 0x140 (0x88)
	struct FRuntimeFloatCurve HeightScaleCurveiOSInGame; // 0x1c8 (0x88)
	struct FRuntimeFloatCurve WidthScaleCurveiOSFrontEnd; // 0x250 (0x88)
	struct FRuntimeFloatCurve HeightScaleCurveiOSFrontEnd; // 0x2d8 (0x88)
	struct FRuntimeFloatCurve WidthScaleCurveAndroidInGame; // 0x360 (0x88)
	struct FRuntimeFloatCurve HeightScaleCurveAndroidInGame; // 0x3e8 (0x88)
	struct FRuntimeFloatCurve WidthScaleCurveAndroidFrontEnd; // 0x470 (0x88)
	struct FRuntimeFloatCurve HeightScaleCurveAndroidFrontEnd; // 0x4f8 (0x88)
};

