// Class /Script/FortniteGame.FortVehicleDynAnimInstance_Ferret
// Size: 0x410
class UFortVehicleDynAnimInstance_Ferret : public UFortVehicleDynAnimInstance
{
	class AFortAthenaFerretVehicle* FerretVehicle; // 0x380 (0x8)
	struct FRotator BobbleHeadJiggle; // 0x388 (0x18)
	struct FRotator PaperJiggle; // 0x3a0 (0x18)
	struct FRotator CurrentDriveJiggleRandom; // 0x3b8 (0x18)
	struct FRotator CurrentDriveJiggleRandom2; // 0x3d0 (0x18)
	struct FRotator WingRotations; // 0x3e8 (0x18)
	float WingJiggleAlpha; // 0x400 (0x4)
	unsigned char padding_404[0xc]; // 0x404 (0xc)
};

