// Class /Script/FortniteGame.FortClientSettingsRecord
// Size: 0x11d8
class UFortClientSettingsRecord : public UFortGenericRecord
{
	struct FFortGamepadUserOptions LocalGamepadUserOptions; // 0xe0 (0x4c)
	unsigned char unreflected_12c[0x1]; // 0x12c (0x1) 
	bool bHighResTexturesReminderEnabled; // 0x12d (0x1)
	unsigned char unreflected_12e[0x1fa]; // 0x12e (0x1fa) 
	float HUDScale; // 0x328 (0x4)
	unsigned char unreflected_32c[0x4]; // 0x32c (0x4) 
	float InitialHUDScale; // 0x330 (0x4)
	bool bAutoHideBuildingMaterials; // 0x334 (0x1)
	enum EFortRarity ShowPickupDotsOnMapByRarity; // 0x335 (0x1)
	unsigned char unreflected_336[0x2]; // 0x336 (0x2) 
	struct FFortGamepadUserOptions GamepadUserOptions; // 0x338 (0x4c)
	unsigned char unreflected_384[0x4]; // 0x384 (0x4) 
	struct FVector2D GamepadLookSensitivity; // 0x388 (0x10)
	float GamepadMoveStickDeadZone; // 0x398 (0x4)
	float GamepadLookStickDeadZone; // 0x39c (0x4)
	bool bCustomKeyboardDiagonals; // 0x3a0 (0x1)
	unsigned char unreflected_3a1[0x3]; // 0x3a1 (0x3) 
	float KeyboardForwardDiagonal; // 0x3a4 (0x4)
	float KeyboardStrafeDiagonal; // 0x3a8 (0x4)
	float KeyboardBackwardDiagonal; // 0x3ac (0x4)
	float TargetingSlow; // 0x3b0 (0x4)
	float ScopedSlow; // 0x3b4 (0x4)
	float GamepadTargetingSlow; // 0x3b8 (0x4)
	float GamepadScopedSlow; // 0x3bc (0x4)
	float GamepadBuildingMultiplier; // 0x3c0 (0x4)
	float GamepadEditModeMultiplier; // 0x3c4 (0x4)
	float MotionTargetingSlow; // 0x3c8 (0x4)
	float MotionScopedSlow; // 0x3cc (0x4)
	float MotionHarvestingToolSlow; // 0x3d0 (0x4)
	float MouseSensitivity; // 0x3d4 (0x4)
	float MouseSensitivityX; // 0x3d8 (0x4)
	float MouseSensitivityY; // 0x3dc (0x4)
	float MouseSensitivityMultiplierForAircraftValue; // 0x3e0 (0x4)
	float InitialMouseSensitivityMultiplierForAircraft; // 0x3e4 (0x4)
	float TouchLookAccelerationMultiplier; // 0x3e8 (0x4)
	float TouchLookSensitivitySetting; // 0x3ec (0x4)
	float TouchTargetingSlow; // 0x3f0 (0x4)
	float TouchScopedSlow; // 0x3f4 (0x4)
	float TouchBuildingMultiplier; // 0x3f8 (0x4)
	float TouchEditModeMultiplier; // 0x3fc (0x4)
	float TouchVerticalMultiplier; // 0x400 (0x4)
	bool bMotionControlsEnabled; // 0x404 (0x1)
	enum EFortMotionYawAxis MotionYawAxis; // 0x405 (0x1)
	enum EFortMotionYawAxis MotionYawAxisMobile; // 0x406 (0x1)
	enum EGyroSpace GyroSpaceAttached; // 0x407 (0x1)
	enum EGyroSpace GyroSpaceDetached; // 0x408 (0x1)
	enum EAxisDirection GyroV2YawDirection; // 0x409 (0x1)
	enum EAxisDirection GyroV2PitchDirection; // 0x40a (0x1)
	enum EAxisDirection GyroV2RollDirection; // 0x40b (0x1)
	bool bGyroAdvancedSettingsEnabled; // 0x40c (0x1)
	bool bGyroUseZoomSensitivityScaling; // 0x40d (0x1)
	enum EGyroAcceleration GyroAccelerationMode; // 0x40e (0x1)
	unsigned char unreflected_40f[0x1]; // 0x40f (0x1) 
	float GyroSensitivity; // 0x410 (0x4)
	float GyroV2Sensitivity; // 0x414 (0x4)
	float GyroV2TargetingMultiplier; // 0x418 (0x4)
	float GyroV2ScopedMultiplier; // 0x41c (0x4)
	float GyroV2HarvestingMultiplier; // 0x420 (0x4)
	float GyroV2BuildingMultiplier; // 0x424 (0x4)
	float GyroV2EditingMultiplier; // 0x428 (0x4)
	enum EGyroActiveMode GyroActiveMode; // 0x42c (0x1)
	enum EGyroActiveBuildMode GyroActiveBuildMode; // 0x42d (0x1)
	enum EGyroStickMode GyroStickMode; // 0x42e (0x1)
	enum EGyroTouchMode GyroTouchMode; // 0x42f (0x1)
	bool GyroStickDisables; // 0x430 (0x1)
	bool GyroAimAssist; // 0x431 (0x1)
	enum EJoyConMotionSelection JoyConMotionSelection; // 0x432 (0x1)
	enum EGyroButtonResponse GyroButtonModeX; // 0x433 (0x1)
	enum EGyroButtonResponse GyroButtonModeY; // 0x434 (0x1)
	unsigned char unreflected_435[0x3]; // 0x435 (0x3) 
	float GyroAccelerationMultiplier; // 0x438 (0x4)
	float GyroAccelerationMinThreshold; // 0x43c (0x4)
	float GyroAccelerationMaxThreshold; // 0x440 (0x4)
	float GyroVerticalMultiplier; // 0x444 (0x4)
	float GyroSteadyingThreshold; // 0x448 (0x4)
	float GyroSmoothingThreshold; // 0x44c (0x4)
	float GyroSmoothingWindow; // 0x450 (0x4)
	float GyroDeadZone; // 0x454 (0x4)
	float GyroTighteningThreshold; // 0x458 (0x4)
	float GyroTrackballDecay; // 0x45c (0x4)
	float GyroButtonHoldTime; // 0x460 (0x4)
	bool bGyroDisabledWhileDriving; // 0x464 (0x1)
	bool bGyroVibrationConpensation; // 0x465 (0x1)
	unsigned char unreflected_466[0x2]; // 0x466 (0x2) 
	struct FString ControllerPlatform; // 0x468 (0x10)
	struct FString InputKBMPresetNameForCampaign; // 0x478 (0x10)
	struct FString InputKBMPresetNameForAthena; // 0x488 (0x10)
	struct FString InputPresetNameForCampaign; // 0x498 (0x10)
	struct FString InputPresetNameForAthena; // 0x4a8 (0x10)
	struct FString InputPresetNameForAthenaMobile; // 0x4b8 (0x10)
	struct FString InputTemplatePresetNameForCampaign; // 0x4c8 (0x10)
	struct FString InputTemplatePresetNameForAthena; // 0x4d8 (0x10)
	float XboxSafeZone; // 0x4e8 (0x4)
	unsigned char unreflected_4ec[0x4]; // 0x4ec (0x4) 
	struct FString PendingCulture; // 0x4f0 (0x10)
	unsigned char unreflected_500[0x8]; // 0x500 (0x8) 
	struct TArray<struct FFortActionKeyMapping> UserActionBindings; // 0x508 (0x10)
	struct TMap<enum ESubGame, struct FUserActionBindings> UserBindingsPerSubGame; // 0x518 (0x50)
	struct TArray<struct FFortActionKeyMapping> DisabledActionBindings; // 0x568 (0x10)
	struct TArray<struct FFortActionKeyMapping> CustomGamepadActionBindings; // 0x578 (0x10)
	struct TMap<struct FName, struct FFortUserInputSettingsPerMode> UserInputSettingsPerMode; // 0x588 (0x50)
	struct FName InputConfigName; // 0x5d8 (0x4)
	unsigned char unreflected_5dc[0x4]; // 0x5dc (0x4) 
	struct FFortCustomKeybindingProfileContainer CustomKeybindingProfileContainer; // 0x5e0 (0x10)
	bool bInvertedLook; // 0x5f0 (0x1)
	bool bInvertedLookMobile; // 0x5f1 (0x1)
	bool bInvertedPitchForMotion; // 0x5f2 (0x1)
	bool bInvertedPitchForAircraftPrimary; // 0x5f3 (0x1)
	bool bInvertedPitchForAircraftSecondary; // 0x5f4 (0x1)
	bool bInvertedYaw; // 0x5f5 (0x1)
	bool bInvertedYawMobile; // 0x5f6 (0x1)
	bool bInvertedYawForMotion; // 0x5f7 (0x1)
	bool bTankKBMCameraControls; // 0x5f8 (0x1)
	bool bTankGamepadCameraControls; // 0x5f9 (0x1)
	bool bToggleSprint; // 0x5fa (0x1)
	bool bToggleSprintMobile; // 0x5fb (0x1)
	bool bTapInteractEnabled; // 0x5fc (0x1)
	enum ETouchInteractMode TouchInteractionMode; // 0x5fd (0x1)
	bool bTargetingToggleable; // 0x5fe (0x1)
	bool bTargetingToggleableMobile; // 0x5ff (0x1)
	bool bAutoEquipBetterItems; // 0x600 (0x1)
	bool bAimAssistEnabled; // 0x601 (0x1)
	bool bTouchAimAssistEnabled; // 0x602 (0x1)
	bool bTouchEditEnabled; // 0x603 (0x1)
	bool bEditConfirmOnReleaseEnabled; // 0x604 (0x1)
	bool bSmartBuildEnabled; // 0x605 (0x1)
	bool bQuickEditEnabled; // 0x606 (0x1)
	bool bForceFeedbackEnabled; // 0x607 (0x1)
	bool bTriggerHapticsEnabled; // 0x608 (0x1)
	bool bTriggerPullUsesHapticThreshold; // 0x609 (0x1)
	unsigned char TriggerHapticStrength; // 0x60a (0x1)
	unsigned char TriggerHapticStartPosition; // 0x60b (0x1)
	bool bMoveStickAcceleratesVehicles; // 0x60c (0x1)
	bool bDeviceFeedbackBlockedWithAttachedController; // 0x60d (0x1)
	bool bContextTutorialEnabled; // 0x60e (0x1)
	bool bBuildingPossessionShown; // 0x60f (0x1)
	bool bLocalNotificationsEnabled; // 0x610 (0x1)
	bool bUseFirstPersonCamera; // 0x611 (0x1)
	bool bUseGamepadEditModeAimAssist; // 0x612 (0x1)
	bool bUseHoldToSwapPickup; // 0x613 (0x1)
	bool bUseFollowCamera; // 0x614 (0x1)
	bool bUseAutoCenter; // 0x615 (0x1)
	bool bUseGamepadAutoRun; // 0x616 (0x1)
	bool bFlickStickEnabled; // 0x617 (0x1)
	float FlickTime; // 0x618 (0x4)
	float FlickStickSmoothingThreshold; // 0x61c (0x4)
	float FlickStickWindingSpeed; // 0x620 (0x4)
	bool bScaleWindingWithZoom; // 0x624 (0x1)
	unsigned char unreflected_625[0x3]; // 0x625 (0x3) 
	float FlickStickDeadZoneFactor; // 0x628 (0x4)
	float FlickForwardDeadZone; // 0x62c (0x4)
	bool bFocusOnFirstBuildingPieceWhenQuickbarSwapped; // 0x630 (0x1)
	bool bNewFocusOnFirstBuildingPieceWhenQuickbarSwapped; // 0x631 (0x1)
	bool bFocusOnFirstBuildingPieceWhenQuickbarSwappedAthena; // 0x632 (0x1)
	bool bNewFocusOnFirstBuildingPieceWhenQuickbarSwappedAthena; // 0x633 (0x1)
	bool bDisablePreEditsWhenPlacingBuilding; // 0x634 (0x1)
	bool bTurboBuild; // 0x635 (0x1)
	bool bTurboBuildMobile; // 0x636 (0x1)
	bool bCreativeTurboDelete; // 0x637 (0x1)
	bool bAutoChangeMaterial; // 0x638 (0x1)
	bool bAutoChangeMaterialMobile; // 0x639 (0x1)
	bool bAutoOpenDoors; // 0x63a (0x1)
	bool bAutoOpenDoorsNonMobile; // 0x63b (0x1)
	bool bAutoClamber; // 0x63c (0x1)
	bool bShowClamberIndicator; // 0x63d (0x1)
	bool bAutoHurdle; // 0x63e (0x1)
	bool bAutoPickupWeapons; // 0x63f (0x1)
	bool bAutoPickupWeaponsConsolePC; // 0x640 (0x1)
	bool bEnablePreferredItemSlots; // 0x641 (0x1)
	bool bAutoSortConsumablesToRight; // 0x642 (0x1)
	bool bEnableTryBuildOnFocus; // 0x643 (0x1)
	unsigned char unreflected_644[0x4]; // 0x644 (0x4) 
	struct TArray<struct FName> SubscriptionNotificationsViewed; // 0x648 (0x10)
	float EditButtonHoldTime; // 0x658 (0x4)
	float SlideButtonHoldTime; // 0x65c (0x4)
	float CameraResetTime; // 0x660 (0x4)
	enum ECameraResetAxes CameraResetAxes; // 0x664 (0x1)
	bool bUnlockConsoleFPS; // 0x665 (0x1)
	bool bConsoleFPS60; // 0x666 (0x1)
	unsigned char unreflected_667[0x1]; // 0x667 (0x1) 
	struct TMap<struct FGameplayTag, bool> UserHUDVisibiltyMappings; // 0x668 (0x50)
	struct TMap<struct FGameplayTag, bool> UserHUDDefaultMappings; // 0x6b8 (0x50)
	struct TMap<int, enum EFortPreferredItemSlotItemType> UserHUDQuickbarSlotPreferredItemTypes; // 0x708 (0x50)
	enum EPartyType LastPartyType; // 0x758 (0x1)
	bool bLastLeaderInvitesOnly; // 0x759 (0x1)
	bool bLastLeaderFriendsOnly; // 0x75a (0x1)
	bool bAudioVolumesInitialized; // 0x75b (0x1)
	float MasterVolume; // 0x75c (0x4)
	float MusicVolume; // 0x760 (0x4)
	float SoundFXVolume; // 0x764 (0x4)
	float PIPVolume; // 0x768 (0x4)
	float DialogVolume; // 0x76c (0x4)
	float ChatVolume; // 0x770 (0x4)
	float CinematicsVolume; // 0x774 (0x4)
	bool bEnableSubtitles; // 0x778 (0x1)
	enum ESubtitleDisplayTextSize SubtitleTextSize; // 0x779 (0x1)
	enum ESubtitleDisplayTextColor SubtitleTextColor; // 0x77a (0x1)
	enum ESubtitleDisplayTextBorder SubtitleTextBorder; // 0x77b (0x1)
	enum ESubtitleDisplayBackgroundOpacity SubtitleBackgroundOpacity; // 0x77c (0x1)
	enum ESocialCommsPermission VoiceChatSetting; // 0x77d (0x1)
	bool bEnableVoiceChat; // 0x77e (0x1)
	bool bEnableVoiceChat3D; // 0x77f (0x1)
	bool bEnableVoiceChatPTT; // 0x780 (0x1)
	bool bEnableHousepartyCasting; // 0x781 (0x1)
	bool bEnablePeripheralLighting; // 0x782 (0x1)
	bool bShowViewerCount; // 0x783 (0x1)
	bool bAnonymousMode; // 0x784 (0x1)
	bool bAnonymousCharacterMode; // 0x785 (0x1)
	bool bShowSeasonLevel; // 0x786 (0x1)
	bool bHideOtherPlayerNames; // 0x787 (0x1)
	int HiddenMatchmakingDelayMaxSeconds; // 0x788 (0x4)
	bool bReplayRecordingIndicatorEnabled; // 0x78c (0x1)
	bool bReplayRecordingEnabled; // 0x78d (0x1)
	bool bLargeTeamReplayRecordingEnabled; // 0x78e (0x1)
	bool bCreativeModeReplayRecordingEnabled; // 0x78f (0x1)
	bool bHighQualityReplayRecordingEnabled; // 0x790 (0x1)
	bool bShadowPlayHighlightsEnabled; // 0x791 (0x1)
	bool bPlaceDangerMarkerWhenTargeting; // 0x792 (0x1)
	bool bShowGlobalChatEnabled; // 0x793 (0x1)
	float InitialGammaValue; // 0x794 (0x4)
	bool bInitialUseTapToShoot; // 0x798 (0x1)
	bool bInitialAutoOpenDoors; // 0x799 (0x1)
	bool bInitialAutoPickupWeapons; // 0x79a (0x1)
	bool bInitialAutoPickupWeaponsConsolePC; // 0x79b (0x1)
	bool bInitialEnablePreferredItemSlots; // 0x79c (0x1)
	bool bInitialAutoSortConsumablesToRight; // 0x79d (0x1)
	bool bInitialEnableTryBuildOnFocus; // 0x79e (0x1)
	unsigned char unreflected_79f[0x1]; // 0x79f (0x1) 
	float InitialEditButtonHoldTime; // 0x7a0 (0x4)
	float InitialSlideButtonHoldTime; // 0x7a4 (0x4)
	bool bStWQuickbarUpdated; // 0x7a8 (0x1)
	bool bShouldShowBothQuickbars; // 0x7a9 (0x1)
	enum ELicensedAudioTreatment LicensedAudioTreatment; // 0x7aa (0x1)
	enum EColorBlindMode ColorBlindMode; // 0x7ab (0x1)
	float ColorBlindStrength; // 0x7ac (0x4)
	bool bVisualizeAudioSources; // 0x7b0 (0x1)
	enum EColorBlindMode InitialColorBlindMode; // 0x7b1 (0x1)
	unsigned char unreflected_7b2[0x2]; // 0x7b2 (0x2) 
	float InitialColorBlindStrength; // 0x7b4 (0x4)
	bool bIgnoreGamepadInput; // 0x7b8 (0x1)
	bool bInitialIgnoreGamepadInput; // 0x7b9 (0x1)
	bool bLockPrimaryInputMethodToMouse; // 0x7ba (0x1)
	bool bLockPrimaryInputMethodToMouseInitial; // 0x7bb (0x1)
	bool bEnableRudderControl; // 0x7bc (0x1)
	unsigned char unreflected_7bd[0x3]; // 0x7bd (0x3) 
	float RudderDeadZone; // 0x7c0 (0x4)
	float RudderMaxThrottle; // 0x7c4 (0x4)
	bool bDoNotRemindAboutMultiSubs; // 0x7c8 (0x1)
	unsigned char unreflected_7c9[0x7]; // 0x7c9 (0x7) 
	struct FString SelectedRegionId; // 0x7d0 (0x10)
	struct FString PrevSavedRegion; // 0x7e0 (0x10)
	struct FString LastKnownBestRegionId; // 0x7f0 (0x10)
	int CrossplayPreference; // 0x800 (0x4)
	unsigned char unreflected_804[0x4]; // 0x804 (0x4) 
	struct TSet<enum EFortInventoryCustomFilter> CustomInventoryFilterSet; // 0x808 (0x50)
	struct TArray<struct FName> WatchedVideoIDs; // 0x858 (0x10)
	bool bHasMigratedCCSSettings; // 0x868 (0x1)
	unsigned char unreflected_869[0x3]; // 0x869 (0x3) 
	int InitializeKWSWithCCSSettings; // 0x86c (0x4)
	int CurrentDeltaUpdateKWSWithCCSSettings; // 0x870 (0x4)
	int SeenReviewSettingsModal; // 0x874 (0x4)
	int SeenParentalControlsUpdatedModal; // 0x878 (0x4)
	int SeenEnterCabinModeModal; // 0x87c (0x4)
	bool bAllowAudioInBackground; // 0x880 (0x1)
	enum EFortAllowBackgroundAudioSetting AllowAudioInBackground; // 0x881 (0x1)
	bool bUsePowerSavingMode; // 0x882 (0x1)
	bool bHidePerkRecombobulatorHelp; // 0x883 (0x1)
	bool bHideStwItemRefundHelp; // 0x884 (0x1)
	enum EAndroidAppStoreTypes SelectedAndroidAppStore; // 0x885 (0x1)
	unsigned char unreflected_886[0x2]; // 0x886 (0x2) 
	int AndroidStoreSelectionRevision; // 0x888 (0x4)
	bool bHasDisabledAutoSlottingOfSurvivorSquadsAfterQuest; // 0x88c (0x1)
	bool bHasEnabledAutoSlottingOfSurvivorSquadsDuringOnboarding; // 0x88d (0x1)
	bool bWantsAutoSlottingOfSurvivorSquads; // 0x88e (0x1)
	unsigned char unreflected_88f[0x1]; // 0x88f (0x1) 
	struct TArray<struct FHUDLayoutData> CustomHUDLayoutData; // 0x890 (0x10)
	struct FFireModeData FireModeData; // 0x8a0 (0x5)
	bool bRequiresHUDConversion; // 0x8a5 (0x1)
	unsigned char unreflected_8a6[0x2]; // 0x8a6 (0x2) 
	struct FFortMobileHUDProfileContainer HUDProfileContainer; // 0x8a8 (0x28)
	enum EQuestMapScreenMode QuestMapMode; // 0x8d0 (0x1)
	unsigned char unreflected_8d1[0x7]; // 0x8d1 (0x7) 
	struct FString QuestMapEventName; // 0x8d8 (0x10)
	bool bAutoJoinGameServerChannel; // 0x8e8 (0x1)
	bool bEnablePartyVoiceChannel; // 0x8e9 (0x1)
	bool bEnableGameVoiceChannel; // 0x8ea (0x1)
	bool bAllowSidekickFeature1; // 0x8eb (0x1)
	bool bShowVoiceIndicatorsNotifications; // 0x8ec (0x1)
	unsigned char unreflected_8ed[0x3]; // 0x8ed (0x3) 
	struct TSet<struct FString> SeenEventFlags; // 0x8f0 (0x50)
	struct TMap<int, int> ContextTutorialSeenCount; // 0x940 (0x50)
	struct TMap<struct FGameplayTag, int> ContextTutorialSeenCountGameplayTag; // 0x990 (0x50)
	bool bHasCompletedGuidedTutorial; // 0x9e0 (0x1)
	unsigned char unreflected_9e1[0x7]; // 0x9e1 (0x7) 
	struct TArray<enum EKWSSetttingIndividalMigration> KWSSettingAlreadyMigrated; // 0x9e8 (0x10)
	int CapMipsExperimentVersion; // 0x9f8 (0x4)
	bool bHasCompletedHUDLayoutToolV2Tutorial; // 0x9fc (0x1)
	bool FortClientSettingRecord; // 0x9fd (0x1)
	enum EHitNumbersMode HitNumbersMode; // 0x9fe (0x1)
	enum EHitFeedbackMode HitFeedbackMode; // 0x9ff (0x1)
	bool bTargetTypeIndicatorVisible; // 0xa00 (0x1)
	bool bShowTemperature; // 0xa01 (0x1)
	bool bNotifyUsersWhenPlaying; // 0xa02 (0x1)
	unsigned char unreflected_a03[0x1]; // 0xa03 (0x1) 
	bool bPlayerSurveysAllowed; // 0xa04 (0x1)
	bool bClipRemindersEnabled; // 0xa05 (0x1)
	enum EPostpartyClippingState PostpartyClippingState; // 0xa06 (0x1)
	unsigned char unreflected_a07[0x1]; // 0xa07 (0x1) 
	struct FDateTime* FlagSelectionLastUpdated; // 0xa08 (0x8)
	bool bUseSmallInventoryTiles; // 0xa10 (0x1)
	unsigned char unreflected_a11[0x7]; // 0xa11 (0x7) 
	struct TMap<unsigned char, uint32_t> LastSeenHashByShopSection; // 0xa18 (0x50)
	struct TMap<struct FName, uint32_t> LastSeenHashByShopSectionId; // 0xa68 (0x50)
	struct FDateTime* LastTokenRefreshDateNotified; // 0xab8 (0x8)
	bool HasSeenCommunityVotingTutorial; // 0xac0 (0x1)
	unsigned char unreflected_ac1[0x3]; // 0xac1 (0x3) 
	int LastSeenCommunityVotingTutorialVersion; // 0xac4 (0x4)
	struct FString LastSeenCommunityVotingVersion; // 0xac8 (0x10)
	struct FString LastSeenStandaloneOfferId; // 0xad8 (0x10)
	struct TMap<enum EFortAutoMulchCategory, enum EFortAutoMulchMode> AutoMulchModeMap; // 0xae8 (0x50)
	struct TArray<struct FPlayerLastSelectedPreferredProvider> LastPlayerSelectedPreferredProvider; // 0xb38 (0x10)
	unsigned char QuestListSortType; // 0xb48 (0x1)
	unsigned char unreflected_b49[0x3]; // 0xb49 (0x3) 
	struct FGameplayTag QuestScreenTabGameplayTag; // 0xb4c (0x4)
	unsigned char InZoneMapScreenTab; // 0xb50 (0x1)
	unsigned char unreflected_b51[0x7]; // 0xb51 (0x7) 
	struct TSet<int> AttendingSocialEventIds; // 0xb58 (0x50)
	struct TArray<struct FString> EventAttendance; // 0xba8 (0x10)
	struct TSet<struct FString> LastSubscriptionIds; // 0xbb8 (0x50)
	struct FDateTime* LastMultiSubRenewalDate; // 0xc08 (0x8)
	struct FGameplayTagContainer SeenOnboardingTutorials; // 0xc10 (0x20)
	int8_t NumDiscoveryFlowTooltipsRemaining; // 0xc30 (0x1)
	bool bAutoExposureEnabled; // 0xc31 (0x1)
	unsigned char unreflected_c32[0x2]; // 0xc32 (0x2) 
	float ManualExposureBias; // 0xc34 (0x4)
	float FocalLength; // 0xc38 (0x4)
	float Aperture; // 0xc3c (0x4)
	bool bAutoFocusEnabled; // 0xc40 (0x1)
	unsigned char unreflected_c41[0x3]; // 0xc41 (0x3) 
	float ManualFocusDistance; // 0xc44 (0x4)
	bool bPlayerOutlinesEnabled; // 0xc48 (0x1)
	bool bFirstPlaceHighlightEnabled; // 0xc49 (0x1)
	bool bStormEffectsEnabled; // 0xc4a (0x1)
	unsigned char unreflected_c4b[0x1]; // 0xc4b (0x1) 
	float SafeZoneOpacity; // 0xc4c (0x4)
	bool bRelevancyZoneVisible; // 0xc50 (0x1)
	bool bHighQualityFxEnabled; // 0xc51 (0x1)
	bool bDamageFxEnabled; // 0xc52 (0x1)
	enum EThirdPersonAutoFollowMode ThirdPersonAutoFollowMode; // 0xc53 (0x1)
	float ThirdPersonDistanceToSubject; // 0xc54 (0x4)
	bool bThirdPersonCameraCollision; // 0xc58 (0x1)
	bool bShareLensSettings; // 0xc59 (0x1)
	bool bDroneIgnoreJump; // 0xc5a (0x1)
	bool bShowSessionIDWatermark; // 0xc5b (0x1)
	bool bBattleMapShowTimeIndicator; // 0xc5c (0x1)
	bool bBattleMapShowNearbyChests; // 0xc5d (0x1)
	bool bBattleMapShowAllSquadMembers; // 0xc5e (0x1)
	bool bBattleMapAutomaticCameraPlacement; // 0xc5f (0x1)
	bool bNamePlatesEnabled; // 0xc60 (0x1)
	bool bShowTeamColor; // 0xc61 (0x1)
	unsigned char unreflected_c62[0x2]; // 0xc62 (0x2) 
	float ViewDistance; // 0xc64 (0x4)
	float LowDetailDistance; // 0xc68 (0x4)
	float ArrowDistance; // 0xc6c (0x4)
	bool bScalingOptionsEnabled; // 0xc70 (0x1)
	unsigned char unreflected_c71[0x3]; // 0xc71 (0x3) 
	float HighDetailScaleMin; // 0xc74 (0x4)
	float HighDetailScaleMax; // 0xc78 (0x4)
	float LowDetailScaleMin; // 0xc7c (0x4)
	float LowDetailScaleMax; // 0xc80 (0x4)
	float ArrowScaleMin; // 0xc84 (0x4)
	float ArrowScaleMax; // 0xc88 (0x4)
	bool bArrowColorEnabled; // 0xc8c (0x1)
	bool bDisplaySessionRank; // 0xc8d (0x1)
	enum ESpectatorSquadIdMode SquadIdMode; // 0xc8e (0x1)
	unsigned char unreflected_c8f[0x1]; // 0xc8f (0x1) 
	struct TMap<struct FString, struct FString> MediaPartnerData; // 0xc90 (0x50)
	struct TArray<struct FString> HotTamalesWithVeggiesCache; // 0xce0 (0x10)
	bool bDirty; // 0xcf0 (0x1)
	unsigned char unreflected_cf1[0x3]; // 0xcf1 (0x3) 
	unsigned char bSaveToCloud; // 0xcf4 (0x1)
	unsigned char unreflected_cf5[0x3]; // 0xcf5 (0x3) 
	enum ECloudFileState CloudFileState; // 0xcf8 (0x1)
	unsigned char unreflected_cf9[0x3]; // 0xcf9 (0x3) 
	uint32_t bDisableCloudSave; // 0xcfc (0x4)
	int LastRequestSaveCount; // 0xd00 (0x4)
	int LastAttemptedSaveCount; // 0xd04 (0x4)
	double LastSaveAttemptTime; // 0xd08 (0x8)
	double NextCloudSaveTime; // 0xd10 (0x8)
	unsigned char unreflected_d18[0x448]; // 0xd18 (0x448) 
	struct TArray<struct FSettingsSaveContextBehaviorDefinition> ContextBehaviorDefinitions; // 0x1160 (0x10)
	unsigned char unreflected_1170[0x50]; // 0x1170 (0x50) 
	struct FSettingsSaveContextBehaviorDefinition DefaultContextBehaviorDefinition; // 0x11c0 (0x18)

	/* Functions */

	// Function /Script/FortniteGame.FortClientSettingsRecord.SetVoiceChatSettings (Underlying native function: SetVoiceChatSettings 0x88aa1cc)
	void SetVoiceChatSettings(enum ESocialCommsPermission& InSetting); // (Final | 0x00000002 | Native | Public)

	// Function /Script/FortniteGame.FortClientSettingsRecord.SetVoiceChatPTTEnabled (Underlying native function: SetVoiceChatPTTEnabled 0x88aa134)
	void SetVoiceChatPTTEnabled(bool& bEnable); // (Final | 0x00000002 | Native | Public)

	// Function /Script/FortniteGame.FortClientSettingsRecord.SetVoiceChat3DEnabled (Underlying native function: SetVoiceChat3DEnabled 0x88aa09c)
	void SetVoiceChat3DEnabled(bool& bEnable); // (Final | 0x00000002 | Native | Public)

	// Function /Script/FortniteGame.FortClientSettingsRecord.SetVisualizeAudioSources (Underlying native function: SetVisualizeAudioSources 0x88aa010)
