// Class /Script/FortniteGame.FortVehicleAimingWeaponComp
// Size: 0x338
class UFortVehicleAimingWeaponComp : public UFortVehicleSeatWeaponComponent
{
	bool bShouldResetCameraHorizontallyToBarrelWhenEntered; // 0x1d8 (0x1)
	bool bShouldResetCameraVerticallyToBarrelWhenEntered; // 0x1d9 (0x1)
	unsigned char unreflected_1da[0x2]; // 0x1da (0x2) 
	float StartCameraResetToBarrelTime; // 0x1dc (0x4)
	bool bAllowCameraLocalVerticalRotationOnly; // 0x1e0 (0x1)
	unsigned char unreflected_1e1[0x3]; // 0x1e1 (0x3) 
	float AimBlendInSpeed; // 0x1e4 (0x4)
	float AimBlendOutSpeed; // 0x1e8 (0x4)
	bool bSetDesiredPitchWhenUnmanned; // 0x1ec (0x1)
	bool bSetDesiredYawWhenUnmanned; // 0x1ed (0x1)
	bool bUseGlobalOnlyAiming; // 0x1ee (0x1)
	unsigned char unreflected_1ef[0x1]; // 0x1ef (0x1) 
	struct FVector LocalAimOffsetWhenPitchedUp; // 0x1f0 (0x18)
	struct FVector LocalAimOffsetWhenPitchedFlat; // 0x208 (0x18)
	struct FVector LocalAimOffsetWhenPitchedDown; // 0x220 (0x18)
	float RotCyclesPerFullTurnHoriz; // 0x238 (0x4)
	float RotCyclesPerFullTurnVert; // 0x23c (0x4)
	bool bCorrectAimFromCameraToMuzzle; // 0x240 (0x1)
	bool bUseClientMuzzleLocationAuthority; // 0x241 (0x1)
	unsigned char unreflected_242[0x2]; // 0x242 (0x2) 
	float YawDiffRemaining; // 0x244 (0x4)
	float PitchDiffRemaining; // 0x248 (0x4)
	bool bInterpolateAimToDesired; // 0x24c (0x1)
	unsigned char unreflected_24d[0x3]; // 0x24d (0x3) 
	float LastTickTime; // 0x250 (0x4)
	int TickCount; // 0x254 (0x4)
	float CameraAimBlendFactor; // 0x258 (0x4)
	unsigned char unreflected_25c[0x4]; // 0x25c (0x4) 
	struct FRotator TargetLocalAimOrientation; // 0x260 (0x18)
	struct FRotator TargetLocalAimOrientationCorrected; // 0x278 (0x18)
	struct FRotator CurrentLocalAimOrientation; // 0x290 (0x18)
	struct FRotator CurrentLocalAimOrientationCorrected; // 0x2a8 (0x18)
	struct FRotator TargetLocalAimOrientationRepped; // 0x2c0 (0x18)
	struct FRotator TargetLocalAimOrientationCorrectedRepped; // 0x2d8 (0x18)
	float UnmannedDesiredPitch; // 0x2f0 (0x4)
	float UnmannedDesiredYaw; // 0x2f4 (0x4)
	float HorizAimRotDelta; // 0x2f8 (0x4)
	float VertAimRotDelta; // 0x2fc (0x4)
	enum EFortAbilityTargetingSource AimSourceType; // 0x300 (0x1)
	bool bPlayerEnteredThisFrame; // 0x301 (0x1)
	bool bApplyOwnerRotationToAimWhenUnmanned; // 0x302 (0x1)
	unsigned char unreflected_303[0x1]; // 0x303 (0x1) 
	float MaxYawPerSecondThreshold; // 0x304 (0x4)
	float MaxPitchPerSecondThreshold; // 0x308 (0x4)
	float PitchConstraintAngleOffset; // 0x30c (0x4)
	float AimInterpSpeed; // 0x310 (0x4)
	float InitialCameraInterpSpeed; // 0x314 (0x4)
	float InitialCameraLerpTime; // 0x318 (0x4)
	float MinDistanceForCorrection; // 0x31c (0x4)
	struct FVector AnimatedMuzzleLocation; // 0x320 (0x18)

	/* Functions */

	// Function /Script/FortniteGame.FortVehicleAimingWeaponComp.ServerSetAnimatedMuzzleLocation (Underlying native function: ServerSetAnimatedMuzzleLocation 0x8fdbddc)
	void ServerSetAnimatedMuzzleLocation(struct FVector& NewValue); // (Final | Net | NetReliable | Native | Event | Private | NetServer | HasDefaults)

	// Function /Script/FortniteGame.FortVehicleAimingWeaponComp.OnRep_TargetLocalAimOrientationRepped (Underlying native function: OnRep_TargetLocalAimOrientationRepped 0x8fdbce4)
	void OnRepTargetLocalAimOrientationRepped(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortVehicleAimingWeaponComp.OnRep_TargetLocalAimOrientationCorrectedRepped (Underlying native function: OnRep_TargetLocalAimOrientationCorrectedRepped 0x8fdbc74)
	void OnRepTargetLocalAimOrientationCorrectedRepped(); // (Final | Native | Protected)
};

