// Class /Script/FortniteUI.FortEulaWidget
// Size: 0x540
class UFortEulaWidget : public UCommonActivatablePanelLegacy
{
	unsigned char unreflected_4e0[0x18]; // 0x4e0 (0x18) 
	class UClass* ConfirmButtonControllerStyle; // 0x4f8 (0x8)
	class UClass* ConfirmButtonMouseStyle; // 0x500 (0x8)
	class UClass* DeclineButtonControllerStyle; // 0x508 (0x8)
	class UClass* DeclineButtonMouseStyle; // 0x510 (0x8)
	class UCommonTextBlock* TextTitle; // 0x518 (0x8)
	class UFortRichTextBlockLegacy* TextDescription; // 0x520 (0x8)
	class UScrollBox* ScrollBoxLicense; // 0x528 (0x8)
	class UCommonButtonLegacy* ButtonConfirm; // 0x530 (0x8)
	class UCommonButtonLegacy* ButtonDecline; // 0x538 (0x8)
};

