// Class /Script/FortniteUI.FortArenaPersonalDivisionView
// Size: 0x758
class UFortArenaPersonalDivisionView : public UFortShowdownDivisionEventView
{
	class UFortLazyImage* ImageCurrentDivisionFancy; // 0x718 (0x8)
	class UFortLazyImage* ImageCurrentDivisionPlain; // 0x720 (0x8)
	class UProgressBar* BarDivisionProgress; // 0x728 (0x8)
	class UCommonTextBlock* CommonTextDivisionProgress; // 0x730 (0x8)
	class UFortLazyImage* ImageNextDivision; // 0x738 (0x8)
	class URichTextBlock* RichTextTitleName; // 0x740 (0x8)
	class UCommonTextBlock* CommonTextDivisionRank; // 0x748 (0x8)
	class UCommonTextBlock* CommonTextTotalHype; // 0x750 (0x8)
};

