// Class /Script/FortniteAI.FortAIHotSpotSlot
// Size: 0x130
class UFortAIHotSpotSlot : public UAIHotSpotSlot
{
	enum EFortHotSpotSlot SlotType; // 0x120 (0x1)
	unsigned char unreflected_121[0x3]; // 0x121 (0x3) 
	unsigned char bHasProjectedLocation; // 0x124 (0x1)
	unsigned char bProjectedOnLowArea; // 0x124 (0x1)
	unsigned char bIsAutoGenerated; // 0x124 (0x1)
	unsigned char bCanDuplicateOnProjection; // 0x124 (0x1)
	unsigned char bCanProjectUp; // 0x124 (0x1)
	unsigned char padding_125[0xb]; // 0x125 (0xb)
};

