// Class /Script/FortniteGame.FortFerretVehicleConfigs
// Size: 0xaf8
class UFortFerretVehicleConfigs : public UFortDoghouseVehicleConfigs
{
	float BounceCrouchTime; // 0xa38 (0x4)
	float BounceCrouchTimeDeadzone; // 0xa3c (0x4)
	float BounceRecoilTime; // 0xa40 (0x4)
	float BounceForcePerMass; // 0xa44 (0x4)
	float PassengerLeanMagnitude; // 0xa48 (0x4)
	float PassengerLeanMinMagnitude; // 0xa4c (0x4)
	float PassengerLeanLeftRightInterpolationPerSecond; // 0xa50 (0x4)
	float PassengerLeanUpInterpolationPerSecond; // 0xa54 (0x4)
	float PassengerLeanDownInterpolationPerSecond; // 0xa58 (0x4)
	float PassengerLeanResetInterpolationPerSecond; // 0xa5c (0x4)
	float PassengerLeanDeadzone; // 0xa60 (0x4)
	float BoostSteeringMultiplier; // 0xa64 (0x4)
	float BoostCooldown; // 0xa68 (0x4)
	float BoostSteeringMultiplierRampTime; // 0xa6c (0x4)
	float BoostSlowExtraStrength; // 0xa70 (0x4)
	float MinForwardSpeedBoostExtraStrength; // 0xa74 (0x4)
	float BoostTopSpeedForceMultiplier; // 0xa78 (0x4)
	float MinSpeedForWingTrails; // 0xa7c (0x4)
	float CameraShakeAmplitudeMin; // 0xa80 (0x4)
	float CameraShakeAmplitudeMax; // 0xa84 (0x4)
	float SpringFudgeFactor; // 0xa88 (0x4)
	float CameraShakeNormalizedSpeed; // 0xa8c (0x4)
	float CameraShakeSpeedCurvePow; // 0xa90 (0x4)
	float BoostingCameraShakeAmount; // 0xa94 (0x4)
	float BoostCameraShakeFrequency; // 0xa98 (0x4)
	float SmoothedSpringCompressionMin; // 0xa9c (0x4)
	float SmoothedSpringCompressionMax; // 0xaa0 (0x4)
	float ScreenShakeFrequencyMin; // 0xaa4 (0x4)
	float ScreenShakeFrequencyMax; // 0xaa8 (0x4)
	float PassengerCameraShakeMultiplier; // 0xaac (0x4)
	float ScreenShakeYawFrequencyMultiplier; // 0xab0 (0x4)
	struct FLinearColor WheelSlideBoostColorWhenNotPowerSliding; // 0xab4 (0x10)
	float TreadWidth; // 0xac4 (0x4)
	float RumbleMultiplier; // 0xac8 (0x4)
	float SparksRumbleMultiplier; // 0xacc (0x4)
	float BoostCameraOffset; // 0xad0 (0x4)
	float ADSCameraDistance; // 0xad4 (0x4)
	float PassengerCameraOffset; // 0xad8 (0x4)
	float ADSInterpSpeed; // 0xadc (0x4)
	struct FName LeftMuzzleSocketName; // 0xae0 (0x4)
	struct FName RightMuzzleSocketName; // 0xae4 (0x4)
	float MaxHealthToDestroyPropWithDirectHit; // 0xae8 (0x4)
	float ImpactScaleWhenBoosting; // 0xaec (0x4)
	float MaxAltitudeForWaterTest; // 0xaf0 (0x4)
	bool bUseBiplaneComponentsForProjectileOrigins; // 0xaf4 (0x1)
	bool bUseLTMBiplaneForReplayWeaponFX; // 0xaf5 (0x1)
	unsigned char padding_af6[0x2]; // 0xaf6 (0x2)
};

