// Class /Script/FortniteGame.FortPlayerAnimInstance_OstrichDriver
// Size: 0x1b20
class UFortPlayerAnimInstance_OstrichDriver : public UFortPlayerAnimInstance_OstrichOccupant
{
	float BouncePlayRateValue; // 0x1b08 (0x4)
	float LegsBounceAlphaValue; // 0x1b0c (0x4)
	float LegsBounceAlphaWhenSkytubing; // 0x1b10 (0x4)
	float LegsBounceAlphaNoSkytubing; // 0x1b14 (0x4)
	float LegsBounceAlphaInterpSpeed; // 0x1b18 (0x4)
	unsigned char bIsSkyTubing; // 0x1b1c (0x1)
	unsigned char bIsMechMoving2D; // 0x1b1c (0x1)
	unsigned char padding_1b1d[0x3]; // 0x1b1d (0x3)
};

