// Class /Script/FortniteGame.FortRegenHealthSet
// Size: 0x738
class UFortRegenHealthSet : public UFortHealthSet
{
	unsigned char unreflected_630[0x8]; // 0x630 (0x8) 
	struct FFortGameplayAttributeData HealthRegenRate; // 0x638 (0x28)
	struct FFortGameplayAttributeData HealthRegenDelay; // 0x660 (0x28)
	struct FFortGameplayAttributeData HealthRegenThreshold; // 0x688 (0x28)
	struct FFortGameplayAttributeData ShieldRegenRate; // 0x6b0 (0x28)
	struct FFortGameplayAttributeData ShieldRegenDelay; // 0x6d8 (0x28)
	struct FFortGameplayAttributeData ShieldRegenThreshold; // 0x700 (0x28)
	unsigned char padding_728[0x10]; // 0x728 (0x10)
};

