// Class /Script/FortniteGame.FortPlayerAnimInstance_OctopusDriver
// Size: 0x1c50
class UFortPlayerAnimInstance_OctopusDriver : public UFortPlayerAnimInstance
{
	struct FFortAnimInput_VelocityImpact VelocityImpact; // 0x1a18 (0xf0)
	struct FVector SeatLocation; // 0x1b08 (0x18)
	struct FRotator HandRotationOffset; // 0x1b20 (0x18)
	struct FRotator FootRotationOffset; // 0x1b38 (0x18)
	struct FRotator SeatRotationPose; // 0x1b50 (0x18)
	struct FVector HandAttachmentLocLeft; // 0x1b68 (0x18)
	struct FRotator HandAttachmentRotLeft; // 0x1b80 (0x18)
	struct FVector HandAttachmentLocRight; // 0x1b98 (0x18)
	struct FRotator HandAttachmentRotRight; // 0x1bb0 (0x18)
	struct FVector FootAttachmentLocLeft; // 0x1bc8 (0x18)
	struct FRotator FootAttachmentRotLeft; // 0x1be0 (0x18)
	struct FVector FootAttachmentLocRight; // 0x1bf8 (0x18)
	struct FRotator FootAttachmentRotRight; // 0x1c10 (0x18)
	enum EFortCardinalDirection PivotDir; // 0x1c28 (0x1)
	unsigned char unreflected_1c29[0x3]; // 0x1c29 (0x3) 
	float LowerVelocityTime; // 0x1c2c (0x4)
	float LowerVelocityDuration; // 0x1c30 (0x4)
	float FwdBwd; // 0x1c34 (0x4)
	float LeftRight; // 0x1c38 (0x4)
	float SeatSteerYaw; // 0x1c3c (0x4)
	float SeatSteerPitch; // 0x1c40 (0x4)
	float SeatSteerStrength; // 0x1c44 (0x4)
	unsigned char bIsLowerVelocity; // 0x1c48 (0x1)
	unsigned char bWasLowerVelocity; // 0x1c48 (0x1)
	unsigned char bShouldPlayGrappleFire; // 0x1c48 (0x1)
	unsigned char bShouldApplyLeanAdditive; // 0x1c48 (0x1)
	unsigned char bShouldPlayPivotTransition; // 0x1c48 (0x1)
	unsigned char bHasDriver; // 0x1c48 (0x1)
	unsigned char bIsBoosting; // 0x1c48 (0x1)
	unsigned char bWantsEastWestPivot; // 0x1c48 (0x1)
	unsigned char bWantsNorthSouthPivot; // 0x1c49 (0x1)
	unsigned char bIsVehicleInAir; // 0x1c49 (0x1)
	unsigned char bIsTowhookHolstered; // 0x1c49 (0x1)
	unsigned char bIsTowhookExtending; // 0x1c49 (0x1)
	unsigned char bIsTowhookAttached; // 0x1c49 (0x1)
	unsigned char bEnterMovingInPlace; // 0x1c49 (0x1)
	unsigned char padding_1c4a[0x6]; // 0x1c4a (0x6)
};

