// Class /Script/FortniteGame.FortContextualTutorialDefinition_WeaponAbility
// Size: 0x158
class UFortContextualTutorialDefinition_WeaponAbility : public UFortContextualTutorialDefinition
{
	struct FGameplayTagContainer WeaponTags; // 0x100 (0x20)
	struct FGameplayTag AbilityTag; // 0x120 (0x4)
	bool bTriggerOnAmmoCount; // 0x124 (0x1)
	unsigned char unreflected_125[0x3]; // 0x125 (0x3) 
	int TriggerAmmoCount; // 0x128 (0x4)
	bool bSuccessOnAmmoCount; // 0x12c (0x1)
	unsigned char unreflected_12d[0x3]; // 0x12d (0x3) 
	int SuccessAmmoCount; // 0x130 (0x4)
	unsigned char unreflected_134[0x4]; // 0x134 (0x4) 
	struct FGameplayTagContainer BlockedByTags; // 0x138 (0x20)
};

