// Class /Script/FortniteUI.FortMobileHUDLayoutToolV2_WidgetCatalog
// Size: 0x320
class UFortMobileHUDLayoutToolV2_WidgetCatalog : public UCommonUserWidget
{
	class UFortMobileHUDWidgetRegistry* HUDWidgetRegistry; // 0x290 (0x8)
	float PanelOpacityWhenDragedOver; // 0x298 (0x4)
	unsigned char unreflected_29c[0x4c]; // 0x29c (0x4c) 
	class UImage* ImageLayoutIcon; // 0x2e8 (0x8)
	class UCommonTextBlock* TextContextName; // 0x2f0 (0x8)
	class UHUDLayoutToolV2_Button* ButtonDisplayButtonPreviews; // 0x2f8 (0x8)
	class UHUDLayoutToolV2_Button* ButtonDisplayWidgetPreviews; // 0x300 (0x8)
	class UCommonActivatableWidgetSwitcher* SwitcherPreviews; // 0x308 (0x8)
	class UFortDynamicEntryBox* EntryBoxButtonPreviews; // 0x310 (0x8)
	class UFortDynamicEntryBox* EntryBoxWidgetPreviews; // 0x318 (0x8)
};

