// Class /Script/FortniteUI.FortSocialTab
// Size: 0x1490
class UFortSocialTab : public UCommonButtonLegacy
{
	class UTexture2D* TabIcon; // 0x1430 (0x8)
	struct FText TabName; // 0x1438 (0x18)
	struct FSlateColor InviteTintColor; // 0x1450 (0x14)
	unsigned char unreflected_1464[0x4]; // 0x1464 (0x4) 
	class UImage* ImageTabIcon; // 0x1468 (0x8)
	class UCommonTextBlock* TextTabName; // 0x1470 (0x8)
	class UCommonTextBlock* TextNumber; // 0x1478 (0x8)
	class UCommonTextBlock* TextBang; // 0x1480 (0x8)
	unsigned char padding_1488[0x8]; // 0x1488 (0x8)
};

