// Class /Script/FortniteGame.FortFirstPersonState
// Size: 0x58
class UFortFirstPersonState : public UObject
{
	float BlendAlpha; // 0x28 (0x4)
	float BlendWeight; // 0x2c (0x4)
	int HeadBoneIndex; // 0x30 (0x4)
	int AimedObjectBoneIndex; // 0x34 (0x4)
	int CameraBoneIndex; // 0x38 (0x4)
	int HandleBoneIndex; // 0x3c (0x4)
	bool bShouldOwnerBeVisible; // 0x40 (0x1)
	bool bShouldUpdatePlayerVisibility; // 0x41 (0x1)
	unsigned char padding_42[0x16]; // 0x42 (0x16)
};

