// Class /Script/FortniteUI.FortSocialInteractionMenu
// Size: 0x4a0
class UFortSocialInteractionMenu : public USocialInteractionMenu
{
	class UFortSocialNameTextBlock* TextSocialName; // 0x450 (0x8)
	class UCommonRichTextBlock* RichTextPlatformNames; // 0x458 (0x8)
	class UCommonRichTextBlock* TextPresence; // 0x460 (0x8)
	class UFortEditNicknameButton* ButtonEditNickname; // 0x468 (0x8)
	class UCommonTextBlock* TextErrorMessage; // 0x470 (0x8)
	class UCommonButtonLegacy* ButtonCancelEdit; // 0x478 (0x8)
	class UCommonButtonLegacy* ButtonDoneEdit; // 0x480 (0x8)
	unsigned char padding_488[0x18]; // 0x488 (0x18)
};

