// Class /Script/FortniteUI.FortServerBrowserListView
// Size: 0x398
class UFortServerBrowserListView : public UListViewBase
{
	unsigned char unreflected_260[0xd8]; // 0x260 (0xd8) 
	struct TEnumAsByte<EOrientation> Orientation; // 0x338 (0x1)
	unsigned char unreflected_339[0x3]; // 0x339 (0x3) 
	float EntrySpacing; // 0x33c (0x4)
	unsigned char unreflected_340[0x18]; // 0x340 (0x18) 
	class UClass* CreativeServerInfoTileEntryClass; // 0x358 (0x8)
	class UClass* ServerActionTileEntryClass; // 0x360 (0x8)
	class UClass* OwnServerActionTileEntryClass; // 0x368 (0x8)
	class UClass* PlaylistSelectionActionTileEntryClass; // 0x370 (0x8)
	unsigned char padding_378[0x20]; // 0x378 (0x20)
};

