// Class /Script/FortniteGame.FortSwimmingLayerAnimInstance
// Size: 0x9a0
class UFortSwimmingLayerAnimInstance : public UFortBaseLayerAnimInstance
{
	struct FCachedAnimRelevancyData SwimStartRelevancyData; // 0x440 (0x14)
	struct FCachedAnimRelevancyData SwimStartAdditiveRelevancyData; // 0x454 (0x14)
	struct FFortAnimInput_PlayerAnimAsset CurrentAnimSet; // 0x468 (0x200)
	struct FFortAnimInput_AdjustedAim AdjustedAim; // 0x668 (0x23c)
	unsigned char unreflected_8a4[0x4]; // 0x8a4 (0x4) 
	struct FVector SwimmingWaterSurfaceNormal; // 0x8a8 (0x18)
	struct FRotator SwimmingWaterSurfaceWorldRotation; // 0x8c0 (0x18)
	struct FRotator SwimmingMeleeTwistRotator; // 0x8d8 (0x18)
	struct FRotator SwimmingYawDeltaRotator; // 0x8f0 (0x18)
	struct FVector IdlePelvisOffset; // 0x908 (0x18)
	float PlayMeleeAttackAO; // 0x920 (0x4)
	float DisableArmsHeadAdditiveCurveAlpha; // 0x924 (0x4)
	float DisableIKRootAdditiveCurveAlpha; // 0x928 (0x4)
	float SwimmingYawDeltaRatePerSecond; // 0x92c (0x4)
	float SwimmingSpeedRelativeToFlow; // 0x930 (0x4)
	float SwimmingYawDeltaRatePerSecondSmooth; // 0x934 (0x4)
	float SwimmingYawDeltaRatePerSecondSmoothClamped; // 0x938 (0x4)
	float SwimmingSprintYawDeltaRatePerSecondSmooth; // 0x93c (0x4)
	float SwimmingDivePitch; // 0x940 (0x4)
	float SwimmingDivePitchDeltaRatePerSec; // 0x944 (0x4)
	float SwimmingVelocityAngle; // 0x948 (0x4)
	float SwimmingLocalAccelerationYawAngleSmooth; // 0x94c (0x4)
	float SwimmingNonZeroLocalAccelYawAngle; // 0x950 (0x4)
	float SwimmingResetStoppedDivingWhileUnderWaterTime; // 0x954 (0x4)
	float SwimmingNonTargetingBlendspaceDir; // 0x958 (0x4)
	float AbsYawDeltaSmoothed; // 0x95c (0x4)
	float LocalAccelYawAngle; // 0x960 (0x4)
	float SwimmingLayerAlpha; // 0x964 (0x4)
	float IdlePelvisOffsetAlpha; // 0x968 (0x4)
	float MeleeTwistCurveValue; // 0x96c (0x4)
	float DBNOTurnPlayRateAbs; // 0x970 (0x4)
	float SwimDiveJumpLayerAlpha; // 0x974 (0x4)
	float SwimmingDiveJumpingBlendOutTime; // 0x978 (0x4)
	float ADSToNonADSBlendTime; // 0x97c (0x4)
	float NonADSToADSBlendTime; // 0x980 (0x4)
	float UpperBodyLocomotionAdditiveMaskAlpha; // 0x984 (0x4)
	enum EFortPlayerAnimBodyType AnimBodyType; // 0x988 (0x1)
	struct TEnumAsByte<EFortCustomGender> Gender; // 0x989 (0x1)
	struct TEnumAsByte<EFortWeaponCoreAnimation> WeaponCoreAnim; // 0x98a (0x1)
	unsigned char bSwimIdleNoiseBlendTrigger; // 0x98b (0x1)
	unsigned char bSwimmingIsWaterPaddlingToSurface; // 0x98b (0x1)
	unsigned char bPlayUpperBodyTargeting; // 0x98b (0x1)
	unsigned char bIsFemale; // 0x98b (0x1)
	unsigned char bIsDBNO; // 0x98b (0x1)
	unsigned char bEnableDiveJumpAimOffsets; // 0x98b (0x1)
	unsigned char bSwimmingDoveIntoGround; // 0x98b (0x1)
	unsigned char bIsWaterJump; // 0x98b (0x1)
	unsigned char bRecentlyFired; // 0x98c (0x1)
	unsigned char bIsSprinting; // 0x98c (0x1)
	unsigned char bIsAccelerating2D; // 0x98c (0x1)
	unsigned char bIsMoving2D; // 0x98c (0x1)
	unsigned char bIsOnGround; // 0x98c (0x1)
	unsigned char bIsCrouching; // 0x98c (0x1)
	unsigned char bIsTargeting; // 0x98c (0x1)
	unsigned char bIsSurfaceSwimming; // 0x98c (0x1)
	unsigned char bIsDiveJumping; // 0x98d (0x1)
	unsigned char bSwimmingAllowSlowSprint; // 0x98d (0x1)
	unsigned char bSwimmingIsWaterLanding; // 0x98d (0x1)
	unsigned char bSwimmingSharpAccelerationChange; // 0x98d (0x1)
	unsigned char bStoppedDivingWhileUnderWater; // 0x98d (0x1)
	unsigned char bSwimmingPlayDBNOTurnEast; // 0x98d (0x1)
	unsigned char bSwimmingSprintSlowEnoughTimePassed; // 0x98d (0x1)
	unsigned char bIsBuilding; // 0x98d (0x1)
	unsigned char bTransitionSwimmingFullBodySprinting; // 0x98e (0x1)
	unsigned char bTransitionSwimmingLowerBodyMovement; // 0x98e (0x1)
	unsigned char bTransitionSwimSprintSlowtoSwimSprintStart; // 0x98e (0x1)
	unsigned char bTransitionSwimSprintSlowtoSwimSprint; // 0x98e (0x1)
	unsigned char bTransitionSwimSprinttoSwimSprintSlow; // 0x98e (0x1)
	unsigned char bTransitionIdlestoSwimStart; // 0x98e (0x1)
	unsigned char bTransitionSwimStarttoSwimMovementAccel; // 0x98e (0x1)
	unsigned char bTransitionSwimStartAdditivetoSwimMovementAccelAdditive; // 0x98e (0x1)
	unsigned char bTransitionSwimDiveLandOnGroundtoSplitBody; // 0x98f (0x1)
	unsigned char bTransitionSprintingtoConduit; // 0x98f (0x1)
	unsigned char bTransitionInterruptSprintSwimming; // 0x98f (0x1)
	unsigned char bTransitionDBNOSwimIdletoDBNOSwimTurn; // 0x98f (0x1)
	unsigned char bIsHidingInProp; // 0x98f (0x1)
	unsigned char bIsDiveLandingOnGround; // 0x98f (0x1)
	float DiveGroundLandingRemainingTime; // 0x990 (0x4)
	unsigned char bWasDiveJumpingLastTick; // 0x994 (0x1)
	unsigned char bIsFlying; // 0x994 (0x1)
	unsigned char bIsWaterSprintBoosting; // 0x994 (0x1)
	unsigned char padding_995[0xb]; // 0x995 (0xb)

	/* Functions */

	// Function /Script/FortniteGame.FortSwimmingLayerAnimInstance.SetDiveGroundLandingRemainingTime (Underlying native function: SetDiveGroundLandingRemainingTime 0x824676c)
	void SetDiveGroundLandingRemainingTime(float& RemainingAnimTime); // (Final | Native | Public | BlueprintCallable)
};

