// Class /Script/FortniteAI.FortAthenaAILODSettings_FortWeaponRanged
// Size: 0x2b0
class UFortAthenaAILODSettings_FortWeaponRanged : public UObject
{
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	struct TArray<class UClass*> SystemClasses; // 0x30 (0x10)
	struct FFortAILODSetting_FortWeaponRanged BelowLowerLODSettings; // 0x40 (0x68)
	struct FFortAILODSetting_FortWeaponRanged LowerLODSettings; // 0xa8 (0x68)
	struct FFortAILODSetting_FortWeaponRanged AboveLowerLODSettings; // 0x110 (0x68)
	struct FFortAILODSetting_FortWeaponRanged BelowNormalLODSettings; // 0x178 (0x68)
	struct FFortAILODSetting_FortWeaponRanged NormalLODSettings; // 0x1e0 (0x68)
	struct FFortAILODSetting_FortWeaponRanged AboveNormalLODSettings; // 0x248 (0x68)
};

