// Class /Script/FortniteAI.FortAthenaAIBotEvaluator_TrapOnPathDetected
// Size: 0xb8
class UFortAthenaAIBotEvaluator_TrapOnPathDetected : public UFortAthenaAIBotEvaluator
{
	class UFortAthenaAIBotAimingDigestedSkillSet* CacheAimingDigestedSkillSet; // 0x88 (0x8)
	struct FName TrapOnPathKeyName; // 0x90 (0x4)
	struct FName TrapActorOnPathKeyName; // 0x94 (0x4)
	struct FName TargetActorName; // 0x98 (0x4)
	struct FName AlertLevelName; // 0x9c (0x4)
	struct FName RangeAttackExecutionStatusName; // 0xa0 (0x4)
	unsigned char unreflected_a4[0xc]; // 0xa4 (0xc) 
	class ABuildingTrap* CurrentTrapTarget; // 0xb0 (0x8)
};

