// Class /Script/FortniteGame.FortDifficultyOptionEncounter_FixedPace
// Size: 0x200
class UFortDifficultyOptionEncounter_FixedPace : public UFortDifficultyOptionEncounter
{
	struct FScalableFloat RiftSpawnInterval; // 0x48 (0x28)
	struct FScalableFloat RiftSpawnCount; // 0x70 (0x28)
	struct FScalableFloat AIMaxCount; // 0x98 (0x28)
	struct FScalableFloat SpawnAIMaxCountPlayerMultiplier; // 0xc0 (0x28)
	struct FScalableFloat SpawnAIMaxCountDifficultyMultiplier; // 0xe8 (0x28)
	struct FScalableFloat SpawnAIIntervalTime; // 0x110 (0x28)
	struct FScalableFloat SpawnAIIntervalTimePlayerMultiplier; // 0x138 (0x28)
	struct FScalableFloat SpawnAIIntervalTimeDifficultyMultiplier; // 0x160 (0x28)
	struct FScalableFloat SpawnAIIntervalCount; // 0x188 (0x28)
	struct FScalableFloat SpawnAIIntervalCountPlayerMultiplier; // 0x1b0 (0x28)
	struct FScalableFloat SpawnAIIntervalCountDifficultyMultiplier; // 0x1d8 (0x28)
};

