// Class /Script/FortniteGame.FortExperienceSettingsComponent
// Size: 0xa78
class UFortExperienceSettingsComponent : public UActorComponent
{
	struct FScalableFloat VoiceChat; // 0xa0 (0x28)
	struct FScalableFloat Invincibility; // 0xc8 (0x28)
	struct FScalableFloat StartingHealth; // 0xf0 (0x28)
	struct FScalableFloat MaxHealth; // 0x118 (0x28)
	struct FScalableFloat StartingShield; // 0x140 (0x28)
	struct FScalableFloat MaxShields; // 0x168 (0x28)
	struct FScalableFloat DBNOType; // 0x190 (0x28)
	struct FScalableFloat AimAssistAllowed; // 0x1b8 (0x28)
	struct FScalableFloat RespawnHeight; // 0x1e0 (0x28)
	struct FScalableFloat RespawnTime; // 0x208 (0x28)
	struct FScalableFloat SpawnLocation; // 0x230 (0x28)
	struct FScalableFloat OverrideSpawnImmunityTime; // 0x258 (0x28)
	struct FScalableFloat SpawnImmunityTime; // 0x280 (0x28)
	struct FScalableFloat BuildingMode; // 0x2a8 (0x28)
	struct FScalableFloat DropAllItemsOverride; // 0x2d0 (0x28)
	struct FScalableFloat DropAllResourcesOverride; // 0x2f8 (0x28)
	struct FScalableFloat DropAllGameResourcesOverride; // 0x320 (0x28)
	struct FScalableFloat InstantReload; // 0x348 (0x28)
	struct FScalableFloat InfiniteAmmo; // 0x370 (0x28)
	struct FScalableFloat InfiniteConsumables; // 0x398 (0x28)
	struct FScalableFloat InfiniteResources; // 0x3c0 (0x28)
	struct FScalableFloat AllowItemDrop; // 0x3e8 (0x28)
	struct FScalableFloat AllowItemPickUp; // 0x410 (0x28)
	struct FScalableFloat MaxItemSlots; // 0x438 (0x28)
	struct FScalableFloat WoodResourceWidgetVisible; // 0x460 (0x28)
	struct FScalableFloat StoneResourceWidgetVisible; // 0x488 (0x28)
	struct FScalableFloat MetalResourceWidgetVisible; // 0x4b0 (0x28)
	struct FScalableFloat GoldCurrencyResourceWidgetVisible; // 0x4d8 (0x28)
	struct FScalableFloat HealthSiphonValue; // 0x500 (0x28)
	struct FScalableFloat WoodSiphonValue; // 0x528 (0x28)
	struct FScalableFloat StoneSiphonValue; // 0x550 (0x28)
	struct FScalableFloat MetalSiphonValue; // 0x578 (0x28)
	struct FScalableFloat GoldSiphonValue; // 0x5a0 (0x28)
	struct FScalableFloat DamageToDeal; // 0x5c8 (0x28)
	struct FScalableFloat RequiresNonZeroDamage; // 0x5f0 (0x28)
	struct FScalableFloat TargetQueryIndex; // 0x618 (0x28)
	struct FScalableFloat WeaponQueryIndex; // 0x640 (0x28)
	struct FScalableFloat FallDamage; // 0x668 (0x28)
	struct FScalableFloat MovementMultiplier; // 0x690 (0x28)
	struct FScalableFloat Gravity; // 0x6b8 (0x28)
	struct FScalableFloat ApplyJumpPenalty; // 0x6e0 (0x28)
	struct FScalableFloat GliderRedeploy; // 0x708 (0x28)
	struct FScalableFloat FlyEnabled; // 0x730 (0x28)
	struct FScalableFloat AllowFlightSprint; // 0x758 (0x28)
	struct FScalableFloat FlySpeed; // 0x780 (0x28)
	struct FScalableFloat PlayerLives; // 0x7a8 (0x28)
	struct FScalableFloat EliminationsToScoreMultiplier; // 0x7d0 (0x28)
	struct FScalableFloat AssistsToScoreMultiplier; // 0x7f8 (0x28)
	struct FScalableFloat AllowFriendlyFire; // 0x820 (0x28)
	struct FScalableFloat VehiclesDamageObjects; // 0x848 (0x28)
	struct FScalableFloat VehiclesDamageVehicles; // 0x870 (0x28)
	struct FScalableFloat HarvestRateMutliplier; // 0x898 (0x28)
	struct FScalableFloat HarvestStyle; // 0x8c0 (0x28)
	struct FScalableFloat MaximumResources; // 0x8e8 (0x28)
	struct FScalableFloat NameplateDisplayMode; // 0x910 (0x28)
	struct FScalableFloat LimitNamePlateMaxDistance; // 0x938 (0x28)
	struct FScalableFloat NameplateDisplayDistance; // 0x960 (0x28)
	struct FScalableFloat NameplateFocusAngle; // 0x988 (0x28)
	struct FScalableFloat NameplateFocusTime; // 0x9b0 (0x28)
	struct FScalableFloat NameplateFocusMode; // 0x9d8 (0x28)
	struct FScalableFloat NameplateLineOfSight; // 0xa00 (0x28)
	struct FScalableFloat PlayerHealthIndicatorDisplayMode; // 0xa28 (0x28)
	struct FScalableFloat CreativeBossHealthDisplayMode; // 0xa50 (0x28)
};

