// Class /Script/FortniteGame.FortCreativeItemTemplate
// Size: 0x108
class UFortCreativeItemTemplate : public UObject
{
	unsigned char unreflected_28[0x20]; // 0x28 (0x20) 
	int TrackedIndex; // 0x48 (0x4)
	unsigned char unreflected_4c[0x4]; // 0x4c (0x4) 
	struct FGameplayTagContainer SourceTags; // 0x50 (0x20)
	struct FItemVariantHandle VariantHandle; // 0x70 (0x18)
	unsigned char unreflected_88[0x8]; // 0x88 (0x8) 
	bool bEnabled; // 0x90 (0x1)
	unsigned char unreflected_91[0x57]; // 0x91 (0x57) 
	struct FString DisplayName; // 0xe8 (0x10)
	enum EFortRarity Rarity; // 0xf8 (0x1)
	unsigned char unreflected_f9[0x3]; // 0xf9 (0x3) 
	int MaxRegenStacks; // 0xfc (0x4)
	bool bShouldGenerateUserOptionConfig; // 0x100 (0x1)
	unsigned char padding_101[0x7]; // 0x101 (0x7)
};

