// Class /Script/FortniteGame.FortVehicleMovementSet
// Size: 0x170
class UFortVehicleMovementSet : public UFortAttributeSet
{
	struct FFortGameplayAttributeData FrontLateralFrictionScale; // 0x30 (0x28)
	struct FFortGameplayAttributeData RearLateralFrictionScale; // 0x58 (0x28)
	struct FFortGameplayAttributeData BrakeForceTractionScale; // 0x80 (0x28)
	struct FFortGameplayAttributeData ForwardForceTractionScale; // 0xa8 (0x28)
	struct FFortGameplayAttributeData SlopeAntigravityScale; // 0xd0 (0x28)
	struct FFortGameplayAttributeData TopSpeedScale; // 0xf8 (0x28)
	struct FFortGameplayAttributeData VehicleGravityScale; // 0x120 (0x28)
	struct FFortGameplayAttributeData BrakeBeforeReverse; // 0x148 (0x28)
};

