// Class /Script/FortniteGame.FortSKPushVehicleConfigs
// Size: 0x8e8
class UFortSKPushVehicleConfigs : public UFortPhysicsVehicleConfigs
{
	float PedalForceMultiplier; // 0x890 (0x4)
	float PedalTopSpeedMultiplier; // 0x894 (0x4)
	float PedalForceDuration; // 0x898 (0x4)
	float CoastBrakingMinDelta; // 0x89c (0x4)
	float CoastBrakingMaxDelta; // 0x8a0 (0x4)
	float PedalMinDuration; // 0x8a4 (0x4)
	float MountDuration; // 0x8a8 (0x4)
	float DismountDuration; // 0x8ac (0x4)
	float MinPreDismountCooldown; // 0x8b0 (0x4)
	float PreDismountCooldown; // 0x8b4 (0x4)
	float PedalCooldown; // 0x8b8 (0x4)
	float CoastBrakingStrength; // 0x8bc (0x4)
	float ShoppingMinPedalCoastSpeed; // 0x8c0 (0x4)
	float VehicleDebugStrafeCoastMultiplier; // 0x8c4 (0x4)
	float CanCoastCooldown; // 0x8c8 (0x4)
	float MaxAutoDismountForwardSpeed; // 0x8cc (0x4)
	float PedalMinForwardVelocity; // 0x8d0 (0x4)
	float FastDismountDuration; // 0x8d4 (0x4)
	float CanCoastAfterFastDismountCooldown; // 0x8d8 (0x4)
	float PassengerVehicleWeightShiftYawStrength; // 0x8dc (0x4)
	float MinPushForceMagnitude; // 0x8e0 (0x4)
	float MinGearRampTime; // 0x8e4 (0x4)
};

