// Class /Script/FortniteGame.FortCurieFirePropagationManagerConfig
// Size: 0x130
class UFortCurieFirePropagationManagerConfig : public UCurieManagerComponentConfig
{
	float TickInterval; // 0x40 (0x4)
	float FirePropagationDelay; // 0x44 (0x4)
	float MinPropagationFuel; // 0x48 (0x4)
	float DefaultPropagationFuel; // 0x4c (0x4)
	float MaxPropagationFuel; // 0x50 (0x4)
	float DefaultPropagationFuelCost; // 0x54 (0x4)
	float IncompletePropagationRefundFuelMultiplier; // 0x58 (0x4)
	float InactiveFireFailsafeRemovalTime; // 0x5c (0x4)
	float MaximumPendingInteractTimePerTick; // 0x60 (0x4)
	float PropagationApplicationMagnitude; // 0x64 (0x4)
	float HalfAngleForUpwardMobilityCalculation; // 0x68 (0x4)
	int PropagationLimit; // 0x6c (0x4)
	int ForcedNeighborPropagationLimitPerTick; // 0x70 (0x4)
	int MinimumPendingInteractsToProcessPerTick; // 0x74 (0x4)
	int DefaultConnectivityPoints; // 0x78 (0x4)
	unsigned char unreflected_7c[0x4]; // 0x7c (0x4) 
	struct FScalableFloat PropagationRate; // 0x80 (0x28)
	struct FVector2D PropagationApplicationMagnitudeRandomizationRange; // 0xa8 (0x10)
	struct FVector DefaultFireBoundsExpansion; // 0xb8 (0x18)
	bool bAllowPropagationFuelOverrides; // 0xd0 (0x1)
	unsigned char unreflected_d1[0x3]; // 0xd1 (0x3) 
	float FireElementSubgridOverlapThreshold; // 0xd4 (0x4)
	float BuildingFirePropagationTickInterval; // 0xd8 (0x4)
	float GrassFirePropagationInterval; // 0xdc (0x4)
	float GrassFireBurnoutInterval; // 0xe0 (0x4)
	float GrassFireInitialPropagationDelay; // 0xe4 (0x4)
	float GrassFireMinPropagationDelay; // 0xe8 (0x4)
	float GrassFireMaxPropagationDelay; // 0xec (0x4)
	float GrassFireBurnoutTime; // 0xf0 (0x4)
	float GrassMaxWaterContent; // 0xf4 (0x4)
	float GrassWaterContentChangeOnFireApplication; // 0xf8 (0x4)
	float GrassWaterContentChangeOnWaterApplication; // 0xfc (0x4)
	float GrassFirePropagationCostPerLocation; // 0x100 (0x4)
	float GrassTraceLandscapeOffset; // 0x104 (0x4)
	float FireFoundationGrassDefaultExpansion; // 0x108 (0x4)
	int GrassFirePropagationRate; // 0x10c (0x4)
	int GrassGridCellsPerAxisManagedByGrassFireReplicator; // 0x110 (0x4)
	int GrassGridFireMinimumTraceOptimization; // 0x114 (0x4)
	int GrassFirePropagationFuelConsumptionLimit; // 0x118 (0x4)
	float FireLandscapePropagationApplicationMagnitude; // 0x11c (0x4)
	float OverlapFireApplicationMagnitude; // 0x120 (0x4)
	float MovableActorFireInteractionMagnitude; // 0x124 (0x4)
	bool bUseLandscapeMapForGrassGrid; // 0x128 (0x1)
	bool bUseIFACacheForGrassGrid; // 0x129 (0x1)
	bool bAllowInteractsWhileDBNO; // 0x12a (0x1)
	bool bAllowInteractsWhileInVehicle; // 0x12b (0x1)
	bool bCreateFireInteractsForMovableActors; // 0x12c (0x1)
	unsigned char padding_12d[0x3]; // 0x12d (0x3)
};

