// Class /Script/FortniteUI.FortMobileActionButtonBehavior_Use
// Size: 0x1d0
class UFortMobileActionButtonBehavior_Use : public UFortMobileActionButtonBehavior
{
	class UPaperSprite* InterrogateSprite; // 0x110 (0x8)
	class UPaperSprite* CancelSprite; // 0x118 (0x8)
	class UPaperSprite* PickUpSprite; // 0x120 (0x8)
	struct FGameplayTag CreativeMatchmakingPortalComparisonTag; // 0x128 (0x4)
	unsigned char unreflected_12c[0x4]; // 0x12c (0x4) 
	struct TArray<struct FIconPicker> PawnSpriteOverrides; // 0x130 (0x10)
	struct FGameplayTagQuery ReceiverTagQueryRequiringVisibilityOverride; // 0x140 (0x48)
	struct FGameplayTagQuery InstigatorTagQueryRequiringVisibilityOverride; // 0x188 (0x48)
};

