// Class /Script/FortniteUI.FortLoginCredentialSelect
// Size: 0x400
class UFortLoginCredentialSelect : public UCommonActivatableWidget
{
	unsigned char unreflected_3a8[0x20]; // 0x3a8 (0x20) 
	class UCommonButtonLegacy* ButtonEpic; // 0x3c8 (0x8)
	class UCommonButtonLegacy* ButtonFacebook; // 0x3d0 (0x8)
	class UCommonButtonLegacy* ButtonGoogle; // 0x3d8 (0x8)
	class UCommonButtonLegacy* ButtonPS; // 0x3e0 (0x8)
	class UCommonButtonLegacy* ButtonXB; // 0x3e8 (0x8)
	class UCommonButtonLegacy* ButtonErebus; // 0x3f0 (0x8)
	class UCommonButtonLegacy* ButtonCreateAccount; // 0x3f8 (0x8)
};

