// Class /Script/FortniteGame.FortMountedTurretAnimInstance
// Size: 0x610
class UFortMountedTurretAnimInstance : public UFortVehicleAnimInstance
{
	class AFortMountedTurret* MountedTurret; // 0x5f0 (0x8)
	bool bIsUsingMountedTurret; // 0x5f8 (0x1)
	unsigned char unreflected_5f9[0x3]; // 0x5f9 (0x3) 
	float AimingYaw; // 0x5fc (0x4)
	float AimingPitch; // 0x600 (0x4)
	float PedalScaler; // 0x604 (0x4)
	float TurnRate; // 0x608 (0x4)
	unsigned char padding_60c[0x4]; // 0x60c (0x4)
};

