// Class /Script/FortniteGame.FortLiveEventLayerAnimInstance
// Size: 0x510
class UFortLiveEventLayerAnimInstance : public UFortBaseLayerAnimInstance
{
	class UClass* LiveEventLayerAnimBP; // 0x440 (0x8)
	struct FCachedAnimRelevancyData UnderwaterSprintStopRelevancyData; // 0x448 (0x14)
	struct FCachedAnimRelevancyData UnderwaterSwimStartRelevancyData; // 0x45c (0x14)
	enum EFortCardinalDirection StopDirection; // 0x470 (0x1)
	unsigned char unreflected_471[0x7]; // 0x471 (0x7) 
	struct FRotator WorldFlipRotator; // 0x478 (0x18)
	float WorldFlipAimOffsetAlpha; // 0x490 (0x4)
	float Speed; // 0x494 (0x4)
	float AccelerationMagnitude; // 0x498 (0x4)
	float VelocityYaw; // 0x49c (0x4)
	float VelocityYawLocal; // 0x4a0 (0x4)
	float VelocityYawLocalStop; // 0x4a4 (0x4)
	float VelocityYawLocalSmooth; // 0x4a8 (0x4)
	float AccelerationYaw; // 0x4ac (0x4)
	float AccelerationYawLocal; // 0x4b0 (0x4)
	float ControlRotationPitchLocal; // 0x4b4 (0x4)
	float VelocityPitchDelta; // 0x4b8 (0x4)
	float VelocityYawDelta; // 0x4bc (0x4)
	float ControlRotationPitchLocalDelta; // 0x4c0 (0x4)
	float WorldTiltRoll; // 0x4c4 (0x4)
	float WorldTiltPitch; // 0x4c8 (0x4)
	float WorldFlipPitch; // 0x4cc (0x4)
	float WorldFlipRoll; // 0x4d0 (0x4)
	float WorldFlipAlpha; // 0x4d4 (0x4)
	float WorldTiltCameraRoll; // 0x4d8 (0x4)
	float WorldFlipCameraRoll; // 0x4dc (0x4)
	float BreaststrokeDirection; // 0x4e0 (0x4)
	float PitchAOInput; // 0x4e4 (0x4)
	float BreaststrokeAOYaw; // 0x4e8 (0x4)
	float BreaststrokeAOPitch; // 0x4ec (0x4)
	bool bIsWorldTilting; // 0x4f0 (0x1)
	bool bIsWorldFlipping; // 0x4f1 (0x1)
	bool bUseIdleNoiseTucked; // 0x4f2 (0x1)
	bool bHasWorldFullyFlipped; // 0x4f3 (0x1)
	bool bEnterWorldFlipGliding; // 0x4f4 (0x1)
	bool bWorldFlipBeginDive; // 0x4f5 (0x1)
	bool bWorldFlipReturnToGlide; // 0x4f6 (0x1)
	bool bIsFloating; // 0x4f7 (0x1)
	bool bIsOnGround; // 0x4f8 (0x1)
	bool bUWIdleFullyBlended; // 0x4f9 (0x1)
	bool bIsChangingDirection; // 0x4fa (0x1)
	bool bIsStopping; // 0x4fb (0x1)
	bool bWantsToUpdateStop; // 0x4fc (0x1)
	bool bWantsToUpdateStopDirection; // 0x4fd (0x1)
	bool bHoldBSDirection; // 0x4fe (0x1)
	bool bTransitionUWIdleToUWSwimStart; // 0x4ff (0x1)
	bool bTransitionUWSprintStopToUWSwimStart; // 0x500 (0x1)
	bool bTransitionUWSwimStartToSprintStop; // 0x501 (0x1)
	bool bTransitionUWSwimStartToIdle; // 0x502 (0x1)
	bool bTransitionUWSprintLoopToSprintStop; // 0x503 (0x1)
	unsigned char padding_504[0xc]; // 0x504 (0xc)

	/* Functions */

	// Function /Script/FortniteGame.FortLiveEventLayerAnimInstance.LocalUpdateFromCameraManager (Has no native function)
	void LocalUpdateFromCameraManager(class APlayerCameraManager*& CameraManager); // (Event | Public | BlueprintEvent)
};

