// Class /Script/FortniteGame.FortAntelopeVehicleConfigs
// Size: 0x970
class UFortAntelopeVehicleConfigs : public UFortPhysicsVehicleConfigs
{
	float BounceCrouchTime; // 0x890 (0x4)
	float BounceCrouchTimeDeadzone; // 0x894 (0x4)
	float BounceRecoilTime; // 0x898 (0x4)
	float BounceForcePerMass; // 0x89c (0x4)
	float PassengerLeanMagnitude; // 0x8a0 (0x4)
	float PassengerLeanMinMagnitude; // 0x8a4 (0x4)
	float PassengerLeanLeftRightInterpolationPerSecond; // 0x8a8 (0x4)
	float PassengerLeanUpInterpolationPerSecond; // 0x8ac (0x4)
	float PassengerLeanDownInterpolationPerSecond; // 0x8b0 (0x4)
	float PassengerLeanResetInterpolationPerSecond; // 0x8b4 (0x4)
	float PassengerLeanDeadzone; // 0x8b8 (0x4)
	float NaturalSlideMinAngle; // 0x8bc (0x4)
	float TractionVelocityDelta; // 0x8c0 (0x4)
	float MinSpeedForWheelRotation; // 0x8c4 (0x4)
	float MinSpeedForSkidFX; // 0x8c8 (0x4)
	float BoostAccumulationRate; // 0x8cc (0x4)
	float BoostExpenseRate; // 0x8d0 (0x4)
	float BoostPassiveExpenseRate; // 0x8d4 (0x4)
	float BoostTopSpeedMultiplier; // 0x8d8 (0x4)
	float BoostTopSpeedInAirMultiplier; // 0x8dc (0x4)
	float BoostAirMaxSpeed; // 0x8e0 (0x4)
	float BoostForceInAir; // 0x8e4 (0x4)
	float BoostSteeringMultiplier; // 0x8e8 (0x4)
	float BoostCooldown; // 0x8ec (0x4)
	float BoostSteeringMultiplierRampTime; // 0x8f0 (0x4)
	float BoostSlowExtraStrength; // 0x8f4 (0x4)
	float BoostTopSpeedForceMultiplier; // 0x8f8 (0x4)
	float VehicleBoostFrontFrictionMultiplier; // 0x8fc (0x4)
	float VehicleBoostRearFrictionMultiplier; // 0x900 (0x4)
	float BoostMinPushForce; // 0x904 (0x4)
	float BoostSmashForgivenessDuration; // 0x908 (0x4)
	float MinBoostTime; // 0x90c (0x4)
	float CameraShakeAmplitudeMin; // 0x910 (0x4)
	float CameraShakeAmplitudeMax; // 0x914 (0x4)
	float SpringFudgeFactor; // 0x918 (0x4)
	float CameraShakeNormalizedSpeed; // 0x91c (0x4)
	float CameraShakeSpeedCurvePow; // 0x920 (0x4)
	float BoostingCameraShakeAmount; // 0x924 (0x4)
	float BoostCameraShakeFrequency; // 0x928 (0x4)
	float SmoothedSpringCompressionMin; // 0x92c (0x4)
	float SmoothedSpringCompressionMax; // 0x930 (0x4)
	float ScreenShakeFrequencyMin; // 0x934 (0x4)
	float ScreenShakeFrequencyMax; // 0x938 (0x4)
	float PassengerCameraShakeMultiplier; // 0x93c (0x4)
	float ScreenShakeYawFrequencyMultiplier; // 0x940 (0x4)
	struct FLinearColor WheelSlideBoostColorWhenNotPowerSliding; // 0x944 (0x10)
	float TreadWidth; // 0x954 (0x4)
	float RumbleMultiplier; // 0x958 (0x4)
	float SparksRumbleMultiplier; // 0x95c (0x4)
	float BoostCameraOffset; // 0x960 (0x4)
	float ADSCameraDistance; // 0x964 (0x4)
	float PassengerCameraOffset; // 0x968 (0x4)
	float ADSInterpSpeed; // 0x96c (0x4)
};

