// Class /Script/FortniteGame.FortRemoteControlPawnSet
// Size: 0x288
class UFortRemoteControlPawnSet : public UFortAttributeSet
{
	struct FFortGameplayAttributeData FuseLength; // 0x30 (0x28)
	struct FFortGameplayAttributeData MouseTurnCap; // 0x58 (0x28)
	struct FFortGameplayAttributeData MouseTurnRate; // 0x80 (0x28)
	struct FFortGameplayAttributeData MouseTurnRateMax; // 0xa8 (0x28)
	struct FFortGameplayAttributeData GyroTurnRateMax; // 0xd0 (0x28)
	struct FFortGameplayAttributeData KeyboardTurnRate; // 0xf8 (0x28)
	struct FFortGameplayAttributeData ControllerTurnRate; // 0x120 (0x28)
	struct FFortGameplayAttributeData TouchTurnRate; // 0x148 (0x28)
	struct FFortGameplayAttributeData MaxSpeed; // 0x170 (0x28)
	struct FFortGameplayAttributeData MaxAcceleration; // 0x198 (0x28)
	struct FFortGameplayAttributeData UseLaunchDelay; // 0x1c0 (0x28)
	struct FFortGameplayAttributeData LaunchDelay; // 0x1e8 (0x28)
	struct FFortGameplayAttributeData LaunchSpeed; // 0x210 (0x28)
	struct FFortGameplayAttributeData OutOfHealthExplodeDelay; // 0x238 (0x28)
	struct FFortGameplayAttributeData PlayerCanDetonate; // 0x260 (0x28)
};

