// Class /Script/FortniteGame.FortContextualTutorialDefinition
// Size: 0x100
class UFortContextualTutorialDefinition : public UDataAsset
{
	class UClass* ContextualTutorialClass; // 0x30 (0x8)
	struct FGameplayTag TutorialType; // 0x38 (0x4)
	unsigned char unreflected_3c[0x4]; // 0x3c (0x4) 
	class UMediaSource* MainMediaSource; // 0x40 (0x8)
	class UMediaSource* SuccessMediaSource; // 0x48 (0x8)
	int Priority; // 0x50 (0x4)
	int AmountOfRecallMatches; // 0x54 (0x4)
	struct TArray<struct FDirectiveInput> DirectiveMessages; // 0x58 (0x10)
	struct FText InformativeMessage; // 0x68 (0x18)
	float TriggerActivationDelay; // 0x80 (0x4)
	float MessageDisplayTime; // 0x84 (0x4)
	float SuccesMessageDisplayTime; // 0x88 (0x4)
	float ReminderDelay; // 0x8c (0x4)
	int ReminderAmount; // 0x90 (0x4)
	float InformativeMessageDelay; // 0x94 (0x4)
	float LockedDelay; // 0x98 (0x4)
	float QueuedActivateDelay; // 0x9c (0x4)
	bool bQueueActivation; // 0xa0 (0x1)
	unsigned char unreflected_a1[0x3]; // 0xa1 (0x3) 
	int AccountLevelLimit; // 0xa4 (0x4)
	bool bCanBeShownInCombat; // 0xa8 (0x1)
	bool bIsCompletionSilent; // 0xa9 (0x1)
	bool bAlwaysSendSuccess; // 0xaa (0x1)
	bool bCanSetMessagingSystemOnCooldown; // 0xab (0x1)
	bool bCanBeShownWhileDBNO; // 0xac (0x1)
	enum EFortContextualTutorialPlatform Platform; // 0xad (0x1)
	unsigned char unreflected_ae[0x2]; // 0xae (0x2) 
	struct FGameplayTag ContextualTutorialDependency; // 0xb0 (0x4)
	unsigned char unreflected_b4[0x4]; // 0xb4 (0x4) 
	struct FGameplayTagContainer AdditionalTutorialsToComplete; // 0xb8 (0x20)
	struct TArray<struct FHUDElementToHighlight> HudElementsToHighlight; // 0xd8 (0x10)
	bool bRequireSquad; // 0xe8 (0x1)
	bool bRequireSolo; // 0xe9 (0x1)
	bool bActivateInBR; // 0xea (0x1)
	bool bActivateInCreative; // 0xeb (0x1)
	bool bIsEnabled; // 0xec (0x1)
	unsigned char unreflected_ed[0x3]; // 0xed (0x3) 
	struct TArray<enum EAthenaGamePhase> ExcludedGamePhases; // 0xf0 (0x10)
};

