// Class /Script/FortniteUI.FortSocialUserTreeView
// Size: 0x568
class UFortSocialUserTreeView : public USocialUserTreeView
{
	class UClass* PartyMemberEntryWidgetClass; // 0x4a0 (0x8)
	class UClass* TeamMemberEntryWidgetClass; // 0x4a8 (0x8)
	class UClass* VoiceChatMemberEntryWidgetClass; // 0x4b0 (0x8)
	class UClass* JoinablePartyEntryWidgetClass; // 0x4b8 (0x8)
	class UClass* JoinablePartyEntryWidgetClass2; // 0x4c0 (0x8)
	class UClass* MissedInviteEntryWidgetClass; // 0x4c8 (0x8)
	class UClass* ReferFriendEntryWidgetClass; // 0x4d0 (0x8)
	class UClass* UserSearchResultEntryWidgetClass; // 0x4d8 (0x8)
	class UClass* LeavePartyEntryWidgetClass; // 0x4e0 (0x8)
	class UClass* ShuffleLfgEntryWidgetClass; // 0x4e8 (0x8)
	class UClass* SuggestedFriendEntryWidgetClass; // 0x4f0 (0x8)
	class UClass* JoinRequestEntryWidgetClass; // 0x4f8 (0x8)
	class UClass* VoiceChannelHeaderEntryWidgetClass; // 0x500 (0x8)
	class UClass* RecentPlayerEntryWidgetClass; // 0x508 (0x8)
	class UClass* TagsNoFriendsEntryWidgetClass; // 0x510 (0x8)
	class UClass* LfgToggleEntryWidgetClass; // 0x518 (0x8)
	class UClass* LfgTagCheckboxEntryWidgetClass; // 0x520 (0x8)
	class UClass* LfgFilterButtonEntryWidgetClass; // 0x528 (0x8)
	class UClass* LfgInviteEntryWidgetClass; // 0x530 (0x8)
	class UClass* LfgState2EntryWidgetClass; // 0x538 (0x8)
	class UClass* MultiFriendActionEntryWidgetClass; // 0x540 (0x8)
	class UClass* LfgFilterHeaderEntryWidgetClass; // 0x548 (0x8)
	class UClass* RebootPlayersHeaderEntryWidgetClass; // 0x550 (0x8)
	unsigned char padding_558[0x10]; // 0x558 (0x10)
};

