// Class /Script/FortniteGame.FortMissionInfo
// Size: 0x9c0
class UFortMissionInfo : public UPrimaryDataAsset
{
	struct TWeakObjectPtr<class UClass> MissionRef; // 0x30 (0x28)
	struct TEnumAsByte<EFortMissionType> MissionType; // 0x58 (0x1)
	unsigned char unreflected_59[0x7]; // 0x59 (0x7) 
	struct FGameplayTagContainer MissionTags; // 0x60 (0x20)
	float TimeOfDaySpeed; // 0x80 (0x4)
	float ZoneEndDelay; // 0x84 (0x4)
	float ZoneEndDelayOverrideForFailure; // 0x88 (0x4)
	unsigned char unreflected_8c[0x4]; // 0x8c (0x4) 
	class UFortBadgeItemDefinition* MissionRewardBadge; // 0x90 (0x8)
	struct FName MissionRewardItemsLootTierGroup; // 0x98 (0x4)
	int MaxRewardLootTierPoints; // 0x9c (0x4)
	int ParTime; // 0xa0 (0x4)
	unsigned char unreflected_a4[0x4]; // 0xa4 (0x4) 
	class UFortBadgeItemDefinition* UnderParBadge; // 0xa8 (0x8)
	int MaxMissionPoints; // 0xb0 (0x4)
	bool bVictoryTileRequired; // 0xb4 (0x1)
	unsigned char unreflected_b5[0x3]; // 0xb5 (0x3) 
	struct FText MissionDescription; // 0xb8 (0x18)
	struct FFortMultiSizeBrush MissionIcons; // 0xd0 (0x480)
	class UMediaSource* EndOfMissionMediaSource; // 0x550 (0x8)
	bool bSkipEndOfMissionVideo; // 0x558 (0x1)
	unsigned char unreflected_559[0x3]; // 0x559 (0x3) 
	int DaysToLive; // 0x55c (0x4)
	struct TArray<struct FFortObjectiveBlock> ObjectiveBlocks; // 0x560 (0x10)
	bool bShowMinimapIconsOnlyIfFocused; // 0x570 (0x1)
	unsigned char unreflected_571[0x3]; // 0x571 (0x3) 
	float ExpectedCompletionTime; // 0x574 (0x4)
	float MissionEncounterTime; // 0x578 (0x4)
	unsigned char unreflected_57c[0x4]; // 0x57c (0x4) 
	struct FFortMissionPlacementItems MissionPlacementInfo; // 0x580 (0x40)
	float MinDistanceToOtherMissions; // 0x5c0 (0x4)
	float MinDistanceToAllowSpawnPad; // 0x5c4 (0x4)
	struct FFortPlacementActorFinderInfo PlacementActorInfo; // 0x5c8 (0x18)
	bool bStartPlayingOnLoad; // 0x5e0 (0x1)
	bool bRequiresActivation; // 0x5e1 (0x1)
	unsigned char unreflected_5e2[0x2]; // 0x5e2 (0x2) 
	int BluGloActivationRequirement; // 0x5e4 (0x4)
	bool bAllowDifficultyIncrease; // 0x5e8 (0x1)
	unsigned char unreflected_5e9[0x7]; // 0x5e9 (0x7) 
	struct FText RewardsTitleText; // 0x5f0 (0x18)
	struct FText RewardsDescriptionText; // 0x608 (0x18)
	struct FText NonParticipationRewardsDescriptionText; // 0x620 (0x18)
	unsigned char unreflected_638[0x8]; // 0x638 (0x8) 
	struct FFortMissionPopupWidgetData PopupWidgetData; // 0x640 (0x280)
	class UFortMissionWeightedRewards* WeightedRewards; // 0x8c0 (0x8)
	bool bIsGroupContent; // 0x8c8 (0x1)
	bool bUseRRV; // 0x8c9 (0x1)
	unsigned char unreflected_8ca[0x6]; // 0x8ca (0x6) 
	struct FText MissionName; // 0x8d0 (0x18)
	bool bShouldDisplayMissionName; // 0x8e8 (0x1)
	unsigned char unreflected_8e9[0x7]; // 0x8e9 (0x7) 
	struct TArray<struct FFortEncounterProfile> EncounterProfiles; // 0x8f0 (0x10)
	struct TArray<struct FFortEncounterSequenceSettings> EncounterSequences; // 0x900 (0x10)
	struct TWeakObjectPtr<class UFortDifficultyOptionSetMission> MissionOptions; // 0x910 (0x28)
	struct FGameplayTagContainer MissionDifficultyOptionTags; // 0x938 (0x20)
	struct TArray<struct FFortMissionTaggedRewards> TaggedRewards; // 0x958 (0x10)
	struct TArray<struct FMissionPerDifficultyProperties> PerDifficultyProperties; // 0x968 (0x10)
	struct FFortMissionConfigDataParams ConfigParams; // 0x978 (0x10)
	struct TArray<class UClass*> AIServices; // 0x988 (0x10)
	struct TWeakObjectPtr<class UCurveTable> GameData; // 0x998 (0x28)
};

