// Class /Script/FortniteAI.FortAthenaAIBotDBNODigestedSkillSet
// Size: 0x50
class UFortAthenaAIBotDBNODigestedSkillSet : public UFortAthenaAIBotDigestedSkillSet
{
	float MaxDBNOCrawlingResponseTime; // 0x30 (0x4)
	float MaxDBNOCrawlingResponseTimeDeviation; // 0x34 (0x4)
	float AllyEvaluationTime; // 0x38 (0x4)
	float AllyEvaluationTimeDeviation; // 0x3c (0x4)
	float AllyEvaluationMaxDistanceSquared; // 0x40 (0x4)
	float OddsToLookForCover; // 0x44 (0x4)
	float CoverEvaluationTime; // 0x48 (0x4)
	float CoverEvaluationTimeDeviation; // 0x4c (0x4)
};

