// Class /Script/FortniteAI.FortQueryTest_AssignmentTypeInterest
// Size: 0x428
class UFortQueryTest_AssignmentTypeInterest : public UFortQueryTest_GoalBase
{
	struct FAIDataProviderFloatValue InvalidTypeStartInterest; // 0x268 (0x38)
	struct FAIDataProviderFloatValue InvalidTypeEndInterest; // 0x2a0 (0x38)
	struct FAIDataProviderFloatValue InvalidTypeTimeBeforeLerp; // 0x2d8 (0x38)
	struct FAIDataProviderFloatValue InvalidTypeLerpDuration; // 0x310 (0x38)
	struct FAIDataProviderFloatValue ValidTypeStartInterest; // 0x348 (0x38)
	struct FAIDataProviderFloatValue ValidTypeEndInterest; // 0x380 (0x38)
	struct FAIDataProviderFloatValue ValidTypeTimeBeforeLerp; // 0x3b8 (0x38)
	struct FAIDataProviderFloatValue ValidTypeLerpDuration; // 0x3f0 (0x38)
};

