// Class /Script/FortniteAI.FortAthenaBTService_Patrolling
// Size: 0x90
class UFortAthenaBTService_Patrolling : public UBTService
{
	struct FName PatrollingAppendDestinationKeyName; // 0x70 (0x4)
	unsigned char unreflected_74[0x4]; // 0x74 (0x4) 
	float AcceptableRadius; // 0x78 (0x4)
	unsigned char unreflected_7c[0x4]; // 0x7c (0x4) 
	class UClass* FilterClass; // 0x80 (0x8)
	unsigned char bAllowPartialPath; // 0x88 (0x1)
	unsigned char bProjectGoalLocation; // 0x88 (0x1)
	unsigned char padding_89[0x7]; // 0x89 (0x7)
};

