// Class /Script/FortniteGame.FortPlayerSettingsComponentBase
// Size: 0x278
class UFortPlayerSettingsComponentBase : public UActorComponent
{
	unsigned char unreflected_a0[0x18]; // 0xa0 (0x18) 
	float MaxHealthAlt; // 0xb8 (0x4)
	float MaxHealth; // 0xbc (0x4)
	float StartingHealth; // 0xc0 (0x4)
	float MaxShield; // 0xc4 (0x4)
	float StartingShield; // 0xc8 (0x4)
	bool bInvincibility; // 0xcc (0x1)
	enum EDBNOMutatorType DBNOSetting; // 0xcd (0x1)
	unsigned char unreflected_ce[0x2]; // 0xce (0x2) 
	float RespawnHeight; // 0xd0 (0x4)
	float RespawnTime; // 0xd4 (0x4)
	enum EFortMinigamePlayerSpawnLocationSetting SpawnLocationSetting; // 0xd8 (0x1)
	bool bOverrideSpawnImmunityTime; // 0xd9 (0x1)
	unsigned char unreflected_da[0x2]; // 0xda (0x2) 
	float SpawnImmunityTime; // 0xdc (0x4)
	enum EAthenaLootDropOverride DropAllItemsOverride; // 0xe0 (0x1)
	enum EAthenaLootDropOverride DropAllResourcesOverride; // 0xe1 (0x1)
	enum EAthenaLootDropOverride DropAllGameResourcesOverride; // 0xe2 (0x1)
	unsigned char unreflected_e3[0x5]; // 0xe3 (0x5) 
	struct TArray<struct FItemAndCount> InventoryItems; // 0xe8 (0x10)
	struct FString CharacterOverride; // 0xf8 (0x10)
	struct FString PickaxeOverride; // 0x108 (0x10)
	struct FString BackpackOverride; // 0x118 (0x10)
	struct FString GliderOverride; // 0x128 (0x10)
	int HealthSiphonValue; // 0x138 (0x4)
	int WoodSiphonValue; // 0x13c (0x4)
	int StoneSiphonValue; // 0x140 (0x4)
	int MetalSiphonValue; // 0x144 (0x4)
	int GoldSiphonValue; // 0x148 (0x4)
	float DamageToDeal; // 0x14c (0x4)
	bool bRequiresNonZeroDamage; // 0x150 (0x1)
	enum ESelfDamageTargetPreset TargetQueryIndex; // 0x151 (0x1)
	enum ESelfDamageWeaponTypePreset WeaponQueryIndex; // 0x152 (0x1)
	bool bFallDamage; // 0x153 (0x1)
	float FallDamageMultiplier; // 0x154 (0x4)
	int GravityOverride; // 0x158 (0x4)
	enum EGravityPresetOverride GravityPreset; // 0x15c (0x1)
	unsigned char unreflected_15d[0x3]; // 0x15d (0x3) 
	int PlayerLives; // 0x160 (0x4)
	struct FCreativeTeamOption* AfterLastSpawnGoTo; // 0x164 (0x8)
	unsigned char TeamToMoveToWhenOutOfSpawns; // 0x16c (0x1)
	unsigned char unreflected_16d[0x3]; // 0x16d (0x3) 
	float EliminationsToScoreMultiplier; // 0x170 (0x4)
	float AssistsToScoreMultiplier; // 0x174 (0x4)
	float HarvestRateMutliplier; // 0x178 (0x4)
	int ResourceRateOverrideIndex; // 0x17c (0x4)
	enum EHarvestStyleOverride HarvestStyle; // 0x180 (0x1)
	enum EBuildingMode BuildingMode; // 0x181 (0x1)
	bool bAimAssistAllowed; // 0x182 (0x1)
	bool bIsPlayerTriggeredRespawnAllowed; // 0x183 (0x1)
	bool OnlyAllowRespawningIfPlayerStartPadsFound; // 0x184 (0x1)
	bool bInstantReload; // 0x185 (0x1)
	bool bInfiniteAmmo; // 0x186 (0x1)
	bool bInfiniteConsumables; // 0x187 (0x1)
	bool bInfiniteResources; // 0x188 (0x1)
	bool bAllowItemDrop; // 0x189 (0x1)
	bool bAllowItemPickUp; // 0x18a (0x1)
	unsigned char unreflected_18b[0x1]; // 0x18b (0x1) 
	float MaxItemSlots; // 0x18c (0x4)
	bool bWoodResourceWidgetVisible; // 0x190 (0x1)
	bool bStoneResourceWidgetVisible; // 0x191 (0x1)
	bool bMetalResourceWidgetVisible; // 0x192 (0x1)
	bool bGoldCurrencyResourceWidgetVisible; // 0x193 (0x1)
	bool bApplyJumpPenalty; // 0x194 (0x1)
	bool bGliderRedeploy; // 0x195 (0x1)
	bool bFlyEnabled; // 0x196 (0x1)
	bool bAllowFlightSprint; // 0x197 (0x1)
	enum EFlightSpeedPresetOverride FlySpeedPreset; // 0x198 (0x1)
	unsigned char unreflected_199[0x3]; // 0x199 (0x3) 
	int FlySpeedModifierIndex; // 0x19c (0x4)
	bool bAllowFriendlyFire; // 0x1a0 (0x1)
	bool bVehiclesDamageObjects; // 0x1a1 (0x1)
	bool bVehiclesDamageVehicles; // 0x1a2 (0x1)
	unsigned char unreflected_1a3[0x1]; // 0x1a3 (0x1) 
	int MaximumResources; // 0x1a4 (0x4)
	enum EIndicatorDisplayMode NameplateDisplayMode; // 0x1a8 (0x1)
	bool bLimitNamePlateMaxDistance; // 0x1a9 (0x1)
	unsigned char unreflected_1aa[0x2]; // 0x1aa (0x2) 
	float NameplateDisplayDistanceMeters; // 0x1ac (0x4)
	float NameplateDisplayDistance; // 0x1b0 (0x4)
	float NameplateFocusAngleDegrees; // 0x1b4 (0x4)
	float NameplateFocusAngle; // 0x1b8 (0x4)
	float NameplateFocusTime; // 0x1bc (0x4)
	enum EIndicatorDisplayMode NameplateFocusMode; // 0x1c0 (0x1)
	enum EIndicatorLineOfSightMode NameplateLineOfSight; // 0x1c1 (0x1)
	enum EPlayerIndicatorDisplayMode PlayerHealthIndicatorDisplayMode; // 0x1c2 (0x1)
	enum ECreativeBossDisplayMode CreativeBossHealthDisplayMode; // 0x1c3 (0x1)
	unsigned char unreflected_1c4[0x4]; // 0x1c4 (0x4) 
	struct FPropertyOverrideData AbilitySetOptionData; // 0x1c8 (0x50)
	struct TArray<struct FString> EnabledSettings; // 0x218 (0x10)
	unsigned char padding_228[0x50]; // 0x228 (0x50)

	/* Functions */

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.ResolvePendingRepOverrides (Underlying native function: ResolvePendingRepOverrides 0x84eed0c)
	void ResolvePendingRepOverrides(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.OnRep_PlayerHealthIndicatorDisplayMode (Underlying native function: OnRep_PlayerHealthIndicatorDisplayMode 0x84ee830)
	void OnRepPlayerHealthIndicatorDisplayMode(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.OnRep_NameplateDisplayMode (Underlying native function: OnRep_NameplateDisplayMode 0x84ee81c)
	void OnRepNameplateDisplayMode(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.OnRep_EnabledSettings (Underlying native function: OnRep_EnabledSettings 0x84ee780)
	void OnRepEnabledSettings(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.OnRep_CreativeBossHealthDisplayMode (Underlying native function: OnRep_CreativeBossHealthDisplayMode 0x84ee6cc)
	void OnRepCreativeBossHealthDisplayMode(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.OnRep_bWoodResourceWidgetVisible (Underlying native function: OnRep_bWoodResourceWidgetVisible 0x84ee904)
	void OnRepbWoodResourceWidgetVisible(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.OnRep_bStoneResourceWidgetVisible (Underlying native function: OnRep_bStoneResourceWidgetVisible 0x84ee8ec)
	void OnRepbStoneResourceWidgetVisible(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.OnRep_bMetalResourceWidgetVisible (Underlying native function: OnRep_bMetalResourceWidgetVisible 0x84ee8c0)
	void OnRepbMetalResourceWidgetVisible(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.OnRep_bGoldCurrencyResourceWidgetVisible (Underlying native function: OnRep_bGoldCurrencyResourceWidgetVisible 0x84ee8a8)
	void OnRepbGoldCurrencyResourceWidgetVisible(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.OnRep_AbilitySetOptionData (Underlying native function: OnRep_AbilitySetOptionData 0x84ee6b8)
	void OnRepAbilitySetOptionData(); // (Final | Native | Private)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.IsSettingEnabled (Underlying native function: IsSettingEnabled 0x84ee270)
	bool IsSettingEnabled(struct FName& PropertyName); // (Final | Native | Public | HasOutParms | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortPlayerSettingsComponentBase.GetHUDVisibilityTags (Underlying native function: GetHUDVisibilityTags 0x84ed9f8)
	struct FGameplayTagContainer GetHUDVisibilityTags(); // (Native | Event | Public | BlueprintEvent | Const)
};

