// Class /Script/FortniteGame.FortMeatballVehicleConfigs
// Size: 0x960
class UFortMeatballVehicleConfigs : public UFortPhysicsVehicleConfigs
{
	float WaterSteerRollFactor; // 0x890 (0x4)
	float InnerTurnPontoonOffsetMultiplier; // 0x894 (0x4)
	float OuterTurnPontoonOffsetMultiplier; // 0x898 (0x4)
	float MinForwardSpeedToBankOnTurn; // 0x89c (0x4)
	float BoostMinPushForce; // 0x8a0 (0x4)
	float BoostTopSpeedForceMultiplier; // 0x8a4 (0x4)
	float BoostTopSpeedMultiplier; // 0x8a8 (0x4)
	float MaxPontoonOffsetPerSecond; // 0x8ac (0x4)
	float LandTopSpeedMultiplier; // 0x8b0 (0x4)
	float LandPushForceMultiplier; // 0x8b4 (0x4)
	int MinPushPontoonsForWaterDriving; // 0x8b8 (0x4)
	float MaxWaterPitchAngle; // 0x8bc (0x4)
	float MinForwardSpeedToPitch; // 0x8c0 (0x4)
	float MinForwardSpeedForMaxPitch; // 0x8c4 (0x4)
	float MaxForwardSpeedForMaxPitch; // 0x8c8 (0x4)
	float MaxFowrardSpeedPitchFactor; // 0x8cc (0x4)
	float BoostMaxForwardSpeedPitchFactor; // 0x8d0 (0x4)
	float FrontLateralFrictionFactor; // 0x8d4 (0x4)
	float RearLateralFrictionFactor; // 0x8d8 (0x4)
	float LandFrontLateralFrictionFactor; // 0x8dc (0x4)
	float LandRearLateralFrictionFactor; // 0x8e0 (0x4)
	float LateralFrictionModStartSpeedKmh; // 0x8e4 (0x4)
	float RearLateralFrictionModPerSpeedKmh; // 0x8e8 (0x4)
	float FrontLateralFrictionModPerSpeedKmh; // 0x8ec (0x4)
	float SeatOffsetScaleX; // 0x8f0 (0x4)
	float SeatOffsetScaleY; // 0x8f4 (0x4)
	float SeatYawAngleMax; // 0x8f8 (0x4)
	float SeatPitchAngleMax; // 0x8fc (0x4)
	float BoostSteeringMultiplier; // 0x900 (0x4)
	float BoostSteeringMultiplierRampTime; // 0x904 (0x4)
	float LandSteeringMultiplier; // 0x908 (0x4)
	float LandMinSpeedSteeringAngle; // 0x90c (0x4)
	float LandMaxSpeedSteeringAngle; // 0x910 (0x4)
	float DragCoefficientNoAccel; // 0x914 (0x4)
	float DragCoefficient2NoAccel; // 0x918 (0x4)
	float DragCoefficientMultiplierRoad; // 0x91c (0x4)
	float DragCoefficientMultiplierGrass; // 0x920 (0x4)
	float DragCoefficientMultiplierDirt; // 0x924 (0x4)
	float DragCoefficientMultiplierSnow; // 0x928 (0x4)
	float DragCoefficientMultiplierIce; // 0x92c (0x4)
	float MinSteerAlphaForWaterFriction; // 0x930 (0x4)
	float TurnInPlaceYawStiff; // 0x934 (0x4)
	float TurnInPlaceYawDamp; // 0x938 (0x4)
	float MaxSteerRollAngle; // 0x93c (0x4)
	float MaxTurnInPlaceYawAngle; // 0x940 (0x4)
	float UprightSpringSteerStrength; // 0x944 (0x4)
	float TurnInPlaceYawStrength; // 0x948 (0x4)
	float MaxSpeedForTurnInPlaceKmH; // 0x94c (0x4)
	float BlendOutExtraSpeedTurnInPlaceKmH; // 0x950 (0x4)
	float MaxPitchForCameraInPlaceSteer; // 0x954 (0x4)
	float SpringLengthMutliplierWater; // 0x958 (0x4)
	unsigned char padding_95c[0x4]; // 0x95c (0x4)
};

