// Class /Script/FortniteGame.FortAnimAssetLocomotion
// Size: 0x138
class UFortAnimAssetLocomotion : public UDataAsset
{
	struct TArray<class UFortAnimAssetLocomotion*> ParentAnimSets; // 0x30 (0x10)
	enum ETriState EnableAdditiveLeans; // 0x40 (0x1)
	enum ETriState UseMovementAdditiveForOneHandedTransitions; // 0x41 (0x1)
	enum ETriState PlayMovementTransitions; // 0x42 (0x1)
	unsigned char unreflected_43[0x5]; // 0x43 (0x5) 
	class UBlendSpace* MovementBlendSpaceTargeting; // 0x48 (0x8)
	class UBlendSpace* MovementBlendSpaceTargetingRightFootForward; // 0x50 (0x8)
	class UBlendSpace* MovementBlendSpace; // 0x58 (0x8)
	class UBlendSpace* MovementBlendSpaceNo45s; // 0x60 (0x8)
	class UAnimSequenceBase* StartN; // 0x68 (0x8)
	class UAnimSequenceBase* StartS; // 0x70 (0x8)
	class UAnimSequenceBase* StartE; // 0x78 (0x8)
	class UAnimSequenceBase* StartW; // 0x80 (0x8)
	class UAnimSequenceBase* StopN; // 0x88 (0x8)
	class UAnimSequenceBase* StopS; // 0x90 (0x8)
	class UAnimSequenceBase* StopE; // 0x98 (0x8)
	class UAnimSequenceBase* StopW; // 0xa0 (0x8)
	class UAnimSequenceBase* PivotN; // 0xa8 (0x8)
	class UAnimSequenceBase* PivotS; // 0xb0 (0x8)
	class UAnimSequenceBase* PivotE; // 0xb8 (0x8)
	class UAnimSequenceBase* PivotW; // 0xc0 (0x8)
	class UBlendSpace* CrouchAdditiveLean; // 0xc8 (0x8)
	class UBlendSpace* AdditiveLean; // 0xd0 (0x8)
	class UAnimSequenceBase* AdditiveStartN; // 0xd8 (0x8)
	class UAnimSequenceBase* AdditiveStartS; // 0xe0 (0x8)
	class UAnimSequenceBase* AdditiveStartE; // 0xe8 (0x8)
	class UAnimSequenceBase* AdditiveStartW; // 0xf0 (0x8)
	class UAnimSequenceBase* AdditiveStopN; // 0xf8 (0x8)
	class UAnimSequenceBase* AdditiveStopS; // 0x100 (0x8)
	class UAnimSequenceBase* AdditiveStopE; // 0x108 (0x8)
	class UAnimSequenceBase* AdditiveStopW; // 0x110 (0x8)
	class UAnimSequenceBase* AdditivePivotN; // 0x118 (0x8)
	class UAnimSequenceBase* AdditivePivotS; // 0x120 (0x8)
	class UAnimSequenceBase* AdditivePivotE; // 0x128 (0x8)
	class UAnimSequenceBase* AdditivePivotW; // 0x130 (0x8)
};

