// Class /Script/FortniteAI.FortAIPerkBase
// Size: 0x168
class UFortAIPerkBase : public UObject
{
	struct FScalableFloat CooldownDuration; // 0x28 (0x28)
	struct FScalableFloat CooldownDurationRandomDeviation; // 0x50 (0x28)
	struct FScalableFloat ActivationCountBeforeCooldown; // 0x78 (0x28)
	struct FScalableFloat ActivationDuration; // 0xa0 (0x28)
	struct FScalableFloat ActivationDurationRandomDeviation; // 0xc8 (0x28)
	struct FScalableFloat OddsToActivate; // 0xf0 (0x28)
	struct FScalableFloat FailedActivationCooldownDuration; // 0x118 (0x28)
	struct FScalableFloat FailedActivationCooldownDurationRandomDeviation; // 0x140 (0x28)
};

