// Class /Script/FortniteGame.FortGamepadSettingsV2
// Size: 0x7f8
class UFortGamepadSettingsV2 : public UDataAsset
{
	class UCurveFloat* LookInputCurve; // 0x30 (0x8)
	struct FScalableFloat LookAdsEnterEaseTime; // 0x38 (0x28)
	struct FScalableFloat LookAdsExitEaseTime; // 0x60 (0x28)
	struct FScalableFloat LookAdsEaseExponent; // 0x88 (0x28)
	struct FScalableFloat LookBoostDeflection; // 0xb0 (0x28)
	struct FScalableFloat LookBoostAccelerationTime; // 0xd8 (0x28)
	struct FScalableFloat LookBoostAccelerationTimeAds; // 0x100 (0x28)
	struct FScalableFloat LookEaseTime; // 0x128 (0x28)
	struct FScalableFloat LookBuildModeMultiplier; // 0x150 (0x28)
	struct FScalableFloat LookEditModeMultiplier; // 0x178 (0x28)
	struct FScalableFloat LookHorizontalSpeed; // 0x1a0 (0x28)
	struct FScalableFloat LookVerticalSpeed; // 0x1c8 (0x28)
	struct FScalableFloat LookHorizontalSpeedAds; // 0x1f0 (0x28)
	struct FScalableFloat LookVerticalSpeedAds; // 0x218 (0x28)
	struct FScalableFloat LookHorizontalBoostSpeed; // 0x240 (0x28)
	struct FScalableFloat LookVerticalBoostSpeed; // 0x268 (0x28)
	struct FScalableFloat LookHorizontalBoostSpeedAds; // 0x290 (0x28)
	struct FScalableFloat LookVerticalBoostSpeedAds; // 0x2b8 (0x28)
	struct FFortAimAssist2D_Settings AimAssistSettings; // 0x2e0 (0x3b0)
	struct FFortFollowCam_Settings FollowCamSettings; // 0x690 (0x168)
};

