// Class /Script/FortniteUI.FortMobileHUDLayoutToolV2
// Size: 0xa90
class UFortMobileHUDLayoutToolV2 : public UCommonActivatablePanelLegacy
{
	unsigned char unreflected_4e0[0x8]; // 0x4e0 (0x8) 
	float OverlapPercentageToColapsePanels; // 0x4e8 (0x4)
	float NonEditableHUDWidgetOpacity; // 0x4ec (0x4)
	float PanelOpacityWhenDragedOver; // 0x4f0 (0x4)
	float OnOpenSubPanelAnimPlaybackSpeed; // 0x4f4 (0x4)
	struct FPrimaryContentSetup PrimaryContentSetup; // 0x4f8 (0x3)
	unsigned char unreflected_4fb[0x5]; // 0x4fb (0x5) 
	class UFortMobileHUDWidgetRegistry* HUDWidgetRegistry; // 0x500 (0x8)
	class UClass* HudLayoutToolPopupClass; // 0x508 (0x8)
	class UClass* HudLayoutToolTutorialPopupClass; // 0x510 (0x8)
	struct FHUDLayoutToolV2_PopupContent ExitHudLayoutToolPopupContent; // 0x518 (0x68)
	struct FHUDLayoutToolV2_PopupContent DeleteOutOfBoundsHUDProxiesPopupContent; // 0x580 (0x68)
	struct FHUDLayoutToolV2_PopupContent RevertAllProxiesPopupContent; // 0x5e8 (0x68)
	struct FHUDLayoutToolV2_PopupContent SwitchHUDProfileSavePopupContent; // 0x650 (0x68)
	struct FHUDLayoutToolV2_PopupContent SwitchHUDProfileDeletePopupContent; // 0x6b8 (0x68)
	struct FHUDLayoutToolV2_PopupContent CreateNewCustomLayoutPopupContent; // 0x720 (0x68)
	struct FHUDLayoutToolV2_PopupContent CustomLayoutSlotsFullPopupContent; // 0x788 (0x68)
	struct FHUDLayoutToolV2_ToastNotificationContent SuccessToasterContent; // 0x7f0 (0x38)
	struct FHUDLayoutToolV2_ToastNotificationContent FailureToasterContent; // 0x828 (0x38)
	struct FHUDLayoutToolV2_ToastNotificationContent LocalFailureToasterContent; // 0x860 (0x38)
	struct FHUDLayoutToolV2_ToastNotificationContent CloudFailureToasterContent; // 0x898 (0x38)
	struct FGameplayTag AnchorsCustomPropertyTag; // 0x8d0 (0x4)
	float DoubleClickDelay; // 0x8d4 (0x4)
	struct FFortMobileHUDLayoutProfile LayoutProfile; // 0x8d8 (0x40)
	struct FFortMobileHUDLayoutProfile CachedSavedLayoutProfile; // 0x918 (0x40)
	class UFortMobileHUDElementProxy* SelectedWidgetProxy; // 0x958 (0x8)
	struct TArray<class UHUDLayoutToolV2_Popup*> QueuedPopups; // 0x960 (0x10)
	unsigned char unreflected_970[0x78]; // 0x970 (0x78) 
	class UHUDLayoutToolV2_VirtualCanvas* VirtualCanvasWidgetLayer; // 0x9e8 (0x8)
	class UFortMobileHUDLayer* HUDLayerHUDWidgetProxies; // 0x9f0 (0x8)
	class UOverlay* OverlayVirtualCanvasWorkspace; // 0x9f8 (0x8)
	class UHUDLayoutToolV2_Grid* GridVisual; // 0xa00 (0x8)
	class UCommonTextBlock* TextProfileName; // 0xa08 (0x8)
	class UCommonTextBlock* TextWidgetName; // 0xa10 (0x8)
	class UCommonTextBlock* TextContextName; // 0xa18 (0x8)
	class UHUDLayoutToolV2_Button* ButtonExit; // 0xa20 (0x8)
	class UHUDLayoutToolV2_Button* ButtonResetVirtualCanvas; // 0xa28 (0x8)
	class UHUDLayoutToolV2_Button* ButtonToggleControlPanel; // 0xa30 (0x8)
	class UHUDLayoutToolV2_Button* ButtonToggleWidgetCatalog; // 0xa38 (0x8)
	class UCanvasPanel* CanvasPanelControlsContainer; // 0xa40 (0x8)
	class UVerticalBox* VerticalBoxControlPanelContainer; // 0xa48 (0x8)
	class UFortMobileHUDLayoutToolV2_ControlPanel* ControlPanelControls; // 0xa50 (0x8)
	class UHUDLayoutToolV2_ProfileSelectionPanel* ProfileSelectionPanelProfiles; // 0xa58 (0x8)
	class UFortMobileHUDLayoutToolV2_WidgetCatalog* WidgetCatalogCatalog; // 0xa60 (0x8)
	class UHUDLayoutToolV2_LinkAcrossPanel* LinkAcrossPanelLinkManagementWindow; // 0xa68 (0x8)
	class UWidgetAnimation* AnimControlPanelToggle; // 0xa70 (0x8)
	class UWidgetAnimation* AnimToggleWidgetCatalog; // 0xa78 (0x8)
	class UHUDLayoutToolV2_Toaster* ToasterNotifications; // 0xa80 (0x8)
	class UHUDLayoutToolV2_TooltipLayer* TooltipLayerMessages; // 0xa88 (0x8)
};

