// Class /Script/IrwinRuntime.FortAIFaunaAnimInstance
// Size: 0x6d0
class UFortAIFaunaAnimInstance : public UFortAIAnimInstance
{
	float AverageSpeed; // 0x570 (0x4)
	float AverageSpeedTimeFrame; // 0x574 (0x4)
	bool bHasValidAimTarget; // 0x578 (0x1)
	unsigned char unreflected_579[0x3]; // 0x579 (0x3) 
	float AimTime; // 0x57c (0x4)
	struct FVector AimTargetLocation; // 0x580 (0x18)
	bool bIsSurfaceSwimming; // 0x598 (0x1)
	bool bIsMovingOnGround; // 0x599 (0x1)
	bool bIsInTornado; // 0x59a (0x1)
	unsigned char unreflected_59b[0x1]; // 0x59b (0x1) 
	float LookAtAlpha; // 0x59c (0x4)
	float MaxDistanceToPlayerForLookAt; // 0x5a0 (0x4)
	float LookAtTooFarFromPlayerTimeOut; // 0x5a4 (0x4)
	bool bDisableLookAtDuringMontage; // 0x5a8 (0x1)
	unsigned char unreflected_5a9[0x3]; // 0x5a9 (0x3) 
	struct FName DisableHeadTrackingCurveName; // 0x5ac (0x4)
	struct FRidingAnimationData RidingAnimationData; // 0x5b0 (0x14)
	bool bIsSlopeSliding; // 0x5c4 (0x1)
	unsigned char unreflected_5c5[0x3]; // 0x5c5 (0x3) 
	float SlopeSlidingPitch; // 0x5c8 (0x4)
	float SlopeSlidingRoll; // 0x5cc (0x4)
	float RidingMovePlayRate; // 0x5d0 (0x4)
	bool bJustGotPlayer; // 0x5d4 (0x1)
	bool bIsBoosting; // 0x5d5 (0x1)
	bool bIsTurningInPlace; // 0x5d6 (0x1)
	unsigned char unreflected_5d7[0x1]; // 0x5d7 (0x1) 
	float TurnInPlaceRotationSpeed; // 0x5d8 (0x4)
	float TurnInPlaceAngleDelta; // 0x5dc (0x4)
	bool bIsMovingBackwards; // 0x5e0 (0x1)
	unsigned char unreflected_5e1[0x3]; // 0x5e1 (0x3) 
	float RiderReferentialYaw; // 0x5e4 (0x4)
	float BoostPlayRate; // 0x5e8 (0x4)
	bool bIsTurnInPlaceAngleDeltaPositive; // 0x5ec (0x1)
	bool bPlayLandAdditive; // 0x5ed (0x1)
	unsigned char unreflected_5ee[0x2]; // 0x5ee (0x2) 
	float BackwardVelocity; // 0x5f0 (0x4)
	bool bShouldPlayStopBackwards; // 0x5f4 (0x1)
	unsigned char unreflected_5f5[0x3]; // 0x5f5 (0x3) 
	float SwimmingYaw; // 0x5f8 (0x4)
	float BackwardsPlayRate; // 0x5fc (0x4)
	float BodyRoll; // 0x600 (0x4)
	float TurnAngleStored; // 0x604 (0x4)
	bool bWasTurningRight; // 0x608 (0x1)
	enum ERidingFootPhase FootPhase; // 0x609 (0x1)
	bool bIsFootPhaseFeetInAir; // 0x60a (0x1)
	bool bIsFootPhaseFrontFeetPlanted; // 0x60b (0x1)
	bool bIsFootPhaseBackFeetPlanted; // 0x60c (0x1)
	bool bIsFootPhaseLeftBackFeetForward; // 0x60d (0x1)
	bool bIsFootPhaseRightBackFeetForward; // 0x60e (0x1)
	bool bIsFootPhaseLeftPlantedRightPass; // 0x60f (0x1)
	bool bIsFootPhaseRightPlantedLeftPass; // 0x610 (0x1)
	unsigned char unreflected_611[0x7]; // 0x611 (0x7) 
	struct FGameplayTagContainer SlipstreamTags; // 0x618 (0x20)
	bool bIsInSlipstream; // 0x638 (0x1)
	unsigned char unreflected_639[0x7]; // 0x639 (0x7) 
	struct FGameplayTagContainer SkydivingTags; // 0x640 (0x20)
	bool bMovementModeSkydiving; // 0x660 (0x1)
	unsigned char unreflected_661[0x7]; // 0x661 (0x7) 
	struct FGameplayTagContainer SkytubingTags; // 0x668 (0x20)
	bool bGameplayStatusSkytubing; // 0x688 (0x1)
	bool bIsAbducted; // 0x689 (0x1)
	unsigned char unreflected_68a[0x6]; // 0x68a (0x6) 
	struct FGameplayTagContainer TractorBeamTags; // 0x690 (0x20)
	bool bIsInTractorBeam; // 0x6b0 (0x1)
	bool bIsFloating; // 0x6b1 (0x1)
	unsigned char unreflected_6b2[0x2]; // 0x6b2 (0x2) 
	float JustGotPlayerInitialDelaySec; // 0x6b4 (0x4)
	unsigned char padding_6b8[0x18]; // 0x6b8 (0x18)

	/* Functions */

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.UpdateTurnAngleStored (Underlying native function: UpdateTurnAngleStored 0x6e180a8)
	void UpdateTurnAngleStored(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.UpdateSwimmingYaw (Underlying native function: UpdateSwimmingYaw 0x721d17c)
	void UpdateSwimmingYaw(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.UpdateRidingMovePlayRate (Underlying native function: UpdateRidingMovePlayRate 0x721d0a8)
	void UpdateRidingMovePlayRate(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.UpdatePlayLandAdditive (Underlying native function: UpdatePlayLandAdditive 0x721d090)
	void UpdatePlayLandAdditive(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.UpdateFootPhaseStop (Underlying native function: UpdateFootPhaseStop 0x721cf5c)
	void UpdateFootPhaseStop(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.UpdateBoostPlayRate (Underlying native function: UpdateBoostPlayRate 0x721ced8)
	void UpdateBoostPlayRate(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.UpdateBodyRoll (Underlying native function: UpdateBodyRoll 0x721cec0)
	void UpdateBodyRoll(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.UpdateBackwardVelocity (Underlying native function: UpdateBackwardVelocity 0x721ce64)
	void UpdateBackwardVelocity(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.UpdateBackwardsPlayRate (Underlying native function: UpdateBackwardsPlayRate 0x721ce7c)
	void UpdateBackwardsPlayRate(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.FinishFootPhaseStopUpdate (Underlying native function: FinishFootPhaseStopUpdate 0x721ce4c)
	void FinishFootPhaseStopUpdate(); // (Native | Event | Public | BlueprintEvent)

	// Function /Script/IrwinRuntime.FortAIFaunaAnimInstance.CalculateLookAtAlpha (Underlying native function: CalculateLookAtAlpha 0x721cc50)
	void CalculateLookAtAlpha(bool& bForceDisableLookAt, float& DeltaSeconds); // (Final | Native | Public | BlueprintCallable)
};

