// Class /Script/FortniteAI.FortAthenaAIBotAttackingDigestedSkillSet
// Size: 0x140
class UFortAthenaAIBotAttackingDigestedSkillSet : public UFortAthenaAIBotDigestedSkillSet
{
	float MaxDistanceToEngageMeleeSq; // 0x30 (0x4)
	float MinDistanceToGiveUpMeleeSq; // 0x34 (0x4)
	float MaxDistanceToThrowMeleeAttackSq; // 0x38 (0x4)
	float ExcludeReachingTargetInMeleeTime; // 0x3c (0x4)
	float ExcludeReachingTargetMoveDistanceSquared; // 0x40 (0x4)
	bool bUseContinuousMeleeAttack; // 0x44 (0x1)
	bool bOnlyEngageMeleeAgainstThreatThatHasNoRangeWeapon; // 0x45 (0x1)
	bool bOnlyUsePickaxeAgainstGameParticipants; // 0x46 (0x1)
	unsigned char unreflected_47[0x1]; // 0x47 (0x1) 
	float MaxDistanceToConsiderAsAnAlternateTargetSq; // 0x48 (0x4)
	bool bEnableAlternateTargetRequiredTags; // 0x4c (0x1)
	unsigned char unreflected_4d[0x3]; // 0x4d (0x3) 
	struct FGameplayTagContainer AlternateTargetRequiredTags; // 0x50 (0x20)
	bool bEnableWTFBehavior; // 0x70 (0x1)
	unsigned char unreflected_71[0x3]; // 0x71 (0x3) 
	float MinCooldownDelayBetweenMeleeAttackAttempts; // 0x74 (0x4)
	float MaxCooldownDelayBetweenMeleeAttackAttempts; // 0x78 (0x4)
	unsigned char unreflected_7c[0x4]; // 0x7c (0x4) 
	struct FGameplayTagContainer ThrowableGameplayTags; // 0x80 (0x20)
	struct FGameplayTagQuery CombatMeleeTagQuery; // 0xa0 (0x48)
	int MinThrowableCount; // 0xe8 (0x4)
	int MaxThrowableCount; // 0xec (0x4)
	float ThrowableCooldownMin; // 0xf0 (0x4)
	float ThrowableCooldownMax; // 0xf4 (0x4)
	float ThrowableMinimumRangeSquared; // 0xf8 (0x4)
	bool bThrowableEvaluatorActive; // 0xfc (0x1)
	unsigned char unreflected_fd[0x3]; // 0xfd (0x3) 
	float RetreatMinHealthRange; // 0x100 (0x4)
	float RetreatMaxHealthRange; // 0x104 (0x4)
	float RetreatProbability; // 0x108 (0x4)
	float RetreatRangeMinSquared; // 0x10c (0x4)
	float RetreatRangeMaxSquared; // 0x110 (0x4)
	float RetreatMaxDuration; // 0x114 (0x4)
	struct FVector RetreatPositionBoxExtent; // 0x118 (0x18)
	bool CautiousInvestigationEnabled; // 0x130 (0x1)
	unsigned char unreflected_131[0x3]; // 0x131 (0x3) 
	float TimeSinceLastStimToBeCautious; // 0x134 (0x4)
	float CautiousInvestigationTimeMax; // 0x138 (0x4)
	unsigned char padding_13c[0x4]; // 0x13c (0x4)
};

