// Class /Script/NevadaRuntime.FortNevadaVehicleAnimInstance
// Size: 0x6e0
class UFortNevadaVehicleAnimInstance : public UFortVehicleAnimInstance
{
	class AFortNevadaVehicle* NevadaVehicle; // 0x5f0 (0x8)
	bool bTractorBeamIsAttached; // 0x5f8 (0x1)
	bool bTractorBeamIsCharging; // 0x5f9 (0x1)
	bool bTractorBeamIsActive; // 0x5fa (0x1)
	bool bTractorBeamIsInactive; // 0x5fb (0x1)
	bool bTractorBeamIsOn; // 0x5fc (0x1)
	bool bTractorBeamHasTarget; // 0x5fd (0x1)
	bool bTractorBeamShouldApplyCustomAO; // 0x5fe (0x1)
	unsigned char unreflected_5ff[0x1]; // 0x5ff (0x1) 
	float TractorBeamLookAtPitch; // 0x600 (0x4)
	float TractorBeamLookAtYaw; // 0x604 (0x4)
	float LeanLeftRight; // 0x608 (0x4)
	float LeanForwardBackward; // 0x60c (0x4)
	float LeanValue; // 0x610 (0x4)
	float PreviousLeanValue; // 0x614 (0x4)
	float VelocityZValue; // 0x618 (0x4)
	float LeanDelta; // 0x61c (0x4)
	bool bTurnAgain; // 0x620 (0x1)
	bool bHadDriver; // 0x621 (0x1)
	bool bJustGotDriver; // 0x622 (0x1)
	bool bJustLostDriver; // 0x623 (0x1)
	bool bWasBoosting; // 0x624 (0x1)
	bool bIsBoosting; // 0x625 (0x1)
	unsigned char unreflected_626[0x2]; // 0x626 (0x2) 
	int PreviousBoostCount; // 0x628 (0x4)
	int BoostCount; // 0x62c (0x4)
	bool bIsBoostingAgain; // 0x630 (0x1)
	bool bIsMoving; // 0x631 (0x1)
	unsigned char unreflected_632[0x2]; // 0x632 (0x2) 
	float WingsPlayRate; // 0x634 (0x4)
	float TractorBeamAlpha; // 0x638 (0x4)
	float AimPitch; // 0x63c (0x4)
	float AimYaw; // 0x640 (0x4)
	bool bIsFiringCannon; // 0x644 (0x1)
	unsigned char unreflected_645[0x3]; // 0x645 (0x3) 
	float DistanceFromGround; // 0x648 (0x4)
	bool bIsLanding; // 0x64c (0x1)
	bool bHasLanded; // 0x64d (0x1)
	unsigned char unreflected_64e[0x2]; // 0x64e (0x2) 
	float LandingAlpha; // 0x650 (0x4)
	bool bNotLandingMode; // 0x654 (0x1)
	bool bHadBattery; // 0x655 (0x1)
	bool bOutOfBattery; // 0x656 (0x1)
	bool bJustGotBattery; // 0x657 (0x1)
	bool bLaunchToDepart; // 0x658 (0x1)
	bool bLaunchToIdle; // 0x659 (0x1)
	bool bIsPartsLanding; // 0x65a (0x1)
	unsigned char unreflected_65b[0x1]; // 0x65b (0x1) 
	struct FName TractorBeamSocketName; // 0x65c (0x4)
	struct FName TractorBeamAimCurveName; // 0x660 (0x4)
	struct FName NevadaVehicleInterruptName; // 0x664 (0x4)
	struct FName LandingTraceRightName; // 0x668 (0x4)
	struct FName LandingTraceLeftName; // 0x66c (0x4)
	float MaxLeanDeltaInterruptMagnitude; // 0x670 (0x4)
	float MinForwardSpeedToBeMoving; // 0x674 (0x4)
	float MinForwardSpeedToPlayWings; // 0x678 (0x4)
	float MinWingsPlayRate; // 0x67c (0x4)
	float MaxWingsPlayRate; // 0x680 (0x4)
	float WingsPlayRateInterpSpeed; // 0x684 (0x4)
	struct TWeakObjectPtr<class UAnimMontage> CannonFiringMontage; // 0x688 (0x28)
	float LandingGearTraceLength; // 0x6b0 (0x4)
	unsigned char padding_6b4[0x2c]; // 0x6b4 (0x2c)
};

