// Class /Script/FortniteGame.FortDefenderAnimInstance
// Size: 0x590
class UFortDefenderAnimInstance : public UFortAIAnimInstance
{
	struct TEnumAsByte<EFortCustomGender> Gender; // 0x570 (0x1)
	unsigned char unreflected_571[0x3]; // 0x571 (0x3) 
	unsigned char bShouldWalkRightFootForward; // 0x574 (0x1)
	unsigned char bIsChargingWeapon; // 0x574 (0x1)
	unsigned char unreflected_575[0x3]; // 0x575 (0x3) 
	float SpeedAdjustedPlayrate; // 0x578 (0x4)
	float AuthoredJogSpeed; // 0x57c (0x4)
	float AuthoredWalkSpeed; // 0x580 (0x4)
	unsigned char padding_584[0xc]; // 0x584 (0xc)
};

