// Class /Script/FortniteGame.FortContextualTutorialDefinition_NearNPCs
// Size: 0x158
class UFortContextualTutorialDefinition_NearNPCs : public UFortContextualTutorialDefinition
{
	struct FGameplayTagContainer GameplayTags; // 0x100 (0x20)
	float RayCastFarDistance; // 0x120 (0x4)
	float RayCastNearDistance; // 0x124 (0x4)
	bool bInventoryRequirement; // 0x128 (0x1)
	unsigned char unreflected_129[0x7]; // 0x129 (0x7) 
	struct FGameplayTagContainer BlockedByTags; // 0x130 (0x20)
	struct FGameplayTag GamePlayEventTag; // 0x150 (0x4)
	unsigned char padding_154[0x4]; // 0x154 (0x4)
};

