// Class /Script/FortniteGame.FortVehicleConfigs
// Size: 0x308
class UFortVehicleConfigs : public UObject
{
	int NumWheelsTouchingGroundForWheelsOnGround; // 0x28 (0x4)
	float TimeToIdleBrake; // 0x2c (0x4)
	float ChangeDirBrakeDelta; // 0x30 (0x4)
	float VehicleSleepCounter; // 0x34 (0x4)
	float GasPedalDownMinSpeed; // 0x38 (0x4)
	float AcceleratingSpeedThresholdMin; // 0x3c (0x4)
	float AcceleratingSpeedThresholdMax; // 0x40 (0x4)
	float VehicleMinFOV; // 0x44 (0x4)
	float VehicleMaxFOV; // 0x48 (0x4)
	float VehicleMinFOVSpeed; // 0x4c (0x4)
	float VehicleMaxFOVSpeed; // 0x50 (0x4)
	float VehicleFOVInterpSpeed; // 0x54 (0x4)
	float VehicleFOVPassengerInterpSpeed; // 0x58 (0x4)
	float CameraSpaceForwardDistanceOverride; // 0x5c (0x4)
	bool bStandingPlayerMatchesVehicleOrientation; // 0x60 (0x1)
	bool bPreventCameraBlockedByFriendlyPassenger; // 0x61 (0x1)
	bool bPreventCameraBlockedByEnemyPassenger; // 0x62 (0x1)
	unsigned char unreflected_63[0x5]; // 0x63 (0x5) 
	class UClass* DriverCameraShakeClass; // 0x68 (0x8)
	class UClass* OffroadCamShakeClass; // 0x70 (0x8)
	float OffroadCameraShakeOscillationYAmplitude; // 0x78 (0x4)
	float OffroadCameraShakeOscillationZAmplitude; // 0x7c (0x4)
	float OffroadCameraShakeMaxVehicleSpeed; // 0x80 (0x4)
	float OffroadCameraShakeOscillationRotationAmplitude; // 0x84 (0x4)
	float OffroadCameraShakeOscillationMinFrequency; // 0x88 (0x4)
	float OffroadCameraShakeOscillationMaxFrequency; // 0x8c (0x4)
	class UClass* AcceleratingCamShakeClass; // 0x90 (0x8)
	float AcceleratingMaxSpeedForCameraShakeIntensity; // 0x98 (0x4)
	float AcceleratingMaxCameraShakeIntensity; // 0x9c (0x4)
	float AcceleratingCameraShakeIntensityFalloff; // 0xa0 (0x4)
	float AcceleratingForceFeedbackDuration; // 0xa4 (0x4)
	bool bAcceleratingAffectsLeftLarge; // 0xa8 (0x1)
	bool bAcceleratingAffectsLeftSmall; // 0xa9 (0x1)
	bool bAcceleratingAffectsRightLarge; // 0xaa (0x1)
	bool bAcceleratingAffectsRightSmall; // 0xab (0x1)
	float AcceleratingMaxSpeedForForceFeedbackIntensity; // 0xac (0x4)
	float AcceleratingMaxForceFeedbackIntensity; // 0xb0 (0x4)
	float AcceleratingForceFeedbackIntensityFalloff; // 0xb4 (0x4)
	float InteractDistanceScalar; // 0xb8 (0x4)
	float MinFallDamageHeight; // 0xbc (0x4)
	float MaxFallDamageHeight; // 0xc0 (0x4)
	float MinFallDamage; // 0xc4 (0x4)
	float MaxFallDamage; // 0xc8 (0x4)
	float PlayerFallDamageMultiplier; // 0xcc (0x4)
	bool bDamageFriendlyVehicles; // 0xd0 (0x1)
	bool bDamageOtherVehicles; // 0xd1 (0x1)
	bool bDamageOwnVehicle; // 0xd2 (0x1)
	bool bDamageAllowedFromOtherVehicle; // 0xd3 (0x1)
	float VehicleEjectCooldown; // 0xd4 (0x4)
	float PlayerToSocketSweepRadius; // 0xd8 (0x4)
	float VehicleGravity; // 0xdc (0x4)
	float PlayerGravityMultiplier; // 0xe0 (0x4)
	float PassengerDamageOnDestruction; // 0xe4 (0x4)
	float MinFallDamageNormalScale; // 0xe8 (0x4)
	float DriverExitLaunchScalar; // 0xec (0x4)
	float DriverExitLaunchUpScalar; // 0xf0 (0x4)
	float DriverExitInAirLaunchScalar; // 0xf4 (0x4)
	float DriverExitInAirLaunchUpScalar; // 0xf8 (0x4)
	float PassengerExitLaunchScalar; // 0xfc (0x4)
	float PassengerExitLaunchUpScalar; // 0x100 (0x4)
	float PassengerExitInAirLaunchScalar; // 0x104 (0x4)
	float PassengerExitInAirLaunchUpScalar; // 0x108 (0x4)
	bool bCanDoTricks; // 0x10c (0x1)
	bool bShouldDriverHaveReticle; // 0x10d (0x1)
	bool bSupportsWraps; // 0x10e (0x1)
	unsigned char unreflected_10f[0x1]; // 0x10f (0x1) 
	float ExitVehicleCoolDown; // 0x110 (0x4)
	bool bShouldProtectFromFireDamage; // 0x114 (0x1)
	bool bInheritScale; // 0x115 (0x1)
	unsigned char unreflected_116[0x2]; // 0x116 (0x2) 
	float HoldToExitTime; // 0x118 (0x4)
	float ForceExitZOffset; // 0x11c (0x4)
	bool bBlockBuilding; // 0x120 (0x1)
	bool bPreferDriverSeatWhenEmpty; // 0x121 (0x1)
	bool bCanUseSkeletalMeshSimulationUpdatesChildTransforms; // 0x122 (0x1)
	unsigned char unreflected_123[0x1]; // 0x123 (0x1) 
	float FireDamagePerSecond; // 0x124 (0x4)
	float FireDamageTickRate; // 0x128 (0x4)
	bool bCanBeOnFire; // 0x12c (0x1)
	unsigned char unreflected_12d[0x3]; // 0x12d (0x3) 
	struct TArray<struct FVehicleDamageablePartConfig> DamageableParts; // 0x130 (0x10)
	struct TArray<struct FName> ToggleablePartNames; // 0x140 (0x10)
	struct TArray<struct FVehicleWeaponReticle3DConfig> WeaponDynamicReticleData; // 0x150 (0x10)
	struct FScalableFloat UnoccupiedAutoDestroyTime; // 0x160 (0x28)
	float HUDTopSpeed; // 0x188 (0x4)
	unsigned char unreflected_18c[0x4]; // 0x18c (0x4) 
	struct FText PlayerFacingLocName; // 0x190 (0x18)
	float WheelRotationRange; // 0x1a8 (0x4)
	float VehicleFrontLowLateralFrictionMultiplier; // 0x1ac (0x4)
	float VehicleRearLowLateralFrictionMultiplier; // 0x1b0 (0x4)
	float VehicleFrontHighLateralFrictionMultiplier; // 0x1b4 (0x4)
	float VehicleRearHighLateralFrictionMultiplier; // 0x1b8 (0x4)
	float LowToHighFrictionDuration; // 0x1bc (0x4)
	float UphillIncline; // 0x1c0 (0x4)
	float ReverseToForwardFrontFriction; // 0x1c4 (0x4)
	float ReverseToForwardRearFriction; // 0x1c8 (0x4)
	float ReverseToForwardMaxSpeed; // 0x1cc (0x4)
	struct TMap<struct FGameplayTag, struct FTireInfo> TireModDataMapping; // 0x1d0 (0x50)
	float HonkTimeMax; // 0x220 (0x4)
	float HonkCooldownMax; // 0x224 (0x4)
	float HonkTimePerHonk; // 0x228 (0x4)
	float ServerExtraHealth; // 0x22c (0x4)
	float MaxTimeZeroHealth; // 0x230 (0x4)
	float MaxTimeExplosion; // 0x234 (0x4)
	float SelfDestructTime; // 0x238 (0x4)
	float MaxTimeSelfDestructCleanup; // 0x23c (0x4)
	struct FGameplayTagQuery SkipDamageWhileCriticalHealthTagQuery; // 0x240 (0x48)
	struct FScalableFloat SquadRestrictionEnabled; // 0x288 (0x28)
	struct FText SquadRestrictionText; // 0x2b0 (0x18)
	struct FScalableFloat TeamRestrictionEnabled; // 0x2c8 (0x28)
	struct FText TeamRestrictionText; // 0x2f0 (0x18)
};

