// Class /Script/FortniteUI.FortUIDataConfiguration
// Size: 0x4b00
class UFortUIDataConfiguration : public UPrimaryDataAsset
{
	unsigned char unreflected_30[0x8]; // 0x30 (0x8) 
	struct FString DefaultUIDataConfigurationPath; // 0x38 (0x10)
	struct FString DefaultBROnlyUIDataConfigurationPath; // 0x48 (0x10)
	struct FString MobileBROnlyUIDataConfigurationPath; // 0x58 (0x10)
	struct FStateWidgetEntry StateWidgetClasses[0xd]; // 0x68 (0x30) (ARRAY) 
	struct FStateWidgetEntry CampaignFrontEndWidget; // 0x2d8 (0x30)
	struct TWeakObjectPtr<class UClass> StartupStateWidgetLogin; // 0x308 (0x28)
	struct TWeakObjectPtr<class UClass> StartupStateWidgetSubgameSelect; // 0x330 (0x28)
	struct TWeakObjectPtr<class UClass> AthenaStateWidgetFrontend; // 0x358 (0x28)
	struct TWeakObjectPtr<class UClass> AthenaStateWidgetMobileFrontend; // 0x380 (0x28)
	struct TWeakObjectPtr<class UClass> AthenaStateWidgetStandaloneFrontend; // 0x3a8 (0x28)
	struct TWeakObjectPtr<class UClass> AthenaStateWidgetMobileStandaloneFrontend; // 0x3d0 (0x28)
	struct TWeakObjectPtr<class UClass> AthenaStateWidgetNightNightMode; // 0x3f8 (0x28)
	struct TWeakObjectPtr<class UClass> AthenaStateWidgetHUD; // 0x420 (0x28)
	struct TWeakObjectPtr<class UClass> AthenaStateWidgetMobileHUD; // 0x448 (0x28)
	struct TWeakObjectPtr<class UClass> HUDLayoutToolV2SoftClass; // 0x470 (0x28)
	struct TWeakObjectPtr<class UClass> AthenaStateWidgetReplay; // 0x498 (0x28)
	struct TWeakObjectPtr<class UClass> MFAModalClass; // 0x4c0 (0x28)
	struct TWeakObjectPtr<class UClass> EulaClass; // 0x4e8 (0x28)
	struct TWeakObjectPtr<class UClass> FactionScreenSoftClassRef; // 0x510 (0x28)
	struct TWeakObjectPtr<class UClass> CreativeServerBrowserSoftClassRef; // 0x538 (0x28)
	struct TWeakObjectPtr<class UClass> BattleLabServerBrowserSoftClassRef; // 0x560 (0x28)
	struct TWeakObjectPtr<class UClass> RegionLockMessageWidgetClass; // 0x588 (0x28)
	struct TMap<struct TEnumAsByte<EFortBrushSize>, int> StandardImageBrushSizes; // 0x5b0 (0x50)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> PowerRatingIconMultiSizeBrush; // 0x600 (0x28)
	struct FLinearColor PowerRatingEnchantedPositiveColorOverride; // 0x628 (0x10)
	struct FLinearColor PowerRatingEnchantedNegativeColorOverride; // 0x638 (0x10)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> FilledTierPipMultiSizeBrush; // 0x648 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> UnfilledTierPipMultiSizeBrush; // 0x670 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> PreviewingTierPipMultiSizeBrush; // 0x698 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> PromotedTierPipMultiSizeBrush; // 0x6c0 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> UpgradeArrowMultiSizeBrush; // 0x6e8 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> ComparisonUpArrowMultiSizeBrush; // 0x710 (0x28)
	struct FLinearColor BetterComparisonResultColor; // 0x738 (0x10)
	struct FLinearColor WorseComparisonResultColor; // 0x748 (0x10)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> InventoryOverflowIndicatorMultiSizeBrush; // 0x758 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> TrackedSchematicIndicatorMultiSizeBrush; // 0x780 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> FavoritedItemIndicatorMultiSizeBrush; // 0x7a8 (0x28)
	unsigned char VariantToWidgetMaping_7d0[0x50]; // 0x7d0 (0x50) (UNHANDLED PROPERTY TYPE: MapProperty UID: 0)
	struct TWeakObjectPtr<class UClass> PlayerSurveyWidgetClass; // 0x820 (0x28)
	bool bEnableSocialFeatures; // 0x848 (0x1)
	bool bEnableChat; // 0x849 (0x1)
	bool bEnablePartyFeatures; // 0x84a (0x1)
	unsigned char unreflected_84b[0x5]; // 0x84b (0x5) 
	struct TMap<enum ESocialChannelType, struct FSocialChatMessageEntryStyle> ChatChannelStyles; // 0x850 (0x50)
	class UClass* SocialPanelClass; // 0x8a0 (0x8)
	class UClass* TeamMemberManageClass; // 0x8a8 (0x8)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> UnlockedSquadSlotBorderMultiSizeBrush; // 0x8b0 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> LockedSquadSlotBorderMultiSizeBrush; // 0x8d8 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> ReadOnlySquadSlotBorderMultiSizeBrush; // 0x900 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> DefenderIconMultiSizeBrush; // 0x928 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> AssaultDefenderIconMultiSizeBrush; // 0x950 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> PistolDefenderIconMultiSizeBrush; // 0x978 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> MeleeDefenderIconMultiSizeBrush; // 0x9a0 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> SniperDefenderIconMultiSizeBrush; // 0x9c8 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> ShotgunDefenderIconMultiSizeBrush; // 0x9f0 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> LeadSurvivorIconMultiSizeBrush; // 0xa18 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> SurvivorIconMultiSizeBrush; // 0xa40 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> TrapIconMultiSizeBrush; // 0xa68 (0x28)
	struct TWeakObjectPtr<class UClass> KeybindWidgetClass; // 0xa90 (0x28)
	struct TWeakObjectPtr<class UClass> HiddenCursorWidget; // 0xab8 (0x28)
	struct TWeakObjectPtr<class UClass> VirtualCursorWidget; // 0xae0 (0x28)
	struct FRuntimeFloatCurve UIScaleCurve; // 0xb08 (0x88)
	struct FRuntimeFloatCurve FrontEndUIScaleCurve; // 0xb90 (0x88)
	struct TWeakObjectPtr<class UDataTable> EventsStyleDataTable; // 0xc18 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> DefaultDivisionRoundIcon; // 0xc40 (0x28)
	struct TMap<int, struct TWeakObjectPtr<class UMaterialInterface>> DivisionRoundToIcons; // 0xc68 (0x50)
	struct TMap<int, struct TWeakObjectPtr<class UMaterialInterface>> DivisionRoundToFancyIcons; // 0xcb8 (0x50)
	struct TMap<struct TEnumAsByte<EFortBrushSize>, class UClass*> ItemCardPowerRatingTextStylesByBrushSize; // 0xd08 (0x50)
	struct TMap<struct TEnumAsByte<EFortBrushSize>, class UClass*> ItemCardStackCountTextStylesByBrushSize; // 0xd58 (0x50)
	struct TWeakObjectPtr<class UMaterialInterface> ItemCardLevelMeterMaterial; // 0xda8 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> ItemCardDurabilityMeterMaterial; // 0xdd0 (0x28)
	unsigned char unreflected_df8[0x8]; // 0xdf8 (0x8) 
	struct FSlateBrush ItemCardBackgroundPlateBrush; // 0xe00 (0xc0)
	struct FSlateBrush ItemCardRarityGradientBrush; // 0xec0 (0xc0)
	struct FSlateBrush ItemCardDefenderPortraitBackgroundBrush; // 0xf80 (0xc0)
	struct FSlateBrush ItemCardHeroPortraitBackgroundBrush; // 0x1040 (0xc0)
	struct FSlateBrush ItemCardLeadSurvivorPortraitBackgroundBrush; // 0x1100 (0xc0)
	struct FSlateBrush ItemCardSchematicBackgroundBrush; // 0x11c0 (0xc0)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> ItemCardRewardTraitsBackgroundMultiSizeBrush; // 0x1280 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> ItemCardSchematicTraitsBackgroundMultiSizeBrush; // 0x12a8 (0x28)
	struct TWeakObjectPtr<class UClass> MatchReadyDesktopPopupWidgetType; // 0x12d0 (0x28)
	struct TWeakObjectPtr<class UClass> PlayerFeedbackModalWidget; // 0x12f8 (0x28)
	bool bLimitedToES2Features; // 0x1320 (0x1)
	unsigned char unreflected_1321[0x7]; // 0x1321 (0x7) 
	struct FWeightedBlendables FrontEndFFPostProcessMaterials; // 0x1328 (0x10)
	bool bUseSpecificPinataWeapon; // 0x1338 (0x1)
	bool bQuestVOEnabled; // 0x1339 (0x1)
	unsigned char unreflected_133a[0x6]; // 0x133a (0x6) 
	struct TMap<enum EFortItemCardSize, struct FVector2D> PersonnelAndSchematicCardSizes; // 0x1340 (0x50)
	struct TMap<enum EFortItemCardSize, struct FVector2D> OtherItemCardSizes; // 0x1390 (0x50)
	struct TMap<enum EFortItemCardSize, struct TWeakObjectPtr<class UMaterialInterface>> PersonnelAndSchematicItemCardMaterial; // 0x13e0 (0x50)
	struct TMap<enum EFortItemCardSize, struct TWeakObjectPtr<class UMaterialInterface>> CardPackItemCardMaterial; // 0x1430 (0x50)
	struct TMap<enum EFortItemCardSize, struct TWeakObjectPtr<class UMaterialInterface>> InstanceItemCardMaterial; // 0x1480 (0x50)
	struct TMap<enum EFortItemCardSize, struct TWeakObjectPtr<class UMaterialInterface>> TransformKeyItemCardMaterial; // 0x14d0 (0x50)
	struct TMap<enum EFortItemCardSize, struct TWeakObjectPtr<class UMaterialInterface>> CosmeticItemCardMaterial; // 0x1520 (0x50)
	struct TArray<enum EFortItemType> ItemTypesWhoseImagesReplaceCardBackgrounds; // 0x1570 (0x10)
	struct TSet<enum EFortItemType> ItemTypesToHideCountWhenCountEqualsOne; // 0x1580 (0x50)
	struct TMap<enum EFortItemCardSize, struct TWeakObjectPtr<class UMaterialInterface>> ItemCardDetailAreaMaterial; // 0x15d0 (0x50)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> FavoriteBookmarkMultiSizeBrush; // 0x1620 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> PermanentTransformKeykMultiSizeBrush; // 0x1648 (0x28)
	struct TWeakObjectPtr<class UFortMultiSizeBrushAsset> ConsumableTransformKeykMultiSizeBrush; // 0x1670 (0x28)
	struct TMap<struct FGameplayTag, struct TWeakObjectPtr<class UTexture2D>> DefenderSubtypeWeaponTextures; // 0x1698 (0x50)
	struct TMap<enum EFortBuffState, struct TWeakObjectPtr<class UMaterialInterface>> EnchantedCustomRatingBlockBackgroundMaterial; // 0x16e8 (0x50)
	struct TMap<enum EFortBuffState, struct TWeakObjectPtr<class UMaterialInterface>> NormalCustomRatingBlockBackgroundMaterial; // 0x1738 (0x50)
	struct FMargin CustomRatingBlockBackgroundBrushMargin; // 0x1788 (0x10)
	struct TWeakObjectPtr<class UMaterialInterface> UniversalItemCardDurabilityMeterMaterial; // 0x1798 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> UniversalItemCardLevelMeterMaterial; // 0x17c0 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> UniversalItemCardTraitIconMaterial; // 0x17e8 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> UniversalItemCardUnearnedTierIconMaterial; // 0x1810 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> UniversalItemCardAvailableTierIconMaterial; // 0x1838 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> UniversalItemCardEarnedTierIconMaterial; // 0x1860 (0x28)
	struct TWeakObjectPtr<class UMaterialInterface> UniversalItemCardPromotedTierIconMaterial; // 0x1888 (0x28)
	struct TWeakObjectPtr<class UFortItemDefinition> MysteryItemDefinition; // 0x18b0 (0x28)
	struct TWeakObjectPtr<class UTexture2D> LoadingCardTexture; // 0x18d8 (0x28)
	struct FFortItemCard_XL_PersonnelAndSchematics_Configuration ItemCardConfigXXLPersonnelAndSchematics; // 0x1900 (0x560)
	struct FFortItemCard_XL_ItemInstance_Configuration ItemCardConfigXXLItemInstance; // 0x1e60 (0x320)
	struct FFortItemCard_XL_TransformKey_Configuration ItemCardConfigXXLTransformKey; // 0x2180 (0x50)
	struct FFortItemCard_XL_PersonnelAndSchematics_Configuration ItemCardConfigXLPersonnelAndSchematics; // 0x21d0 (0x560)
	struct FFortItemCard_XL_ItemInstance_Configuration ItemCardConfigXLItemInstance; // 0x2730 (0x320)
	struct FFortItemCard_XL_TransformKey_Configuration ItemCardConfigXLTransformKey; // 0x2a50 (0x50)
	struct FFortItemCard_L_PersonnelAndSchematics_Configuration ItemCardConfigLPersonnelAndSchematics; // 0x2aa0 (0x4c0)
	struct FFortItemCard_L_ItemInstance_Configuration ItemCardConfigLItemInstance; // 0x2f60 (0x320)
	struct FFortItemCard_L_TransformKey_Configuration ItemCardConfigLTransformKey; // 0x3280 (0x50)
	struct FFortItemCard_M_PersonnelAndSchematics_Configuration ItemCardConfigMPersonnelAndSchematics; // 0x32d0 (0x4c0)
	struct FFortItemCard_M_ItemInstance_Configuration ItemCardConfigMItemInstance; // 0x3790 (0x320)
	struct FFortItemCard_M_TransformKey_Configuration ItemCardConfigMTransformKey; // 0x3ab0 (0x50)
	struct FFortItemCard_S_PersonnelAndSchematics_Configuration ItemCardConfigSPersonnelAndSchematics; // 0x3b00 (0x4c0)
	struct FFortItemCard_S_ItemInstance_Configuration ItemCardConfigSItemInstance; // 0x3fc0 (0x300)
	struct FFortItemCard_S_TransformKey_Configuration ItemCardConfigSTransformKey; // 0x42c0 (0x50)
	struct FFortItemCard_XS_PersonnelAndSchematics_Configuration ItemCardConfigXSPersonnelAndSchematics; // 0x4310 (0x48)
	unsigned char unreflected_4358[0x8]; // 0x4358 (0x8) 
	struct FFortItemCard_XS_ItemInstance_Configuration ItemCardConfigXSItemInstance; // 0x4360 (0x2e0)
	struct FFortItemCard_XS_TransformKey_Configuration ItemCardConfigXSTransformKey; // 0x4640 (0x50)
	struct FFortItemCard_XS_PersonnelAndSchematics_Configuration ItemCardConfigXXSPersonnelAndSchematics; // 0x4690 (0x48)
	struct FFortItemCard_XXS_ItemInstance_Configuration ItemCardConfigXXSItemInstance; // 0x46d8 (0x30)
	struct FFortItemCard_XS_TransformKey_Configuration ItemCardConfigXXSTransformKey; // 0x4708 (0x50)
	struct TWeakObjectPtr<class UDataTable> HealthyGamingDataTable; // 0x4758 (0x28)
	struct TWeakObjectPtr<class UDataTable> TrapPickerGameplayTagSettings; // 0x4780 (0x28)
	struct FFortUIPickerTrapSortScores TrapPickerSortScores; // 0x47a8 (0x14)
	unsigned char unreflected_47bc[0x4]; // 0x47bc (0x4) 
	class UFortTooltipDisplayStatsLookupTable* ObjClassToTooltipStatsMap; // 0x47c0 (0x8)
	struct TWeakObjectPtr<class UClass> LoadingScreenBacchusTutorialWidget; // 0x47c8 (0x28)
	struct TWeakObjectPtr<class UClass> LoadingScreenReturnToKairosWidget; // 0x47f0 (0x28)
	struct TWeakObjectPtr<class USlateBrushAsset> ActorCanvasArrowBrush; // 0x4818 (0x28)
	struct TWeakObjectPtr<class UDataTable> UITutorialData; // 0x4840 (0x28)
	struct TWeakObjectPtr<class UObject> PawnHealthBarPowerRatingBacking; // 0x4868 (0x28)
	struct TArray<class UFortUIDataProfileStats*> ProfileStatStyleSets; // 0x4890 (0x10)
	struct TMap<struct FName, struct TWeakObjectPtr<class USlateBrushAsset>> LegacyNativeUIBrushMap; // 0x48a0 (0x50)
	struct TMap<struct FName, struct TWeakObjectPtr<class UObject>> LegacyNativeUIAssetMap; // 0x48f0 (0x50)
	struct TWeakObjectPtr<class UClass> ItemPairsInspectionScreen; // 0x4940 (0x28)
	struct TWeakObjectPtr<class UClass> RealMoneyPurchaseSpecialInfoModal; // 0x4968 (0x28)
	class UAthenaItemShopConfiguration* ItemShopConfiguration; // 0x4990 (0x8)
	float AnalogRotateSpeed; // 0x4998 (0x4)
	float DragRotateSpeed; // 0x499c (0x4)
	float TouchSwipeRotateRate; // 0x49a0 (0x4)
	float MouseWheelZoomSpeed; // 0x49a4 (0x4)
	float DragZoomSpeed; // 0x49a8 (0x4)
	float TriggerZoomSpeed; // 0x49ac (0x4)
	float TouchZoomPinchRate; // 0x49b0 (0x4)
	float ItemViewCompetingAxisInputThreshold; // 0x49b4 (0x4)
	struct TArray<enum EFortItemType> ItemTypesToUseVaultCamera; // 0x49b8 (0x10)
	class UClass* FrontendItemViewSettingsManager; // 0x49c8 (0x8)
	class UFortVideoDisplayData* VideoDisplayData; // 0x49d0 (0x8)
	class UFortSocialDisplayData* SocialDisplayData; // 0x49d8 (0x8)
	class UAthenaChallengeDisplayData* ChallengeDisplayData; // 0x49e0 (0x8)
	class UAthenaTeamDisplayData* SquadStyleData; // 0x49e8 (0x8)
	class UFortStoreDisplayData* StoreDisplayData; // 0x49f0 (0x8)
	class UFortItemPresentationDisplayData* ItemPresentationDisplayData; // 0x49f8 (0x8)
	class UDataTable* PipTest; // 0x4a00 (0x8)
	unsigned char unreflected_4a08[0x8]; // 0x4a08 (0x8) 
	struct TWeakObjectPtr<class UPaperSprite> ResourceSprites[0x6]; // 0x4a10 (0x28) (ARRAY) 

	/* Functions */

	// Function /Script/FortniteUI.FortUIDataConfiguration.GetDefenderSubtypeIconMultiSizeBrushByTag (Underlying native function: GetDefenderSubtypeIconMultiSizeBrushByTag 0xa7239dc)
	static class UFortMultiSizeBrushAsset* GetDefenderSubtypeIconMultiSizeBrushByTag(struct FGameplayTag& DefenderSubtypeTag); // (Final | Native | Static | Public | BlueprintCallable | BlueprintPure)
};

