// Class /Script/ValetRuntime.FortDagwoodVehicleConfigs
// Size: 0xaa8
class UFortDagwoodVehicleConfigs : public UFortPhysicsVehicleConfigs
{
	float BoostMinPushForce; // 0x890 (0x4)
	float BoostTopSpeedForceMultiplier; // 0x894 (0x4)
	float BoostTopSpeedMultiplier; // 0x898 (0x4)
	float BoostWaterMultiplier; // 0x89c (0x4)
	float VehiclePowerSlideFrontMultiplier; // 0x8a0 (0x4)
	float VehiclePowerSlideRearMultiplier; // 0x8a4 (0x4)
	float IceVehiclePowerSlideFrontMultiplier; // 0x8a8 (0x4)
	float IceVehiclePowerSlideRearMultiplier; // 0x8ac (0x4)
	float HandbrakeGripAngle; // 0x8b0 (0x4)
	float HandbrakeGripAngleRecovery; // 0x8b4 (0x4)
	float HandbrakeSpeedForGripLoss; // 0x8b8 (0x4)
	float MinSlipDuration; // 0x8bc (0x4)
	float HandbrakeLateralFriction; // 0x8c0 (0x4)
	float HandbrakeSteeringMultiplier; // 0x8c4 (0x4)
	float HandbrakeFrictionDampFactor; // 0x8c8 (0x4)
	float RestoreTractionDampFactor; // 0x8cc (0x4)
	float HandbrakeForce; // 0x8d0 (0x4)
	float HandbrakeForceNoAccel; // 0x8d4 (0x4)
	float BoostSteeringMultiplier; // 0x8d8 (0x4)
	float DirtRoadTopSpeedMultiplier; // 0x8dc (0x4)
	float DirtRoadFrontLateralFriction; // 0x8e0 (0x4)
	float DirtRoadRearLateralFriction; // 0x8e4 (0x4)
	float DirtRoadAccelForceMultiplier; // 0x8e8 (0x4)
	float OffRoadTopSpeedMultiplier; // 0x8ec (0x4)
	float OffRoadFrontLateralFriction; // 0x8f0 (0x4)
	float OffRoadRearLateralFriction; // 0x8f4 (0x4)
	float OffRoadPushForceMultiplier; // 0x8f8 (0x4)
	float OffroadDamageImpactForceMin; // 0x8fc (0x4)
	float OffroadDamageImpactForceMax; // 0x900 (0x4)
	float OffroadImpactDamageMin; // 0x904 (0x4)
	float OffroadImpactDamageMax; // 0x908 (0x4)
	float MinSpeedForOffroadHandling; // 0x90c (0x4)
	float SnowFrontLateralFriction; // 0x910 (0x4)
	float SnowRearLateralFriction; // 0x914 (0x4)
	float IceFrontLateralFriction; // 0x918 (0x4)
	float IceRearLateralFriction; // 0x91c (0x4)
	float IcePushForceMultiplier; // 0x920 (0x4)
	float IceBrakeForceMultiplier; // 0x924 (0x4)
	float FireHealthPercentThreshold; // 0x928 (0x4)
	float OffroadRumbleIntensity; // 0x92c (0x4)
	float DirtRoadRumbleIntensity; // 0x930 (0x4)
	float OffroadDamageScaleExponent; // 0x934 (0x4)
	float HardLandingThresholdMin; // 0x938 (0x4)
	float HardLandingThresholdMax; // 0x93c (0x4)
	float HardLandingShakeZAmplitudeMin; // 0x940 (0x4)
	float HardLandingShakeZAmplitudeMax; // 0x944 (0x4)
	float SpeedLinesThreshold; // 0x948 (0x4)
	float PropDestructionImpulse; // 0x94c (0x4)
	float DestructionAngle; // 0x950 (0x4)
	float UpNormalMinProtected; // 0x954 (0x4)
	float UpForwardMinProtected; // 0x958 (0x4)
	float NonCameraSteeringAngleMultiplier; // 0x95c (0x4)
	float CameraAssistStrengthMax; // 0x960 (0x4)
	float CameraAssistStrengthMin; // 0x964 (0x4)
	float CameraAssistStrengthRecovery; // 0x968 (0x4)
	float CameraAssistInterpSpeed; // 0x96c (0x4)
	float ReverseChangeDirectionBrakeForceMultiplier; // 0x970 (0x4)
	float ReverseChangeDirectionSpeedThreshold; // 0x974 (0x4)
	float DriftExitPushForce; // 0x978 (0x4)
	float DriftExitCatchupSpeed; // 0x97c (0x4)
	float HandbrakeDurationRequiredForCatchup; // 0x980 (0x4)
	float ImpactMagnitudeToEndCatchup; // 0x984 (0x4)
	float PoppedTireSpringLength; // 0x988 (0x4)
	float PoppedTireSpringStiff; // 0x98c (0x4)
	float PoppedTireSpringDamp; // 0x990 (0x4)
	float PoppedTireScrapeFrictionMultiplier; // 0x994 (0x4)
	float RimScrapeFlipRollMagnitude; // 0x998 (0x4)
	float RimScrapeFlipPitchMagnitude; // 0x99c (0x4)
	float SpeedForRimFlip; // 0x9a0 (0x4)
	float HealthPercentForFlip; // 0x9a4 (0x4)
	float FlipYawDuration; // 0x9a8 (0x4)
	float FlipRollDuration; // 0x9ac (0x4)
	float FlipPitchDuration; // 0x9b0 (0x4)
	float FlipExplodeDurationYaw; // 0x9b4 (0x4)
	float FlipExplodeDurationPitch; // 0x9b8 (0x4)
	float FlipPushForceDurationYaw; // 0x9bc (0x4)
	float FlipPushForceDurationPitch; // 0x9c0 (0x4)
	float FlipPushForcMultiplier; // 0x9c4 (0x4)
	float FlipPushForceUpComponentPitch; // 0x9c8 (0x4)
	float FlipPushForceUpComponentRoll; // 0x9cc (0x4)
	float MinTimeInAirRequiredForExplodeLanding; // 0x9d0 (0x4)
	float FlipYawSpringStiff; // 0x9d4 (0x4)
	float FlipYawSpringDamp; // 0x9d8 (0x4)
	float FlipYawSpringMaxAccel; // 0x9dc (0x4)
	float HealthPercentForExplode; // 0x9e0 (0x4)
	float FlipRecoveryTime; // 0x9e4 (0x4)
	float FlipMaxDuration; // 0x9e8 (0x4)
	float FlipWiggleDuration; // 0x9ec (0x4)
	float PoppedTireVeerDuration; // 0x9f0 (0x4)
	float PoppedTireVeerSteeringAngle; // 0x9f4 (0x4)
	float FlipWiggleFrequency; // 0x9f8 (0x4)
	float FlipWiggleSteeringAngle; // 0x9fc (0x4)
	float FlipYawAngleThreshold; // 0xa00 (0x4)
	bool bUsesBoost; // 0xa04 (0x1)
	unsigned char unreflected_a05[0x3]; // 0xa05 (0x3) 
	float RechargeableBoostRateOfUse; // 0xa08 (0x4)
	float RechargeableBoostRateOfRegen; // 0xa0c (0x4)
	float BoostRateOfRegenMinMultiplier; // 0xa10 (0x4)
	float BoostRateOfRegenMaxMultiplier; // 0xa14 (0x4)
	float BoostRegenMaxMultiplyTime; // 0xa18 (0x4)
	float RechargeableBoostRequiredPercentToActivate; // 0xa1c (0x4)
	float RechargeableBoostMaxPercent; // 0xa20 (0x4)
	float RechargeableBoostMinPercent; // 0xa24 (0x4)
	float AnalogDriftStickThreshold; // 0xa28 (0x4)
	struct FName TireBootRightSocketName; // 0xa2c (0x4)
	struct FName TireBootLeftSocketName; // 0xa30 (0x4)
	float TireBootRelativeDistance; // 0xa34 (0x4)
	float BoostForceInAir; // 0xa38 (0x4)
	float BoostAirMaxSpeed; // 0xa3c (0x4)
	struct TArray<struct FName> TireSocketNames; // 0xa40 (0x10)
	struct TArray<struct FName> TireBoneNames; // 0xa50 (0x10)
	struct TArray<int> RearTireIndices; // 0xa60 (0x10)
	struct TArray<int> RightSideTires; // 0xa70 (0x10)
	struct TArray<int> FakeTireIndices; // 0xa80 (0x10)
	bool bNoWheels; // 0xa90 (0x1)
	unsigned char unreflected_a91[0x3]; // 0xa91 (0x3) 
	float NoWheelsSpringLenMult; // 0xa94 (0x4)
	struct TArray<struct FName> NoWheelsBonesToHide; // 0xa98 (0x10)
};

