// Class /Script/FortniteGame.FortGoatVehicleConfigs
// Size: 0x988
class UFortGoatVehicleConfigs : public UFortPhysicsVehicleConfigs
{
	float BounceCrouchTime; // 0x890 (0x4)
	float BounceCrouchTimeDeadzone; // 0x894 (0x4)
	float BounceRecoilTime; // 0x898 (0x4)
	float BounceForcePerMass; // 0x89c (0x4)
	float PassengerLeanMagnitude; // 0x8a0 (0x4)
	float PassengerLeanMinMagnitude; // 0x8a4 (0x4)
	float PassengerLeanLeftRightInterpolationPerSecond; // 0x8a8 (0x4)
	float PassengerLeanUpInterpolationPerSecond; // 0x8ac (0x4)
	float PassengerLeanDownInterpolationPerSecond; // 0x8b0 (0x4)
	float PassengerLeanResetInterpolationPerSecond; // 0x8b4 (0x4)
	float PassengerLeanDeadzone; // 0x8b8 (0x4)
	float HandbrakeForce; // 0x8bc (0x4)
	float PowerSlideMinAngle; // 0x8c0 (0x4)
	float MinLateralSpeedForPowerSlideBoost; // 0x8c4 (0x4)
	float MaxAccumulatedPowerSlideBoost; // 0x8c8 (0x4)
	unsigned char unreflected_8cc[0x4]; // 0x8cc (0x4) 
	struct TArray<struct FGoatVehicleBoostLevel*> PowerSlideBoostAccumulationSteps; // 0x8d0 (0x10)
	float PowerSlideAccumulationMultiplier; // 0x8e0 (0x4)
	float PowerSlideTopSpeedMultiplier; // 0x8e4 (0x4)
	float PowerSlideTopSpeedInAirMultiplier; // 0x8e8 (0x4)
	float PowerSlideStrength; // 0x8ec (0x4)
	float PowerSlideMinAngularSpeed; // 0x8f0 (0x4)
	float PowerSlideMaxAngularSpeed; // 0x8f4 (0x4)
	float BoostSteeringMultiplier; // 0x8f8 (0x4)
	float BoostCooldown; // 0x8fc (0x4)
	float BoostSteeringMultiplierRampTime; // 0x900 (0x4)
	float BoostSlowExtraStrength; // 0x904 (0x4)
	float MinForwardSpeedBoostExtraStrength; // 0x908 (0x4)
	float BoostTopSpeedForceMultiplier; // 0x90c (0x4)
	float VehiclePowerSlideFrontMultiplier; // 0x910 (0x4)
	float VehiclePowerSlideRearMultiplier; // 0x914 (0x4)
	float PowerSlideMinPushForce; // 0x918 (0x4)
	float CameraShakeAmplitudeMin; // 0x91c (0x4)
	float CameraShakeAmplitudeMax; // 0x920 (0x4)
	float SpringFudgeFactor; // 0x924 (0x4)
	float CameraShakeNormalizedSpeed; // 0x928 (0x4)
	float CameraShakeSpeedCurvePow; // 0x92c (0x4)
	float PowerSlideShakeMultiplierMin; // 0x930 (0x4)
	float PowerSlideShakeMultiplierMax; // 0x934 (0x4)
	float BoostingCameraShakeAmount; // 0x938 (0x4)
	float BoostCameraShakeFrequency; // 0x93c (0x4)
	float SmoothedSpringCompressionMin; // 0x940 (0x4)
	float SmoothedSpringCompressionMax; // 0x944 (0x4)
	float PowerSlideMinSpringCompression; // 0x948 (0x4)
	float ScreenShakeFrequencyMin; // 0x94c (0x4)
	float ScreenShakeFrequencyMax; // 0x950 (0x4)
	float PassengerCameraShakeMultiplier; // 0x954 (0x4)
	float ScreenShakeYawFrequencyMultiplier; // 0x958 (0x4)
	struct FLinearColor WheelSlideBoostColorWhenNotPowerSliding; // 0x95c (0x10)
	float TreadWidth; // 0x96c (0x4)
	float RumbleMultiplier; // 0x970 (0x4)
	float SparksRumbleMultiplier; // 0x974 (0x4)
	float BoostCameraOffset; // 0x978 (0x4)
	float ADSCameraDistance; // 0x97c (0x4)
	float PassengerCameraOffset; // 0x980 (0x4)
	float ADSInterpSpeed; // 0x984 (0x4)
};

