// Class /Script/FortniteGame.FortMedicPackSet
// Size: 0x268
class UFortMedicPackSet : public UFortAttributeSet
{
	unsigned char unreflected_30[0x8]; // 0x30 (0x8) 
	struct FFortGameplayAttributeData MaxFuel; // 0x38 (0x28)
	struct FFortGameplayAttributeData Fuel; // 0x60 (0x28)
	struct FFortGameplayAttributeData ReserveMaxFuel; // 0x88 (0x28)
	struct FFortGameplayAttributeData ReserveFuel; // 0xb0 (0x28)
	struct FFortGameplayAttributeData FuelBurnRate; // 0xd8 (0x28)
	struct FFortGameplayAttributeData FuelRegenRate; // 0x100 (0x28)
	struct FFortGameplayAttributeData FuelRegenDelay; // 0x128 (0x28)
	struct FFortGameplayAttributeData SelfReviveActive; // 0x150 (0x28)
	struct FFortGameplayAttributeData SelfReviveTime; // 0x178 (0x28)
	struct FFortGameplayAttributeData SelfReviveCost; // 0x1a0 (0x28)
	struct FFortGameplayAttributeData DamageBreaksSelfRevive; // 0x1c8 (0x28)
	struct FFortGameplayAttributeData Heal; // 0x1f0 (0x28)
	struct FFortGameplayAttributeData HealRadius; // 0x218 (0x28)
	struct FFortGameplayAttributeData HealPeriod; // 0x240 (0x28)
};

