// Class /Script/FortniteGame.FortPetAnimInstance
// Size: 0x730
class UFortPetAnimInstance : public UFortPetAnimInstanceShared
{
	struct FFortAnimInput_Skydiving SkydivingState; // 0x598 (0x78)
	struct FRotator SkydiveRotation; // 0x610 (0x18)
	float LookAtAlpha; // 0x628 (0x4)
	unsigned char unreflected_62c[0x4]; // 0x62c (0x4) 
	struct FVector LookAtTargetLocation; // 0x630 (0x18)
	float LookAtTargetingSpeed; // 0x648 (0x4)
	float LookAtOverride; // 0x64c (0x4)
	int JumpAnimIndex; // 0x650 (0x4)
	struct FName OwnerBoneNameToFollowInVortex; // 0x654 (0x4)
	struct FVector2D SkydiveRollInVortexOwnerRange; // 0x658 (0x10)
	struct FVector2D SkydiveRollInVortexRange; // 0x668 (0x10)
	float SkydiveRollWhenFloating; // 0x678 (0x4)
	float SkydiveRollWhenDiving; // 0x67c (0x4)
	float SkydiveRollInterpSpeed; // 0x680 (0x4)
	float DownSightsToLocomotionTimeRemaining; // 0x684 (0x4)
	float FaceCurveOverrideValue; // 0x688 (0x4)
	bool bIsFlyingPet; // 0x68c (0x1)
	unsigned char unreflected_68d[0x3]; // 0x68d (0x3) 
	float HandIKAlpha; // 0x690 (0x4)
	float LegIKAlpha; // 0x694 (0x4)
	unsigned char bIsSlopeSliding; // 0x698 (0x1)
	unsigned char bIsJumpLandComplete; // 0x698 (0x1)
	unsigned char bIsZiplining; // 0x698 (0x1)
	unsigned char bIsBallooning; // 0x698 (0x1)
	unsigned char bIsFlying; // 0x698 (0x1)
	unsigned char bIsSurfaceSwimming; // 0x698 (0x1)
	unsigned char bIsInAirNotJumping; // 0x698 (0x1)
	unsigned char bUseSkydiveRotation; // 0x698 (0x1)
	unsigned char bIsSkydivingInGame; // 0x699 (0x1)
	unsigned char unreflected_69a[0x2]; // 0x69a (0x2) 
	unsigned char bIsPlayingMeleeAnim; // 0x69c (0x1)
	unsigned char unreflected_69d[0x3]; // 0x69d (0x3) 
	unsigned char bIsTargeting; // 0x6a0 (0x1)
	unsigned char bIsDBNO; // 0x6a0 (0x1)
	unsigned char bIsHappy; // 0x6a0 (0x1)
	unsigned char bIsHunker; // 0x6a0 (0x1)
	unsigned char unreflected_6a1[0x3]; // 0x6a1 (0x3) 
	unsigned char bIsInFrontEnd; // 0x6a4 (0x1)
	unsigned char unreflected_6a5[0x3]; // 0x6a5 (0x3) 
	unsigned char bIsFrontEndLobbyPartyMember; // 0x6a8 (0x1)
	unsigned char bIsOwnerPawnBeingControlledByNonPlayerAnimBP; // 0x6a8 (0x1)
	unsigned char bIsCrouching; // 0x6a8 (0x1)
	unsigned char bIsMoving2D; // 0x6a8 (0x1)
	unsigned char bIsLocomotion; // 0x6a8 (0x1)
	unsigned char bIsJogging; // 0x6a8 (0x1)
	unsigned char bIsSprinting; // 0x6a8 (0x1)
	unsigned char bIsCrouchSprinting; // 0x6a9 (0x1)
	unsigned char bIsCrouchMoving; // 0x6a9 (0x1)
	unsigned char bIsTargetingAndMoving; // 0x6a9 (0x1)
	unsigned char unreflected_6aa[0x2]; // 0x6aa (0x2) 
	struct FCachedAnimRelevancyData CachedAnimDataDownSightsToIdle; // 0x6ac (0x14)
	struct FCachedAnimRelevancyData CachedAnimDataJumpLand; // 0x6c0 (0x14)
	struct FCachedAnimRelevancyData CachedAnimDataIdleHappy; // 0x6d4 (0x14)
	struct FCachedAnimRelevancyData CachedAnimDataCrouchInternalHappy; // 0x6e8 (0x14)
	struct FCachedAnimRelevancyData CachedAnimDataParachuteSkydive; // 0x6fc (0x14)
	unsigned char bTransitionLocomotionToIdleToLocomotion; // 0x710 (0x1)
	unsigned char bTransitionLocomotionToLocomotionToIdle; // 0x710 (0x1)
	unsigned char bTransitionJumpFallToSkydive; // 0x710 (0x1)
	unsigned char bTransitionJumpLandToLocomotion; // 0x710 (0x1)
	unsigned char bTransitionDownSightsToIdleToLocomotion; // 0x710 (0x1)
	unsigned char bTransitionIdleIdleLobby; // 0x710 (0x1)
	unsigned char bTransitionIdleLocomotion; // 0x710 (0x1)
	unsigned char bTransitionInnerIdleIdleToHappy; // 0x710 (0x1)
	unsigned char bTransitionLocomotionStartJump; // 0x711 (0x1)
	unsigned char bTransitionLocomotionLocomotionHappy; // 0x711 (0x1)
	unsigned char bTransitionCrouchCrouchToLocomotion; // 0x711 (0x1)
	unsigned char bTransitionCrouchingCrouchToIdle; // 0x711 (0x1)
	unsigned char bTransitionCrouchingCrouchToCrouchADSNotMoving; // 0x711 (0x1)
	unsigned char bTransitionCrouchToCrouchADSNotMovingCrouching; // 0x711 (0x1)
	unsigned char bTransitionSkyDiveIdle; // 0x711 (0x1)
	unsigned char bTransitionSkyDiveGlidingSkyDiveDiving; // 0x711 (0x1)
	unsigned char bTransitionHunkerIdle; // 0x712 (0x1)
	unsigned char bTransitionHunkerLocomotion; // 0x712 (0x1)
	unsigned char bTransitionHunkerHunkerToCrouch; // 0x712 (0x1)
	unsigned char bTransitionDownSightsADSToCrouch; // 0x712 (0x1)
	unsigned char bTransitionDownSightsDownSightsToIdle; // 0x712 (0x1)
	unsigned char bTransitionCrouchWalkingDownSightsDownSights; // 0x712 (0x1)
	unsigned char bTransitionIdleLobbyIdle; // 0x712 (0x1)
	unsigned char bTransitionFrontEndSkydiveLobbyHunker; // 0x712 (0x1)
	unsigned char bTransitionFrontEndSkydiveIdleLobby; // 0x713 (0x1)
	unsigned char bTransitionLobbyHunkerHunkerToLobby; // 0x713 (0x1)
	unsigned char bTransitionHappyHappyToIdle; // 0x713 (0x1)
	unsigned char bTransitionHappyHappyToCrouchInternal; // 0x713 (0x1)
	unsigned char bTransitionParachuteToSkydiveGlideSkydive; // 0x713 (0x1)
	unsigned char bEmotePlayingWhereHunkeringIsBest; // 0x713 (0x1)
	unsigned char bEmotePlayingWhereHappyIsBest; // 0x713 (0x1)
	unsigned char bResponseShouldBeHappy; // 0x713 (0x1)
	unsigned char unreflected_714[0x4]; // 0x714 (0x4) 
	class UFortMontageItemDefinitionBase* LastObservedFrontEndEmote; // 0x718 (0x8)
	unsigned char padding_720[0x10]; // 0x720 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.FortPetAnimInstance.TEMP_OnActiveTagChanged (Has no native function)
	void TEMPOnActiveTagChanged(struct FGameplayTag& NewTag); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortPetAnimInstance.TEMP_GetActiveTag (Underlying native function: TEMP_GetActiveTag 0x8246a04)
	struct FGameplayTag TEMPGetActiveTag(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortPetAnimInstance.ApplyOrRemoveFlagsFromEmote (Underlying native function: ApplyOrRemoveFlagsFromEmote 0x8245960)
	void ApplyOrRemoveFlagsFromEmote(class UFortMontageItemDefinitionBase*& Emote, bool& bApply); // (Final | Native | Public | BlueprintCallable)
};

