// Class /Script/FortniteGame.FortFastLoadConfig
// Size: 0x30
class UFortFastLoadConfig : public UObject
{
	unsigned char bDisableStreamInBuildings; // 0x28 (0x1)
	unsigned char bDisableStartupAIDirector; // 0x28 (0x1)
	unsigned char bDisableUpgradePlayerBuildingClasses; // 0x28 (0x1)
	unsigned char bUseMinimalPlayerBuildingClasses; // 0x28 (0x1)
	unsigned char bDisableStartingMissions; // 0x28 (0x1)
	unsigned char bUseFastLoadDefaultInventory; // 0x28 (0x1)
	unsigned char bDisableThreatVisualsManager; // 0x28 (0x1)
	unsigned char bDisablePreLoadAssets; // 0x28 (0x1)
	unsigned char bDisablePreLoadLootAssets; // 0x29 (0x1)
	unsigned char bDisableLoadStateClientAthena; // 0x29 (0x1)
	unsigned char bDisableGameFeaturePlugins; // 0x29 (0x1)
	unsigned char padding_2a[0x6]; // 0x2a (0x6)
};

