// Class /Script/FortniteGame.FortAthenaWaterJackalConfigs
// Size: 0xa00
class UFortAthenaWaterJackalConfigs : public UFortAthenaJackalVehicleConfigs
{
	float RopeAccelRangeMin; // 0x9d8 (0x4)
	float RopeAccelRangeMax; // 0x9dc (0x4)
	float RopeAccelRangeDefault; // 0x9e0 (0x4)
	float RopeAccel; // 0x9e4 (0x4)
	float ReverseCorrectionRopeAccelMultiplier; // 0x9e8 (0x4)
	float MaxSpeedForAccel; // 0x9ec (0x4)
	float YawAngularDrag; // 0x9f0 (0x4)
	float LinearDrag; // 0x9f4 (0x4)
	float CustomLateralFriction; // 0x9f8 (0x4)
	unsigned char padding_9fc[0x4]; // 0x9fc (0x4)
};

