// Class /Script/FortniteAI.FortAthenaAIPerk_Bunker
// Size: 0x2d0
class UFortAthenaAIPerk_Bunker : public UFortAIPerkBase
{
	struct FScalableFloat OddsToBeUsedAgainstUnknownThreat; // 0x168 (0x28)
	struct FScalableFloat OddsToUseRoofBuilding; // 0x190 (0x28)
	struct FScalableFloat OddsToBuildForwardRamp; // 0x1b8 (0x28)
	struct FScalableFloat InitialBuildDelay; // 0x1e0 (0x28)
	struct FScalableFloat SamePieceBuildDelay; // 0x208 (0x28)
	struct FScalableFloat SamePieceBuildDelayRandomDeviation; // 0x230 (0x28)
	struct FScalableFloat DifferentPieceBuildDelay; // 0x258 (0x28)
	struct FScalableFloat DifferentPieceBuildDelayRandomDeviation; // 0x280 (0x28)
	struct FScalableFloat OddsToSelectRandomMaterial; // 0x2a8 (0x28)
};

