// Class /Script/FortniteUI.FortParentalControls_DisplaySettings
// Size: 0x590
class UFortParentalControls_DisplaySettings : public UFortParentalControls_SettingModifyingSubScreen
{
	unsigned char unreflected_408[0x18]; // 0x408 (0x18) 
	class UCommonTextBlock* TextSaveFail; // 0x420 (0x8)
	class UCommonButtonLegacy* ButtonSaveSettings; // 0x428 (0x8)
	class UCommonButtonLegacy* ButtonMoreSettings; // 0x430 (0x8)
	class UCommonButtonLegacy* ButtonDisableParentalControls; // 0x438 (0x8)
	class UFortSettingsPanel* PanelSettings; // 0x440 (0x8)
	class UFortSettingRegistry* Registry; // 0x448 (0x8)
	unsigned char padding_450[0x140]; // 0x450 (0x140)
};

