// Class /Script/FortniteGame.FortOstrichAnimInstance
// Size: 0x9a0
class UFortOstrichAnimInstance : public UFortAnimInstance
{
	struct TWeakObjectPtr<class UAnimMontage> EmoteMeshSpecialMontage; // 0x530 (0x28)
	class UAnimMontage* MechMeshSpecialMontage; // 0x558 (0x8)
	unsigned char unreflected_560[0x1]; // 0x560 (0x1) 
	bool bDoingSpecialEmote; // 0x561 (0x1)
	bool bIsCosmeticPreview; // 0x562 (0x1)
	unsigned char unreflected_563[0x5]; // 0x563 (0x5) 
	struct FFortAnimInput_VelocityImpact VelocityImpactInput; // 0x568 (0xf0)
	unsigned char bIsMoving2D; // 0x658 (0x1)
	unsigned char bWasMoving2DLastFrame; // 0x658 (0x1)
	unsigned char bIsShotgunFired; // 0x658 (0x1)
	unsigned char bIsMechBeginFired; // 0x658 (0x1)
	unsigned char bIsFallingWithDriver; // 0x658 (0x1)
	unsigned char bIsSkyTubingWithDriver; // 0x658 (0x1)
	unsigned char bIsInAirWithDriver; // 0x658 (0x1)
	unsigned char bStartTransitionTriggeredAndEnableStarts; // 0x658 (0x1)
	unsigned char unreflected_659[0x3]; // 0x659 (0x3) 
	float RocketCurveValueFloat; // 0x65c (0x4)
	float ShotgunAmmoSlideValue; // 0x660 (0x4)
	unsigned char unreflected_664[0x4]; // 0x664 (0x4) 
	class AFortCharacterVehicle_Ostrich* Ostrich; // 0x668 (0x8)
	class USkeletalMeshComponent* EmoteMeshToCopy; // 0x670 (0x8)
	struct FVector ImpactDisplacement; // 0x678 (0x18)
	struct FFortAnimInput_TurnInPlace TurnInPlaceInput; // 0x690 (0x78)
	float YawDeltaCurrentTick; // 0x708 (0x4)
	unsigned char unreflected_70c[0x4]; // 0x70c (0x4) 
	struct FVector ActorLocationLastTick; // 0x710 (0x18)
	struct FRotator ActorRotationLastTick; // 0x728 (0x18)
	float SlopeWarpingAlpha; // 0x740 (0x4)
	unsigned char unreflected_744[0x4]; // 0x744 (0x4) 
	struct FVector2D SlopeWarpingAlphaSpeedInputRange; // 0x748 (0x10)
	struct FVector2D SlopeWarpingAlphaSpeedOutputRange; // 0x758 (0x10)
	float SlopeWarpingAlphaInterpSpeed; // 0x768 (0x4)
	float Speed2D; // 0x76c (0x4)
	float LocalAimYaw; // 0x770 (0x4)
	float GunnerAimTargetDeltaYaw; // 0x774 (0x4)
	float GunnerAimTargetDeltaPitch; // 0x778 (0x4)
	enum EFortCardinalDirection LocalAimCardinalDirection; // 0x77c (0x1)
	unsigned char unreflected_77d[0x3]; // 0x77d (0x3) 
	float LocalAimYawDeadZoneAngle; // 0x780 (0x4)
	float LocalVelocityYawAngle; // 0x784 (0x4)
	struct FFloatRK4SpringInterpolator* LocalVelocityYawAngleInterpolator; // 0x788 (0x8)
	unsigned char unreflected_790[0x1c]; // 0x790 (0x1c) 
	float LocalVelocityYawAngleInterpolated; // 0x7ac (0x4)
	float LocalAccelerationYawAngle; // 0x7b0 (0x4)
	enum EFortCardinalDirection LocomotionCardinalDirection; // 0x7b4 (0x1)
	unsigned char unreflected_7b5[0x3]; // 0x7b5 (0x3) 
	float LocomotionDeadZoneAngle; // 0x7b8 (0x4)
	unsigned char unreflected_7bc[0x4]; // 0x7bc (0x4) 
	struct FVector WorldSpaceAimPoint; // 0x7c0 (0x18)
	unsigned char bIsDashing; // 0x7d8 (0x1)
	unsigned char bIsDashAnimDurationElapsed; // 0x7d8 (0x1)
	unsigned char bIsChargingJump; // 0x7d8 (0x1)
	unsigned char bHasDriver; // 0x7d8 (0x1)
	unsigned char bHasGunner; // 0x7d8 (0x1)
	unsigned char bIsEmoting; // 0x7d8 (0x1)
	unsigned char bIsOnGround; // 0x7d8 (0x1)
	unsigned char bIsRocketOnCoolDown; // 0x7d8 (0x1)
	unsigned char bShouldApplyShoulderPadsAdditive; // 0x7d9 (0x1)
	unsigned char bInAir; // 0x7d9 (0x1)
	unsigned char bShouldRightArmLookAt; // 0x7d9 (0x1)
	unsigned char bPassengerBootUp; // 0x7d9 (0x1)
	unsigned char bIsEmptyOnFirstLoad; // 0x7d9 (0x1)
	unsigned char bJustDidStompInAir; // 0x7d9 (0x1)
	unsigned char bIsStompInAir; // 0x7d9 (0x1)
	unsigned char bWasStompInAir; // 0x7d9 (0x1)
	unsigned char bShouldPlayJumpCharging; // 0x7da (0x1)
	unsigned char bHadDriver; // 0x7da (0x1)
	unsigned char bJustGotDriver; // 0x7da (0x1)
	unsigned char bJustLostDriver; // 0x7da (0x1)
	unsigned char bWasDashing; // 0x7da (0x1)
	unsigned char bStartedDash; // 0x7da (0x1)
	unsigned char bHadGunner; // 0x7da (0x1)
	unsigned char bJustGotGunner; // 0x7da (0x1)
	unsigned char bJustLostGunner; // 0x7db (0x1)
	unsigned char bShouldPlayJogStop; // 0x7db (0x1)
	unsigned char bShouldBringAmmoBack; // 0x7db (0x1)
	unsigned char bHasAnyPlayer; // 0x7db (0x1)
	unsigned char bIsOnCoolDown; // 0x7db (0x1)
	unsigned char bShouldPlayNormalJump; // 0x7db (0x1)
	unsigned char bShouldPlayChargedJump; // 0x7db (0x1)
	unsigned char bIsSkyTubing; // 0x7db (0x1)
	unsigned char bShouldPlaySkyTubingLoop; // 0x7dc (0x1)
	unsigned char bStartTransitionTriggered; // 0x7dc (0x1)
	unsigned char bStartEarlyOut; // 0x7dc (0x1)
	unsigned char bPivotTransitionTriggered; // 0x7dc (0x1)
	unsigned char bPivotEarlyOut; // 0x7dc (0x1)
	unsigned char bShouldEarlyOutStompLanding; // 0x7dc (0x1)
	unsigned char unreflected_7dd[0x3]; // 0x7dd (0x3) 
	float JumpApexLoopAlphaValue; // 0x7e0 (0x4)
	float StatusStartPositionAlphaValue; // 0x7e4 (0x4)
	float InMotionAlphaValue; // 0x7e8 (0x4)
	float DashLeansAlphaValue; // 0x7ec (0x4)
	float ShotgunShellsAlphaValue; // 0x7f0 (0x4)
	float GunnerJogBounceAlphaValue; // 0x7f4 (0x4)
	struct FRotator AimYawRotationValue; // 0x7f8 (0x18)
	float GunnerAimYawBlendIn; // 0x810 (0x4)
	float GunnerAimYawBlendOut; // 0x814 (0x4)
	float RightArmNoAdditiveAlphaValue; // 0x818 (0x4)
	float BaseAdditiveAlphaValue; // 0x81c (0x4)
	float GunnerAlphaValue; // 0x820 (0x4)
	float JoyStickAlphaValue; // 0x824 (0x4)
	float ShellOneAlphaValue; // 0x828 (0x4)
	float ShellTwoAlphaValue; // 0x82c (0x4)
	float ShellThreeAlphaValue; // 0x830 (0x4)
	float ShellFourAlphaValue; // 0x834 (0x4)
	float ShellsPlayRateValue; // 0x838 (0x4)
	float RecoilAmountAlphaValue; // 0x83c (0x4)
	float LowerBodyRecoilAdditiveAlphaValue; // 0x840 (0x4)
	float ChargeJumpFloatValue; // 0x844 (0x4)
	float InMotionAlphaInterpSpeed; // 0x848 (0x4)
	float DashLeansAlphaInterpSpeed; // 0x84c (0x4)
	float GunnerJogBounceAlphaInterpSpeed; // 0x850 (0x4)
	float RightArmNoAdditiveInterpSpeed; // 0x854 (0x4)
	float JoyStickAlphaInterpSpeed; // 0x858 (0x4)
	float GunnerAlphaInterpSpeed; // 0x85c (0x4)
	float StatusStartPositionAlphaWhemIsEmptyOnFirstLoad; // 0x860 (0x4)
	float DashLeansAlphaWhenGunner; // 0x864 (0x4)
	float DashLeansAlphaNoGunner; // 0x868 (0x4)
	float ShotgunShellsAlphaWhenShotgunFires; // 0x86c (0x4)
	float ShotgunShellsAlphaNoShotgunFiring; // 0x870 (0x4)
	float BaseAdditiveAlphaWhenMontageIsPlaying; // 0x874 (0x4)
	float BaseAdditiveAlphaNoMontagePlaying; // 0x878 (0x4)
	float JoyStickAlphaWithGunner; // 0x87c (0x4)
	float GunnerAlphaWithGunner; // 0x880 (0x4)
	float ShellOneAlphaAmmoCountAt3; // 0x884 (0x4)
	float ShellTwoAlphaAmmoCountAt2; // 0x888 (0x4)
	float ShellThreeAlphaAmmoCountAt1; // 0x88c (0x4)
	float ShellFourAlphaAmmoCountAt0; // 0x890 (0x4)
	float ShellsPlayRateWhenNoMoreAmmoAndShouldBringAmmo; // 0x894 (0x4)
	float RecoilAmountAlphaWhenMontagePlayingAndShotgunFires; // 0x898 (0x4)
	float LowerBodyRecoilAdditiveAlphaWithDriver; // 0x89c (0x4)
	float LowerBodyRecoilAdditiveAlphaNoDriver; // 0x8a0 (0x4)
	float JumpApexLoopAlphaNotChargingJump; // 0x8a4 (0x4)
	float JumpApexLoopAlphaWhenIsChargingJump; // 0x8a8 (0x4)
	float RigidBodyAlpha; // 0x8ac (0x4)
	class UAnimMontage* MechShotgunReload; // 0x8b0 (0x8)
	class UAnimMontage* MechShotgunFireA; // 0x8b8 (0x8)
	class UAnimMontage* MechShotgunFireB; // 0x8c0 (0x8)
	class UAnimMontage* MechRocketFire; // 0x8c8 (0x8)
	class UAnimMontage* MechRocketFireSettle; // 0x8d0 (0x8)
	class UAnimSequence* ChargedJumpApexSeq; // 0x8d8 (0x8)
	class UAnimSequence* ChargedJumpFallSeq; // 0x8e0 (0x8)
	class UBlendSpace1D* ChargedJumpLandSeq; // 0x8e8 (0x8)
	class UAnimSequence* ChargedJumpLandPredictedSeq; // 0x8f0 (0x8)
	class UAnimSequence* NormalJumpApexSeq; // 0x8f8 (0x8)
	class UAnimSequence* NormalJumpFallSeq; // 0x900 (0x8)
	class UBlendSpace1D* NormalJumpLandSeq; // 0x908 (0x8)
	class UAnimSequence* NormalJumpLandPredictedSeq; // 0x910 (0x8)
	class UAnimSequence* JumpBaseApexSeq; // 0x918 (0x8)
	class UAnimSequence* JumpBaseFallSeq; // 0x920 (0x8)
	class UBlendSpace1D* JumpBaseLandSeq; // 0x928 (0x8)
	class UAnimSequence* JumpBaseLandPredictedSeq; // 0x930 (0x8)
	unsigned char bTransitionIdleToMovement; // 0x938 (0x1)
	unsigned char bTransitionBootUpToMovement; // 0x938 (0x1)
	unsigned char bTransitionTurnToIdle; // 0x938 (0x1)
	unsigned char bTransitionStopToIdle; // 0x938 (0x1)
	unsigned char bTransitionDashLoopToDefault; // 0x938 (0x1)
	unsigned char bTransitionDashLoopToDashOutro; // 0x938 (0x1)
	unsigned char unreflected_939[0x3]; // 0x939 (0x3) 
	float NotJustGotDriverFloat; // 0x93c (0x4)
	float IsShotgunFiredFloat; // 0x940 (0x4)
	unsigned char unreflected_944[0x4]; // 0x944 (0x4) 
	struct FRotator UpperBodyLagOffset; // 0x948 (0x18)
	float UpperBodyLagMaxRecoverySpeed; // 0x960 (0x4)
	float UpperBodyLagRecoverySmoothness; // 0x964 (0x4)
	float UpperBodyLagRecoveryMass; // 0x968 (0x4)
	float UpperBodyLagRecoveryDelay; // 0x96c (0x4)
	float UpperBodyLagOffsetLimitDuringTurns; // 0x970 (0x4)
	float UpperBodyLagOffsetLimitDuringTurnsInterpSpeed; // 0x974 (0x4)
	float UpperBodyLagOffsetLimitWhileStill; // 0x978 (0x4)
	float UpperBodyLagOffsetLimitWhileStillInterpSpeed; // 0x97c (0x4)
	float CurrentUpperBodyLagRecoverySpeed; // 0x980 (0x4)
	float TimeUntilNextUpperBodyLagRecovery; // 0x984 (0x4)
	float CurrentUpperBodyLagOffsetLimit; // 0x988 (0x4)
	bool bEnableStarts; // 0x98c (0x1)
	unsigned char unreflected_98d[0x3]; // 0x98d (0x3) 
	class UFortAnimWorldStriderComponent* WorldStriderComponent; // 0x990 (0x8)
	unsigned char padding_998[0x8]; // 0x998 (0x8)

	/* Functions */

	// Function /Script/FortniteGame.FortOstrichAnimInstance.StopSeatTransition_PassengerExit (Has no native function)
	void StopSeatTransitionPassengerExit(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.StopSeatTransition_PassengerEnter (Has no native function)
	void StopSeatTransitionPassengerEnter(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.StopSeatTransition_DriverExit (Has no native function)
	void StopSeatTransitionDriverExit(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.StopSeatTransition_DriverEnter (Has no native function)
	void StopSeatTransitionDriverEnter(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.StartSeatTransition_PassengerExit (Has no native function)
	void StartSeatTransitionPassengerExit(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.StartSeatTransition_PassengerEnter (Has no native function)
	void StartSeatTransitionPassengerEnter(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.StartSeatTransition_DriverExit (Has no native function)
	void StartSeatTransitionDriverExit(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.StartSeatTransition_DriverEnter (Has no native function)
	void StartSeatTransitionDriverEnter(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.OnReloadShotgun (Has no native function)
	void OnReloadShotgun(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.OnFireShotgun (Has no native function)
	void OnFireShotgun(); // (Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.OnFiredSingleRocket (Has no native function)
	void OnFiredSingleRocket(int& NumRocketsLeft); // (Event | Public | HasOutParms | BlueprintEvent)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.OnEmoteMontageStarted (Underlying native function: OnEmoteMontageStarted 0x82466e8)
	void OnEmoteMontageStarted(class UAnimMontage*& EmoteMontage); // (Native | Public)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.OnEmoteMontageBlendingOut (Underlying native function: OnEmoteMontageBlendingOut 0x824661c)
	void OnEmoteMontageBlendingOut(class UAnimMontage*& EmoteMontage, bool& bInterrupted); // (Native | Public)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.GetWorldStriderComponent (Underlying native function: GetWorldStriderComponent 0x82465f4)
	class UFortAnimWorldStriderComponent* GetWorldStriderComponent(); // (Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.GetStartTurnYawCorrection (Underlying native function: GetStartTurnYawCorrection 0x82465c8)
	float GetStartTurnYawCorrection(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.GetStartAnimPosition (Underlying native function: GetStartAnimPosition 0x8246574)
	float GetStartAnimPosition(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.GetStartAnimation (Underlying native function: GetStartAnimation 0x82465a0)
	class UAnimSequenceBase* GetStartAnimation(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.GetPivotTurnYawCorrection (Underlying native function: GetPivotTurnYawCorrection 0x824632c)
	float GetPivotTurnYawCorrection(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.GetPivotAnimPosition (Underlying native function: GetPivotAnimPosition 0x82462d8)
	float GetPivotAnimPosition(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.GetPivotAnimation (Underlying native function: GetPivotAnimation 0x8246304)
	class UAnimSequenceBase* GetPivotAnimation(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.GetMechWalkSpeedWarpingValue (Underlying native function: GetMechWalkSpeedWarpingValue 0x8245dc0)
	float GetMechWalkSpeedWarpingValue(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.GetMechWalkPlayRateValue (Underlying native function: GetMechWalkPlayRateValue 0x8245da0)
	float GetMechWalkPlayRateValue(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.AnimNotify_MechBeginFire (Underlying native function: AnimNotify_MechBeginFire 0x82456ec)
	void AnimNotifyMechBeginFire(class UAnimNotify*& Notify); // (Final | Native | Public)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.AnimNotify_JumpEnter (Underlying native function: AnimNotify_JumpEnter 0x8245610)
	void AnimNotifyJumpEnter(class UAnimNotify*& Notify); // (Final | Native | Public)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.AnimNotify_EmptyPoseState (Underlying native function: AnimNotify_EmptyPoseState 0x82454a8)
	void AnimNotifyEmptyPoseState(class UAnimNotify*& Notify); // (Final | Native | Public)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.AnimNotify_AnimNotify_Mech_OnCoolDown (Underlying native function: AnimNotify_AnimNotify_Mech_OnCoolDown 0x8245404)
	void AnimNotifyAnimNotifyMechOnCoolDown(class UAnimNotify*& Notify); // (Final | Native | Public)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.AnimNotify_AnimNotify_AmmoHide (Underlying native function: AnimNotify_AnimNotify_AmmoHide 0x8245388)
	void AnimNotifyAnimNotifyAmmoHide(class UAnimNotify*& Notify); // (Final | Native | Public)

	// Function /Script/FortniteGame.FortOstrichAnimInstance.AnimNotify_AnimNotify_AmmoCheck (Underlying native function: AnimNotify_AnimNotify_AmmoCheck 0x824530c)
	void AnimNotifyAnimNotifyAmmoCheck(class UAnimNotify*& Notify); // (Final | Native | Public)
};

