// Class /Script/FortniteGame.FortDoghouseVehicleConfigs
// Size: 0xa38
class UFortDoghouseVehicleConfigs : public UFortPhysicsVehicleConfigs
{
	float PropSpeedPerLinearSpeed; // 0x890 (0x4)
	float PropSpeedPerLinearSpeedPassive; // 0x894 (0x4)
	float PropSpeedAccelLerpPerSecond; // 0x898 (0x4)
	float PropSpeedDecelLerpPerSecond; // 0x89c (0x4)
	float TaxiPitchProjTarget; // 0x8a0 (0x4)
	float MaxAltitudeZ; // 0x8a4 (0x4)
	float StallAltitudeZ; // 0x8a8 (0x4)
	float StallTime; // 0x8ac (0x4)
	float StuckTimeBeforeStall; // 0x8b0 (0x4)
	float MinSkipShocksAltitudeZ; // 0x8b4 (0x4)
	float AltitudeUpdateFrequency; // 0x8b8 (0x4)
	float ControlStateNetUpdateFrequency; // 0x8bc (0x4)
	float ForceHeadingUpdateFrequency; // 0x8c0 (0x4)
	unsigned char unreflected_8c4[0x4]; // 0x8c4 (0x4) 
	struct FFlightParams BaseFlightParams; // 0x8c8 (0xc8)
	float AileronRollMatchRate; // 0x990 (0x4)
	float AileronRollRotationalDampingCoefficient; // 0x994 (0x4)
	float AileronRollMaxRotationalDampingTorque; // 0x998 (0x4)
	float DivebombSpeedMinKmh; // 0x99c (0x4)
	float DivebombSpeedMaxKmh; // 0x9a0 (0x4)
	float DivebombSteerPitchRate; // 0x9a4 (0x4)
	float DivebombHeadingMatchRate; // 0x9a8 (0x4)
	float HardRollHeadingMatchRate; // 0x9ac (0x4)
	float HardRollHeadingSteerRate; // 0x9b0 (0x4)
	float HardRollOffsetPercent; // 0x9b4 (0x4)
	float TimeBeforeStallWithNoPassengersInAir; // 0x9b8 (0x4)
	float TimeBeforeStallWithNoPassengersOnGround; // 0x9bc (0x4)
	float BoostTopSpeedKmh; // 0x9c0 (0x4)
	float BoostThrust; // 0x9c4 (0x4)
	float AileronRollDoubleClickSpeed; // 0x9c8 (0x4)
	unsigned char unreflected_9cc[0x4]; // 0x9cc (0x4) 
	struct FFortRechargingActionTimerConfig BoostConfig; // 0x9d0 (0x28)
	struct FFortRechargingActionTimerConfig AileronRollConfig; // 0x9f8 (0x28)
	float PitchBiasOnGround; // 0xa20 (0x4)
	float HeadingAutoCenterRate; // 0xa24 (0x4)
	float RollAutoCenterRate; // 0xa28 (0x4)
	float AirbrakeDragCoefficient; // 0xa2c (0x4)
	bool bEngineStallAtCriticalHealth; // 0xa30 (0x1)
	unsigned char padding_a31[0x7]; // 0xa31 (0x7)
};

