// Class /Script/FortniteAI.FortAthenaBTService_Zipline
// Size: 0xc8
class UFortAthenaBTService_Zipline : public UBTService
{
	struct FName ZiplineTargetName; // 0x70 (0x4)
	struct FName LastZiplineUsedName; // 0x74 (0x4)
	struct FName InteractionExecutionStatusName; // 0x78 (0x4)
	struct FName InteractionContextInfoName; // 0x7c (0x4)
	struct FName UsageExecutionStatusName; // 0x80 (0x4)
	struct FName ZiplineEntryLocationName; // 0x84 (0x4)
	struct FName ZiplineExitLocationKeyName; // 0x88 (0x4)
	struct FName MoveToPathMovementStateName; // 0x8c (0x4)
	struct FName MoveExecutionStatusName; // 0x90 (0x4)
	struct FName FocalPointName; // 0x94 (0x4)
	struct FName LastUsageTimeName; // 0x98 (0x4)
	unsigned char padding_9c[0x2c]; // 0x9c (0x2c)
};

