// Class /Script/FortniteAI.FortAthenaAILODSettings_CharacterMovement
// Size: 0x970
class UFortAthenaAILODSettings_CharacterMovement : public UObject
{
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	struct TArray<class UClass*> SystemClasses; // 0x30 (0x10)
	struct FFortAILODSetting_CharacterMovement BelowLowerLODSettings; // 0x40 (0x188)
	struct FFortAILODSetting_CharacterMovement LowerLODSettings; // 0x1c8 (0x188)
	struct FFortAILODSetting_CharacterMovement AboveLowerLODSettings; // 0x350 (0x188)
	struct FFortAILODSetting_CharacterMovement BelowNormalLODSettings; // 0x4d8 (0x188)
	struct FFortAILODSetting_CharacterMovement NormalLODSettings; // 0x660 (0x188)
	struct FFortAILODSetting_CharacterMovement AboveNormalLODSettings; // 0x7e8 (0x188)
};

