// Class /Script/FortniteGame.FortClientBotManager
// Size: 0x300
class UFortClientBotManager : public UObject
{
	unsigned char unreflected_28[0x40]; // 0x28 (0x40) 
	struct FTimerHandle* MissionEndTimerHandle; // 0x68 (0x8)
	unsigned char unreflected_70[0x24]; // 0x70 (0x24) 
	bool bHasAttemptedAbandon; // 0x94 (0x1)
	bool bIsMatchmaking; // 0x95 (0x1)
	bool bShouldPickRandomMap; // 0x96 (0x1)
	bool bShouldRecordFPSCharts; // 0x97 (0x1)
	bool bShouldRecordMemoryReports; // 0x98 (0x1)
	unsigned char unreflected_99[0x1]; // 0x99 (0x1) 
	bool bFPSRecordingStarted; // 0x9a (0x1)
	bool bWatchingForCallStack; // 0x9b (0x1)
	int iSelectedTheater; // 0x9c (0x4)
	int iSelectedTile; // 0xa0 (0x4)
	unsigned char unreflected_a4[0x4]; // 0xa4 (0x4) 
	struct TArray<int> SelectedTileList; // 0xa8 (0x10)
	float RandomZoneDifficultyMinimum; // 0xb8 (0x4)
	float RandomZoneDifficultyMaximum; // 0xbc (0x4)
	int NumSkillPurchasesAttempted; // 0xc0 (0x4)
	int MaxSkillPurchaseAttempts; // 0xc4 (0x4)
	int NumWorkerSlotsAttempted; // 0xc8 (0x4)
	int MaxWorkerSlotAttempts; // 0xcc (0x4)
	float LobbyActionTimer; // 0xd0 (0x4)
	float TimeBetweenLobbyActions; // 0xd4 (0x4)
	bool bWaitingForSkillTreePurchase; // 0xd8 (0x1)
	bool bWaitingForWorkerSlot; // 0xd9 (0x1)
	unsigned char unreflected_da[0x2]; // 0xda (0x2) 
	int LoopsSpentWaitingForFrontend; // 0xdc (0x4)
	float TimeBetweenStartButtonClicks; // 0xe0 (0x4)
	unsigned char unreflected_e4[0x4]; // 0xe4 (0x4) 
	float TimeSinceFriendInvitesSent; // 0xe8 (0x4)
	float LastMatchmakeTime; // 0xec (0x4)
	float LastLoginCycleTime; // 0xf0 (0x4)
	float MatchmakingStartTime; // 0xf4 (0x4)
	float LastChangedStateTime; // 0xf8 (0x4)
	float LastRandomTurnTime; // 0xfc (0x4)
	float LastPickLootTime; // 0x100 (0x4)
	float LastPickEnemyTime; // 0x104 (0x4)
	float LastEnemyKilledTime; // 0x108 (0x4)
	float LastBuildingKilledTime; // 0x10c (0x4)
	float LastGoodInteraction; // 0x110 (0x4)
	float LastCheckGoodTarget; // 0x114 (0x4)
	unsigned char unreflected_118[0x48]; // 0x118 (0x48) 
	struct TWeakObjectPtr<class AFortPawn> WeakEnemyTarget; // 0x160 (0x8)
	class AFortPickup* PickupTarget; // 0x168 (0x8)
	class ABuildingActor* BuildingTarget; // 0x170 (0x8)
	class ABuildingActor* MissionTarget; // 0x178 (0x8)
	class ABuildingActor* PrimaryMissionTarget; // 0x180 (0x8)
	struct TArray<class ABuildingActor*> AllMissionTargets; // 0x188 (0x10)
	struct TArray<class ABuildingActor*> ActiveMissionTargets; // 0x198 (0x10)
	unsigned char unreflected_1a8[0xa0]; // 0x1a8 (0xa0) 
	struct FVector ViewLocation; // 0x248 (0x18)
	class AFortPlayerPawn* MyPawn; // 0x260 (0x8)
	struct TArray<class UFortWorldItem*> ItemsToCheckForMaxStackSize; // 0x268 (0x10)
	unsigned char padding_278[0x88]; // 0x278 (0x88)
};

