// Class /Script/FortniteGame.FortDeterminismConfig
// Size: 0x30
class UFortDeterminismConfig : public UObject
{
	unsigned char bStormDeterminism; // 0x28 (0x1)
	unsigned char bAIDeterminism; // 0x28 (0x1)
	unsigned char bNoAI; // 0x28 (0x1)
	unsigned char bNoLager; // 0x28 (0x1)
	unsigned char bWorldDeterminism; // 0x28 (0x1)
	unsigned char bWeatherDeterminism; // 0x28 (0x1)
	unsigned char bNoValet; // 0x28 (0x1)
	unsigned char padding_29[0x7]; // 0x29 (0x7)
};

