// Class /Script/FortniteGame.FortFerretVehicleAnimInstance
// Size: 0x700
class UFortFerretVehicleAnimInstance : public UFortVehicleAnimInstance
{
	class AFortAthenaFerretVehicle* FerretVehicle; // 0x5f0 (0x8)
	struct FRotator FerretVehicleSpeed; // 0x5f8 (0x18)
	bool bForwardSpeedIsNearlyZero; // 0x610 (0x1)
	bool bForwardSpeedIsGreaterThanOne; // 0x611 (0x1)
	bool bReverseSpeedIsGreaterThanOne; // 0x612 (0x1)
	bool bSpeedIsGreaterThanFiveAndPlayerHitSpace; // 0x613 (0x1)
	bool bIsBraking; // 0x614 (0x1)
	bool bIsBoosting; // 0x615 (0x1)
	bool bIsBoostReady; // 0x616 (0x1)
	bool bPlayerHitSpaceBar; // 0x617 (0x1)
	bool bOnGround; // 0x618 (0x1)
	unsigned char unreflected_619[0x7]; // 0x619 (0x7) 
	struct FVector ControlTorque; // 0x620 (0x18)
	struct FRotator RudderAngle; // 0x638 (0x18)
	struct FRotator AileronAngle; // 0x650 (0x18)
	struct FRotator ElevatorAngle; // 0x668 (0x18)
	struct FRotator FlapAngle; // 0x680 (0x18)
	struct FRotator Altitude; // 0x698 (0x18)
	float SteerPitchAngle; // 0x6b0 (0x4)
	unsigned char unreflected_6b4[0x4]; // 0x6b4 (0x4) 
	struct FRotator PropellorAngle; // 0x6b8 (0x18)
	struct FRotator BoostPercent; // 0x6d0 (0x18)
	enum EPlaneDirection FerretCardinalDirection; // 0x6e8 (0x1)
	unsigned char unreflected_6e9[0x3]; // 0x6e9 (0x3) 
	float ElevatorDeadZone; // 0x6ec (0x4)
	float RudderDeadZone; // 0x6f0 (0x4)
	bool bFerretShouldPlayStartTransition; // 0x6f4 (0x1)
	unsigned char unreflected_6f5[0x1]; // 0x6f5 (0x1) 
	bool bFerretShouldPlayStopTransition; // 0x6f6 (0x1)
	unsigned char unreflected_6f7[0x1]; // 0x6f7 (0x1) 
	enum EPlaneDirection FerretStopCardinalDirection; // 0x6f8 (0x1)
	enum EPlaneDirection FerretPrePivotCardinalDirection; // 0x6f9 (0x1)
	bool bFerretShouldPlayPivotTransition; // 0x6fa (0x1)
	unsigned char unreflected_6fb[0x1]; // 0x6fb (0x1) 
	float AbsSteerAngle; // 0x6fc (0x4)
};

