// Class /Script/FortniteAI.FortAthenaAIBotEmoteDigestedSkillSet
// Size: 0x50
class UFortAthenaAIBotEmoteDigestedSkillSet : public UFortAthenaAIBotDigestedSkillSet
{
	float InfiniteEmoteMinDuration; // 0x30 (0x4)
	float InfiniteEmoteMaxDuration; // 0x34 (0x4)
	int EmotesMaxCount; // 0x38 (0x4)
	float DanceOnKillMaxDistanceFromKillSqr; // 0x3c (0x4)
	float DanceOnKillMaxTimeFromKill; // 0x40 (0x4)
	float DanceOnKillMinTimeFromLastTry; // 0x44 (0x4)
	float DanceOnKillChanceToDanceOnBots; // 0x48 (0x4)
	float DanceOnKillChanceToDanceOnPlayers; // 0x4c (0x4)
};

