// Class /Script/GrappleParentRuntime.FortSwingingLayerAnimInstance
// Size: 0x5e0
class UFortSwingingLayerAnimInstance : public UFortBaseLayerAnimInstance
{
	class UAnimInstance* MainAnimBP; // 0x440 (0x8)
	class AFortPlayerPawnAthena* Player; // 0x448 (0x8)
	bool IsGroundSwing; // 0x450 (0x1)
	bool IsFemale; // 0x451 (0x1)
	unsigned char unreflected_452[0x2]; // 0x452 (0x2) 
	float PlayerDistanceToGround; // 0x454 (0x4)
	bool CalculateRotation; // 0x458 (0x1)
	unsigned char unreflected_459[0x7]; // 0x459 (0x7) 
	struct FScalableFloat ForwardInfluenceOnRotation; // 0x460 (0x28)
	struct FScalableFloat TimeForMaxRotationSpeed; // 0x488 (0x28)
	struct FScalableFloat MaxRotationSpeed; // 0x4b0 (0x28)
	struct FScalableFloat RotationSpeedWhileNotAttached; // 0x4d8 (0x28)
	struct FScalableFloat RotationSpeedWhileNotRotated; // 0x500 (0x28)
	class AActor* GetAttachedActor; // 0x528 (0x8)
	bool isFreeFalling; // 0x530 (0x1)
	bool IsAttached; // 0x531 (0x1)
	bool IsNotAttachedToCliff; // 0x532 (0x1)
	unsigned char unreflected_533[0x5]; // 0x533 (0x5) 
	struct FVector Velocity; // 0x538 (0x18)
	struct FVector XYVelocity; // 0x550 (0x18)
	struct FVector VecFromPlayerToAttachPoint; // 0x568 (0x18)
	float PitchAngleFromAttachPoint; // 0x580 (0x4)
	float RollAngle; // 0x584 (0x4)
	float YawAngleToAttachTarget; // 0x588 (0x4)
	struct FName CurveNameSwingPhase; // 0x58c (0x4)
	struct FName CurveNameBlendOut; // 0x590 (0x4)
	float SwingPhase; // 0x594 (0x4)
	struct FRotator CurrentRootRotation; // 0x598 (0x18)
	struct FVector CurrentRootTranslation; // 0x5b0 (0x18)
	bool IsSwingRelease1; // 0x5c8 (0x1)
	bool IsSwingRelease2; // 0x5c9 (0x1)
	bool IsSwingRelease3; // 0x5ca (0x1)
	bool IsSwingRelease4; // 0x5cb (0x1)
	bool IsSwingRelease5; // 0x5cc (0x1)
	bool IsSwingReleaseSkid; // 0x5cd (0x1)
	bool IsMovingAttachPoint; // 0x5ce (0x1)
	bool IsBlendOut; // 0x5cf (0x1)
	float WebCastAttachDirection; // 0x5d0 (0x4)
	bool IsWebCastDown; // 0x5d4 (0x1)
	bool IsSwingOneHand; // 0x5d5 (0x1)
	bool IsRandomHandBool; // 0x5d6 (0x1)
	bool IsRandomSwingReleaseBool; // 0x5d7 (0x1)
	bool IsRandomeReleaseBool; // 0x5d8 (0x1)
	bool IsWithin100UnitsOfGround; // 0x5d9 (0x1)
	bool IsHanging; // 0x5da (0x1)
	bool IsFallRelease; // 0x5db (0x1)
	bool IsOnGroundWebCast; // 0x5dc (0x1)
	bool IsSwingNearGroundToSkid; // 0x5dd (0x1)
	bool IsHangToSwingInAir; // 0x5de (0x1)
	bool IsHangToSwingNearGround; // 0x5df (0x1)

	/* Functions */

	// Function /Script/GrappleParentRuntime.FortSwingingLayerAnimInstance.GetPlayerAnglesFromAttachPoint (Underlying native function: GetPlayerAnglesFromAttachPoint 0x72646f0)
	void GetPlayerAnglesFromAttachPoint(float& Pitch, float& Roll, float& Yaw); // (Final | Native | Public | HasOutParms)

	// Function /Script/GrappleParentRuntime.FortSwingingLayerAnimInstance.GetAttachVectorInPlayerSpace (Underlying native function: GetAttachVectorInPlayerSpace 0x7264648)
	struct FVector GetAttachVectorInPlayerSpace(struct FVector& InPlayerToAttachPoint); // (Final | Native | Public | HasOutParms | HasDefaults)
};

