// Class /Script/FortniteUI.FortVoiceSpeakerContainerWidget
// Size: 0x330
class UFortVoiceSpeakerContainerWidget : public UCommonUserWidget
{
	class UClass* CustomSpeakerWidgetClass; // 0x290 (0x8)
	unsigned char unreflected_298[0x68]; // 0x298 (0x68) 
	int MaxSimultaneousUsers; // 0x300 (0x4)
	bool bShowIndicatorsForSquadMembers; // 0x304 (0x1)
	bool bCurrentChannelDisplayEnabled; // 0x305 (0x1)
	unsigned char unreflected_306[0xa]; // 0x306 (0xa) 
	class UDynamicEntryBox* DynamicEntrySpeakers; // 0x310 (0x8)
	class UPanelWidget* PanelChannelContainer; // 0x318 (0x8)
	class UCommonTextBlock* TextChannelDisplayName; // 0x320 (0x8)
	unsigned char padding_328[0x8]; // 0x328 (0x8)
};

