// Class /Script/FortniteGame.FortControllerComponent_MarkActorsInRadius
// Size: 0x1b0
class UFortControllerComponent_MarkActorsInRadius : public UFortControllerComponent
{
	struct FScalableFloat bClampIndicatorToScreen; // 0xa0 (0x28)
	struct FGameplayTagQuery AITagQuery; // 0xc8 (0x48)
	struct FGameplayTagContainer VendettaAITags; // 0x110 (0x20)
	struct FScalableFloat AIIndicatorRadius; // 0x130 (0x28)
	struct FScalableFloat AIIndicatorHalfHeight; // 0x158 (0x28)
	struct FVector IndicatorOffset; // 0x180 (0x18)
	enum EIndicatorStateImage MarkedAIIndicatorImageType; // 0x198 (0x1)
	unsigned char padding_199[0x17]; // 0x199 (0x17)
};

