// Class /Script/FortniteGame.FortPlayerAnimInstance_ShoppingCartDriver
// Size: 0x1b90
class UFortPlayerAnimInstance_ShoppingCartDriver : public UFortPlayerAnimInstance
{
	struct FFortAnimInput_ShoppingCart ShoppingCartInput; // 0x1a18 (0x5c)
	unsigned char unreflected_1a74[0x4]; // 0x1a74 (0x4) 
	struct FFortAnimInput_VelocityImpact VelocityImpact; // 0x1a78 (0xf0)
	struct FVector ImpactDisplacement; // 0x1b68 (0x18)
	bool bIsInAirFarFromGround; // 0x1b80 (0x1)
	bool bForwardVelocityGT400; // 0x1b81 (0x1)
	bool bForwardSpeedKmHLT5; // 0x1b82 (0x1)
	unsigned char padding_1b83[0xd]; // 0x1b83 (0xd)
};

