// Class /Script/FortniteUI.FortSocialSidebarButton
// Size: 0x1500
class UFortSocialSidebarButton : public UFortSocialSidebarButtonBase
{
	struct FLinearColor ColorContentSelected; // 0x1478 (0x10)
	struct FLinearColor ColorContentUnselected; // 0x1488 (0x10)
	struct FLinearColor ColorContentHovered; // 0x1498 (0x10)
	class UImage* ImageTabIcon; // 0x14a8 (0x8)
	class UImage* ImageTabIconSelected; // 0x14b0 (0x8)
	class UCommonTextBlock* TextNumber; // 0x14b8 (0x8)
	class UCommonTextBlock* TextNumberSelected; // 0x14c0 (0x8)
	class UScaleBox* ScaleBoxNumber; // 0x14c8 (0x8)
	class UTexture2D* Icon; // 0x14d0 (0x8)
	class UTexture2D* IconFeatureDisabled; // 0x14d8 (0x8)
	class UMaterialInstance* MaterialIcon; // 0x14e0 (0x8)
	class UMaterialInstance* MaterialIconFeatureDisabled; // 0x14e8 (0x8)
	unsigned char padding_14f0[0x10]; // 0x14f0 (0x10)
};

