// Class /Script/FortniteGame.FortSocialToolkit
// Size: 0x6f8
class UFortSocialToolkit : public USocialToolkit
{
	unsigned char unreflected_2a8[0x380]; // 0x2a8 (0x380) 
	float SocialProfileSettingsSaveDelay; // 0x628 (0x4)
	float MutualFriendsSettingSaveDelay; // 0x62c (0x4)
	float RebootRallyPlatformFriendsQueryDelay; // 0x630 (0x4)
	float RebootRallyReQueryDelay; // 0x634 (0x4)
	float LfgSettingsSaveDelay; // 0x638 (0x4)
	bool bAutoRecreatePartiesDuringLogin; // 0x63c (0x1)
	bool bEnableDisplayNamesPrivacy; // 0x63d (0x1)
	unsigned char padding_63e[0xba]; // 0x63e (0xba)
};

