// Class /Script/FortniteAI.FortAthenaAIBotDBNOSkillSet
// Size: 0x170
class UFortAthenaAIBotDBNOSkillSet : public UFortAthenaAIBotSkillSet
{
	struct FScalableFloat MaxDBNOCrawlingResponseTime; // 0x30 (0x28)
	struct FScalableFloat MaxDBNOCrawlingResponseTimeDeviation; // 0x58 (0x28)
	struct FScalableFloat AllyEvaluationTime; // 0x80 (0x28)
	struct FScalableFloat AllyEvaluationTimeDeviation; // 0xa8 (0x28)
	struct FScalableFloat AllyEvaluationMaxDistance; // 0xd0 (0x28)
	struct FScalableFloat OddsToLookForCover; // 0xf8 (0x28)
	struct FScalableFloat CoverEvaluationTime; // 0x120 (0x28)
	struct FScalableFloat CoverEvaluationTimeDeviation; // 0x148 (0x28)
};

