// BlueprintGeneratedClass /Game/Athena/Items/Consumables/Grenade/GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C
// Size: 0xf99
class UGA_Athena_Grenade_WithTrajectory_Deprecated_C : public UFortGameplayAbility
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0xb20 (0x8)
	struct FGameplayTag EventActivation; // 0xb28 (0x4)
	struct FGameplayTag EventComplete; // 0xb2c (0x4)
	class UClass* PrjGrenade; // 0xb30 (0x8)
	double GrenadeSpeedMin; // 0xb38 (0x8)
	double GrenadeSpeedMax; // 0xb40 (0x8)
	double GravityScale; // 0xb48 (0x8)
	class USoundBase* GrenadeSound; // 0xb50 (0x8)
	struct FGameplayTag ECDefaultExplosion; // 0xb58 (0x4)
	unsigned char unreflected_b5c[0x4]; // 0xb5c (0x4) 
	struct FFortGameplayEffectContainerSpec ECReturnedEffect; // 0xb60 (0xb8)
	struct FFortGameplayEffectContainerSpec ECAdditionalReturnedEffect; // 0xc18 (0xb8)
	double ExplosionRadius; // 0xcd0 (0x8)
	double AdditionalThrowAngle; // 0xcd8 (0x8)
	struct FFortFeedbackHandle GrenadeDialogFeedback; // 0xce0 (0x10)
	bool GrenadeAmmo; // 0xcf0 (0x1)
	bool PlasmaGrenades; // 0xcf1 (0x1)
	bool Flashbang; // 0xcf2 (0x1)
	unsigned char unreflected_cf3[0x5]; // 0xcf3 (0x5) 
	struct FVector GrenadeTargetingOriginOffset; // 0xcf8 (0x18)
	bool DummyShouldBounce; // 0xd10 (0x1)
	unsigned char unreflected_d11[0x7]; // 0xd11 (0x7) 
	double DummyBounciness; // 0xd18 (0x8)
	double DummyFriction; // 0xd20 (0x8)
	double DummyMaxSpeed; // 0xd28 (0x8)
	double DummyGravity; // 0xd30 (0x8)
	double DummyTimeStep; // 0xd38 (0x8)
	double DummyExtent; // 0xd40 (0x8)
	struct FVector GrenadeTargetingOriginOffsetCrouched; // 0xd48 (0x18)
	bool InThrowWindup; // 0xd60 (0x1)
	unsigned char unreflected_d61[0x7]; // 0xd61 (0x7) 
	class ABP_ProjectileTrajectory_C* TrajectoryIndicator; // 0xd68 (0x8)
	class UClass* TrajectoryIndicatorClass; // 0xd70 (0x8)
	struct FFortGameplayAbilityMontageInfo ThrowWindupMontage; // 0xd78 (0x58)
	bool AbilityKeyPressed; // 0xdd0 (0x1)
	unsigned char unreflected_dd1[0x7]; // 0xdd1 (0x7) 
	double MaxSpeedPitch; // 0xdd8 (0x8)
	double MinSpeedPitch; // 0xde0 (0x8)
	struct FGameplayEventData EventData; // 0xde8 (0xb0)
	class AFortPlayerPawn* PlayerPawn; // 0xe98 (0x8)
	double MaxTossPitch; // 0xea0 (0x8)
	int MaxTrajectoryBounces; // 0xea8 (0x4)
	unsigned char unreflected_eac[0x4]; // 0xeac (0x4) 
	double PostThrowCancelDelay; // 0xeb0 (0x8)
	double PostThrowEndDelay; // 0xeb8 (0x8)
	class AFortProjectileBase* ProjectileReference; // 0xec0 (0x8)
	double DistanceFromInstigatorCheck; // 0xec8 (0x8)
	struct FTimerHandle* UpdateTrajectoryTimerHandle; // 0xed0 (0x8)
	bool SpawnedOnEquip; // 0xed8 (0x1)
	struct TEnumAsByte<ECollisionChannel> DummyCollisionChannel; // 0xed9 (0x1)
	unsigned char unreflected_eda[0x6]; // 0xeda (0x6) 
	class AFortProjectileDecoHelper* GrenadeDecoHelper; // 0xee0 (0x8)
	class AFortDecoTool_ContextTrap* GrenadeDecoTool; // 0xee8 (0x8)
	struct FMulticastInlineDelegate OnProjectileSpawn; // 0xef0 (0x10)
	struct FGameplayTagContainer QuestCreditTargetTag; // 0xf00 (0x20)
	int DummyMaxSteps; // 0xf20 (0x4)
	struct FGameplayTag GCCookLoop; // 0xf24 (0x4)
	struct FGameplayTag GCOnThrow; // 0xf28 (0x4)
	bool bIsSecondaryFire; // 0xf2c (0x1)
	bool bIsThrowing; // 0xf2d (0x1)
	unsigned char unreflected_f2e[0x2]; // 0xf2e (0x2) 
	class UClass* CameraMode; // 0xf30 (0x8)
	bool bThrowInstantly; // 0xf38 (0x1)
	bool bPreventDeploymentInBlockAreas; // 0xf39 (0x1)
	unsigned char unreflected_f3a[0x2]; // 0xf3a (0x2) 
	float DeployableBlockingAreaCheckRadius; // 0xf3c (0x4)
	struct FVector DeployableBlockingAreaCheckOffset; // 0xf40 (0x18)
	struct FGameplayTagContainer VehicleTag; // 0xf58 (0x20)
	struct FGameplayTagContainer ThrowTag; // 0xf78 (0x20)
	bool TrajectoryHidden; // 0xf98 (0x1)

	/* Functions */

	// Function /Game/Athena/Items/Consumables/Grenade/GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.ShouldOnlyShowTrajectoryOnUse (Has no native function)
	bool ShouldOnlyShowTrajectoryOnUse(); // (Event | Public | HasOutParms | BlueprintCallable | BlueprintEvent | BlueprintPure | Const)

	// Function /Game/Athena/Items/Consumables/Grenade/GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.SpawnTrajectoryIndicator (Has no native function)
	class AFortProjectileTrajectory* SpawnTrajectoryIndicator(bool& bSpawnOnEquip); // (Event | Public | HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Athena/Items/Consumables/Grenade/GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.GetProjectileTrajectoryPoints (Has no native function)
