// BlueprintGeneratedClass /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C
// Size: 0xe58
class UGA_NPC_Parent_C : public UFortGameplayAbility
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0xb20 (0x8)
	class AFortAIPawn* NPCActivatingFortAIPawn; // 0xb28 (0x8)
	struct TEnumAsByte<EFortMovementUrgency> NPCInitialMovementUrgency; // 0xb30 (0x1)
	bool NPCDebugAbility; // 0xb31 (0x1)
	unsigned char unreflected_b32[0x6]; // 0xb32 (0x6) 
	struct FGameplayTagContainer NPCIgnoreDamageAndOnlyDoKnockbackIfTheseAbilitiesAreActive; // 0xb38 (0x20)
	bool NPCDebugFreezeFrameEnabled; // 0xb58 (0x1)
	bool NPCDebugFreezeFrameOnlyWhenAbilityTargetHit; // 0xb59 (0x1)
	bool NPCDebugFreezeFrameOnlyWhenWeHaveSomeTarget; // 0xb5a (0x1)
	bool NPCDamageHitAbilityTargetDuringThisAbilityActivation; // 0xb5b (0x1)
	unsigned char unreflected_b5c[0x4]; // 0xb5c (0x4) 
	struct TArray<class AActor*> NPCDamageActorsWeHaveHitDuringThisAbilityActivation; // 0xb60 (0x10)
	double NPCCanActivateAbilityMaxTargetZDistanceBelow; // 0xb70 (0x8)
	double NPCCanActivateAbilityMaxTargetZDistanceAbove; // 0xb78 (0x8)
	double NPCCanActivateAbilityMaxTargetZDistanceAboveForIntentionalFailedAttack; // 0xb80 (0x8)
	struct TArray<class AActor*> BuildingTargetingHitActors; // 0xb88 (0x10)
	struct FGameplayTagContainer TCNPCFrustrationTagsToClearForGoals; // 0xb98 (0x20)
	struct TEnumAsByte<Enum_NPC_AlertLevel> NPCAlertLevelGoalIsFortPawn; // 0xbb8 (0x1)
	struct TEnumAsByte<Enum_NPC_AlertLevel> NPCAlertLevelGoalIsOther; // 0xbb9 (0x1)
	struct TEnumAsByte<Enum_NPC_AlertLevel> NPCAlertLevelGoalIsNotValid; // 0xbba (0x1)
	unsigned char unreflected_bbb[0x5]; // 0xbbb (0x5) 
	struct FScalableFloat NPCDamageKnockbackVelocityHF; // 0xbc0 (0x28)
	struct FScalableFloat NPCDamageKnockbackVerticalAngleHF; // 0xbe8 (0x28)
	struct FScalableFloat NPCDamageKnockbackMinimumYawValueHF; // 0xc10 (0x28)
	struct FScalableFloat NPCDamageCanAttackDBNOPlayersHF; // 0xc38 (0x28)
	struct FScalableFloat NPCDamageKnockbackVelocityVehicleHF; // 0xc60 (0x28)
	struct FScalableFloat NPCDamageKnockbackVerticalAngleVehicleHF; // 0xc88 (0x28)
	struct FScalableFloat NPCDamageKnockbackMinimumYawValueVehicleHF; // 0xcb0 (0x28)
	struct FScalableFloat NPCDamageChanceToEjectFromVehicleHF; // 0xcd8 (0x28)
	struct FGameplayTag DestroyBuildingGC; // 0xd00 (0x4)
	unsigned char unreflected_d04[0x4]; // 0xd04 (0x4) 
	class UClass* DestroyBuildingGE; // 0xd08 (0x8)
	struct FGameplayTagContainer TCNPCFrustrationTagsToClearForMovement; // 0xd10 (0x20)
	struct FGameplayTag TCNPCFrustrationBuildDueToGoal; // 0xd30 (0x4)
	struct FGameplayTag TCNPCFrustrationBuildDueToMovement; // 0xd34 (0x4)
	struct FGameplayTagQuery TQNPCRequirementsToBuildFrustrationDueToGoal; // 0xd38 (0x48)
	struct FGameplayTagQuery TQNPCRequirementsToBuildFrustrationDueToMovement; // 0xd80 (0x48)
	struct FScalableFloat NPCBodyBumpBuildingsWhenBuildingMovementFrustrationHF; // 0xdc8 (0x28)
	struct FScalableFloat NPCFrustrationBodyBumpOnlyDestroyPlayerBuildingsHF; // 0xdf0 (0x28)
	struct FGameplayTag TCNPCEffectContainerBodyBumpBuildingsWhenBuildingMovementFrustration; // 0xe18 (0x4)
	unsigned char unreflected_e1c[0x4]; // 0xe1c (0x4) 
	struct FGameplayAbilityTargetDataHandle BuildingTargetingTargetData; // 0xe20 (0x28)
	struct FGameplayTag BuildingTargetingApplicationTag; // 0xe48 (0x4)
	struct FGameplayTag TCBuildingTypePlayer; // 0xe4c (0x4)
	class UClass* GENPCMMRScalingAbilityCooldown; // 0xe50 (0x8)

	/* Functions */

	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC ResetRotationRate (Has no native function)
	void NPCResetRotationRate(bool& CallFuncIsValidReturnValue); // (Public | BlueprintCallable | BlueprintEvent)

	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC OverrideRotationRate (Has no native function)
