// VerseClass /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_phase
// Size: 0x90
class UGame_StormController_storm_phase : public UObject
{
	double verse0x4CDBEC4DwaitTime; // 0x28 (0x8)
	double verse0xDFEF9A4EshrinkTime; // 0x30 (0x8)
	double verse0x96A9475AendRadius; // 0x38 (0x8)
	double verse0x61AAA523endRadiusPercentage; // 0x40 (0x8)
	int64_t verse0x7781DBF3damageIndex; // 0x48 (0x8)
	unsigned char verse0x3902DD0Bmoves; // 0x50 (0x1)
	unsigned char unreflected_51[0x7]; // 0x51 (0x7) 
	double verse0xA376E20DminMovementDistance; // 0x58 (0x8)
	double verse0x2C327F1DmaxMovementDistance; // 0x60 (0x8)
	double verse0xDA5EE7C4minMovementDistancePercentage; // 0x68 (0x8)
	double verse0x7B63CDBAmaxMovementDistancePercentage; // 0x70 (0x8)
	struct FSpatialMath_vector3 verse0xD6F5A7B7endLocation; // 0x78 (0x18)

	/* Functions */

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_phase.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_phase.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_phase.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

