// Class /Script/FortniteGame.GameDataCosmetics
// Size: 0x9a8
class UGameDataCosmetics : public UPrimaryDataAsset
{
	struct TWeakObjectPtr<class UClass> EmoteGameplayAbility; // 0x30 (0x28)
	struct TWeakObjectPtr<class UClass> SprayGameplayAbility; // 0x58 (0x28)
	struct TWeakObjectPtr<class UCustomCharacterPart> DefaultBackpackCharacterPart; // 0x80 (0x28)
	struct TArray<struct TWeakObjectPtr<class UCustomCharacterPart>> DefaultCharacterParts; // 0xa8 (0x10)
	struct TArray<struct FFallbackCharacterPartsMapper> FallbackCharacterParts; // 0xb8 (0x10)
	struct TArray<struct FFallbackAIPawnCustomizationMapper> FallbackCustomizations; // 0xc8 (0x10)
	class UFortCosmeticRestrictionData* CosmeticRestrictionData; // 0xd8 (0x8)
	struct TWeakObjectPtr<class UDataTable> BannerIconCategoryData; // 0xe0 (0x28)
	struct TWeakObjectPtr<class UDataTable> BannerColorData; // 0x108 (0x28)
	struct TWeakObjectPtr<class UDataTable> BannerColorCategoryData; // 0x130 (0x28)
	struct TWeakObjectPtr<class UFortHomebaseBannerColorMap> BannerColorMap; // 0x158 (0x28)
	struct TArray<struct FName> HideElementParameterNames; // 0x180 (0x10)
	struct TWeakObjectPtr<class UAthenaPickaxeItemDefinition> FallbackPickaxe; // 0x190 (0x28)
	struct TWeakObjectPtr<class USkeletalMesh> FallbackPickaxeMesh; // 0x1b8 (0x28)
	struct TWeakObjectPtr<class USkeletalMesh> FallbackDualWieldPickaxeMesh; // 0x1e0 (0x28)
	struct TWeakObjectPtr<class UAthenaDanceItemDefinition> FallbackDance; // 0x208 (0x28)
	struct TArray<struct TWeakObjectPtr<class UFortItemDefinition>> ShuffleTileItemDefinitions; // 0x230 (0x10)
	class UAthenaBackpackItemDefinition* STWHeroBackpackItemDefinition; // 0x240 (0x8)
	class UAthenaBackpackItemDefinition* STWHeroNoDefaultBackpackItemDefinition; // 0x248 (0x8)
	class UAthenaBattleBusItemDefinition* DefaultBattleBusSkin; // 0x250 (0x8)
	class UAthenaGliderItemDefinition* DefaultGliderSkin; // 0x258 (0x8)
	class UAthenaSkyDiveContrailItemDefinition* DefaultContrailEffect; // 0x260 (0x8)
	class UAthenaMusicPackItemDefinition* DefaultMusicPack; // 0x268 (0x8)
	struct TArray<struct FPrimaryAssetId*> ValidMaleSkinsForAnonymousMode; // 0x270 (0x10)
	struct TArray<struct FPrimaryAssetId*> ValidFemaleSkinsForAnonymousMode; // 0x280 (0x10)
	struct TArray<struct FPrimaryAssetId*> ValidBackPacksForAnonymousMode; // 0x290 (0x10)
	class UFortCosmeticItemFilterTable* FilterTagTable; // 0x2a0 (0x8)
	class UFortCosmeticItemMarkupTable* CosmeticMarkupTable; // 0x2a8 (0x8)
	struct TWeakObjectPtr<class UDataTable> CosmeticPreviewActionList; // 0x2b0 (0x28)
	struct TWeakObjectPtr<class UClass> CharacterPreviewCameraActorClass; // 0x2d8 (0x28)
	struct TWeakObjectPtr<class UClass> EmotePreviewActorClass; // 0x300 (0x28)
	struct TWeakObjectPtr<class UClass> EmotePreviewCameraActorClass; // 0x328 (0x28)
	struct TWeakObjectPtr<class UClass> ItemWrapPreviewActorClass; // 0x350 (0x28)
	struct TWeakObjectPtr<class UClass> ItemWrapPreviewCameraActorClass; // 0x378 (0x28)
	struct TWeakObjectPtr<class UClass> LoadingScreenPreviewActorClass; // 0x3a0 (0x28)
	struct TWeakObjectPtr<class UClass> LoadingScreenPreviewCameraActorClass; // 0x3c8 (0x28)
	struct TWeakObjectPtr<class UClass> SprayPreviewActorClass; // 0x3f0 (0x28)
	struct TWeakObjectPtr<class UClass> SprayPreviewCameraActorClass; // 0x418 (0x28)
	struct TWeakObjectPtr<class UClass> MusicPackPreviewActorClass; // 0x440 (0x28)
	struct TWeakObjectPtr<class UClass> MusicPackPreviewCameraActorClass; // 0x468 (0x28)
	struct TWeakObjectPtr<class UClass> SkyDiveContrailPreviewActorClass; // 0x490 (0x28)
	struct TWeakObjectPtr<class UClass> SkyDiveContrailPreviewCameraActorClass; // 0x4b8 (0x28)
	struct TWeakObjectPtr<class UAnimMontage> SkyDiveContrailAnimationMale; // 0x4e0 (0x28)
	struct TWeakObjectPtr<class UAnimMontage> SkyDiveContrailAnimationFemale; // 0x508 (0x28)
	struct TWeakObjectPtr<class UAnimMontage> PickaxePreviewMontageIdle2H; // 0x530 (0x28)
	struct TWeakObjectPtr<class UAnimMontage> PickaxePreviewMontageSwing2H; // 0x558 (0x28)
	struct TWeakObjectPtr<class UAnimMontage> PickaxePreviewMontageIdleDualWield; // 0x580 (0x28)
	struct TWeakObjectPtr<class UAnimMontage> PickaxePreviewMontageSwingDualWield; // 0x5a8 (0x28)
	struct TWeakObjectPtr<class UClass> GliderPreviewCameraActorClass; // 0x5d0 (0x28)
	struct TWeakObjectPtr<class UClass> BodyPartOverridePreviewActorClass; // 0x5f8 (0x28)
	struct TWeakObjectPtr<class UClass> BodyPartPreviewCameraActorClass; // 0x620 (0x28)
	struct TWeakObjectPtr<class UClass> CharmPreviewActorClass; // 0x648 (0x28)
	struct TWeakObjectPtr<class UClass> CharmPreviewCameraActorClass; // 0x670 (0x28)
	struct TWeakObjectPtr<class UClass> WeaponCharmPreviewActorClass; // 0x698 (0x28)
	struct TWeakObjectPtr<class UClass> WeaponCharmPreviewCameraActorClass; // 0x6c0 (0x28)
	struct TWeakObjectPtr<class UClass> PickaxeCosmeticPreviewActorClass; // 0x6e8 (0x28)
	struct TWeakObjectPtr<class UClass> PickaxePreviewCameraActorClass; // 0x710 (0x28)
	struct TWeakObjectPtr<class UClass> BannerItemPreviewActorClass; // 0x738 (0x28)
	struct TWeakObjectPtr<class UClass> CurrencyItemPreviewActorClass; // 0x760 (0x28)
	struct TWeakObjectPtr<class UClass> BattlePassItemPreviewActorClass; // 0x788 (0x28)
	struct TWeakObjectPtr<class UClass> ToyItemPreviewActorClass; // 0x7b0 (0x28)
	struct TWeakObjectPtr<class UClass> DefaultPreviewActorClass; // 0x7d8 (0x28)
	struct TWeakObjectPtr<class UClass> DefaultPreviewPawnAnimInstanceClass; // 0x800 (0x28)
	class UFortMetaTagToPreviewActorMapping* MetaTagToPreviewActorAsset; // 0x828 (0x8)
	float ItemPreviewLODStreamingTimeout; // 0x830 (0x4)
	unsigned char unreflected_834[0x4]; // 0x834 (0x4) 
	struct TMap<enum EAthenaCustomizationCategory, struct TWeakObjectPtr<class UClass>> CosmeticPreviewActionMap; // 0x838 (0x50)
	class UFortCharmsMappingData* CharmConfigAsset; // 0x888 (0x8)
	struct TWeakObjectPtr<class UTexture2D> NoneTexture; // 0x890 (0x28)
	struct TWeakObjectPtr<class UTexture2D> DeniedCosmeticThumbnail; // 0x8b8 (0x28)
	class UFortItemDefinition* PlaceholderItemToShowForDeniedCosmetics; // 0x8e0 (0x8)
	struct TArray<struct FPrimaryAssetId*> RandomCharacters; // 0x8e8 (0x10)
	class UCurveFloat* CameraPositionTransitionCurve; // 0x8f8 (0x8)
	float CameraPositionTransitionDuration; // 0x900 (0x4)
	float CameraPositionTargetMaxLerpDistance; // 0x904 (0x4)
	float MinPanelSizeForFraming; // 0x908 (0x4)
	unsigned char unreflected_90c[0x4]; // 0x90c (0x4) 
	struct FFortHarvestingToolMontageOverrides HarvestingToolMontageOverrides; // 0x910 (0x10)
	struct TArray<unsigned char> BakedThumbnailData; // 0x920 (0x10)
	struct TArray<struct FEmoteActivationTrigger> EmoteActivationTriggers; // 0x930 (0x10)
	int BaseCharacterIndex; // 0x940 (0x4)
	unsigned char unreflected_944[0x4]; // 0x944 (0x4) 
	struct TWeakObjectPtr<class UPhysicsAsset> HeadDefaultPhysicsAsset; // 0x948 (0x28)
	struct TWeakObjectPtr<class UPhysicsAsset> FaceDefaultPhysicsAsset; // 0x970 (0x28)
	struct TArray<struct TWeakObjectPtr<class UClass>> CosmeticStatObjects; // 0x998 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.GameDataCosmetics.GetHideElementParameterNames (Underlying native function: GetHideElementParameterNames 0x873d4e8)
	struct TArray<struct FName> GetHideElementParameterNames(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.GameDataCosmetics.CreateBannerAssets (Underlying native function: CreateBannerAssets 0x26daa0c)
	void CreateBannerAssets(); // (Final | Native | Public)
};

