// VerseClass /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats
// Size: 0x158
class UGame_match_stats : public UGame_stat_container
{
	unsigned char unreflected_68[0x70]; // 0x68 (0x70) 
	unsigned char verse0xD6C53453L2fFortnite2ecom2fGame2fmatchstatsNRGetMatchStatLNintR_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x1F493C56L2fFortnite2ecom2fGame2fmatchstatsNRGetPlayerStatLNplayerMNintR_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_88[0x20]; // 0x88 (0x20) 
	unsigned char verse0x384BE6C0L2fFortnite2ecom2fGame2fmatchstatsNRGetTeamStatLNplayerteamMNintR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b8[0x30]; // 0xb8 (0x30) 
	unsigned char verse0xAB54707EL2fFortnite2ecom2fGame2fmatchstatsNRIncrementMatchStatLNintMNintR_e8[0x10]; // 0xe8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xF099193FL2fFortnite2ecom2fGame2fmatchstatsNRIncrementPlayerStatLNplayerMNintMNintR_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_98[0x20]; // 0x98 (0x20) 
	unsigned char verse0xDDA80A55L2fFortnite2ecom2fGame2fmatchstatsNRIncrementTeamStatLNplayerteamMNintMNintR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_c8[0x30]; // 0xc8 (0x30) 
	unsigned char verse0x0F1148C3L2fFortnite2ecom2fGame2fmatchstatsNRReset_f8[0x10]; // 0xf8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xC5F988D4L2fFortnite2ecom2fGame2fmatchstatsNRSetMatchStatLNintMNintR_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x822BA24CL2fFortnite2ecom2fGame2fmatchstatsNRSetPlayerStatLNplayerMNintMNintR_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_78[0x20]; // 0x78 (0x20) 
	unsigned char verse0xAD5EC947L2fFortnite2ecom2fGame2fmatchstatsNRSetTeamStatLNplayerteamMNintMNintR_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_a8[0xb0]; // 0xa8 (0xb0)

	/* Functions */

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetTeamStat_L_Nplayer__team_M_Nint_M_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetTeamStat_L_Nplayer__team_M_Nint_M_Nint_R 0x707f818)
	void L2fFortnite2ecom2fGame2fmatchstatsNRSetTeamStatLNplayerteamMNintMNintR(struct Ftuple_Lplayer__team_Mint_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R 0x707f810)
	void L2fFortnite2ecom2fGame2fmatchstatsNRSetPlayerStatLNplayerMNintMNintR(struct Ftuple_Lplayer_Mint_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetMatchStat_L_Nint_M_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetMatchStat_L_Nint_M_Nint_R 0x707f808)
	void L2fFortnite2ecom2fGame2fmatchstatsNRSetMatchStatLNintMNintR(struct Ftuple_Lint_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RReset (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RReset 0x707f800)
	void L2fFortnite2ecom2fGame2fmatchstatsNRReset(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementTeamStat_L_Nplayer__team_M_Nint_M_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementTeamStat_L_Nplayer__team_M_Nint_M_Nint_R 0x707f7f8)
	unsigned char L2fFortnite2ecom2fGame2fmatchstatsNRIncrementTeamStatLNplayerteamMNintMNintR(struct Ftuple_Lplayer__team_Mint_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R 0x707f7f0)
	unsigned char L2fFortnite2ecom2fGame2fmatchstatsNRIncrementPlayerStatLNplayerMNintMNintR(struct Ftuple_Lplayer_Mint_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementMatchStat_L_Nint_M_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementMatchStat_L_Nint_M_Nint_R 0x707f7e8)
	unsigned char L2fFortnite2ecom2fGame2fmatchstatsNRIncrementMatchStatLNintMNintR(struct Ftuple_Lint_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetTeamStat_L_Nplayer__team_M_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetTeamStat_L_Nplayer__team_M_Nint_R 0x707f7e0)
	int64_t L2fFortnite2ecom2fGame2fmatchstatsNRGetTeamStatLNplayerteamMNintR(struct Ftuple_Lplayer__team_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetPlayerStat_L_Nplayer_M_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetPlayerStat_L_Nplayer_M_Nint_R 0x707f7d8)
	int64_t L2fFortnite2ecom2fGame2fmatchstatsNRGetPlayerStatLNplayerMNintR(struct Ftuple_Lplayer_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetMatchStat_L_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetMatchStat_L_Nint_R 0x707f7d0)
	int64_t L2fFortnite2ecom2fGame2fmatchstatsNRGetMatchStatLNintR(int64_t& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_match_stats.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

