// VerseClass /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability
// Size: 0xd20
class UGame_Abilities_gameplay_ability : public UVerseFortniteAbilityBase
{
	unsigned char unreflected_b30[0x1b0]; // 0xb30 (0x1b0) 
	class UVerse_event* verse0xBB37B63FAbilityEndedEvent; // 0xce0 (0x8)
	unsigned char verse0xD4B2C208ActivateAbility_bc0[0x10]; // 0xbc0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x32D79620ActivateAbilityAsync_bb0[0x10]; // 0xbb0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xAA473109L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRApplyGameplayEffectToOwnerLNgameplayeffectassetMNfloatR_b60[0x10]; // 0xb60 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7E5CC1A0L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRApplyGameplayEffectToTargetLNabilitytargetdataMNgameplayeffectassetMNfloatR_b70[0x10]; // 0xb70 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x630370EEL2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRCallEndAbility_b30[0x10]; // 0xb30 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b40[0x50]; // 0xb40 (0x50) 
	unsigned char verse0x2CAFA422L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRDoTargetingLNintR_b90[0x10]; // 0xb90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_ba0[0x40]; // 0xba0 (0x40) 
	unsigned char verse0x2B4CB662L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNREndAbility_be0[0x10]; // 0xbe0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7A86A420L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRGetOwnerAbilityComponent_b40[0x10]; // 0xb40 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA654FA76L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRGetOwningPlayer_b50[0x10]; // 0xb50 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b60[0x20]; // 0xb60 (0x20) 
	unsigned char verse0x47152F0AL2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRRemoveGameplayEffectFromOwnerLNgameplayeffectassetR_b80[0x10]; // 0xb80 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b90[0x10]; // 0xb90 (0x10) 
	unsigned char verse0x21C9F778L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVActivateAbility_ba0[0x10]; // 0xba0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_bb0[0x20]; // 0xbb0 (0x20) 
	unsigned char verse0x0634A156L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVEndAbility_bd0[0x10]; // 0xbd0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_be0[0x80]; // 0xbe0 (0x80) 
	unsigned char verse0x1ECDCD34L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetActionName_c60[0x10]; // 0xc60 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_c70[0x60]; // 0xc70 (0x60) 
	unsigned char verse0x8C6E1DB0L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetActivationAnim_cd0[0x10]; // 0xcd0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x907C8D5CL2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetCancelOnInputRelease_c70[0x10]; // 0xc70 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD20ABED4L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetCreateHitWhenNoTarget_c50[0x10]; // 0xc50 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_c60[0x50]; // 0xc60 (0x50) 
	unsigned char verse0xAF534E3BL2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetDefaultOwnerEffect_cb0[0x10]; // 0xcb0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x51A285A1L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetDefaultOwnerEffectMagnitude_cc0[0x10]; // 0xcc0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7C522A81L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetDefaultTargetingEffect_c80[0x10]; // 0xc80 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6A81F84CL2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetType_c30[0x10]; // 0xc30 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_c40[0x50]; // 0xc40 (0x50) 
	unsigned char verse0x696D61C1L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingActivationCues_c90[0x10]; // 0xc90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xFF586EE0L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingImpactCues_ca0[0x10]; // 0xca0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x649F2F25L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingRange_c40[0x10]; // 0xc40 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xBF0DD999L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingShape_c10[0x10]; // 0xc10 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x96035A40L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingSource_c20[0x10]; // 0xc20 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x766AA0AFL2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVOnGiveAbility_bf0[0x10]; // 0xbf0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xCA611812L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVOnRemoveAbility_c00[0x10]; // 0xc00 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_c10[0x110]; // 0xc10 (0x110)

	/* Functions */

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__OnRemoveAbility (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVOnRemoveAbility(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__OnGiveAbility (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVOnGiveAbility(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetTargetingSource (Has no native function)
	enum Game_Abilities_verse_target_source L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingSource(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetTargetingShape (Has no native function)
	enum Game_Abilities_verse_target_shape L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingShape(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetTargetingRange (Has no native function)
	double L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingRange(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetTargetingImpactCues (Has no native function)
	struct TArray<> L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingImpactCues(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetTargetingActivationCues (Has no native function)
	struct TArray<> L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetingActivationCues(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetTargetType (Has no native function)
	enum Game_Abilities_verse_target_type L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetTargetType(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetDefaultTargetingEffect (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetDefaultTargetingEffect(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetDefaultOwnerEffectMagnitude (Has no native function)
	double L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetDefaultOwnerEffectMagnitude(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetDefaultOwnerEffect (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetDefaultOwnerEffect(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetCreateHitWhenNoTarget (Has no native function)
	unsigned char L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetCreateHitWhenNoTarget(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetCancelOnInputRelease (Has no native function)
	unsigned char L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetCancelOnInputRelease(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetActivationAnim (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetActivationAnim(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__GetActionName (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVGetActionName(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__EndAbility (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVEndAbility(struct Ftuple_L_R& verse0xB2CDDD72Argument, class UVerse_event*& verse0x000000002, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RV__ActivateAbility (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRVActivateAbility(struct Ftuple_L_R& verse0xB2CDDD72Argument, class UConcurrency_task*& $AsyncTask0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RRemoveGameplayEffectFromOwner_L_Ngameplay__effect__asset_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RRemoveGameplayEffectFromOwner_L_Ngameplay__effect__asset_R 0x707f5b0)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRRemoveGameplayEffectFromOwnerLNgameplayeffectassetR(class UGame_Abilities_gameplay_effect_asset*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RGetOwningPlayer (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRGetOwningPlayer(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RGetOwnerAbilityComponent (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RGetOwnerAbilityComponent 0x707f5a8)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRGetOwnerAbilityComponent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_REndAbility (Has no native function)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNREndAbility(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RDoTargeting_L_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RDoTargeting_L_Nint_R 0x707f5a0)
	class UGame_Abilities_ability_target_data* L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRDoTargetingLNintR(int64_t& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RCallEndAbility (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RCallEndAbility 0x707f598)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRCallEndAbility(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RApplyGameplayEffectToTarget_L_Nability__target__data_M_Ngameplay__effect__asset_M_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RApplyGameplayEffectToTarget_L_Nability__target__data_M_Ngameplay__effect__asset_M_Nfloat_R 0x707f590)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRApplyGameplayEffectToTargetLNabilitytargetdataMNgameplayeffectassetMNfloatR(struct Ftuple_Lability__target__data_Mgameplay__effect__asset_Mfloat_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RApplyGameplayEffectToOwner_L_Ngameplay__effect__asset_M_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability_N_RApplyGameplayEffectToOwner_L_Ngameplay__effect__asset_M_Nfloat_R 0x707f588)
	void L2fFortnite2ecom2fGame2fAbilities2fgameplayabilityNRApplyGameplayEffectToOwnerLNgameplayeffectassetMNfloatR(struct Ftuple_Lgameplay__effect__asset_Mfloat_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability.ActivateAbilityAsync (Has no native function)
	class UConcurrency_task* ActivateAbilityAsync(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability.ActivateAbility (Has no native function)
	class UConcurrency_task* ActivateAbility(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_gameplay_ability.$InitCDO (Has no native function)
	void $InitCDO(class UVerse_event*& $ExprResult0, uint64_t& $InstancingGraph1); // (HasDefaults)
};

