// Class /Script/GameplayAbilities.GameplayEffect
// Size: 0x858
class UGameplayEffect : public UObject
{
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	enum EGameplayEffectDurationType DurationPolicy; // 0x30 (0x1)
	unsigned char unreflected_31[0x7]; // 0x31 (0x7) 
	struct FGameplayEffectModifierMagnitude DurationMagnitude; // 0x38 (0x1d8)
	struct FScalableFloat Period; // 0x210 (0x28)
	bool bExecutePeriodicEffectOnApplication; // 0x238 (0x1)
	enum EGameplayEffectPeriodInhibitionRemovedPolicy PeriodicInhibitionPolicy; // 0x239 (0x1)
	unsigned char unreflected_23a[0x6]; // 0x23a (0x6) 
	struct TArray<struct FGameplayModifierInfo> Modifiers; // 0x240 (0x10)
	struct TArray<struct FGameplayEffectExecutionDefinition> Executions; // 0x250 (0x10)
	struct FScalableFloat ChanceToApplyToTarget; // 0x260 (0x28)
	struct TArray<class UClass*> ApplicationRequirements; // 0x288 (0x10)
	struct TArray<class UClass*> TargetEffectClasses; // 0x298 (0x10)
	struct TArray<struct FConditionalGameplayEffect> ConditionalGameplayEffects; // 0x2a8 (0x10)
	struct TArray<class UClass*> OverflowEffects; // 0x2b8 (0x10)
	bool bDenyOverflowApplication; // 0x2c8 (0x1)
	bool bClearStackOnOverflow; // 0x2c9 (0x1)
	unsigned char unreflected_2ca[0x6]; // 0x2ca (0x6) 
	struct TArray<class UClass*> PrematureExpirationEffectClasses; // 0x2d0 (0x10)
	struct TArray<class UClass*> RoutineExpirationEffectClasses; // 0x2e0 (0x10)
	bool bRequireModifierSuccessToTriggerCues; // 0x2f0 (0x1)
	bool bSuppressStackingCues; // 0x2f1 (0x1)
	unsigned char unreflected_2f2[0x6]; // 0x2f2 (0x6) 
	struct TArray<struct FGameplayEffectCue> GameplayCues; // 0x2f8 (0x10)
	class UGameplayEffectUIData* UIData; // 0x308 (0x8)
	struct FInheritedTagContainer InheritableGameplayEffectTags; // 0x310 (0x60)
	struct FInheritedTagContainer InheritableOwnedTagsContainer; // 0x370 (0x60)
	struct FInheritedTagContainer InheritableBlockedAbilityTagsContainer; // 0x3d0 (0x60)
	struct FGameplayTagRequirements OngoingTagRequirements; // 0x430 (0x40)
	struct FGameplayTagRequirements ApplicationTagRequirements; // 0x470 (0x40)
	struct FGameplayTagRequirements RemovalTagRequirements; // 0x4b0 (0x40)
	struct FInheritedTagContainer RemoveGameplayEffectsWithTags; // 0x4f0 (0x60)
	struct FGameplayTagRequirements GrantedApplicationImmunityTags; // 0x550 (0x40)
	struct FGameplayEffectQuery GrantedApplicationImmunityQuery; // 0x590 (0x150)
	unsigned char unreflected_6e0[0x8]; // 0x6e0 (0x8) 
	struct FGameplayEffectQuery RemoveGameplayEffectQuery; // 0x6e8 (0x150)
	unsigned char unreflected_838[0x1]; // 0x838 (0x1) 
	enum EGameplayEffectStackingType StackingType; // 0x839 (0x1)
	unsigned char unreflected_83a[0x2]; // 0x83a (0x2) 
	int StackLimitCount; // 0x83c (0x4)
	enum EGameplayEffectStackingDurationPolicy StackDurationRefreshPolicy; // 0x840 (0x1)
	enum EGameplayEffectStackingPeriodPolicy StackPeriodResetPolicy; // 0x841 (0x1)
	enum EGameplayEffectStackingExpirationPolicy StackExpirationPolicy; // 0x842 (0x1)
	unsigned char unreflected_843[0x5]; // 0x843 (0x5) 
	struct TArray<struct FGameplayAbilitySpecDef> GrantedAbilities; // 0x848 (0x10)
};

