// VerseClass /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Item_player_pickup_component
// Size: 0xb8
class UGame_Item_player_pickup_component : public UEntityComponent
{
	unsigned char unreflected_60[0x30]; // 0x60 (0x30) 
	unsigned char verse0xCBCBC029L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRattemptPartialCollectLNitemtypeMNintMNplayercomponentR_90[0x10]; // 0x90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xF4552B58L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRgetNumOfItemTypeLNitemtypeR_80[0x10]; // 0x80 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_90[0x10]; // 0x90 (0x10) 
	unsigned char verse0x92CBECB5L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRgetPrimaryItemType_a0[0x10]; // 0xa0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x89400523L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRgivePickupToLNplayercomponentR_60[0x10]; // 0x60 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xC3A81506L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRtossPickupLNvector3MNQplayercomponentR_70[0x10]; // 0x70 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_80[0x38]; // 0x80 (0x38)

	/* Functions */

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R 0x707f5e0)
	void L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRtossPickupLNvector3MNQplayercomponentR(struct Ftuple_Lvector3_M_Qplayer__component_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R 0x707f5d8)
	void L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRgivePickupToLNplayercomponentR(class USimulation_player_component*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType 0x707f5d0)
	class UGame_Item_item_type* L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRgetPrimaryItemType(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R 0x707f5c8)
	int64_t L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRgetNumOfItemTypeLNitemtypeR(class UGame_Item_item_type*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R 0x707f5c0)
	void L2fFortnite2ecom2fGame2fItem2fplayerpickupcomponentNRattemptPartialCollectLNitemtypeMNintMNplayercomponentR(struct Ftuple_Litem__type_Mint_Mplayer__component_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Item_player_pickup_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Item_player_pickup_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Item_player_pickup_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

