// VerseClass /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component
// Size: 0xf0
class UGame_Movement_projectile_movement_component : public UVerseFortniteMovementComponentBase
{
	unsigned char unreflected_90[0x40]; // 0x90 (0x40) 
	unsigned char verse0x8040185EL2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetBouncinessLNfloatR_d0[0x10]; // 0xd0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x0B25997BL2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetDirectionLNvector3R_90[0x10]; // 0x90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_a0[0x40]; // 0xa0 (0x40) 
	unsigned char verse0x68515442L2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetFrictionLNfloatR_e0[0x10]; // 0xe0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7B2D42E9L2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetGravityLNfloatR_b0[0x10]; // 0xb0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xF24F59C9L2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetShouldBounceLNlogicR_c0[0x10]; // 0xc0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6C4C17DBL2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetSpeedLNfloatR_a0[0x10]; // 0xa0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_b0[0x40]; // 0xb0 (0x40)

	/* Functions */

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetSpeed_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetSpeed_L_Nfloat_R 0x707f610)
	void L2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetSpeedLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetShouldBounce_L_Nlogic_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetShouldBounce_L_Nlogic_R 0x707f608)
	void L2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetShouldBounceLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetGravity_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetGravity_L_Nfloat_R 0x707f600)
	void L2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetGravityLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetFriction_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetFriction_L_Nfloat_R 0x707f5f8)
	void L2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetFrictionLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetDirection_L_Nvector3_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetDirection_L_Nvector3_R 0x707f5f0)
	void L2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetDirectionLNvector3R(struct FSpatialMath_vector3& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetBounciness_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetBounciness_L_Nfloat_R 0x707f5e8)
	void L2fFortnite2ecom2fGame2fMovement2fprojectilemovementcomponentNRSetBouncinessLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Movement_projectile_movement_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

