// VerseClass /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_ability_component
// Size: 0x138
class UGame_Abilities_ability_component : public UVerseFortniteAbilityComponentBase
{
	unsigned char unreflected_98[0x40]; // 0x98 (0x40) 
	unsigned char verse0xFC826A64L2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRApplyGameplayEffectToSelfLNgameplayeffectassetMNfloatR_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3D5F94B4L2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRClearAbilityLNanyR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x4E0147BDL2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRGiveAbilityLNanyR_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x02082BB3L2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRGiveAbilityAndActivateOnceLNanyR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b8[0x10]; // 0xb8 (0x10) 
	unsigned char verse0xB8708772L2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRTryActivateAbilityLNanyR_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_d8[0x60]; // 0xd8 (0x60)

	/* Functions */

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R 0x707f560)
	unsigned char L2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRTryActivateAbilityLNanyR(class UClass*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R 0x52d77c0)
	void L2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRGiveAbilityAndActivateOnceLNanyR(class UClass*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R 0x707f558)
	void L2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRGiveAbilityLNanyR(class UClass*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R 0x707f550)
	void L2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRClearAbilityLNanyR(class UClass*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R 0x707f548)
	void L2fFortnite2ecom2fGame2fAbilities2fabilitycomponentNRApplyGameplayEffectToSelfLNgameplayeffectassetMNfloatR(struct Ftuple_Lgameplay__effect__asset_Mfloat_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_ability_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_ability_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Abilities_ability_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

