// Class /Script/FortniteGame.GameDataBR
// Size: 0x860
class UGameDataBR : public UPrimaryDataAsset
{
	struct TWeakObjectPtr<class UFortAnalyticsItemExclusions> AnalyticsItemExclusionDataBR; // 0x30 (0x28)
	struct TArray<struct TWeakObjectPtr<class UDataTable>> LootTierDataTablesBR; // 0x58 (0x10)
	struct TArray<struct TWeakObjectPtr<class UDataTable>> LootPackageDataTablesBR; // 0x68 (0x10)
	struct TWeakObjectPtr<class UDataTable> QuestEventXPTable; // 0x78 (0x28)
	struct FDataRegistryType QuestEventXPRegistry; // 0xa0 (0x4)
	unsigned char unreflected_a4[0x4]; // 0xa4 (0x4) 
	struct TArray<struct TWeakObjectPtr<class UFortTokenType>> RarityTokens; // 0xa8 (0x10)
	struct TWeakObjectPtr<class UDataTable> NamedWeightTagQueryTable; // 0xb8 (0x28)
	struct TWeakObjectPtr<class UClass> AIGoalManagerBR; // 0xe0 (0x28)
	struct TWeakObjectPtr<class UClass> AIDirectorBR; // 0x108 (0x28)
	struct TWeakObjectPtr<class UClass> DefaultDamageReceiverClassBR; // 0x130 (0x28)
	struct TWeakObjectPtr<class UClass> FeedbackManagerClassBR; // 0x158 (0x28)
	struct TWeakObjectPtr<class UFortUIFeedbackBank> UIFeedbackBankBR; // 0x180 (0x28)
	struct TWeakObjectPtr<class UFortHeroType> DefaultHeroBR; // 0x1a8 (0x28)
	struct TWeakObjectPtr<class UFortAbilitySet> PlayerAbilitySetBR; // 0x1d0 (0x28)
	struct TWeakObjectPtr<class UDataTable> CompetitiveIdentityDataTable; // 0x1f8 (0x28)
	struct TWeakObjectPtr<class UFortItemsForEventMapping> FortItemsForEventMapping; // 0x220 (0x28)
	struct TWeakObjectPtr<class UFortItemToBuildingGameplayActorPickupMapping> FortItemToPickupBGAMapping; // 0x248 (0x28)
	struct TWeakObjectPtr<class UFortWeaponReticleExtensionData> WeaponReticleExtensions; // 0x270 (0x28)
	struct TWeakObjectPtr<class UFortGameplayFeedbackEventData> FeedbackEventData; // 0x298 (0x28)
	struct TWeakObjectPtr<class UClass> DefaultRebootVanIndicatorClass; // 0x2c0 (0x28)
	struct TWeakObjectPtr<class UClass> DefaultContextTutorialIndicatorClass; // 0x2e8 (0x28)
	struct TWeakObjectPtr<class UClass> DefaultEliminationIndicatorClass; // 0x310 (0x28)
	struct TWeakObjectPtr<class UDataRegistry> CreativeRealEstatePlotTable; // 0x338 (0x28)
	class UFortCreativeActorCollection* CreativeInventoryCollection; // 0x360 (0x8)
	class UCreativeBetaPermissionsDataAsset* CreativeBetaPermissions; // 0x368 (0x8)
	struct TWeakObjectPtr<class UCreativeDynamicXpDataAsset> CreativeDynamicXp; // 0x370 (0x28)
	struct TWeakObjectPtr<class UCreativePlaysetPropsDataAsset> CreativePlaysetProps; // 0x398 (0x28)
	struct TMap<struct FPrimaryAssetId*, struct FCreativeItemMetaData*> CachedCreativeInventory; // 0x3c0 (0x50)
	struct TArray<struct FPrimaryAssetId*> CachedCreativeRealEstatePlots; // 0x410 (0x10)
	struct TMap<struct FPrimaryAssetId*, struct FCreativeBetaPermission> CachedCreativeBetaPermissions; // 0x420 (0x50)
	struct TSet<struct FName> CachedCreativePlaysetProps; // 0x470 (0x50)
	struct TWeakObjectPtr<class UDataTable> CreativeTagsTable; // 0x4c0 (0x28)
	struct TWeakObjectPtr<class UDataTable> CreativeTagCategoriesTable; // 0x4e8 (0x28)
	struct TWeakObjectPtr<class UAthenaMapPreloadData> MapPreloadData; // 0x510 (0x28)
	struct TWeakObjectPtr<class UFortWeaponPickupSpawnAmmoData> FortWeaponPickupSpawnAmmoData; // 0x538 (0x28)
	struct TArray<struct TWeakObjectPtr<class UClass>> FrontendGameStateComponents; // 0x560 (0x10)
	struct TWeakObjectPtr<class UFortFactionMapping> FortFactionMapping; // 0x570 (0x28)
	struct TWeakObjectPtr<class UFortItemWrapMappingData> ItemWrapConfigAsset; // 0x598 (0x28)
	struct TWeakObjectPtr<class UFortPlayerGliderAnimSet> DefaultGliderAnimSet; // 0x5c0 (0x28)
	struct TWeakObjectPtr<class UFortPlayerGliderAnimSet> UmbrellaGliderAnimSet; // 0x5e8 (0x28)
	struct TWeakObjectPtr<class UFortItemDefToItemVariantDataMapping> ItemDefToItemVariantDataMappingAsset; // 0x610 (0x28)
	struct TWeakObjectPtr<class UDataTable> WeaponUpgradeTable; // 0x638 (0x28)
	struct TWeakObjectPtr<class UFortResourceItemDefinition> DefaultGlobalCurrencyItemDefinition; // 0x660 (0x28)
	struct TWeakObjectPtr<class UCurveTable> DefaultCurrencyPayoutTable; // 0x688 (0x28)
	struct TWeakObjectPtr<class UFortLootGroupWeightedRollingData> DefaultLootGroupData; // 0x6b0 (0x28)
	struct TWeakObjectPtr<class UDataTable> PlayerAttributesClampingDataTable; // 0x6d8 (0x28)
	struct TWeakObjectPtr<class UDataTable> BotItemDataTable; // 0x700 (0x28)
	struct TWeakObjectPtr<class UAthenaQuestCategoryGlobalData> QuestCategoryGlobalData; // 0x728 (0x28)
	struct TWeakObjectPtr<class USlateBrushAsset> ElevationArrowBrush; // 0x750 (0x28)
	struct FElevationArrowData DefaultElevationArrowData; // 0x778 (0x1c)
	unsigned char unreflected_794[0x4]; // 0x794 (0x4) 
	struct FGameplayTagContainer BotSupportedItemTags; // 0x798 (0x20)
	unsigned char unreflected_7b8[0x20]; // 0x7b8 (0x20) 
	class UAthenaSeasonItemDefinition* FallbackSeason; // 0x7d8 (0x8)
	class UFortRepeatableDailiesCardItemDefinition* FallbackRepeatableDailiesCard; // 0x7e0 (0x8)
	struct TArray<struct FGameplayTagMessage> UnableToPerformActionMessages; // 0x7e8 (0x10)
	struct TArray<struct FSettingsHUDVisibilityAndText> HUDVisibilityGameplayTags; // 0x7f8 (0x10)
	class UCurveLinearColor* TimeOfDayRGBForPeripherals; // 0x808 (0x8)
	class USoundMix* AthenaSoundMix; // 0x810 (0x8)
	class UReverbEffect* AthenaReverbEffect; // 0x818 (0x8)
	struct FName AthenaReverbEffectTag; // 0x820 (0x4)
	unsigned char unreflected_824[0x4]; // 0x824 (0x4) 
	class USoundMix* VisualizationSoundMix; // 0x828 (0x8)
	class UFortRespawnDataTable* RespawnDataTable; // 0x830 (0x8)
	class UPoiNamedWeights* NamedWeightsByPoi; // 0x838 (0x8)
	class UAthenaMemoryCostRegister* AthenaMemoryCostRegister; // 0x840 (0x8)
	struct FText DefaultDisplayNameForGiftBoxes; // 0x848 (0x18)
};

