// VerseClass /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component
// Size: 0xf0
class UGame_StormController_storm_controller_component : public UEntityFortniteStormControllerComponent
{
	unsigned char unreflected_70[0x60]; // 0x70 (0x60) 
	double verse0xA5122212startRadius; // 0xd0 (0x8)
	double verse0xE6BD5D91boundsRadius; // 0xd8 (0x8)
	struct TArray<class UGame_StormController_storm_phase*> verse0xC2790393phases; // 0xe0 (0x10)
	unsigned char verse0x7675A710L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRbegin_70[0x10]; // 0x70 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x4D705B14L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRend_80[0x10]; // 0x80 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_90[0x30]; // 0x90 (0x30) 
	unsigned char verse0xF5FB08F4L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRexists_c0[0x10]; // 0xc0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD93DC734L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRpause_90[0x10]; // 0x90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x64AA7497L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRreset_a0[0x10]; // 0xa0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD763A2FAL2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRsetBattleRoyalePhases_b0[0x10]; // 0xb0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_c0[0x30]; // 0xc0 (0x30)

	/* Functions */

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_RsetBattleRoyalePhases (Has no native function)
	void L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRsetBattleRoyalePhases(struct Ftuple_L_R& verse0xB2CDDD72Argument, struct TArray<class UGame_StormController_storm_phase*>& $ExprResult0, class UGame_StormController_storm_phase*& $ExprResult1, uint64_t& $InstancingGraph2, struct FSpatialMath_vector3& $ExprResult3, class UGame_StormController_storm_phase*& $ExprResult4, uint64_t& $InstancingGraph5, struct FSpatialMath_vector3& $ExprResult6, class UGame_StormController_storm_phase*& $ExprResult7, uint64_t& $InstancingGraph8, struct FSpatialMath_vector3& $ExprResult9, class UGame_StormController_storm_phase*& $ExprResult10, uint64_t& $InstancingGraph11, struct FSpatialMath_vector3& $ExprResult12, class UGame_StormController_storm_phase*& $ExprResult13, uint64_t& $InstancingGraph14, struct FSpatialMath_vector3& $ExprResult15, class UGame_StormController_storm_phase*& $ExprResult16, uint64_t& $InstancingGraph17, struct FSpatialMath_vector3& $ExprResult18, class UGame_StormController_storm_phase*& $ExprResult19, uint64_t& $InstancingGraph20, struct FSpatialMath_vector3& $ExprResult21, class UGame_StormController_storm_phase*& $ExprResult22, uint64_t& $InstancingGraph23, struct FSpatialMath_vector3& $ExprResult24, class UGame_StormController_storm_phase*& $ExprResult25, uint64_t& $InstancingGraph26, struct FSpatialMath_vector3& $ExprResult27); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rreset (Has no native function)
	void L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRreset(struct Ftuple_L_R& verse0xB2CDDD72Argument, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause 0x707f758)
	void L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRpause(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists 0x707f750)
	unsigned char L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRexists(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend 0x707f748)
	void L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRend(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin 0x707f740)
	void L2fFortnite2ecom2fGame2fStormController2fstormcontrollercomponentNRbegin(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_StormController_storm_controller_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

