// Class /Script/GeometryCollectionEngine.GeometryCollection
// Size: 0x168
class UGeometryCollection : public UObject
{
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	bool EnableClustering; // 0x30 (0x1)
	unsigned char unreflected_31[0x3]; // 0x31 (0x3) 
	int ClusterGroupIndex; // 0x34 (0x4)
	int MaxClusterLevel; // 0x38 (0x4)
	unsigned char unreflected_3c[0x4]; // 0x3c (0x4) 
	struct TArray<float> DamageThreshold; // 0x40 (0x10)
	bool bUseSizeSpecificDamageThreshold; // 0x50 (0x1)
	bool PerClusterOnlyDamageThreshold; // 0x51 (0x1)
	unsigned char unreflected_52[0x2]; // 0x52 (0x2) 
	struct FGeometryCollectionDamagePropagationData DamagePropagationData; // 0x54 (0xc)
	enum EClusterConnectionTypeEnum ClusterConnectionType; // 0x60 (0x1)
	unsigned char unreflected_61[0x3]; // 0x61 (0x3) 
	float ConnectionGraphBoundsFilteringMargin; // 0x64 (0x4)
	struct TArray<class UMaterialInterface*> Materials; // 0x68 (0x10)
	struct TArray<struct FGeometryCollectionEmbeddedExemplar> EmbeddedGeometryExemplar; // 0x78 (0x10)
	bool bUseFullPrecisionUVs; // 0x88 (0x1)
	unsigned char unreflected_89[0x7]; // 0x89 (0x7) 
	struct TArray<struct FGeometryCollectionAutoInstanceMesh> AutoInstanceMeshes; // 0x90 (0x10)
	struct FSoftObjectPath RootProxy; // 0xa0 (0x18)
	bool bStripOnCook; // 0xb8 (0x1)
	bool EnableNanite; // 0xb9 (0x1)
	bool bMassAsDensity; // 0xba (0x1)
	unsigned char unreflected_bb[0x1]; // 0xbb (0x1) 
	float Mass; // 0xbc (0x4)
	float MinimumMassClamp; // 0xc0 (0x4)
	bool bImportCollisionFromSource; // 0xc4 (0x1)
	bool bRemoveOnMaxSleep; // 0xc5 (0x1)
	unsigned char unreflected_c6[0x2]; // 0xc6 (0x2) 
	struct FVector2D MaximumSleepTime; // 0xc8 (0x10)
	struct FVector2D RemovalDuration; // 0xd8 (0x10)
	bool bSlowMovingAsSleeping; // 0xe8 (0x1)
	unsigned char unreflected_e9[0x3]; // 0xe9 (0x3) 
	float SlowMovingVelocityThreshold; // 0xec (0x4)
	struct TArray<struct FGeometryCollectionSizeSpecificData> SizeSpecificData; // 0xf0 (0x10)
	bool EnableRemovePiecesOnFracture; // 0x100 (0x1)
	unsigned char unreflected_101[0x7]; // 0x101 (0x7) 
	struct TArray<class UMaterialInterface*> RemoveOnFractureMaterials; // 0x108 (0x10)
	class UDataflow* DataflowAsset; // 0x118 (0x8)
	struct FString DataflowTerminal; // 0x120 (0x10)
	struct FGuid PersistentGuid; // 0x130 (0x10)
	struct FGuid StateGuid; // 0x140 (0x10)
	int BoneSelectedMaterialIndex; // 0x150 (0x4)
	unsigned char padding_154[0x14]; // 0x154 (0x14)
};

