// AnimBlueprintGeneratedClass /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C
// Size: 0x4ee0
class UGrandma_AnimBP_C : public UFortAIFaunaAnimInstance_Grandma
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x790 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x798 (0x74)
	unsigned char unreflected_80c[0x4]; // 0x80c (0x4) 
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x810 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x818 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x820 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult60; // 0x840 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult59; // 0x868 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult58; // 0x890 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult57; // 0x8b8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult56; // 0x8e0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult55; // 0x908 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult54; // 0x930 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer41; // 0x958 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult35; // 0x9a0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer40; // 0x9c0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult34; // 0xa08 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer39; // 0xa28 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult33; // 0xa70 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer38; // 0xa90 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult32; // 0xad8 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine8; // 0xaf8 (0xc8)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0xbc0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0xbe0 (0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer37; // 0xca0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer36; // 0xce8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool13; // 0xd30 (0x48)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0xd78 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0xd98 (0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer35; // 0xe58 (0x48)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0xea0 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult53; // 0xec0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult52; // 0xee8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult51; // 0xf10 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult50; // 0xf38 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult49; // 0xf60 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult48; // 0xf88 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult47; // 0xfb0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult46; // 0xfd8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult45; // 0x1000 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult44; // 0x1028 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult43; // 0x1050 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult42; // 0x1078 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult41; // 0x10a0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult40; // 0x10c8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult39; // 0x10f0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult38; // 0x1118 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer34; // 0x1140 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult31; // 0x1188 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer33; // 0x11a8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult30; // 0x11f0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer32; // 0x1210 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult29; // 0x1258 (0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive11; // 0x1278 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer9; // 0x1340 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool12; // 0x13b0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer31; // 0x13f8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer30; // 0x1440 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult28; // 0x1488 (0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive10; // 0x14a8 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer8; // 0x1570 (0x70)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult37; // 0x15e0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult36; // 0x1608 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer29; // 0x1630 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult27; // 0x1678 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose3; // 0x1698 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult26; // 0x16a8 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine7; // 0x16c8 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive9; // 0x1790 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer7; // 0x1858 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult25; // 0x18c8 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer6; // 0x18e8 (0x70)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer28; // 0x1958 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer27; // 0x19a0 (0x48)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose4; // 0x19e8 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool11; // 0x1a10 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend2; // 0x1a58 (0xe0)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive8; // 0x1b38 (0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool10; // 0x1c00 (0x48)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose3; // 0x1c48 (0x28)
	struct FAnimNode_StateResult AnimGraphNodeStateResult24; // 0x1c70 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine6; // 0x1c90 (0xc8)
	struct FAnimNode_Slot AnimGraphNodeSlot4; // 0x1d58 (0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace; // 0x1da0 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0x1dc0 (0x20)
	struct FAnimNode_Slot AnimGraphNodeSlot3; // 0x1de0 (0x48)
	struct FAnimNode_LegIK AnimGraphNodeLegIK; // 0x1e28 (0xf8)
	struct FAnimNode_Slot AnimGraphNodeSlot2; // 0x1f20 (0x48)
	struct FAnimNode_Slot AnimGraphNodeSlot1; // 0x1f68 (0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0x1fb0 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x20b0 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x20d8 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool9; // 0x2100 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend1; // 0x2148 (0xe0)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x2228 (0x28)
	struct FAnimNode_Slot AnimGraphNodeSlot; // 0x2250 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive7; // 0x2298 (0xc8)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult35; // 0x2360 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult34; // 0x2388 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult33; // 0x23b0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult32; // 0x23d8 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer26; // 0x2400 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult23; // 0x2448 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer25; // 0x2468 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult22; // 0x24b0 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose2; // 0x24d0 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult21; // 0x24e0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine5; // 0x2500 (0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer24; // 0x25c8 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend; // 0x2610 (0xe0)
	struct FFortAnimNode_QuadrupedSlopeWarping FortAnimGraphNodeQuadrupedSlopeWarping; // 0x26f0 (0x5c8)
	unsigned char unreflected_2cb8[0x8]; // 0x2cb8 (0x8) 
	struct FFortAnimNode_WeightedLookAt FortAnimGraphNodeWeightedLookAt; // 0x2cc0 (0x250)
	struct FAnimNode_Inertialization AnimGraphNodeInertialization; // 0x2f10 (0x100)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer; // 0x3010 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x30d8 (0x100)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer23; // 0x31d8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool8; // 0x3220 (0x48)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult31; // 0x3268 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult30; // 0x3290 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult29; // 0x32b8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult28; // 0x32e0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult27; // 0x3308 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult26; // 0x3330 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult25; // 0x3358 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult24; // 0x3380 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult23; // 0x33a8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult22; // 0x33d0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult21; // 0x33f8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult20; // 0x3420 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult19; // 0x3448 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult18; // 0x3470 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult17; // 0x3498 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult16; // 0x34c0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult15; // 0x34e8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult14; // 0x3510 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer22; // 0x3538 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer21; // 0x3580 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool7; // 0x35c8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult20; // 0x3610 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer20; // 0x3630 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer19; // 0x3678 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool6; // 0x36c0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult19; // 0x3708 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult13; // 0x3728 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult12; // 0x3750 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult11; // 0x3778 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult10; // 0x37a0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult9; // 0x37c8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult8; // 0x37f0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult7; // 0x3818 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult6; // 0x3840 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer18; // 0x3868 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult18; // 0x38b0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer17; // 0x38d0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult17; // 0x3918 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer16; // 0x3938 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult16; // 0x3980 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer15; // 0x39a0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult15; // 0x39e8 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult5; // 0x3a08 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine4; // 0x3a30 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult14; // 0x3af8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer14; // 0x3b18 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult13; // 0x3b60 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer13; // 0x3b80 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult12; // 0x3bc8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer12; // 0x3be8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult11; // 0x3c30 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult4; // 0x3c50 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine3; // 0x3c78 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult10; // 0x3d40 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer11; // 0x3d60 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult9; // 0x3da8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer10; // 0x3dc8 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive6; // 0x3e10 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer5; // 0x3ed8 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x3f48 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer9; // 0x3f90 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult8; // 0x3fd8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer8; // 0x3ff8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult7; // 0x4040 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0x4060 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x40a8 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive5; // 0x40f0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer4; // 0x41b8 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x4228 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0x4270 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0x42b8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult6; // 0x4300 (0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive4; // 0x4320 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer3; // 0x43e8 (0x70)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x4458 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x44a0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x44e8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x4530 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive3; // 0x4578 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer2; // 0x4640 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive2; // 0x46b0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x4778 (0x70)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult3; // 0x47e8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult2; // 0x4810 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x4838 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult5; // 0x4880 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose1; // 0x48a0 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult4; // 0x48b0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine2; // 0x48d0 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive1; // 0x4998 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x4a60 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult3; // 0x4ad0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x4af0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult2; // 0x4b38 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine1; // 0x4b58 (0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x4c20 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive; // 0x4c68 (0xc8)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0x4d30 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x4d58 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x4d80 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x4dc8 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose; // 0x4de8 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x4df8 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x4e18 (0xc8)

	/* Functions */

	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.Fauna Jump (Has no native function)
	void FaunaJump(struct FPoseLink& FaunaJump); // (HasOutParms | BlueprintCallable)

	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.Fauna IdleTurn (Has no native function)
	void FaunaIdleTurn(struct FPoseLink& InPoseIdleTurn, struct FPoseLink& FaunaIdleTurn); // (HasOutParms | BlueprintCallable)

	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.Fauna Idle (Has no native function)
	void FaunaIdle(struct FPoseLink& InPoseIdle, struct FPoseLink& FaunaIdle); // (HasOutParms | BlueprintCallable)

	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_FallExit (Has no native function)
	void AnimNotifyFallExit(); // (BlueprintCallable | BlueprintEvent)

	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_LandAddExit (Has no native function)
	void AnimNotifyLandAddExit(); // (BlueprintCallable | BlueprintEvent)

	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_LandEnter (Has no native function)
	void AnimNotifyLandEnter(); // (BlueprintCallable | BlueprintEvent)

	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.ExecuteUbergraph_Grandma_AnimBP (Has no native function)
	void ExecuteUbergraphGrandmaAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

