// AnimBlueprintGeneratedClass /Game/Weapons/FORT_Melee/Pickaxe_HightowerTapas/Meshes/HighTower_Tapas_Axe_AnimBP.HighTower_Tapas_Axe_AnimBP_C
// Size: 0x1c30
class UHighTower_Tapas_Axe_AnimBP_C : public UCustomCharacterPartAnimInstance_HightowerTapasAxe
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x6f0 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x6f8 (0x2)
	unsigned char unreflected_6fa[0x6]; // 0x6fa (0x6) 
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x700 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x708 (0x8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace2; // 0x710 (0x20)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNodeCopyPoseFromMesh; // 0x730 (0x1d0)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x900 (0x20)
	struct FAnimNode_Trail AnimGraphNodeTrail; // 0x920 (0x2a0)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone1; // 0xbc0 (0x128)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0xce8 (0x48)
	struct FAnimNode_RigidBody AnimGraphNodeRigidBody; // 0xd30 (0x990)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace2; // 0x16c0 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace1; // 0x16e0 (0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0x1700 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose3; // 0x1800 (0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace1; // 0x1828 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x1848 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x1870 (0x28)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone; // 0x1898 (0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace; // 0x19c0 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0x19e0 (0x20)
	struct FAnimNode_Slot AnimGraphNodeSlot; // 0x1a00 (0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x1a48 (0x100)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend; // 0x1b48 (0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x1c08 (0x28)

	/* Functions */

	// Function /Game/Weapons/FORT_Melee/Pickaxe_HightowerTapas/Meshes/HighTower_Tapas_Axe_AnimBP.HighTower_Tapas_Axe_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Weapons/FORT_Melee/Pickaxe_HightowerTapas/Meshes/HighTower_Tapas_Axe_AnimBP.HighTower_Tapas_Axe_AnimBP_C.ExecuteUbergraph_HighTower_Tapas_Axe_AnimBP (Has no native function)
	void ExecuteUbergraphHighTowerTapasAxeAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

