// Class /Script/FortniteUI.HUDLayoutToolV2_Popup
// Size: 0x418
class UHUDLayoutToolV2_Popup : public UCommonActivatableWidget
{
	unsigned char unreflected_3a8[0x30]; // 0x3a8 (0x30) 
	class UCommonTextBlock* CommonTextTitle; // 0x3d8 (0x8)
	class URichTextBlock* RichTextDescription; // 0x3e0 (0x8)
	class UHUDLayoutToolV2_Button* ButtonConfirm; // 0x3e8 (0x8)
	class UHUDLayoutToolV2_Button* ButtonCancel; // 0x3f0 (0x8)
	class UBacchusCloseButton* ButtonClose; // 0x3f8 (0x8)
	class UWidgetAnimation* AnimIn; // 0x400 (0x8)
	class UWidgetAnimation* AnimOut; // 0x408 (0x8)
	class UCommonActivatableWidgetSwitcher* SwitcherCornerIcon; // 0x410 (0x8)
};

