// Class /Script/FortniteUI.HUDLayoutToolV2_LinkAcrossPanel
// Size: 0x410
class UHUDLayoutToolV2_LinkAcrossPanel : public UCommonUserWidget
{
	class UFortMobileHUDWidgetRegistry* HUDWidgetRegistry; // 0x290 (0x8)
	class UHUDLayoutToolV2_TooltipLayer* TooltipLayer; // 0x298 (0x8)
	unsigned char unreflected_2a0[0x100]; // 0x2a0 (0x100) 
	struct TArray<struct FSimpleActionMessages> SimpleActionMessages; // 0x3a0 (0x10)
	class UHUDLayoutToolV2_LinkAcrossPanelTitle* LinkAcrossPanelTitleHeader; // 0x3b0 (0x8)
	class UBacchusCloseButton* ButtonClose; // 0x3b8 (0x8)
	class UCommonVisibilitySwitcher* SwitcherActions; // 0x3c0 (0x8)
	class USizeBox* SizeBoxActionPanelContainer; // 0x3c8 (0x8)
	class UHUDLayoutToolV2_LinkAcrossActionPanel* LinkAcrossActionPanelActions; // 0x3d0 (0x8)
	class UVerticalBox* VerticalBoxSimpleAction; // 0x3d8 (0x8)
	class UCommonTextBlock* TextSimpleAction; // 0x3e0 (0x8)
	class UCommonTextBlock* TextSimpleActionWarning; // 0x3e8 (0x8)
	class UHUDLayoutToolV2_Button* ButtonToggleAdvanced; // 0x3f0 (0x8)
	class UHUDLayoutToolV2_Button* ButtonCancel; // 0x3f8 (0x8)
	class UHUDLayoutToolV2_Button* ButtonConfirm; // 0x400 (0x8)
	class UHUDLayoutToolV2_LinkAcrossWarningIndicator* WarningIndicatorMainWarning; // 0x408 (0x8)
};

