// Class /Script/FortniteUI.HUDLayoutToolV2_LinkAcrossActionSetting
// Size: 0x300
class UHUDLayoutToolV2_LinkAcrossActionSetting : public UCommonUserWidget
{
	unsigned char unreflected_290[0x8]; // 0x290 (0x8) 
	struct FLinearColor EnabledCheckBoxBorderColor; // 0x298 (0x10)
	struct FLinearColor DisabledCheckBoxBorderColor; // 0x2a8 (0x10)
	class UPaperSprite* CheckMarkSprite; // 0x2b8 (0x8)
	unsigned char unreflected_2c0[0x10]; // 0x2c0 (0x10) 
	class UImage* ImageActionIcon; // 0x2d0 (0x8)
	class UCommonTextBlock* TextActionName; // 0x2d8 (0x8)
	class UHUDLayoutToolV2_LinkAcrossWarningIndicator* LinkAcrossWarningIndicatorWarning; // 0x2e0 (0x8)
	class UHUDLayoutToolV2_LinkAcrossNumericalIndicator* NumericalIndicatorActionImpact; // 0x2e8 (0x8)
	class UImage* ImageCheckboxBorder; // 0x2f0 (0x8)
	class UHUDLayoutToolV2_Button* ButtonSelectAction; // 0x2f8 (0x8)
};

