// Class /Script/FortniteUI.HUDLayoutToolV2SettingsListEntry_Anchors
// Size: 0x320
class UHUDLayoutToolV2SettingsListEntry_Anchors : public UFortSettingsListEntry_Setting
{
	class UFortSettingValueDiscreteDynamic_Anchors* AnchorSetting; // 0x2d0 (0x8)
	class UHUDLayoutToolV2_Button* ButtonTopLeft; // 0x2d8 (0x8)
	class UHUDLayoutToolV2_Button* ButtonTopMiddle; // 0x2e0 (0x8)
	class UHUDLayoutToolV2_Button* ButtonTopRight; // 0x2e8 (0x8)
	class UHUDLayoutToolV2_Button* ButtonMiddleLeft; // 0x2f0 (0x8)
	class UHUDLayoutToolV2_Button* ButtonMiddleMiddle; // 0x2f8 (0x8)
	class UHUDLayoutToolV2_Button* ButtonMiddleRight; // 0x300 (0x8)
	class UHUDLayoutToolV2_Button* ButtonBottomLeft; // 0x308 (0x8)
	class UHUDLayoutToolV2_Button* ButtonBottomMiddle; // 0x310 (0x8)
	class UHUDLayoutToolV2_Button* ButtonBottomRight; // 0x318 (0x8)
};

