// Class /Script/Engine.IntSerialization
// Size: 0x50
class UIntSerialization : public UObject
{
	uint16_t UnsignedInt16Variable; // 0x28 (0x2)
	unsigned char unreflected_2a[0x2]; // 0x2a (0x2) 
	uint32_t UnsignedInt32Variable; // 0x2c (0x4)
	uint64_t UnsignedInt64Variable; // 0x30 (0x8)
	int8_t SignedInt8Variable; // 0x38 (0x1)
	unsigned char unreflected_39[0x1]; // 0x39 (0x1) 
	int16_t SignedInt16Variable; // 0x3a (0x2)
	unsigned char unreflected_3c[0x4]; // 0x3c (0x4) 
	int64_t SignedInt64Variable; // 0x40 (0x8)
	unsigned char UnsignedInt8Variable; // 0x48 (0x1)
	unsigned char unreflected_49[0x3]; // 0x49 (0x3) 
	int SignedInt32Variable; // 0x4c (0x4)
};

