// Class /Script/FortniteGame.LayerAnimInstance_MechanicalEngineerPet
// Size: 0x610
class ULayerAnimInstance_MechanicalEngineerPet : public UAnimInstance
{
	struct TWeakObjectPtr<class USkeletalMesh> GliderSkeletalMesh; // 0x348 (0x28)
	struct TWeakObjectPtr<class UFortPlayerGliderAnimSet> GliderPlayerAnimSet; // 0x370 (0x28)
	struct TWeakObjectPtr<class UFortPlayerGliderAnimSet> UmbrellaAnimSet; // 0x398 (0x28)
	struct TWeakObjectPtr<class UFortPlayerGliderAnimSet> HangGliderAnimSet; // 0x3c0 (0x28)
	struct FFortAnimInput_Skydiving SkydivingState; // 0x3e8 (0x78)
	struct FPoseSnapshot GliderSnapshotPose; // 0x460 (0x30)
	struct FVector AttachLocation; // 0x490 (0x18)
	struct FRotator AttachRotation; // 0x4a8 (0x18)
	struct FVector OwlLocationOffset; // 0x4c0 (0x18)
	struct FRotator OwlRotationOffset; // 0x4d8 (0x18)
	struct FVector GliderOwlSnapshotLocation; // 0x4f0 (0x18)
	struct FVector GliderOwlSnapshotLocationStatic; // 0x508 (0x18)
	struct FVector PlayerRootSnapshotLocationStatic; // 0x520 (0x18)
	struct FRotator GliderOwlSnapshotRotation; // 0x538 (0x18)
	float FrontendLocAlpha; // 0x550 (0x4)
	unsigned char unreflected_554[0x4]; // 0x554 (0x4) 
	float OwlFrameAlpha; // 0x558 (0x4)
	float OwlPoseAlpha; // 0x55c (0x4)
	struct FVector PlayerRootLocation; // 0x560 (0x18)
	struct FRotator PlayerRootRotation; // 0x578 (0x18)
	struct FVector GliderOwlFrameLandingStart; // 0x590 (0x18)
	struct FVector OwlGLBaseLocation; // 0x5a8 (0x18)
	struct FRotator OwlGLBaseRotation; // 0x5c0 (0x18)
	struct FFortAnimInput_AimScrambleDataHelper AimSmooth; // 0x5d8 (0xc)
	float SkydiveForward; // 0x5e4 (0x4)
	float ClosedAlpha; // 0x5e8 (0x4)
	float AdditiveAlpha; // 0x5ec (0x4)
	float ClosedNewCurveValue; // 0x5f0 (0x4)
	float GliderCurveValue; // 0x5f4 (0x4)
	float WingCorrectiveAdditiveAlpha; // 0x5f8 (0x4)
	float LocalVelocityRight; // 0x5fc (0x4)
	unsigned char bSwitchInterpSpeed; // 0x600 (0x1)
	unsigned char bGateCanPlayLanding; // 0x600 (0x1)
	unsigned char bGateWrenchTransition; // 0x600 (0x1)
	unsigned char bOwlIsOnPack; // 0x600 (0x1)
	unsigned char BlockAnimRule; // 0x600 (0x1)
	unsigned char bHideOwl; // 0x600 (0x1)
	unsigned char bDetachFromWrenchTransition; // 0x600 (0x1)
	unsigned char bSkydiveFreefall; // 0x600 (0x1)
	unsigned char bIsInLandingPhase; // 0x601 (0x1)
	unsigned char bCanPlayLandingAnim; // 0x601 (0x1)
	unsigned char bIsFrontEndContrails; // 0x601 (0x1)
	unsigned char bUseLayer; // 0x601 (0x1)
	unsigned char bUsingHangGliderSet; // 0x601 (0x1)
	unsigned char bUsingUmbrellaGliderSet; // 0x601 (0x1)
	unsigned char bTransitionToSkydive; // 0x601 (0x1)
	unsigned char bTransitionToClosed; // 0x601 (0x1)
	unsigned char bTransitionDetachToDive; // 0x602 (0x1)
	unsigned char bTransitionDetachToGlide; // 0x602 (0x1)
	unsigned char padding_603[0xd]; // 0x603 (0xd)
};

