// Class /Script/Engine.Level
// Size: 0x310
class ULevel : public UObject
{
	unsigned char unreflected_28[0x90]; // 0x28 (0x90) 
	class UWorld* OwningWorld; // 0xb8 (0x8)
	class UModel* Model; // 0xc0 (0x8)
	struct TArray<class UModelComponent*> ModelComponents; // 0xc8 (0x10)
	class ULevelActorContainer* ActorCluster; // 0xd8 (0x8)
	int NumTextureStreamingUnbuiltComponents; // 0xe0 (0x4)
	int NumTextureStreamingDirtyResources; // 0xe4 (0x4)
	class ALevelScriptActor* LevelScriptActor; // 0xe8 (0x8)
	class ANavigationObjectBase* NavListStart; // 0xf0 (0x8)
	class ANavigationObjectBase* NavListEnd; // 0xf8 (0x8)
	struct TArray<class UNavigationDataChunk*> NavDataChunks; // 0x100 (0x10)
	float LightmapTotalSize; // 0x110 (0x4)
	float ShadowmapTotalSize; // 0x114 (0x4)
	struct TArray<struct FVector> StaticNavigableGeometry; // 0x118 (0x10)
	struct TArray<struct FGuid> StreamingTextureGuids; // 0x128 (0x10)
	struct TArray<struct FName> StreamingTextures; // 0x138 (0x10)
	uint32_t PackedTextureStreamingQualityLevelFeatureLevel; // 0x148 (0x4)
	unsigned char unreflected_14c[0xc4]; // 0x14c (0xc4) 
	struct FGuid LevelBuildDataId; // 0x210 (0x10)
	class UMapBuildDataRegistry* MapBuildData; // 0x220 (0x8)
	struct FIntVector LightBuildLevelOffset; // 0x228 (0xc)
	unsigned char bIsLightingScenario; // 0x234 (0x1)
	unsigned char bTextureStreamingRotationChanged; // 0x234 (0x1)
	unsigned char bStaticComponentsRegisteredInStreamingManager; // 0x234 (0x1)
	unsigned char bIsVisible; // 0x234 (0x1)
	unsigned char unreflected_235[0x1]; // 0x235 (0x1) 
	unsigned char bIsPartitioned; // 0x236 (0x1)
	unsigned char unreflected_237[0x61]; // 0x237 (0x61) 
	class AWorldSettings* WorldSettings; // 0x298 (0x8)
	class AWorldDataLayers* WorldDataLayers; // 0x2a0 (0x8)
	struct TWeakObjectPtr<class UWorldPartitionRuntimeCell> WorldPartitionRuntimeCell; // 0x2a8 (0x28)
	unsigned char unreflected_2d0[0x8]; // 0x2d0 (0x8) 
	struct TArray<class UAssetUserData*> AssetUserData; // 0x2d8 (0x10)
	unsigned char unreflected_2e8[0x10]; // 0x2e8 (0x10) 
	struct TArray<struct FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x2f8 (0x10)
	unsigned char padding_308[0x8]; // 0x308 (0x8)
};

