// WidgetBlueprintGeneratedClass /Game/UI/Login/AccountSelect/LoginCredentialSelect.LoginCredentialSelect_C
// Size: 0x468
class ULoginCredentialSelect_C : public UFortLoginCredentialSelect
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x400 (0x8)
	class UCommonWidgetSwitcherLegacy* CommonWidgetSwitcher0; // 0x408 (0x8)
	class UCommonTextBlock* ErebusTitle; // 0x410 (0x8)
	class UCommonTextBlock* ErebusType; // 0x418 (0x8)
	class UImage* Image0; // 0x420 (0x8)
	class UImage* Image1; // 0x428 (0x8)
	class UImage* Image2; // 0x430 (0x8)
	class UImage* Image3; // 0x438 (0x8)
	class UImage* Image4; // 0x440 (0x8)
	class UImage* Image5; // 0x448 (0x8)
	class UImage* Image48; // 0x450 (0x8)
	class USafeZone* SafeZone0; // 0x458 (0x8)
	class UBorder* TrademarksBorder; // 0x460 (0x8)

	/* Functions */

	// Function /Game/UI/Login/AccountSelect/LoginCredentialSelect.LoginCredentialSelect_C.Construct (Has no native function)
	void Construct(); // (BlueprintCosmetic | Event | Public | BlueprintEvent)

	// Function /Game/UI/Login/AccountSelect/LoginCredentialSelect.LoginCredentialSelect_C.ExecuteUbergraph_LoginCredentialSelect (Has no native function)
	void ExecuteUbergraphLoginCredentialSelect(int& EntryPoint, class UMaterialInstanceDynamic*& CallFuncCreateDynamicMaterialInstanceReturnValue); // (Final | 0x00008000)
};

