// Class /Script/Engine.MaterialExpressionStrataSimpleClearCoatBSDF
// Size: 0x1f0
class UMaterialExpressionStrataSimpleClearCoatBSDF : public UMaterialExpressionStrataBSDF
{
	struct FExpressionInput BaseColor; // 0xb0 (0x28)
	struct FExpressionInput Metallic; // 0xd8 (0x28)
	struct FExpressionInput Specular; // 0x100 (0x28)
	struct FExpressionInput Roughness; // 0x128 (0x28)
	struct FExpressionInput ClearCoatCoverage; // 0x150 (0x28)
	struct FExpressionInput ClearCoatRoughness; // 0x178 (0x28)
	struct FExpressionInput Normal; // 0x1a0 (0x28)
	struct FExpressionInput EmissiveColor; // 0x1c8 (0x28)
};

