// Class /Script/Engine.MaterialExpressionStrataSingleLayerWaterBSDF
// Size: 0x268
class UMaterialExpressionStrataSingleLayerWaterBSDF : public UMaterialExpressionStrataBSDF
{
	struct FExpressionInput BaseColor; // 0xb0 (0x28)
	struct FExpressionInput Metallic; // 0xd8 (0x28)
	struct FExpressionInput Specular; // 0x100 (0x28)
	struct FExpressionInput Roughness; // 0x128 (0x28)
	struct FExpressionInput Normal; // 0x150 (0x28)
	struct FExpressionInput EmissiveColor; // 0x178 (0x28)
	struct FExpressionInput TopMaterialOpacity; // 0x1a0 (0x28)
	struct FExpressionInput WaterAlbedo; // 0x1c8 (0x28)
	struct FExpressionInput WaterExtinction; // 0x1f0 (0x28)
	struct FExpressionInput WaterPhaseG; // 0x218 (0x28)
	struct FExpressionInput ColorScaleBehindWater; // 0x240 (0x28)
};

