// Class /Script/Engine.MaterialExpressionInverseLinearInterpolate
// Size: 0x138
class UMaterialExpressionInverseLinearInterpolate : public UMaterialExpression
{
	struct FExpressionInput A; // 0xb0 (0x28)
	struct FExpressionInput B; // 0xd8 (0x28)
	struct FExpressionInput Value; // 0x100 (0x28)
	float ConstA; // 0x128 (0x4)
	float ConstB; // 0x12c (0x4)
	float ConstValue; // 0x130 (0x4)
	bool bClampResult; // 0x134 (0x1)
	unsigned char padding_135[0x3]; // 0x135 (0x3)
};

