// WidgetBlueprintGeneratedClass /Game/UI/Frontend/TopBar/MTXButton.MTXButton_C
// Size: 0x1490
class UMTXButton_C : public UFortMTXButton
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x1450 (0x8)
	class UWidgetAnimation* HoverGrow; // 0x1458 (0x8)
	class UWidgetAnimation* HoverBounce; // 0x1460 (0x8)
	class UWidgetAnimation* Hover; // 0x1468 (0x8)
	class UBorder* AmountColor; // 0x1470 (0x8)
	class UImage* ButtonBacking; // 0x1478 (0x8)
	class UImage* ImageVbucks; // 0x1480 (0x8)
	class USizeBox* VariableSize; // 0x1488 (0x8)

	/* Functions */

	// Function /Game/UI/Frontend/TopBar/MTXButton.MTXButton_C.Construct (Has no native function)
	void Construct(); // (BlueprintCosmetic | Event | Public | BlueprintEvent)

	// Function /Game/UI/Frontend/TopBar/MTXButton.MTXButton_C.BP_OnHovered (Has no native function)
	void BPOnHovered(); // (Event | Protected | BlueprintEvent)

	// Function /Game/UI/Frontend/TopBar/MTXButton.MTXButton_C.BP_OnUnhovered (Has no native function)
	void BPOnUnhovered(); // (Event | Protected | BlueprintEvent)

	// Function /Game/UI/Frontend/TopBar/MTXButton.MTXButton_C.ExecuteUbergraph_MTXButton (Has no native function)
	void ExecuteUbergraphMTXButton(int& EntryPoint, bool& TempboolVariable, bool& TempboolVariable1, double& TemprealVariable, double& TemprealVariable1, bool& CallFuncIsMobileGameReturnValue, class UFortRuntimeOptions*& CallFuncGetRuntimeOptionsReturnValue, double& TemprealVariable2, bool& CallFuncBooleanANDReturnValue, class UUMGSequencePlayer*& CallFuncPlayAnimationForwardReturnValue, class UUMGSequencePlayer*& CallFuncPlayAnimationReverseReturnValue, double& TemprealVariable3, bool& CallFuncIsMobileGameReturnValue1, class UFortRuntimeOptions*& CallFuncGetRuntimeOptionsReturnValue1, bool& CallFuncBooleanANDReturnValue1, bool& CallFuncIsMobileGameReturnValue2, struct FLinearColor& CallFuncSelectColorReturnValue, double& K2NodeSelectDefault, double& K2NodeSelectDefault1, class UMaterialInstance*& CallFuncSelectMaterialInstanceReturnValue, float& CallFuncSetHeightOverrideInHeightOverrideImplicitCast, float& CallFuncSetMinDesiredWidthInMinDesiredWidthImplicitCast); // (Final | 0x00008000)
};

