// Class /Script/NavigationSystem.NavAreaMeta_SwitchByAgent
// Size: 0xc8
class UNavAreaMeta_SwitchByAgent : public UNavAreaMeta
{
	class UClass* Agent0Area; // 0x48 (0x8)
	class UClass* Agent1Area; // 0x50 (0x8)
	class UClass* Agent2Area; // 0x58 (0x8)
	class UClass* Agent3Area; // 0x60 (0x8)
	class UClass* Agent4Area; // 0x68 (0x8)
	class UClass* Agent5Area; // 0x70 (0x8)
	class UClass* Agent6Area; // 0x78 (0x8)
	class UClass* Agent7Area; // 0x80 (0x8)
	class UClass* Agent8Area; // 0x88 (0x8)
	class UClass* Agent9Area; // 0x90 (0x8)
	class UClass* Agent10Area; // 0x98 (0x8)
	class UClass* Agent11Area; // 0xa0 (0x8)
	class UClass* Agent12Area; // 0xa8 (0x8)
	class UClass* Agent13Area; // 0xb0 (0x8)
	class UClass* Agent14Area; // 0xb8 (0x8)
	class UClass* Agent15Area; // 0xc0 (0x8)
};

