// Class /Script/NavigationSystem.NavArea
// Size: 0x48
class UNavArea : public UNavAreaBase
{
	float DefaultCost; // 0x30 (0x4)
	float FixedAreaEnteringCost; // 0x34 (0x4)
	struct FColor DrawColor; // 0x38 (0x4)
	struct FNavAgentSelector SupportedAgents; // 0x3c (0x4)
	unsigned char bSupportsAgent0; // 0x40 (0x1)
	unsigned char bSupportsAgent1; // 0x40 (0x1)
	unsigned char bSupportsAgent2; // 0x40 (0x1)
	unsigned char bSupportsAgent3; // 0x40 (0x1)
	unsigned char bSupportsAgent4; // 0x40 (0x1)
	unsigned char bSupportsAgent5; // 0x40 (0x1)
	unsigned char bSupportsAgent6; // 0x40 (0x1)
	unsigned char bSupportsAgent7; // 0x40 (0x1)
	unsigned char bSupportsAgent8; // 0x41 (0x1)
	unsigned char bSupportsAgent9; // 0x41 (0x1)
	unsigned char bSupportsAgent10; // 0x41 (0x1)
	unsigned char bSupportsAgent11; // 0x41 (0x1)
	unsigned char bSupportsAgent12; // 0x41 (0x1)
	unsigned char bSupportsAgent13; // 0x41 (0x1)
	unsigned char bSupportsAgent14; // 0x41 (0x1)
	unsigned char bSupportsAgent15; // 0x41 (0x1)
	unsigned char padding_42[0x6]; // 0x42 (0x6)
};

