// Class /Script/Niagara.NiagaraMeshRendererProperties
// Size: 0x748
class UNiagaraMeshRendererProperties : public UNiagaraRendererProperties
{
	struct TArray<struct FNiagaraMeshRendererMeshProperties> Meshes; // 0xc8 (0x10)
	enum ENiagaraRendererSourceDataMode SourceMode; // 0xd8 (0x1)
	enum ENiagaraSortMode SortMode; // 0xd9 (0x1)
	unsigned char unreflected_da[0x2]; // 0xda (0x2) 
	unsigned char bOverrideMaterials; // 0xdc (0x1)
	unsigned char bSortOnlyWhenTranslucent; // 0xdc (0x1)
	unsigned char unreflected_dd[0x3]; // 0xdd (0x3) 
	enum ENiagaraRendererSortPrecision SortPrecision; // 0xe0 (0x1)
	enum ENiagaraRendererGpuTranslucentLatency GpuTranslucentLatency; // 0xe1 (0x1)
	unsigned char unreflected_e2[0x2]; // 0xe2 (0x2) 
	unsigned char bSubImageBlend; // 0xe4 (0x1)
	unsigned char bEnableFrustumCulling; // 0xe4 (0x1)
	unsigned char bEnableCameraDistanceCulling; // 0xe4 (0x1)
	unsigned char bEnableMeshFlipbook; // 0xe4 (0x1)
	unsigned char unreflected_e5[0x3]; // 0xe5 (0x3) 
	struct TArray<struct FNiagaraMeshMaterialOverride> OverrideMaterials; // 0xe8 (0x10)
	struct FVector2D SubImageSize; // 0xf8 (0x10)
	enum ENiagaraMeshFacingMode FacingMode; // 0x108 (0x1)
	unsigned char unreflected_109[0x3]; // 0x109 (0x3) 
	unsigned char bLockedAxisEnable; // 0x10c (0x1)
	unsigned char unreflected_10d[0x3]; // 0x10d (0x3) 
	struct FVector LockedAxis; // 0x110 (0x18)
	enum ENiagaraMeshLockedAxisSpace LockedAxisSpace; // 0x128 (0x1)
	unsigned char unreflected_129[0x3]; // 0x129 (0x3) 
	float MinCameraDistance; // 0x12c (0x4)
	float MaxCameraDistance; // 0x130 (0x4)
	uint32_t RendererVisibility; // 0x134 (0x4)
	struct FNiagaraVariableAttributeBinding PositionBinding; // 0x138 (0x40)
	struct FNiagaraVariableAttributeBinding ColorBinding; // 0x178 (0x40)
	struct FNiagaraVariableAttributeBinding VelocityBinding; // 0x1b8 (0x40)
	struct FNiagaraVariableAttributeBinding MeshOrientationBinding; // 0x1f8 (0x40)
	struct FNiagaraVariableAttributeBinding ScaleBinding; // 0x238 (0x40)
	struct FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x278 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x2b8 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x2f8 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x338 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x378 (0x40)
	struct FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x3b8 (0x40)
	struct FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x3f8 (0x40)
	struct FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x438 (0x40)
	struct FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x478 (0x40)
	struct FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x4b8 (0x40)
	struct FNiagaraVariableAttributeBinding MeshIndexBinding; // 0x4f8 (0x40)
	struct FNiagaraRendererMaterialParameters MaterialParameters; // 0x538 (0x40)
	struct FNiagaraVariableAttributeBinding PrevPositionBinding; // 0x578 (0x40)
	struct FNiagaraVariableAttributeBinding PrevScaleBinding; // 0x5b8 (0x40)
	struct FNiagaraVariableAttributeBinding PrevMeshOrientationBinding; // 0x5f8 (0x40)
	struct FNiagaraVariableAttributeBinding PrevCameraOffsetBinding; // 0x638 (0x40)
	struct FNiagaraVariableAttributeBinding PrevVelocityBinding; // 0x678 (0x40)
	unsigned char unreflected_6b8[0x68]; // 0x6b8 (0x68) 
	class UStaticMesh* ParticleMesh; // 0x720 (0x8)
	struct FVector PivotOffset; // 0x728 (0x18)
	enum ENiagaraMeshPivotOffsetSpace PivotOffsetSpace; // 0x740 (0x1)
	unsigned char padding_741[0x7]; // 0x741 (0x7)
};

