// Class /Script/ChaosNiagara.NiagaraDataInterfaceChaosDestruction
// Size: 0x348
class UNiagaraDataInterfaceChaosDestruction : public UNiagaraDataInterface
{
	struct TSet<class AChaosSolverActor*> ChaosSolverActorSet; // 0x38 (0x50)
	enum EDataSourceTypeEnum DataSourceType; // 0x88 (0x1)
	unsigned char unreflected_89[0x3]; // 0x89 (0x3) 
	int DataProcessFrequency; // 0x8c (0x4)
	int MaxNumberOfDataEntriesToSpawn; // 0x90 (0x4)
	bool DoSpawn; // 0x94 (0x1)
	unsigned char unreflected_95[0x3]; // 0x95 (0x3) 
	struct FVector2D SpawnMultiplierMinMax; // 0x98 (0x10)
	float SpawnChance; // 0xa8 (0x4)
	unsigned char unreflected_ac[0x4]; // 0xac (0x4) 
	struct FVector2D ImpulseToSpawnMinMax; // 0xb0 (0x10)
	struct FVector2D SpeedToSpawnMinMax; // 0xc0 (0x10)
	struct FVector2D MassToSpawnMinMax; // 0xd0 (0x10)
	struct FVector2D ExtentMinToSpawnMinMax; // 0xe0 (0x10)
	struct FVector2D ExtentMaxToSpawnMinMax; // 0xf0 (0x10)
	struct FVector2D VolumeToSpawnMinMax; // 0x100 (0x10)
	struct FVector2D SolverTimeToSpawnMinMax; // 0x110 (0x10)
	int SurfaceTypeToSpawn; // 0x120 (0x4)
	enum ELocationFilteringModeEnum LocationFilteringMode; // 0x124 (0x1)
	enum ELocationXToSpawnEnum LocationXToSpawn; // 0x125 (0x1)
	unsigned char unreflected_126[0x2]; // 0x126 (0x2) 
	struct FVector2D LocationXToSpawnMinMax; // 0x128 (0x10)
	enum ELocationYToSpawnEnum LocationYToSpawn; // 0x138 (0x1)
	unsigned char unreflected_139[0x7]; // 0x139 (0x7) 
	struct FVector2D LocationYToSpawnMinMax; // 0x140 (0x10)
	enum ELocationZToSpawnEnum LocationZToSpawn; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	struct FVector2D LocationZToSpawnMinMax; // 0x158 (0x10)
	float TrailMinSpeedToSpawn; // 0x168 (0x4)
	enum EDataSortTypeEnum DataSortingType; // 0x16c (0x1)
	bool bGetExternalCollisionData; // 0x16d (0x1)
	bool DoSpatialHash; // 0x16e (0x1)
	unsigned char unreflected_16f[0x1]; // 0x16f (0x1) 
	struct FVector SpatialHashVolumeMin; // 0x170 (0x18)
	struct FVector SpatialHashVolumeMax; // 0x188 (0x18)
	struct FVector SpatialHashVolumeCellSize; // 0x1a0 (0x18)
	int MaxDataPerCell; // 0x1b8 (0x4)
	bool bApplyMaterialsFilter; // 0x1bc (0x1)
	unsigned char unreflected_1bd[0x3]; // 0x1bd (0x3) 
	struct TSet<class UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x1c0 (0x50)
	bool bGetExternalBreakingData; // 0x210 (0x1)
	bool bGetExternalTrailingData; // 0x211 (0x1)
	unsigned char unreflected_212[0x6]; // 0x212 (0x6) 
	struct FVector2D RandomPositionMagnitudeMinMax; // 0x218 (0x10)
	float InheritedVelocityMultiplier; // 0x228 (0x4)
	enum ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x22c (0x1)
	unsigned char unreflected_22d[0x3]; // 0x22d (0x3) 
	struct FVector2D RandomVelocityMagnitudeMinMax; // 0x230 (0x10)
	float SpreadAngleMax; // 0x240 (0x4)
	unsigned char unreflected_244[0x4]; // 0x244 (0x4) 
	struct FVector VelocityOffsetMin; // 0x248 (0x18)
	struct FVector VelocityOffsetMax; // 0x260 (0x18)
	struct FVector2D FinalVelocityMagnitudeMinMax; // 0x278 (0x10)
	float MaxLatency; // 0x288 (0x4)
	enum EDebugTypeEnum DebugType; // 0x28c (0x1)
	unsigned char unreflected_28d[0x3]; // 0x28d (0x3) 
	int LastSpawnedPointID; // 0x290 (0x4)
	float LastSpawnTime; // 0x294 (0x4)
	unsigned char unreflected_298[0x10]; // 0x298 (0x10) 
	float SolverTime; // 0x2a8 (0x4)
	float TimeStampOfLastProcessedData; // 0x2ac (0x4)
	unsigned char padding_2b0[0x98]; // 0x2b0 (0x98)
};

