// Class /Script/Niagara.NiagaraSpriteRendererProperties
// Size: 0x8c0
class UNiagaraSpriteRendererProperties : public UNiagaraRendererProperties
{
	class UMaterialInterface* Material; // 0xc8 (0x8)
	enum ENiagaraRendererSourceDataMode SourceMode; // 0xd0 (0x1)
	unsigned char unreflected_d1[0x7]; // 0xd1 (0x7) 
	struct FNiagaraUserParameterBinding MaterialUserParamBinding; // 0xd8 (0x18)
	enum ENiagaraSpriteAlignment Alignment; // 0xf0 (0x1)
	enum ENiagaraSpriteFacingMode FacingMode; // 0xf1 (0x1)
	unsigned char unreflected_f2[0x6]; // 0xf2 (0x6) 
	struct FVector2D PivotInUVSpace; // 0xf8 (0x10)
	float MacroUVRadius; // 0x108 (0x4)
	enum ENiagaraSortMode SortMode; // 0x10c (0x1)
	unsigned char unreflected_10d[0x3]; // 0x10d (0x3) 
	struct FVector2D SubImageSize; // 0x110 (0x10)
	unsigned char bSubImageBlend; // 0x120 (0x1)
	unsigned char bRemoveHMDRollInVR; // 0x120 (0x1)
	unsigned char bSortOnlyWhenTranslucent; // 0x120 (0x1)
	unsigned char unreflected_121[0x3]; // 0x121 (0x3) 
	enum ENiagaraRendererSortPrecision SortPrecision; // 0x124 (0x1)
	enum ENiagaraRendererGpuTranslucentLatency GpuTranslucentLatency; // 0x125 (0x1)
	enum ENiagaraRendererPixelCoverageMode PixelCoverageMode; // 0x126 (0x1)
	unsigned char unreflected_127[0x1]; // 0x127 (0x1) 
	float PixelCoverageBlend; // 0x128 (0x4)
	float MinFacingCameraBlendDistance; // 0x12c (0x4)
	float MaxFacingCameraBlendDistance; // 0x130 (0x4)
	unsigned char bEnableCameraDistanceCulling; // 0x134 (0x1)
	unsigned char unreflected_135[0x3]; // 0x135 (0x3) 
	float MinCameraDistance; // 0x138 (0x4)
	float MaxCameraDistance; // 0x13c (0x4)
	uint32_t RendererVisibility; // 0x140 (0x4)
	unsigned char unreflected_144[0x4]; // 0x144 (0x4) 
	struct FNiagaraVariableAttributeBinding PositionBinding; // 0x148 (0x40)
	struct FNiagaraVariableAttributeBinding ColorBinding; // 0x188 (0x40)
	struct FNiagaraVariableAttributeBinding VelocityBinding; // 0x1c8 (0x40)
	struct FNiagaraVariableAttributeBinding SpriteRotationBinding; // 0x208 (0x40)
	struct FNiagaraVariableAttributeBinding SpriteSizeBinding; // 0x248 (0x40)
	struct FNiagaraVariableAttributeBinding SpriteFacingBinding; // 0x288 (0x40)
	struct FNiagaraVariableAttributeBinding SpriteAlignmentBinding; // 0x2c8 (0x40)
	struct FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x308 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x348 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x388 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x3c8 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x408 (0x40)
	struct FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x448 (0x40)
	struct FNiagaraVariableAttributeBinding UVScaleBinding; // 0x488 (0x40)
	struct FNiagaraVariableAttributeBinding PivotOffsetBinding; // 0x4c8 (0x40)
	struct FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x508 (0x40)
	struct FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x548 (0x40)
	struct FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x588 (0x40)
	struct FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x5c8 (0x40)
	struct FNiagaraRendererMaterialParameters MaterialParameters; // 0x608 (0x40)
	struct FNiagaraVariableAttributeBinding PrevPositionBinding; // 0x648 (0x40)
	struct FNiagaraVariableAttributeBinding PrevVelocityBinding; // 0x688 (0x40)
	struct FNiagaraVariableAttributeBinding PrevSpriteRotationBinding; // 0x6c8 (0x40)
	struct FNiagaraVariableAttributeBinding PrevSpriteSizeBinding; // 0x708 (0x40)
	struct FNiagaraVariableAttributeBinding PrevSpriteFacingBinding; // 0x748 (0x40)
	struct FNiagaraVariableAttributeBinding PrevSpriteAlignmentBinding; // 0x788 (0x40)
	struct FNiagaraVariableAttributeBinding PrevCameraOffsetBinding; // 0x7c8 (0x40)
	struct FNiagaraVariableAttributeBinding PrevPivotOffsetBinding; // 0x808 (0x40)
	unsigned char padding_848[0x78]; // 0x848 (0x78)
};

