// Class /Script/Niagara.NiagaraSystem
// Size: 0x4d0
class UNiagaraSystem : public UFXSystemAsset
{
	unsigned char bSupportLargeWorldCoordinates; // 0x30 (0x1)
	unsigned char bOverrideCastShadow; // 0x30 (0x1)
	unsigned char bOverrideReceivesDecals; // 0x30 (0x1)
	unsigned char bOverrideRenderCustomDepth; // 0x30 (0x1)
	unsigned char bOverrideCustomDepthStencilValue; // 0x30 (0x1)
	unsigned char bOverrideCustomDepthStencilWriteMask; // 0x30 (0x1)
	unsigned char bOverrideTranslucencySortPriority; // 0x30 (0x1)
	unsigned char bOverrideTranslucencySortDistanceOffset; // 0x30 (0x1)
	unsigned char bCastShadow; // 0x31 (0x1)
	unsigned char bReceivesDecals; // 0x31 (0x1)
	unsigned char bRenderCustomDepth; // 0x31 (0x1)
	unsigned char bDisableExperimentalVM; // 0x31 (0x1)
	enum ERendererStencilMask CustomDepthStencilWriteMask; // 0x32 (0x1)
	unsigned char unreflected_33[0x1]; // 0x33 (0x1) 
	int CustomDepthStencilValue; // 0x34 (0x4)
	int TranslucencySortPriority; // 0x38 (0x4)
	float TranslucencySortDistanceOffset; // 0x3c (0x4)
	bool bDumpDebugSystemInfo; // 0x40 (0x1)
	bool bDumpDebugEmitterInfo; // 0x41 (0x1)
	unsigned char unreflected_42[0x1]; // 0x42 (0x1) 
	bool bRequireCurrentFrameData; // 0x43 (0x1)
	unsigned char bFixedBounds; // 0x44 (0x1)
	unsigned char unreflected_45[0x3]; // 0x45 (0x3) 
	class UNiagaraEffectType* EffectType; // 0x48 (0x8)
	bool bOverrideScalabilitySettings; // 0x50 (0x1)
	unsigned char unreflected_51[0x3]; // 0x51 (0x3) 
	unsigned char bOverrideAllowCullingForLocalPlayers; // 0x54 (0x1)
	unsigned char bAllowCullingForLocalPlayersOverride; // 0x54 (0x1)
	unsigned char unreflected_55[0x3]; // 0x55 (0x3) 
	struct TArray<struct FNiagaraSystemScalabilityOverride> ScalabilityOverrides; // 0x58 (0x10)
	struct FNiagaraSystemScalabilityOverrides SystemScalabilityOverrides; // 0x68 (0x10)
	struct TArray<struct FNiagaraEmitterHandle> EmitterHandles; // 0x78 (0x10)
	struct TArray<class UNiagaraParameterCollectionInstance*> ParameterCollectionOverrides; // 0x88 (0x10)
	class UNiagaraScript* SystemSpawnScript; // 0x98 (0x8)
	class UNiagaraScript* SystemUpdateScript; // 0xa0 (0x8)
	unsigned char unreflected_a8[0x10]; // 0xa8 (0x10) 
	struct FNiagaraSystemCompiledData SystemCompiledData; // 0xb8 (0x228)
	struct FNiagaraUserRedirectionParameterStore ExposedParameters; // 0x2e0 (0xd8)
	struct FBox FixedBounds; // 0x3b8 (0x38)
	bool bAutoDeactivate; // 0x3f0 (0x1)
	bool bDeterminism; // 0x3f1 (0x1)
	unsigned char unreflected_3f2[0x2]; // 0x3f2 (0x2) 
	int RandomSeed; // 0x3f4 (0x4)
	float WarmupTime; // 0x3f8 (0x4)
	int WarmupTickCount; // 0x3fc (0x4)
	float WarmupTickDelta; // 0x400 (0x4)
	bool bFixedTickDelta; // 0x404 (0x1)
	unsigned char unreflected_405[0x3]; // 0x405 (0x3) 
	float FixedTickDeltaTime; // 0x408 (0x4)
	bool bHasSystemScriptDIsWithPerInstanceData; // 0x40c (0x1)
	bool bNeedsGPUContextInitForDataInterfaces; // 0x40d (0x1)
	unsigned char unreflected_40e[0x2]; // 0x40e (0x2) 
	struct TArray<struct FName> UserDINamesReadInSystemScripts; // 0x410 (0x10)
	unsigned char padding_420[0xb0]; // 0x420 (0xb0)
};

