// Class /Script/Niagara.NiagaraRibbonRendererProperties
// Size: 0x848
class UNiagaraRibbonRendererProperties : public UNiagaraRendererProperties
{
	class UMaterialInterface* Material; // 0xc8 (0x8)
	struct FNiagaraUserParameterBinding MaterialUserParamBinding; // 0xd0 (0x18)
	enum ENiagaraRibbonFacingMode FacingMode; // 0xe8 (0x1)
	unsigned char unreflected_e9[0x7]; // 0xe9 (0x7) 
	struct FNiagaraRibbonUVSettings UV0Settings; // 0xf0 (0x38)
	struct FNiagaraRibbonUVSettings UV1Settings; // 0x128 (0x38)
	int MaxNumRibbons; // 0x160 (0x4)
	bool bUseGPUInit; // 0x164 (0x1)
	enum ENiagaraRibbonDrawDirection DrawDirection; // 0x165 (0x1)
	enum ENiagaraRibbonShapeMode Shape; // 0x166 (0x1)
	bool bEnableAccurateGeometry; // 0x167 (0x1)
	int WidthSegmentationCount; // 0x168 (0x4)
	int MultiPlaneCount; // 0x16c (0x4)
	int TubeSubdivisions; // 0x170 (0x4)
	unsigned char unreflected_174[0x4]; // 0x174 (0x4) 
	struct TArray<struct FNiagaraRibbonShapeCustomVertex> CustomVertices; // 0x178 (0x10)
	float CurveTension; // 0x188 (0x4)
	enum ENiagaraRibbonTessellationMode TessellationMode; // 0x18c (0x1)
	unsigned char unreflected_18d[0x3]; // 0x18d (0x3) 
	int TessellationFactor; // 0x190 (0x4)
	bool bUseConstantFactor; // 0x194 (0x1)
	unsigned char unreflected_195[0x3]; // 0x195 (0x3) 
	float TessellationAngle; // 0x198 (0x4)
	bool bScreenSpaceTessellation; // 0x19c (0x1)
	unsigned char unreflected_19d[0x3]; // 0x19d (0x3) 
	struct FNiagaraVariableAttributeBinding PositionBinding; // 0x1a0 (0x40)
	struct FNiagaraVariableAttributeBinding ColorBinding; // 0x1e0 (0x40)
	struct FNiagaraVariableAttributeBinding VelocityBinding; // 0x220 (0x40)
	struct FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x260 (0x40)
	struct FNiagaraVariableAttributeBinding RibbonTwistBinding; // 0x2a0 (0x40)
	struct FNiagaraVariableAttributeBinding RibbonWidthBinding; // 0x2e0 (0x40)
	struct FNiagaraVariableAttributeBinding RibbonFacingBinding; // 0x320 (0x40)
	struct FNiagaraVariableAttributeBinding RibbonIdBinding; // 0x360 (0x40)
	struct FNiagaraVariableAttributeBinding RibbonLinkOrderBinding; // 0x3a0 (0x40)
	struct FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x3e0 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x420 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x460 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x4a0 (0x40)
	struct FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x4e0 (0x40)
	struct FNiagaraVariableAttributeBinding RibbonUVDistance; // 0x520 (0x40)
	struct FNiagaraVariableAttributeBinding U0OverrideBinding; // 0x560 (0x40)
	struct FNiagaraVariableAttributeBinding V0RangeOverrideBinding; // 0x5a0 (0x40)
	struct FNiagaraVariableAttributeBinding U1OverrideBinding; // 0x5e0 (0x40)
	struct FNiagaraVariableAttributeBinding V1RangeOverrideBinding; // 0x620 (0x40)
	struct FNiagaraRendererMaterialParameters MaterialParameters; // 0x660 (0x40)
	struct FNiagaraVariableAttributeBinding PrevPositionBinding; // 0x6a0 (0x40)
	struct FNiagaraVariableAttributeBinding PrevRibbonWidthBinding; // 0x6e0 (0x40)
	struct FNiagaraVariableAttributeBinding PrevRibbonFacingBinding; // 0x720 (0x40)
	struct FNiagaraVariableAttributeBinding PrevRibbonTwistBinding; // 0x760 (0x40)
	unsigned char padding_7a0[0xa8]; // 0x7a0 (0xa8)
};

