// Class /Script/Account.OnlineAccountCommon
// Size: 0x790
class UOnlineAccountCommon : public UObject
{
	unsigned char unreflected_28[0x10]; // 0x28 (0x10) 
	struct FString AvailabilityServiceGameName; // 0x38 (0x10)
	bool bRequireLightswitchAtStartup; // 0x48 (0x1)
	unsigned char unreflected_49[0x7]; // 0x49 (0x7) 
	struct FString EulaKey; // 0x50 (0x10)
	struct TArray<struct FString> EulaKeys; // 0x60 (0x10)
	struct TMap<struct FString, struct FString> EulaKeyMapping; // 0x70 (0x50)
	bool bEnableWaitingRoom; // 0xc0 (0x1)
	unsigned char unreflected_c1[0x7]; // 0xc1 (0x7) 
	struct TArray<struct FWebEnvUrl> WebCreateEpicAccountUrl; // 0xc8 (0x10)
	bool bAllowLocalLogout; // 0xd8 (0x1)
	unsigned char unreflected_d9[0x3f]; // 0xd9 (0x3f) 
	float DefaultLoginStepTimeout; // 0x118 (0x4)
	unsigned char unreflected_11c[0x4]; // 0x11c (0x4) 
	struct TMap<struct FName, float> CustomLoginStepTimeouts; // 0x120 (0x50)
	bool bEnableDevLoginStepTimeouts; // 0x170 (0x1)
	unsigned char unreflected_171[0x1f]; // 0x171 (0x1f) 
	struct FString RedeemAccessUrl; // 0x190 (0x10)
	struct FString RequestFreeAccessUrl; // 0x1a0 (0x10)
	struct FString RealGameAccessUrl; // 0x1b0 (0x10)
	float SkipRedeemOfflinePurchasesChance; // 0x1c0 (0x4)
	bool bUseFreeAccessInsteadOfGameAccess; // 0x1c4 (0x1)
	bool bShouldGrantFreeAccess; // 0x1c5 (0x1)
	unsigned char unreflected_1c6[0x1]; // 0x1c6 (0x1) 
	bool bAllowHomeSharingAccess; // 0x1c7 (0x1)
	bool bRequireUGCPrivilege; // 0x1c8 (0x1)
	unsigned char unreflected_1c9[0x22f]; // 0x1c9 (0x22f) 
	float AccessGrantDelaySeconds; // 0x3f8 (0x4)
	unsigned char unreflected_3fc[0x4]; // 0x3fc (0x4) 
	class UWaitingRoomState* WaitingRoomState; // 0x400 (0x8)
	unsigned char unreflected_408[0x350]; // 0x408 (0x350) 
	bool bAutoCreateHeadlessAccount; // 0x758 (0x1)
	unsigned char padding_759[0x37]; // 0x759 (0x37)
};

