// Class /Script/FortniteGame.OutpostPOSTRequirementData
// Size: 0x48
class UOutpostPOSTRequirementData : public UObject
{
	class UFortItemDefinition* RequirementItemDefinition; // 0x28 (0x8)
	int TotalRequired; // 0x30 (0x4)
	int AlreadyDeposited; // 0x34 (0x4)
	int AmountOwned; // 0x38 (0x4)
	bool bHasEnough; // 0x3c (0x1)
	unsigned char unreflected_3d[0x3]; // 0x3d (0x3) 
	int AmountToDeposit; // 0x40 (0x4)
	unsigned char padding_44[0x4]; // 0x44 (0x4)
};

