// AnimBlueprintGeneratedClass /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C
// Size: 0x7a74
class UPlayer_ProceduralAdjustments_AnimBP_C : public UFortPlayerProceduralAdjustmentsAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0xe30 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0xe38 (0xb)
	unsigned char unreflected_e43[0x5]; // 0xe43 (0x5) 
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0xe48 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0xe50 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot29; // 0xe58 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose18; // 0xe78 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot28; // 0xf38 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose17; // 0xf58 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot27; // 0x1018 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose16; // 0x1038 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot26; // 0x10f8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose15; // 0x1118 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot25; // 0x11d8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot24; // 0x11f8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot23; // 0x1218 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot22; // 0x1238 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot21; // 0x1258 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot20; // 0x1278 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot19; // 0x1298 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot18; // 0x12b8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose14; // 0x12d8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot17; // 0x1398 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose13; // 0x13b8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot16; // 0x1478 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot15; // 0x1498 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot14; // 0x14b8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot13; // 0x14d8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot12; // 0x14f8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot11; // 0x1518 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose12; // 0x1538 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot10; // 0x15f8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose11; // 0x1618 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose10; // 0x16d8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot9; // 0x1798 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose9; // 0x17b8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot8; // 0x1878 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose8; // 0x1898 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot7; // 0x1958 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace13; // 0x1978 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone34; // 0x1998 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone33; // 0x1ac0 (0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace13; // 0x1be8 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone32; // 0x1c08 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone31; // 0x1d30 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone30; // 0x1e58 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone29; // 0x1f80 (0x128)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose7; // 0x20a8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot6; // 0x2168 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone28; // 0x2188 (0x128)
	struct FFortAnimNode_SlopeWarping FortAnimGraphNodeSlopeWarping; // 0x22b0 (0x2e8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace12; // 0x2598 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool8; // 0x25b8 (0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace12; // 0x2600 (0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace11; // 0x2620 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace11; // 0x2640 (0x20)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone1; // 0x2660 (0xa8)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose21; // 0x2708 (0x28)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone27; // 0x2730 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone26; // 0x2858 (0x128)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose20; // 0x2980 (0x28)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone25; // 0x29a8 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone24; // 0x2ad0 (0x128)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose9; // 0x2bf8 (0x100)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0x2cf8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot5; // 0x2db8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0x2dd8 (0xc0)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone23; // 0x2e98 (0x128)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool7; // 0x2fc0 (0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace10; // 0x3008 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool6; // 0x3028 (0x48)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone22; // 0x3070 (0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace9; // 0x3198 (0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace10; // 0x31b8 (0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace9; // 0x31d8 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone21; // 0x31f8 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone20; // 0x3320 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone19; // 0x3448 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone18; // 0x3570 (0x128)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x3698 (0x48)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone17; // 0x36e0 (0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace8; // 0x3808 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone16; // 0x3828 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone15; // 0x3950 (0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace8; // 0x3a78 (0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose8; // 0x3a98 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose19; // 0x3b98 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose18; // 0x3bc0 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose17; // 0x3be8 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose16; // 0x3c10 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x3c38 (0x48)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose15; // 0x3c80 (0x28)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0x3ca8 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace7; // 0x3cc8 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone14; // 0x3ce8 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone13; // 0x3e10 (0x128)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0x3f38 (0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace7; // 0x3ff8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x4018 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone12; // 0x4038 (0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace6; // 0x4160 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace6; // 0x4180 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone11; // 0x41a0 (0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace5; // 0x42c8 (0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace5; // 0x42e8 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose14; // 0x4308 (0x28)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone10; // 0x4330 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone9; // 0x4458 (0x128)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose13; // 0x4580 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x45a8 (0x48)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0x45f0 (0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose7; // 0x46b0 (0x100)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x47b0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x47d0 (0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace4; // 0x4890 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone8; // 0x48b0 (0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace4; // 0x49d8 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone7; // 0x49f8 (0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace3; // 0x4b20 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x4b40 (0x48)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone6; // 0x4b88 (0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace3; // 0x4cb0 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose12; // 0x4cd0 (0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose6; // 0x4cf8 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose11; // 0x4df8 (0x28)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x4e20 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x4e40 (0xc0)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone14; // 0x4f00 (0xe8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace2; // 0x4fe8 (0x20)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone13; // 0x5008 (0xe8)
	struct FAnimNode_LegIK AnimGraphNodeLegIK2; // 0x50f0 (0xf8)
	struct FAnimNode_LegIK AnimGraphNodeLegIK1; // 0x51e8 (0xf8)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone12; // 0x52e0 (0xe8)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone11; // 0x53c8 (0xe8)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone10; // 0x54b0 (0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace2; // 0x5598 (0x20)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone9; // 0x55b8 (0xe8)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone8; // 0x56a0 (0xe8)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone5; // 0x5788 (0x128)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone7; // 0x58b0 (0xe8)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone6; // 0x5998 (0xe8)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone5; // 0x5a80 (0xe8)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone4; // 0x5b68 (0x128)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone4; // 0x5c90 (0xe8)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone3; // 0x5d78 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone2; // 0x5ea0 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone1; // 0x5fc8 (0x128)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone3; // 0x60f0 (0xe8)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone2; // 0x61d8 (0xe8)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone1; // 0x62c0 (0xe8)
	struct FAnimNode_CopyBone AnimGraphNodeCopyBone; // 0x63a8 (0xe8)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x6490 (0x20)
	struct FAnimNode_Slot AnimGraphNodeSlot; // 0x64b0 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend; // 0x64f8 (0xe0)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone; // 0x65d8 (0xa8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose5; // 0x6680 (0x100)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose4; // 0x6780 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose10; // 0x6880 (0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum; // 0x68a8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x68f0 (0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose3; // 0x6938 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose9; // 0x6a38 (0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer8; // 0x6a60 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose2; // 0x6b28 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose8; // 0x6c28 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose7; // 0x6c50 (0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer7; // 0x6c78 (0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer6; // 0x6d40 (0xc8)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone; // 0x6e08 (0x128)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose6; // 0x6f30 (0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace1; // 0x6f58 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x6f78 (0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace1; // 0x6fc0 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose5; // 0x6fe0 (0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0x7008 (0x100)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x7108 (0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x71c8 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose4; // 0x72c8 (0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer5; // 0x72f0 (0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose3; // 0x73b8 (0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer4; // 0x73e0 (0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x74a8 (0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer3; // 0x74d0 (0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer2; // 0x7598 (0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x7660 (0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend; // 0x7688 (0xc0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0x7748 (0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer1; // 0x7768 (0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x7830 (0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace; // 0x7858 (0x20)
	struct FAnimNode_LegIK AnimGraphNodeLegIK; // 0x7878 (0xf8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer; // 0x7970 (0xc8)
	bool IsHidingInProp; // 0x7a38 (0x1)
	unsigned char unreflected_7a39[0x7]; // 0x7a39 (0x7) 
	struct FVector RightHandOverride; // 0x7a40 (0x18)
	struct FVector LeftHandOverride; // 0x7a58 (0x18)
	struct FName EmoteAnimOffsetCurveName; // 0x7a70 (0x4)

	/* Functions */

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.FullBodyOverride (Has no native function)
	void FullBodyOverride(struct FPoseLink& PassThroughFullBodyPose, struct FPoseLink& FullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.CharacterSkeletalControlPostLegIK (Has no native function)
	void CharacterSkeletalControlPostLegIK(struct FPoseLink& InPosePostLegIK, struct FPoseLink& CharacterSkeletalControlPostLegIK); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemUpperBody (Has no native function)
	void ItemUpperBody(struct FPoseLink& InPoseUpperBody, struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink& ItemUpperBody); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemIdleAdditive (Has no native function)
	void ItemIdleAdditive(struct FPoseLink& InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJumpUpAdditive (Has no native function)
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJumpLoopAdditive (Has no native function)
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemFallAdditive (Has no native function)
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemFallLandAdditive (Has no native function)
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJetPackStartAdditive (Has no native function)
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJetPackJumpAdditive (Has no native function)
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemZipLineStartAdditive (Has no native function)
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemLowerBodyMovement (Has no native function)
	void ItemLowerBodyMovement(struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemRelaxedEntry (Has no native function)
	void ItemRelaxedEntry(struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpStart (Has no native function)
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpStartLoop (Has no native function)
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpFallLoop (Has no native function)
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpSurfaceLoop (Has no native function)
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpSurfaceEnd (Has no native function)
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSkeletalControl (Has no native function)
	void ItemSkeletalControl(struct FPoseLink& InPose, struct FPoseLink& ItemSkeletalControl); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemAimOffset (Has no native function)
	void ItemAimOffset(struct FPoseLink& InPoseAimOffset, double& AimOffsetAlpha, double& Yaw, double& Pitch, struct FPoseLink& InPoseUpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemFullBodyOverride (Has no native function)
	void ItemFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemPreIK (Has no native function)
	void ItemPreIK(struct FPoseLink& InPosePreIK, struct FPoseLink& ItemPreIK); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PostIKAdjustmentsLayer (Has no native function)
	void PostIKAdjustmentsLayer(struct FPoseLink& InPosePostIkAdjustments, struct FPoseLink& PostIKAdjustmentsLayer); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PreIKAdjustmentsLayer (Has no native function)
	void PreIKAdjustmentsLayer(struct FPoseLink& InPosePreIKAdjustments, struct FPoseLink& PreIKAdjustmentsLayer); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PlevisAndFeetAdjustmentsLayer (Has no native function)
	void PlevisAndFeetAdjustmentsLayer(struct FPoseLink& InPosePelvisAndFeetAdjustments, struct FPoseLink& PlevisAndFeetAdjustmentsLayer); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PushCannonAdjustmentsLayer (Has no native function)
	void PushCannonAdjustmentsLayer(struct FPoseLink& InPosePushCannonAdjustments, struct FPoseLink& PushCannonAdjustmentsLayer); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ParaGliderAdjustmentsLayer (Has no native function)
	void ParaGliderAdjustmentsLayer(struct FPoseLink& InPoseParaGliderAdjustments, struct FPoseLink& ParaGliderAdjustmentsLayer); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.HoverboardAdjustmentsLayer (Has no native function)
	void HoverboardAdjustmentsLayer(struct FPoseLink& InPoseHoverboardAdjustments, struct FPoseLink& HoverboardAdjustmentsLayer); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.HandIKFixUpLayer (Has no native function)
	void HandIKFixUpLayer(struct FPoseLink& InPoseHandIk, struct FPoseLink& HandIKFixUpLayer); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& InPosePostTurnInPlace, struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ExecuteUbergraph_Player_ProceduralAdjustments_AnimBP (Has no native function)
	void ExecuteUbergraphPlayerProceduralAdjustmentsAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

