// AnimBlueprintGeneratedClass /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C
// Size: 0x1e90
class UPlayer_FreeFlying_AnimBP_C : public UFortPlayerPrototypeAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x1680 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x1688 (0x48)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x16d0 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x16d8 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x16e0 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x1700 (0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum1; // 0x1728 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0x1770 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0x17b8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0x1800 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x1848 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x1890 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x18d8 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x1920 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive1; // 0x1990 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x1a58 (0x20)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum; // 0x1a78 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x1ac0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x1b08 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x1b50 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x1b98 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x1be0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x1c28 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x1c70 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive; // 0x1ce0 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x1da8 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x1dc8 (0xc8)

	/* Functions */

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C.ExecuteUbergraph_Player_FreeFlying_AnimBP (Has no native function)
	void ExecuteUbergraphPlayerFreeFlyingAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

