// AnimBlueprintGeneratedClass /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C
// Size: 0x1a90
class UPlayer_SourcePose_AnimBP_C : public UFortPlayerPrototypeAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x1680 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x1688 (0x68)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x16f0 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x16f8 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x1700 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x1720 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x1768 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x17b0 (0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNodeSequenceEvaluator6; // 0x17f8 (0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNodeSequenceEvaluator5; // 0x1838 (0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNodeSequenceEvaluator4; // 0x1878 (0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNodeSequenceEvaluator3; // 0x18b8 (0x40)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x18f8 (0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNodeSequenceEvaluator2; // 0x1940 (0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNodeSequenceEvaluator1; // 0x1980 (0x40)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x19c0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x1a08 (0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNodeSequenceEvaluator; // 0x1a50 (0x40)

	/* Functions */

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C.ExecuteUbergraph_Player_SourcePose_AnimBP (Has no native function)
	void ExecuteUbergraphPlayerSourcePoseAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

