// AnimBlueprintGeneratedClass /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C
// Size: 0x5650
class UPlayer_LocomotionAdditives_AnimBP_C : public UFortPlayerPrototypeAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x1680 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x1688 (0x1a8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x1830 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x1838 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot26; // 0x1840 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose17; // 0x1860 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot25; // 0x1920 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose16; // 0x1940 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot24; // 0x1a00 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot23; // 0x1a20 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot22; // 0x1a40 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot21; // 0x1a60 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot20; // 0x1a80 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot19; // 0x1aa0 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot18; // 0x1ac0 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot17; // 0x1ae0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose15; // 0x1b00 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot16; // 0x1bc0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose14; // 0x1be0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot15; // 0x1ca0 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot14; // 0x1cc0 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot13; // 0x1ce0 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot12; // 0x1d00 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot11; // 0x1d20 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot10; // 0x1d40 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose13; // 0x1d60 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot9; // 0x1e20 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose12; // 0x1e40 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose11; // 0x1f00 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot8; // 0x1fc0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose10; // 0x1fe0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot7; // 0x20a0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose9; // 0x20c0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot6; // 0x2180 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose8; // 0x21a0 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose7; // 0x2260 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0x2320 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot5; // 0x23e0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0x2400 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0x24c0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0x24e0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x25a0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0x25c0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x2680 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x26a0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x2760 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x2780 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x2840 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x2900 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult23; // 0x2920 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult22; // 0x2948 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult21; // 0x2970 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult20; // 0x2998 (0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer17; // 0x29c0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer16; // 0x2a30 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool13; // 0x2aa0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool12; // 0x2ae8 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer15; // 0x2b30 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult11; // 0x2ba0 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer14; // 0x2bc0 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool11; // 0x2c30 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer13; // 0x2c78 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer12; // 0x2ce8 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool10; // 0x2d58 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer11; // 0x2da0 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool9; // 0x2e10 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer10; // 0x2e58 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum6; // 0x2ec8 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer9; // 0x2f10 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer8; // 0x2f80 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool8; // 0x2ff0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult10; // 0x3038 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult19; // 0x3058 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine4; // 0x3080 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer7; // 0x3148 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer6; // 0x31b8 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool7; // 0x3228 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool6; // 0x3270 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer5; // 0x32b8 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x3328 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer4; // 0x3370 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x33e0 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer3; // 0x3428 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x3498 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer2; // 0x34e0 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum5; // 0x3550 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x3598 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x3608 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x3678 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult9; // 0x36c0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine3; // 0x36e0 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0x37a8 (0x100)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer; // 0x38a8 (0xc8)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose3; // 0x3970 (0x10)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend6; // 0x3980 (0xe0)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose2; // 0x3a60 (0x10)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend5; // 0x3a70 (0xe0)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose1; // 0x3b50 (0x10)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend4; // 0x3b60 (0xe0)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult18; // 0x3c40 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult17; // 0x3c68 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult16; // 0x3c90 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult15; // 0x3cb8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult14; // 0x3ce0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult13; // 0x3d08 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult12; // 0x3d30 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult11; // 0x3d58 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult10; // 0x3d80 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult9; // 0x3da8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult8; // 0x3dd0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult7; // 0x3df8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult6; // 0x3e20 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult5; // 0x3e48 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult4; // 0x3e70 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult3; // 0x3e98 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult2; // 0x3ec0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0x3ee8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x3f10 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer28; // 0x3f38 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer27; // 0x3f80 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer26; // 0x3fc8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer25; // 0x4010 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer24; // 0x4058 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer23; // 0x40a0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer22; // 0x40e8 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum4; // 0x4130 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer21; // 0x4178 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult8; // 0x41c0 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose4; // 0x41e0 (0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum3; // 0x4208 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend3; // 0x4250 (0xe0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer20; // 0x4330 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer19; // 0x4378 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer18; // 0x43c0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer17; // 0x4408 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult7; // 0x4450 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose3; // 0x4470 (0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum2; // 0x4498 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend2; // 0x44e0 (0xe0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer16; // 0x45c0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer15; // 0x4608 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer14; // 0x4650 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer13; // 0x4698 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult6; // 0x46e0 (0x20)
	struct FAnimNode_ModifyCurve AnimGraphNodeModifyCurve; // 0x4700 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x4800 (0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum1; // 0x4828 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer12; // 0x4870 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x48b8 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend1; // 0x4900 (0xe0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer11; // 0x49e0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer10; // 0x4a28 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer9; // 0x4a70 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer8; // 0x4ab8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult5; // 0x4b00 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x4b20 (0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum; // 0x4b48 (0x48)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend2; // 0x4b90 (0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0x4c50 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend; // 0x4c98 (0xe0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0x4d78 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0x4dc0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x4e08 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x4e50 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult4; // 0x4e98 (0x20)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend1; // 0x4eb8 (0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x4f78 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x4fc0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult3; // 0x5008 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine2; // 0x5028 (0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend; // 0x50f0 (0xc0)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose; // 0x51b0 (0x10)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x51c0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x5208 (0x48)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLayer; // 0x5250 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult2; // 0x5318 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x5338 (0x28)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x5360 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine1; // 0x5380 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x5448 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x5468 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x5530 (0x100)
	bool IsSnowman; // 0x5630 (0x1)
	unsigned char unreflected_5631[0x7]; // 0x5631 (0x7) 
	double StartAnimBlendTime; // 0x5638 (0x8)
	double PivotAnimBlendTime; // 0x5640 (0x8)
	double CrouchPlayRate; // 0x5648 (0x8)

	/* Functions */

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemUpperBody (Has no native function)
	void ItemUpperBody(struct FPoseLink& InPoseUpperBody, struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink& ItemUpperBody); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemIdleAdditive (Has no native function)
	void ItemIdleAdditive(struct FPoseLink& InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemJumpUpAdditive (Has no native function)
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemJumpLoopAdditive (Has no native function)
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemFallAdditive (Has no native function)
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemFallLandAdditive (Has no native function)
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemJetPackStartAdditive (Has no native function)
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemJetPackJumpAdditive (Has no native function)
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemZipLineStartAdditive (Has no native function)
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemLowerBodyMovement (Has no native function)
	void ItemLowerBodyMovement(struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemRelaxedEntry (Has no native function)
	void ItemRelaxedEntry(struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSwimJumpStart (Has no native function)
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSwimJumpStartLoop (Has no native function)
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSwimJumpFallLoop (Has no native function)
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSwimJumpSurfaceLoop (Has no native function)
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSwimJumpSurfaceEnd (Has no native function)
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSkeletalControl (Has no native function)
	void ItemSkeletalControl(struct FPoseLink& InPose, struct FPoseLink& ItemSkeletalControl); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemAimOffset (Has no native function)
	void ItemAimOffset(struct FPoseLink& InPoseAimOffset, double& AimOffsetAlpha, double& Yaw, double& Pitch, struct FPoseLink& InPoseUpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemFullBodyOverride (Has no native function)
	void ItemFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemPreIK (Has no native function)
	void ItemPreIK(struct FPoseLink& InPosePreIK, struct FPoseLink& ItemPreIK); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_LowerBodyOverride (Has no native function)
	void MovementModeLowerBodyOverride(struct FPoseLink& InLowerBodyPose, struct FPoseLink& InSourcePose, struct FPoseLink& InSourcePosePreUpperBodySlot, struct FPoseLink& MovementModeLowerBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_LocomotionAdditives (Has no native function)
	void MovementModeLocomotionAdditives(struct FPoseLink& InLocomotionAdditivesPose, struct FPoseLink& MovementModeLocomotionAdditives); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_SourcePose (Has no native function)
	void MovementModeSourcePose(struct FPoseLink& InSourcePoseBase, struct FPoseLink& MovementModeSourcePose); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_FullBodyOverride (Has no native function)
	void MovementModeFullBodyOverride(struct FPoseLink& InputPoseFullBody, struct FPoseLink& MovementModeFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_FinalPoseOverride (Has no native function)
	void MovementModeFinalPoseOverride(struct FPoseLink& InFinalPose, struct FPoseLink& MovementModeFinalPoseOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_AimOffset (Has no native function)
	void MovementModeAimOffset(struct FPoseLink& InAimOffsetsPose, struct FPoseLink& InSourcePosePreAimOffsets, struct FPoseLink& MovementModeAimOffset); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ExecuteUbergraph_Player_LocomotionAdditives_AnimBP (Has no native function)
	void ExecuteUbergraphPlayerLocomotionAdditivesAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

