// AnimBlueprintGeneratedClass /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C
// Size: 0x3b20
class UPlayer_FullBodyAimOffsets_AnimBP_C : public UFortPlayerPrototypeAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x1680 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x1688 (0x14)
	unsigned char unreflected_169c[0x4]; // 0x169c (0x4) 
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x16a0 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x16a8 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot31; // 0x16b0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose26; // 0x16d0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot30; // 0x1790 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose25; // 0x17b0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot29; // 0x1870 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot28; // 0x1890 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot27; // 0x18b0 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot26; // 0x18d0 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot25; // 0x18f0 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot24; // 0x1910 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot23; // 0x1930 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot22; // 0x1950 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose24; // 0x1970 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot21; // 0x1a30 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose23; // 0x1a50 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot20; // 0x1b10 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot19; // 0x1b30 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot18; // 0x1b50 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot17; // 0x1b70 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot16; // 0x1b90 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot15; // 0x1bb0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose22; // 0x1bd0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot14; // 0x1c90 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose21; // 0x1cb0 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose20; // 0x1d70 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot13; // 0x1e30 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose19; // 0x1e50 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot12; // 0x1f10 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose18; // 0x1f30 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot11; // 0x1ff0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose17; // 0x2010 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose16; // 0x20d0 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose15; // 0x2190 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot10; // 0x2250 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose14; // 0x2270 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot9; // 0x2330 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose13; // 0x2350 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot8; // 0x2410 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose12; // 0x2430 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot7; // 0x24f0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose11; // 0x2510 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot6; // 0x25d0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose10; // 0x25f0 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose9; // 0x26b0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot5; // 0x2770 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose8; // 0x2790 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0x2850 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose7; // 0x2870 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0x2930 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x29f0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0x2a10 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0x2ad0 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0x2b90 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x2c50 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x2c70 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x2d30 (0x20)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace1; // 0x2d50 (0x118)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace; // 0x2e68 (0x118)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend; // 0x2f80 (0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose3; // 0x3040 (0x100)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x3140 (0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose7; // 0x3200 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose6; // 0x3228 (0x28)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x3250 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose5; // 0x3270 (0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose2; // 0x3298 (0x100)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer2; // 0x3398 (0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer1; // 0x3460 (0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose4; // 0x3528 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose3; // 0x3550 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x3578 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x35a0 (0x28)
	struct FAnimNode_ResetRoot AnimGraphNodeResetRoot; // 0x35c8 (0xd8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0x36a0 (0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace; // 0x36c0 (0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0x36e0 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x37e0 (0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x3808 (0x100)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x3908 (0xc0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer; // 0x39c8 (0xc8)
	struct FFortAnimInput_TurnInPlace CustomPropertyTurnInPlaceE972EE0A46EDC236B6BA2482472CB2C0; // 0x3a90 (0x78)
	double CustomPropertyPitch61C65E4944F5DB18DC8B6496B9622A88; // 0x3b08 (0x8)
	double CustomPropertyYaw61C65E4944F5DB18DC8B6496B9622A88; // 0x3b10 (0x8)
	double CustomPropertyAimOffsetAlpha61C65E4944F5DB18DC8B6496B9622A88; // 0x3b18 (0x8)

	/* Functions */

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemUpperBody (Has no native function)
	void ItemUpperBody(struct FPoseLink& InPoseUpperBody, struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink& ItemUpperBody); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemIdleAdditive (Has no native function)
	void ItemIdleAdditive(struct FPoseLink& InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemJumpUpAdditive (Has no native function)
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemJumpLoopAdditive (Has no native function)
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemFallAdditive (Has no native function)
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemFallLandAdditive (Has no native function)
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemJetPackStartAdditive (Has no native function)
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemJetPackJumpAdditive (Has no native function)
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemZipLineStartAdditive (Has no native function)
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemLowerBodyMovement (Has no native function)
	void ItemLowerBodyMovement(struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemRelaxedEntry (Has no native function)
	void ItemRelaxedEntry(struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpStart (Has no native function)
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpStartLoop (Has no native function)
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpFallLoop (Has no native function)
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpSurfaceLoop (Has no native function)
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSwimJumpSurfaceEnd (Has no native function)
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemSkeletalControl (Has no native function)
	void ItemSkeletalControl(struct FPoseLink& InPose, struct FPoseLink& ItemSkeletalControl); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemAimOffset (Has no native function)
	void ItemAimOffset(struct FPoseLink& InPoseAimOffset, double& AimOffsetAlpha, double& Yaw, double& Pitch, struct FPoseLink& InPoseUpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemFullBodyOverride (Has no native function)
	void ItemFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ItemPreIK (Has no native function)
	void ItemPreIK(struct FPoseLink& InPosePreIK, struct FPoseLink& ItemPreIK); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_LowerBodyOverride (Has no native function)
	void MovementModeLowerBodyOverride(struct FPoseLink& InLowerBodyPose, struct FPoseLink& InSourcePose, struct FPoseLink& InSourcePosePreUpperBodySlot, struct FPoseLink& MovementModeLowerBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_LocomotionAdditives (Has no native function)
	void MovementModeLocomotionAdditives(struct FPoseLink& InLocomotionAdditivesPose, struct FPoseLink& MovementModeLocomotionAdditives); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_SourcePose (Has no native function)
	void MovementModeSourcePose(struct FPoseLink& InSourcePoseBase, struct FPoseLink& MovementModeSourcePose); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_FullBodyOverride (Has no native function)
	void MovementModeFullBodyOverride(struct FPoseLink& InputPoseFullBody, struct FPoseLink& MovementModeFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_FinalPoseOverride (Has no native function)
	void MovementModeFinalPoseOverride(struct FPoseLink& InFinalPose, struct FPoseLink& MovementModeFinalPoseOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.MovementMode_AimOffset (Has no native function)
	void MovementModeAimOffset(struct FPoseLink& InAimOffsetsPose, struct FPoseLink& InSourcePosePreAimOffsets, struct FPoseLink& MovementModeAimOffset); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.VehicleFullBodyOverride (Has no native function)
	void VehicleFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.VehicleLowerBodyOverride (Has no native function)
	void VehicleLowerBodyOverride(struct FPoseLink& InPoseLowerBodyDefault, struct FPoseLink& InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.VehicleSplitBodyOverride (Has no native function)
	void VehicleSplitBodyOverride(struct FPoseLink& InPoseSplitBody, struct FPoseLink& InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace& TurnInPlace, struct FPoseLink& InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.VehicleFinalPoseOverride (Has no native function)
	void VehicleFinalPoseOverride(struct FPoseLink& InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.FullBodyAimingOffsetsLayer (Has no native function)
	void FullBodyAimingOffsetsLayer(struct FPoseLink& InFullBodyAimOffsetsBasePose, struct FPoseLink& FullBodyAimingOffsetsLayer); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& InPose, struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.ExecuteUbergraph_Player_FullBodyAimOffsets_AnimBP (Has no native function)
	void ExecuteUbergraphPlayerFullBodyAimOffsetsAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

