// AnimBlueprintGeneratedClass /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C
// Size: 0x3738
class UPlayer_Land_AnimBP_C : public UFortPlayerLandingAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x1680 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x1688 (0x28)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x16b0 (0x8)
	struct FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtensionNodeRelevancy; // 0x16b8 (0xa8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x1760 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot20; // 0x1768 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose8; // 0x1788 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot19; // 0x1848 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose7; // 0x1868 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot18; // 0x1928 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot17; // 0x1948 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot16; // 0x1968 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot15; // 0x1988 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool14; // 0x19a8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer27; // 0x19f0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer26; // 0x1a38 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer25; // 0x1a80 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool13; // 0x1ac8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer24; // 0x1b10 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer23; // 0x1b58 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer22; // 0x1ba0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool12; // 0x1be8 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum6; // 0x1c30 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum5; // 0x1c78 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum4; // 0x1cc0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer21; // 0x1d08 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool11; // 0x1d50 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer20; // 0x1d98 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool10; // 0x1de0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer19; // 0x1e28 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum3; // 0x1e70 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer18; // 0x1eb8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool9; // 0x1f00 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer17; // 0x1f48 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool8; // 0x1f90 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer16; // 0x1fd8 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum2; // 0x2020 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool7; // 0x2068 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer15; // 0x20b0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer14; // 0x20f8 (0x48)
	struct FAnimNode_ModifyCurve AnimGraphNodeModifyCurve; // 0x2140 (0x100)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum1; // 0x2240 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer13; // 0x2288 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool6; // 0x22d0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer12; // 0x2318 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer11; // 0x2360 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer10; // 0x23a8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x23f0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer9; // 0x2438 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x2480 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer8; // 0x24c8 (0x48)
	struct FAnimNode_Root AnimGraphNodeRoot14; // 0x2510 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot13; // 0x2530 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot12; // 0x2550 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot11; // 0x2570 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0x2590 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot10; // 0x2650 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0x2670 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot9; // 0x2730 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot8; // 0x2750 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot7; // 0x2770 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0x2790 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x27d8 (0x48)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose3; // 0x2820 (0x10)
	struct FAnimNode_Root AnimGraphNodeRoot6; // 0x2830 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0x2850 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x2898 (0x48)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose2; // 0x28e0 (0x10)
	struct FAnimNode_Root AnimGraphNodeRoot5; // 0x28f0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0x2910 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x2958 (0x48)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose1; // 0x29a0 (0x10)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0x29b0 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0x29d0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x2a90 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0x2ab0 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x2b70 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x2c30 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x2c50 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x2d10 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x2d30 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x2df0 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult6; // 0x2e10 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult5; // 0x2e38 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult4; // 0x2e60 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult3; // 0x2e88 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult2; // 0x2eb0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0x2ed8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x2f00 (0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer2; // 0x2f28 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult3; // 0x2ff0 (0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer1; // 0x3010 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult2; // 0x30d8 (0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer; // 0x30f8 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x31c0 (0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLayer; // 0x31e0 (0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x32a8 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend; // 0x32f0 (0xe0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x33d0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x3418 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x3460 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum; // 0x34a8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x34f0 (0x48)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend; // 0x3538 (0xc0)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose; // 0x35f8 (0x10)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x3608 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x3650 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x3670 (0xc8)

	/* Functions */

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemUpperBody (Has no native function)
	void ItemUpperBody(struct FPoseLink& InPoseUpperBody, struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink& ItemUpperBody); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemIdleAdditive (Has no native function)
	void ItemIdleAdditive(struct FPoseLink& InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemJumpUpAdditive (Has no native function)
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemJumpLoopAdditive (Has no native function)
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemFallAdditive (Has no native function)
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemFallLandAdditive (Has no native function)
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemJetPackStartAdditive (Has no native function)
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemJetPackJumpAdditive (Has no native function)
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemZipLineStartAdditive (Has no native function)
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemLowerBodyMovement (Has no native function)
	void ItemLowerBodyMovement(struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemRelaxedEntry (Has no native function)
	void ItemRelaxedEntry(struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemSwimJumpStart (Has no native function)
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemSwimJumpStartLoop (Has no native function)
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemSwimJumpFallLoop (Has no native function)
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemSwimJumpSurfaceLoop (Has no native function)
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemSwimJumpSurfaceEnd (Has no native function)
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemSkeletalControl (Has no native function)
	void ItemSkeletalControl(struct FPoseLink& InPose, struct FPoseLink& ItemSkeletalControl); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemAimOffset (Has no native function)
	void ItemAimOffset(struct FPoseLink& InPoseAimOffset, double& AimOffsetAlpha, double& Yaw, double& Pitch, struct FPoseLink& InPoseUpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemFullBodyOverride (Has no native function)
	void ItemFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ItemPreIK (Has no native function)
	void ItemPreIK(struct FPoseLink& InPosePreIK, struct FPoseLink& ItemPreIK); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.OnLandingBecomesRelevant (Has no native function)
	void OnLandingBecomesRelevant(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.OnLandingUpdate (Has no native function)
	void OnLandingUpdate(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node, struct FAnimationStateResultReference& CallFuncConvertToAnimationStateResultAnimationState, enum EAnimNodeReferenceConversionResult& CallFuncConvertToAnimationStateResultResult, bool& K2NodeSwitchEnumCmpSuccess, float& CallFuncGetRelevantAnimTimeRemainingReturnValue, bool& CallFuncGreaterDoubleDoubleReturnValue, double& CallFuncGreaterDoubleDoubleBImplicitCast); // (Public | HasOutParms | HasDefaults | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.ExecuteUbergraph_Player_Land_AnimBP (Has no native function)
	void ExecuteUbergraphPlayerLandAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

