// AnimBlueprintGeneratedClass /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C
// Size: 0x9362
class UPlayer_SkyDiveAndGlide_AnimBP_C : public UFortSkydivingAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x840 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x848 (0x42c)
	unsigned char unreflected_c74[0x4]; // 0xc74 (0x4) 
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0xc78 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0xc80 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0xc88 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeLocalRefPose3; // 0xca8 (0x10)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer20; // 0xcb8 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive39; // 0xd00 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive38; // 0xdc8 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer115; // 0xe90 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer114; // 0xf00 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive37; // 0xf70 (0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer19; // 0x1038 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer18; // 0x1080 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive36; // 0x10c8 (0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer17; // 0x1190 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer16; // 0x11d8 (0x48)
	struct FAnimNode_BlendListByInt AnimGraphNodeBlendListByInt4; // 0x1220 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult35; // 0x1268 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine12; // 0x1288 (0xc8)
	struct FAnimNode_RefPose AnimGraphNodeLocalRefPose2; // 0x1350 (0x10)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum39; // 0x1360 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer113; // 0x13a8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer112; // 0x1418 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive35; // 0x1488 (0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum38; // 0x1550 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer111; // 0x1598 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive34; // 0x1608 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer110; // 0x16d0 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive33; // 0x1740 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer109; // 0x1808 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer108; // 0x1878 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer107; // 0x18e8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer106; // 0x1958 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer105; // 0x19c8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer104; // 0x1a38 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer103; // 0x1aa8 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive32; // 0x1b18 (0xc8)
	struct FAnimNode_BlendListByInt AnimGraphNodeBlendListByInt3; // 0x1be0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult34; // 0x1c28 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine11; // 0x1c48 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0x1d10 (0x100)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x1e10 (0x100)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult50; // 0x1f10 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult49; // 0x1f38 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult48; // 0x1f60 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult47; // 0x1f88 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult46; // 0x1fb0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult45; // 0x1fd8 (0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend10; // 0x2000 (0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer102; // 0x20c0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer101; // 0x2130 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive31; // 0x21a0 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive30; // 0x2268 (0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend9; // 0x2330 (0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer100; // 0x23f0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer99; // 0x2460 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x24d0 (0x48)
	struct FAnimNode_BlendListByInt AnimGraphNodeBlendListByInt2; // 0x2518 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer98; // 0x2560 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer97; // 0x25d0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer96; // 0x2640 (0x70)
	struct FAnimNode_BlendListByInt AnimGraphNodeBlendListByInt1; // 0x26b0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer15; // 0x26f8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer14; // 0x2740 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer13; // 0x2788 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult33; // 0x27d0 (0x20)
	struct FAnimNode_BlendListByInt AnimGraphNodeBlendListByInt; // 0x27f0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer12; // 0x2838 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer11; // 0x2880 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer10; // 0x28c8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult32; // 0x2910 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult44; // 0x2930 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult43; // 0x2958 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult42; // 0x2980 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult41; // 0x29a8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult40; // 0x29d0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult39; // 0x29f8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult38; // 0x2a20 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult37; // 0x2a48 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult36; // 0x2a70 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult35; // 0x2a98 (0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer95; // 0x2ac0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer94; // 0x2b30 (0x70)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend8; // 0x2ba0 (0xc0)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive29; // 0x2c60 (0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend7; // 0x2d28 (0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer93; // 0x2de8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer92; // 0x2e58 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive28; // 0x2ec8 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer91; // 0x2f90 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult31; // 0x3000 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer90; // 0x3020 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum37; // 0x3090 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer89; // 0x30d8 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum36; // 0x3148 (0x48)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend6; // 0x3190 (0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer88; // 0x3250 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer87; // 0x32c0 (0x70)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend5; // 0x3330 (0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer86; // 0x33f0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer85; // 0x3460 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive27; // 0x34d0 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive26; // 0x3598 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer84; // 0x3660 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult30; // 0x36d0 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeLocalRefPose1; // 0x36f0 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult29; // 0x3700 (0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive25; // 0x3720 (0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose3; // 0x37e8 (0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer83; // 0x3810 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult28; // 0x3880 (0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive24; // 0x38a0 (0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x3968 (0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer82; // 0x3990 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult27; // 0x3a00 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine10; // 0x3a20 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult26; // 0x3ae8 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult34; // 0x3b08 (0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer81; // 0x3b30 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer80; // 0x3ba0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer79; // 0x3c10 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer78; // 0x3c80 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer77; // 0x3cf0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer76; // 0x3d60 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer75; // 0x3dd0 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum35; // 0x3e40 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum34; // 0x3e88 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum33; // 0x3ed0 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer74; // 0x3f18 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer73; // 0x3f88 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer72; // 0x3ff8 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive23; // 0x4068 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive22; // 0x4130 (0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum32; // 0x41f8 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum31; // 0x4240 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum30; // 0x4288 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer71; // 0x42d0 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult25; // 0x4340 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer70; // 0x4360 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer69; // 0x43d0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer68; // 0x4440 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer67; // 0x44b0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer66; // 0x4520 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer65; // 0x4590 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer64; // 0x4600 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer63; // 0x4670 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum29; // 0x46e0 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum28; // 0x4728 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum27; // 0x4770 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer62; // 0x47b8 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive21; // 0x4828 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer61; // 0x48f0 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum26; // 0x4960 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum25; // 0x49a8 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive20; // 0x49f0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer60; // 0x4ab8 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum24; // 0x4b28 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult24; // 0x4b70 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine9; // 0x4b90 (0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum23; // 0x4c58 (0x48)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult33; // 0x4ca0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult32; // 0x4cc8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult31; // 0x4cf0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult30; // 0x4d18 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult29; // 0x4d40 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult28; // 0x4d68 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult27; // 0x4d90 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult26; // 0x4db8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult25; // 0x4de0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult24; // 0x4e08 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult23; // 0x4e30 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult22; // 0x4e58 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult21; // 0x4e80 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult20; // 0x4ea8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult19; // 0x4ed0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult18; // 0x4ef8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult17; // 0x4f20 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult16; // 0x4f48 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult15; // 0x4f70 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult14; // 0x4f98 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult13; // 0x4fc0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult12; // 0x4fe8 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer9; // 0x5010 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult23; // 0x5058 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer8; // 0x5078 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult22; // 0x50c0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0x50e0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult21; // 0x5128 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0x5148 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult20; // 0x5190 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose1; // 0x51b0 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult19; // 0x51c0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine8; // 0x51e0 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult18; // 0x52a8 (0x20)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum22; // 0x52c8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0x5310 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x5358 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x53a0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x53e8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x5430 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult17; // 0x5478 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer59; // 0x5498 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer58; // 0x5508 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer57; // 0x5578 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer56; // 0x55e8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer55; // 0x5658 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum21; // 0x56c8 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum20; // 0x5710 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum19; // 0x5758 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult16; // 0x57a0 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose; // 0x57c0 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult15; // 0x57d0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine7; // 0x57f0 (0xc8)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult11; // 0x58b8 (0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive19; // 0x58e0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer54; // 0x59a8 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult14; // 0x5a18 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine6; // 0x5a38 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive18; // 0x5b00 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer53; // 0x5bc8 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive17; // 0x5c38 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer52; // 0x5d00 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer51; // 0x5d70 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult13; // 0x5de0 (0x20)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum18; // 0x5e00 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer50; // 0x5e48 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer49; // 0x5eb8 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive16; // 0x5f28 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive15; // 0x5ff0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer48; // 0x60b8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer47; // 0x6128 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult12; // 0x6198 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine5; // 0x61b8 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive14; // 0x6280 (0xc8)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult10; // 0x6348 (0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive13; // 0x6370 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer46; // 0x6438 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive12; // 0x64a8 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer45; // 0x6570 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer44; // 0x65e0 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult11; // 0x6650 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer43; // 0x6670 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive11; // 0x66e0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer42; // 0x67a8 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult10; // 0x6818 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine4; // 0x6838 (0xc8)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult9; // 0x6900 (0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer41; // 0x6928 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer40; // 0x6998 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer39; // 0x6a08 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer38; // 0x6a78 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer37; // 0x6ae8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer36; // 0x6b58 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer35; // 0x6bc8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer34; // 0x6c38 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer33; // 0x6ca8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer32; // 0x6d18 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer31; // 0x6d88 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer30; // 0x6df8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer29; // 0x6e68 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer28; // 0x6ed8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer27; // 0x6f48 (0x70)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend4; // 0x6fb8 (0xc0)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum17; // 0x7078 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum16; // 0x70c0 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum15; // 0x7108 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum14; // 0x7150 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum13; // 0x7198 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum12; // 0x71e0 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive10; // 0x7228 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive9; // 0x72f0 (0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum11; // 0x73b8 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum10; // 0x7400 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum9; // 0x7448 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer26; // 0x7490 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult9; // 0x7500 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer25; // 0x7520 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer24; // 0x7590 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer23; // 0x7600 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer22; // 0x7670 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer21; // 0x76e0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer20; // 0x7750 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer19; // 0x77c0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer18; // 0x7830 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum8; // 0x78a0 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum7; // 0x78e8 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum6; // 0x7930 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer17; // 0x7978 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive8; // 0x79e8 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer16; // 0x7ab0 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum5; // 0x7b20 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum4; // 0x7b68 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive7; // 0x7bb0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer15; // 0x7c78 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum3; // 0x7ce8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult8; // 0x7d30 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine3; // 0x7d50 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult7; // 0x7e18 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult8; // 0x7e38 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult7; // 0x7e60 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult6; // 0x7e88 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult5; // 0x7eb0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult4; // 0x7ed8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult3; // 0x7f00 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult2; // 0x7f28 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0x7f50 (0x28)
	struct FAnimNode_RefPose AnimGraphNodeLocalRefPose; // 0x7f78 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult6; // 0x7f88 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer14; // 0x7fa8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer13; // 0x8018 (0x70)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend3; // 0x8088 (0xc0)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive6; // 0x8148 (0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend2; // 0x8210 (0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer12; // 0x82d0 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer11; // 0x8340 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive5; // 0x83b0 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer10; // 0x8478 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult5; // 0x84e8 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer9; // 0x8508 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum2; // 0x8578 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer8; // 0x85c0 (0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum1; // 0x8630 (0x48)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend1; // 0x8678 (0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer7; // 0x8738 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer6; // 0x87a8 (0x70)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend; // 0x8818 (0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer5; // 0x88d8 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer4; // 0x8948 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive4; // 0x89b8 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive3; // 0x8a80 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer3; // 0x8b48 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult4; // 0x8bb8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x8bd8 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer2; // 0x8c20 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x8c90 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive2; // 0x8d00 (0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum; // 0x8dc8 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive1; // 0x8e10 (0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x8ed8 (0x28)
	struct FAnimNode_StateResult AnimGraphNodeStateResult3; // 0x8f00 (0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive; // 0x8f20 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x8fe8 (0x70)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x9058 (0x28)
	struct FAnimNode_StateResult AnimGraphNodeStateResult2; // 0x9080 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine2; // 0x90a0 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x9168 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine1; // 0x9188 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x9250 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x9270 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x9298 (0xc8)
	bool ParaGlideTriggerAnim; // 0x9360 (0x1)
	bool BlockAnimRule; // 0x9361 (0x1)

	/* Functions */

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C.BlueprintUpdateAnimation (Has no native function)
	void BlueprintUpdateAnimation(float& DeltaTimeX); // (Event | Public | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C.BlueprintInitializeAnimation (Has no native function)
	void BlueprintInitializeAnimation(); // (Event | Public | BlueprintEvent)

