// AnimBlueprintGeneratedClass /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C
// Size: 0x1c70
class UPlayer_Goop_AnimBP_C : public UFortGoopAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x670 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x678 (0x50)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x6c8 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x6d0 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot20; // 0x6d8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose8; // 0x6f8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot19; // 0x7b8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose7; // 0x7d8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot18; // 0x898 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot17; // 0x8b8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot16; // 0x8d8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot15; // 0x8f8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot14; // 0x918 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x938 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x980 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer8; // 0x9c8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0xa10 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0xa58 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0xaa0 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum1; // 0xae8 (0x48)
	struct FAnimNode_Root AnimGraphNodeRoot13; // 0xb30 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0xb50 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0xb98 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0xbe0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0xc28 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0xc70 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0xcb8 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum; // 0xd00 (0x48)
	struct FAnimNode_Root AnimGraphNodeRoot12; // 0xd48 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot11; // 0xd68 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0xd88 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot10; // 0xe48 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0xe68 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot9; // 0xf28 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot8; // 0xf48 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot7; // 0xf68 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot6; // 0xf88 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot5; // 0xfa8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0xfc8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0xfe8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x10a8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0x10c8 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x1188 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x1248 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x1268 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x1328 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x1348 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x1408 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0x1428 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x1450 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x1478 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive2; // 0x14c0 (0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x1588 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer2; // 0x15d0 (0x70)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x1640 (0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive1; // 0x1668 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x1730 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x17a0 (0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer1; // 0x17c0 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive; // 0x1888 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x1950 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x19c0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x19e0 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x1aa8 (0x100)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer; // 0x1ba8 (0xc8)

	/* Functions */

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemUpperBody (Has no native function)
	void ItemUpperBody(struct FPoseLink& InPoseUpperBody, struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink& ItemUpperBody); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemIdleAdditive (Has no native function)
	void ItemIdleAdditive(struct FPoseLink& InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemJumpUpAdditive (Has no native function)
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemJumpLoopAdditive (Has no native function)
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemFallAdditive (Has no native function)
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemFallLandAdditive (Has no native function)
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemJetPackStartAdditive (Has no native function)
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemJetPackJumpAdditive (Has no native function)
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemZipLineStartAdditive (Has no native function)
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemLowerBodyMovement (Has no native function)
	void ItemLowerBodyMovement(struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemRelaxedEntry (Has no native function)
	void ItemRelaxedEntry(struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemSwimJumpStart (Has no native function)
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemSwimJumpStartLoop (Has no native function)
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemSwimJumpFallLoop (Has no native function)
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemSwimJumpSurfaceLoop (Has no native function)
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemSwimJumpSurfaceEnd (Has no native function)
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemSkeletalControl (Has no native function)
	void ItemSkeletalControl(struct FPoseLink& InPose, struct FPoseLink& ItemSkeletalControl); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemAimOffset (Has no native function)
	void ItemAimOffset(struct FPoseLink& InPoseAimOffset, double& AimOffsetAlpha, double& Yaw, double& Pitch, struct FPoseLink& InPoseUpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemFullBodyOverride (Has no native function)
	void ItemFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ItemPreIK (Has no native function)
	void ItemPreIK(struct FPoseLink& InPosePreIK, struct FPoseLink& ItemPreIK); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.ExecuteUbergraph_Player_Goop_AnimBP (Has no native function)
	void ExecuteUbergraphPlayerGoopAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

