// WidgetBlueprintGeneratedClass /Game/UI/Login/AccountSelect/PlayedBeforeSelect.PlayedBeforeSelect_C
// Size: 0x420
class UPlayedBeforeSelect_C : public UFortPlayedBeforeSelect
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x3d8 (0x8)
	class UWidgetAnimation* Intro; // 0x3e0 (0x8)
	class UCommonTextBlock* CommonTextBlock1; // 0x3e8 (0x8)
	class UCommonTextBlock* CommonTextBlock6; // 0x3f0 (0x8)
	class UCommonWidgetSwitcherLegacy* CommonWidgetSwitcherInviteOnly; // 0x3f8 (0x8)
	class UInviteEventTitle_C* InviteEventTitle; // 0x400 (0x8)
	class UWidgetSwitcher* LoginTypeSwitcher; // 0x408 (0x8)
	class USafeZone* SafeZone0; // 0x410 (0x8)
	class USignInWidget_C* SignInWidget; // 0x418 (0x8)

	/* Functions */

	// Function /Game/UI/Login/AccountSelect/PlayedBeforeSelect.PlayedBeforeSelect_C.OnActivated_1 (Has no native function)
	void OnActivated1(); // (BlueprintCallable | BlueprintEvent)

	// Function /Game/UI/Login/AccountSelect/PlayedBeforeSelect.PlayedBeforeSelect_C.ExecuteUbergraph_PlayedBeforeSelect (Has no native function)
	void ExecuteUbergraphPlayedBeforeSelect(int& EntryPoint, class UUMGSequencePlayer*& CallFuncPlayAnimationReturnValue); // (Final | 0x00008000)
};

