// AnimBlueprintGeneratedClass /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C
// Size: 0x4868
class UPlayer_LowerBodyJog_AnimBP_C : public UFortWalkAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0xb50 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0xb58 (0x130)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0xc88 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0xc90 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot23; // 0xc98 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose10; // 0xcb8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot22; // 0xd78 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose9; // 0xd98 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot21; // 0xe58 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot20; // 0xe78 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot19; // 0xe98 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot18; // 0xeb8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot17; // 0xed8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot16; // 0xef8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot15; // 0xf18 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot14; // 0xf38 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose8; // 0xf58 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot13; // 0x1018 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose7; // 0x1038 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot12; // 0x10f8 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot11; // 0x1118 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot10; // 0x1138 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot9; // 0x1158 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot8; // 0x1178 (0x20)
	struct FAnimNode_Root AnimGraphNodeRoot7; // 0x1198 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0x11b8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot6; // 0x1278 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0x1298 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0x1358 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot5; // 0x1418 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0x1438 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0x14f8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x1518 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x15d8 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer8; // 0x15f8 (0x70)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x1668 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool8; // 0x1688 (0x48)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone9; // 0x16d0 (0xa8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer7; // 0x1778 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer6; // 0x17e8 (0x70)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x1858 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer5; // 0x1878 (0x70)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone8; // 0x18e8 (0xa8)
	struct FFortAnimNode_SpeedWarping FortAnimGraphNodeSpeedWarping2; // 0x1990 (0x200)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace6; // 0x1b90 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace6; // 0x1bb0 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool7; // 0x1bd0 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer4; // 0x1c18 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer3; // 0x1c88 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool6; // 0x1cf8 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer2; // 0x1d40 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x1db0 (0x48)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x1df8 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult23; // 0x1e18 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult22; // 0x1e40 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult21; // 0x1e68 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult20; // 0x1e90 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult19; // 0x1eb8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult18; // 0x1ee0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult17; // 0x1f08 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult16; // 0x1f30 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult15; // 0x1f58 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult14; // 0x1f80 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult13; // 0x1fa8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult12; // 0x1fd0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult11; // 0x1ff8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult10; // 0x2020 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult9; // 0x2048 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult8; // 0x2070 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult7; // 0x2098 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult6; // 0x20c0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult5; // 0x20e8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult4; // 0x2110 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult3; // 0x2138 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult2; // 0x2160 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0x2188 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x21b0 (0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum5; // 0x21d8 (0x48)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone7; // 0x2220 (0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer24; // 0x22c8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer23; // 0x2310 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer22; // 0x2358 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer21; // 0x23a0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult7; // 0x23e8 (0x20)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum4; // 0x2408 (0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace5; // 0x2450 (0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace5; // 0x2470 (0x20)
	struct FFortAnimNode_SpeedWarping FortAnimGraphNodeSpeedWarping1; // 0x2490 (0x200)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer20; // 0x2690 (0x48)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone6; // 0x26d8 (0xa8)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone5; // 0x2780 (0xa8)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone4; // 0x2828 (0xa8)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone3; // 0x28d0 (0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer19; // 0x2978 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer18; // 0x29c0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer17; // 0x2a08 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult6; // 0x2a50 (0x20)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum3; // 0x2a70 (0x48)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone2; // 0x2ab8 (0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer16; // 0x2b60 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer15; // 0x2ba8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer14; // 0x2bf0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer13; // 0x2c38 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult5; // 0x2c80 (0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace4; // 0x2ca0 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace4; // 0x2cc0 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone3; // 0x2ce0 (0x128)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum2; // 0x2e08 (0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum1; // 0x2e50 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer12; // 0x2e98 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer11; // 0x2ee0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer10; // 0x2f28 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer9; // 0x2f70 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer8; // 0x2fb8 (0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend; // 0x3000 (0xe0)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone1; // 0x30e0 (0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0x3188 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0x31d0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0x3218 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult4; // 0x3260 (0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace3; // 0x3280 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace3; // 0x32a0 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone2; // 0x32c0 (0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace2; // 0x33e8 (0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace2; // 0x3408 (0x20)
	struct FFortAnimNode_SpeedWarping FortAnimGraphNodeSpeedWarping; // 0x3428 (0x200)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x3628 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x3670 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x36b8 (0x48)
	struct FAnimNode_TwoWayBlend AnimGraphNodeTwoWayBlend; // 0x3700 (0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x37c0 (0x48)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone; // 0x3808 (0xa8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult3; // 0x38b0 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x38d0 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x38f8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x3940 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x3988 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive1; // 0x39d0 (0xc8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace1; // 0x3a98 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace1; // 0x3ab8 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone1; // 0x3ad8 (0x128)
	struct FAnimNode_StateResult AnimGraphNodeStateResult2; // 0x3c00 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x3c20 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x3c48 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x3c70 (0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace; // 0x3cb8 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0x3cd8 (0x20)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone; // 0x3cf8 (0x128)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x3e20 (0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer2; // 0x3e40 (0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer1; // 0x3f08 (0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLinkedAnimLayer; // 0x3fd0 (0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNodeLayer; // 0x4098 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x4160 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x41d0 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x4240 (0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive; // 0x4288 (0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNodeBlendListByEnum; // 0x4350 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x4398 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x43e0 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x4400 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0x44c8 (0x100)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x45c8 (0x100)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x46c8 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x4788 (0xc0)
	double JogStartPosition; // 0x4848 (0x8)
	double CrouchPlayRate; // 0x4850 (0x8)
	double PivotAnimBlendTime; // 0x4858 (0x8)
	double StartAnimBlendTime; // 0x4860 (0x8)

	/* Functions */

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemUpperBody (Has no native function)
	void ItemUpperBody(struct FPoseLink& InPoseUpperBody, struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink& ItemUpperBody); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemIdleAdditive (Has no native function)
	void ItemIdleAdditive(struct FPoseLink& InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemJumpUpAdditive (Has no native function)
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemJumpLoopAdditive (Has no native function)
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemFallAdditive (Has no native function)
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemFallLandAdditive (Has no native function)
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemJetPackStartAdditive (Has no native function)
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemJetPackJumpAdditive (Has no native function)
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemZipLineStartAdditive (Has no native function)
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemLowerBodyMovement (Has no native function)
	void ItemLowerBodyMovement(struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemRelaxedEntry (Has no native function)
	void ItemRelaxedEntry(struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemSwimJumpStart (Has no native function)
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemSwimJumpStartLoop (Has no native function)
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemSwimJumpFallLoop (Has no native function)
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemSwimJumpSurfaceLoop (Has no native function)
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemSwimJumpSurfaceEnd (Has no native function)
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemSkeletalControl (Has no native function)
	void ItemSkeletalControl(struct FPoseLink& InPose, struct FPoseLink& ItemSkeletalControl); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemAimOffset (Has no native function)
	void ItemAimOffset(struct FPoseLink& InPoseAimOffset, double& AimOffsetAlpha, double& Yaw, double& Pitch, struct FPoseLink& InPoseUpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemFullBodyOverride (Has no native function)
	void ItemFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ItemPreIK (Has no native function)
	void ItemPreIK(struct FPoseLink& InPosePreIK, struct FPoseLink& ItemPreIK); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.Movement_HeavyWeapon (Has no native function)
	void MovementHeavyWeapon(struct FPoseLink& MovementHeavyWeapon); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.Movement_Crouching (Has no native function)
	void MovementCrouching(struct FPoseLink& MovementCrouching); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.Movement_Standing (Has no native function)
	void MovementStanding(struct FPoseLink& MovementStanding); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& UpperBody, struct FPoseLink& PreUpperBodySlot, struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.ExecuteUbergraph_Player_LowerBodyJog_AnimBP (Has no native function)
	void ExecuteUbergraphPlayerLowerBodyJogAnimBP(int& EntryPoint); // (Final | 0x00008000)
};

