// Class /Script/Engine.PrimitiveComponent
// Size: 0x540
class UPrimitiveComponent : public USceneComponent
{
	unsigned char unreflected_2a0[0x10]; // 0x2a0 (0x10) 
	float MinDrawDistance; // 0x2b0 (0x4)
	float LDMaxDrawDistance; // 0x2b4 (0x4)
	float CachedMaxDrawDistance; // 0x2b8 (0x4)
	struct TEnumAsByte<ESceneDepthPriorityGroup> DepthPriorityGroup; // 0x2bc (0x1)
	struct TEnumAsByte<ESceneDepthPriorityGroup> ViewOwnerDepthPriorityGroup; // 0x2bd (0x1)
	struct TEnumAsByte<EIndirectLightingCacheQuality> IndirectLightingCacheQuality; // 0x2be (0x1)
	enum ELightmapType LightmapType; // 0x2bf (0x1)
	enum EHLODBatchingPolicy HLODBatchingPolicy; // 0x2c0 (0x1)
	unsigned char bEnableAutoLODGeneration; // 0x2c1 (0x1)
	unsigned char bIsActorTextureStreamingBuiltData; // 0x2c1 (0x1)
	unsigned char bIsValidTextureStreamingBuiltData; // 0x2c1 (0x1)
	unsigned char bNeverDistanceCull; // 0x2c1 (0x1)
	unsigned char bAlwaysCreatePhysicsState; // 0x2c2 (0x1)
	unsigned char bGenerateOverlapEvents; // 0x2c2 (0x1)
	unsigned char bMultiBodyOverlap; // 0x2c2 (0x1)
	unsigned char bTraceComplexOnMove; // 0x2c2 (0x1)
	unsigned char bReturnMaterialOnMove; // 0x2c2 (0x1)
	unsigned char bUseViewOwnerDepthPriorityGroup; // 0x2c2 (0x1)
	unsigned char bAllowCullDistanceVolume; // 0x2c2 (0x1)
	unsigned char bVisibleInReflectionCaptures; // 0x2c3 (0x1)
	unsigned char bVisibleInRealTimeSkyCaptures; // 0x2c3 (0x1)
	unsigned char bVisibleInRayTracing; // 0x2c3 (0x1)
	unsigned char bRenderInMainPass; // 0x2c3 (0x1)
	unsigned char bRenderInDepthPass; // 0x2c3 (0x1)
	unsigned char bReceivesDecals; // 0x2c3 (0x1)
	unsigned char bOwnerNoSee; // 0x2c3 (0x1)
	unsigned char bOnlyOwnerSee; // 0x2c3 (0x1)
	unsigned char bTreatAsBackgroundForOcclusion; // 0x2c4 (0x1)
	unsigned char bUseAsOccluder; // 0x2c4 (0x1)
	unsigned char bSelectable; // 0x2c4 (0x1)
	unsigned char bForceMipStreaming; // 0x2c4 (0x1)
	unsigned char bHasPerInstanceHitProxies; // 0x2c4 (0x1)
	unsigned char CastShadow; // 0x2c4 (0x1)
	unsigned char bEmissiveLightSource; // 0x2c4 (0x1)
	unsigned char bAffectDynamicIndirectLighting; // 0x2c4 (0x1)
	unsigned char bAffectIndirectLightingWhileHidden; // 0x2c5 (0x1)
	unsigned char bAffectDistanceFieldLighting; // 0x2c5 (0x1)
	unsigned char bCastDynamicShadow; // 0x2c5 (0x1)
	unsigned char bCastStaticShadow; // 0x2c5 (0x1)
	unsigned char bCastVolumetricTranslucentShadow; // 0x2c5 (0x1)
	unsigned char bCastContactShadow; // 0x2c5 (0x1)
	unsigned char bSelfShadowOnly; // 0x2c5 (0x1)
	unsigned char bCastFarShadow; // 0x2c5 (0x1)
	unsigned char bCastInsetShadow; // 0x2c6 (0x1)
	unsigned char bCastCinematicShadow; // 0x2c6 (0x1)
	unsigned char bCastHiddenShadow; // 0x2c6 (0x1)
	unsigned char bCastShadowAsTwoSided; // 0x2c6 (0x1)
	unsigned char bLightAsIfStatic; // 0x2c6 (0x1)
	unsigned char bLightAttachmentsAsGroup; // 0x2c6 (0x1)
	unsigned char bExcludeFromLightAttachmentGroup; // 0x2c6 (0x1)
	unsigned char bReceiveMobileCSMShadows; // 0x2c6 (0x1)
	unsigned char bSingleSampleShadowFromStationaryLights; // 0x2c7 (0x1)
	unsigned char bIgnoreRadialImpulse; // 0x2c7 (0x1)
	unsigned char bIgnoreRadialForce; // 0x2c7 (0x1)
	unsigned char bApplyImpulseOnDamage; // 0x2c7 (0x1)
	unsigned char bReplicatePhysicsToAutonomousProxy; // 0x2c7 (0x1)
	unsigned char bFillCollisionUnderneathForNavmesh; // 0x2c7 (0x1)
	unsigned char AlwaysLoadOnClient; // 0x2c7 (0x1)
	unsigned char AlwaysLoadOnServer; // 0x2c7 (0x1)
	unsigned char bUseEditorCompositing; // 0x2c8 (0x1)
	unsigned char bIsBeingMovedByEditor; // 0x2c8 (0x1)
	unsigned char bRenderCustomDepth; // 0x2c8 (0x1)
	unsigned char bVisibleInSceneCaptureOnly; // 0x2c8 (0x1)
	unsigned char bHiddenInSceneCapture; // 0x2c8 (0x1)
	unsigned char bRayTracingFarField; // 0x2c8 (0x1)
	unsigned char bHasNoStreamableTextures; // 0x2c8 (0x1)
	struct TEnumAsByte<EHasCustomNavigableGeometry> bHasCustomNavigableGeometry; // 0x2c9 (0x1)
	unsigned char unreflected_2ca[0x1]; // 0x2ca (0x1) 
	struct TEnumAsByte<ECanBeCharacterBase> CanCharacterStepUpOn; // 0x2cb (0x1)
	struct FLightingChannels LightingChannels; // 0x2cc (0x1)
	unsigned char unreflected_2cd[0x3]; // 0x2cd (0x3) 
	int RayTracingGroupId; // 0x2d0 (0x4)
	int VisibilityId; // 0x2d4 (0x4)
	int CustomDepthStencilValue; // 0x2d8 (0x4)
	unsigned char unreflected_2dc[0x4]; // 0x2dc (0x4) 
	struct FCustomPrimitiveData CustomPrimitiveData; // 0x2e0 (0x10)
	struct FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x2f0 (0x10)
	unsigned char unreflected_300[0x8]; // 0x300 (0x8) 
	int TranslucencySortPriority; // 0x308 (0x4)
	float TranslucencySortDistanceOffset; // 0x30c (0x4)
	struct TArray<class URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x310 (0x10)
	int8_t VirtualTextureLodBias; // 0x320 (0x1)
	int8_t VirtualTextureCullMips; // 0x321 (0x1)
	int8_t VirtualTextureMinCoverage; // 0x322 (0x1)
	enum ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x323 (0x1)
	unsigned char unreflected_324[0x10]; // 0x324 (0x10) 
	float BoundsScale; // 0x334 (0x4)
	unsigned char unreflected_338[0x10]; // 0x338 (0x10) 
	struct TArray<class AActor*> MoveIgnoreActors; // 0x348 (0x10)
	struct TArray<class UPrimitiveComponent*> MoveIgnoreComponents; // 0x358 (0x10)
	unsigned char unreflected_368[0x10]; // 0x368 (0x10) 
	struct FBodyInstance BodyInstance; // 0x378 (0x188)
	struct FMulticastSparseDelegate OnComponentHit; // 0x500 (0x1)
	struct FMulticastSparseDelegate OnComponentBeginOverlap; // 0x501 (0x1)
	struct FMulticastSparseDelegate OnComponentEndOverlap; // 0x502 (0x1)
	struct FMulticastSparseDelegate OnComponentWake; // 0x503 (0x1)
	struct FMulticastSparseDelegate OnComponentSleep; // 0x504 (0x1)
	unsigned char unreflected_505[0x1]; // 0x505 (0x1) 
	struct FMulticastSparseDelegate OnComponentPhysicsStateChanged; // 0x506 (0x1)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x507 (0x1)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x508 (0x1)
	struct FMulticastSparseDelegate OnClicked; // 0x509 (0x1)
	struct FMulticastSparseDelegate OnReleased; // 0x50a (0x1)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x50b (0x1)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x50c (0x1)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x50d (0x1)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x50e (0x1)
	enum ERayTracingGroupCullingPriority RayTracingGroupCullingPriority; // 0x50f (0x1)
	enum ERendererStencilMask CustomDepthStencilWriteMask; // 0x510 (0x1)
	unsigned char unreflected_511[0x1f]; // 0x511 (0x1f) 
	unsigned char ExcludeFromHLODLevels; // 0x530 (0x1)
	unsigned char unreflected_531[0x7]; // 0x531 (0x7) 
	class UPrimitiveComponent* LODParentPrimitive; // 0x538 (0x8)

	/* Functions */

	// Function /Script/Engine.PrimitiveComponent.WasRecentlyRendered (Underlying native function: WasRecentlyRendered 0x9c17960)
	bool WasRecentlyRendered(float& Tolerance); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/Engine.PrimitiveComponent.WakeRigidBody (Underlying native function: WakeRigidBody 0x9c178dc)
	void WakeRigidBody(struct FName& BoneName); // (Native | Public | BlueprintCallable)

	// Function /Script/Engine.PrimitiveComponent.WakeAllRigidBodies (Underlying native function: WakeAllRigidBodies 0x8ddee5c)
	void WakeAllRigidBodies(); // (Native | Public | BlueprintCallable)

	// Function /Script/Engine.PrimitiveComponent.SetWalkableSlopeOverride (Underlying native function: SetWalkableSlopeOverride 0x9c170b4)
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride& NewOverride); // (Native | Public | HasOutParms | BlueprintCallable)

