// Class /Script/Procedural.ProceduralScatterSettings
// Size: 0x1d8
class UProceduralScatterSettings : public UObject
{
	class UProceduralScatterContentSettings* Content; // 0x28 (0x8)
	unsigned char bContentVariationsModifiersEnabled; // 0x30 (0x1)
	unsigned char unreflected_31[0x7]; // 0x31 (0x7) 
	struct FProceduralContentVariationsModifiers ContentVariationsModifiers; // 0x38 (0x10)
	struct TArray<struct FName> SetPointTags; // 0x48 (0x10)
	float CollisionRadius; // 0x58 (0x4)
	unsigned char bAutomaticCollisionRadius; // 0x5c (0x1)
	unsigned char bUseSphericalBoundsForAutomaticCollisionRadius; // 0x5c (0x1)
	unsigned char unreflected_5d[0x3]; // 0x5d (0x3) 
	float AutomaticCollisionRadiusScaleFactor; // 0x60 (0x4)
	int DistributionSeed; // 0x64 (0x4)
	unsigned char bDensityModifiersEnabled; // 0x68 (0x1)
	unsigned char unreflected_69[0x7]; // 0x69 (0x7) 
	struct FProceduralDensityModifiers DensityModifiers; // 0x70 (0x10)
	float Density; // 0x80 (0x4)
	unsigned char unreflected_84[0x4]; // 0x84 (0x4) 
	struct TArray<struct FName> SourcePointTagIncludes; // 0x88 (0x10)
	struct TArray<struct FName> SourcePointTagExcludes; // 0x98 (0x10)
	struct TArray<struct FName> SourceActorTagIncludes; // 0xa8 (0x10)
	struct TArray<struct FName> SourceActorTagExcludes; // 0xb8 (0x10)
	struct TArray<struct FName> SourceComponentTagIncludes; // 0xc8 (0x10)
	struct TArray<struct FName> SourceComponentTagExcludes; // 0xd8 (0x10)
	struct FFloatInterval* SourcePointDistance; // 0xe8 (0x8)
	unsigned char bUseSourcePointExactNumber; // 0xf0 (0x1)
	unsigned char unreflected_f1[0x3]; // 0xf1 (0x3) 
	int SourcePointExactNumber; // 0xf4 (0x4)
	unsigned char bScaleModifiersEnabled; // 0xf8 (0x1)
	unsigned char unreflected_f9[0x7]; // 0xf9 (0x7) 
	struct FProceduralScaleModifiers ScaleModifiers; // 0x100 (0x20)
	unsigned char bRotationModifiersEnabled; // 0x120 (0x1)
	unsigned char unreflected_121[0x7]; // 0x121 (0x7) 
	struct FProceduralRotationModifiers RotationModifiers; // 0x128 (0x10)
	unsigned char bAlignToNormal; // 0x138 (0x1)
	unsigned char unreflected_139[0x3]; // 0x139 (0x3) 
	float AlignMaxAngle; // 0x13c (0x4)
	struct FProceduralScatterTargetSurface TargetSurface; // 0x140 (0x48)
	unsigned char bDetectOverhangingLedge; // 0x188 (0x1)
	unsigned char unreflected_189[0x3]; // 0x189 (0x3) 
	int OverhangingLedgeDetectionRayCount; // 0x18c (0x4)
	float OverhangingLedgeDetectionLength; // 0x190 (0x4)
	float OverhangingLedgeDetectionVerticalThreshold; // 0x194 (0x4)
	float OverhangingLedgeDetectionRadiusScale; // 0x198 (0x4)
	float FilterMinimumScale; // 0x19c (0x4)
	float OverlapPriority; // 0x1a0 (0x4)
	unsigned char bCollisionWithWorld; // 0x1a4 (0x1)
	unsigned char unreflected_1a5[0x3]; // 0x1a5 (0x3) 
	struct FVector CollisionScale; // 0x1a8 (0x18)
	struct FColor DebugColor; // 0x1c0 (0x4)
	unsigned char padding_1c4[0x14]; // 0x1c4 (0x14)

	/* Functions */

	// Function /Script/Procedural.ProceduralScatterSettings.SetSourcePointDistanceMin (Underlying native function: SetSourcePointDistanceMin 0x7f9328c)
	void SetSourcePointDistanceMin(float& InValue); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/Procedural.ProceduralScatterSettings.SetSourcePointDistanceMax (Underlying native function: SetSourcePointDistanceMax 0x7f931f4)
	void SetSourcePointDistanceMax(float& InValue); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/Procedural.ProceduralScatterSettings.GetSourcePointDistanceMin (Underlying native function: GetSourcePointDistanceMin 0x7f928d0)
	float GetSourcePointDistanceMin(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/Procedural.ProceduralScatterSettings.GetSourcePointDistanceMax (Underlying native function: GetSourcePointDistanceMax 0x7f928b8)
	float GetSourcePointDistanceMax(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)
};

