// VerseClass /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event
// Size: 0xb8
class URestricted_sticky_event : public UObject
{
	unsigned char unreflected_28[0x10]; // 0x28 (0x10) 
	unsigned char verse0xB0B89381L2fVerse2eorg2fRestricted2fstickyevent2fstickyeventLtRNRClearSignal_38[0x10]; // 0x38 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE92C69BEL2fVerse2eorg2fRestricted2fstickyevent2fstickyeventLtRNRGetAwaitCount_48[0x10]; // 0x48 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA811AC9BL2fVerse2eorg2fRestricted2fstickyevent2fstickyeventLtRNRIsSignaled_28[0x10]; // 0x28 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_38[0x30]; // 0x38 (0x30) 
	unsigned char verse0x8DE7DBE5Await_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7260621DL2fVerse2eorg2fVerse2fsignalable2fsignalableLtRNRSignalLNtR_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_68[0x50]; // 0x68 (0x50)

	/* Functions */

	// Function /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event._L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lt_R_N_RSignal_L_Nt_R (Underlying native function: _L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lt_R_N_RSignal_L_Nt_R 0x6d33d38)
	void L2fVerse2eorg2fVerse2fsignalable2fsignalableLtRNRSignalLNtR(); // (Native | Public | BlueprintCallable)

	// Function /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event._L_2fVerse_2eorg_2fRestricted_2fsticky__event_2fsticky__event_Lt_R_N_RIsSignaled (Underlying native function: _L_2fVerse_2eorg_2fRestricted_2fsticky__event_2fsticky__event_Lt_R_N_RIsSignaled 0x6d33d30)
	void L2fVerse2eorg2fRestricted2fstickyevent2fstickyeventLtRNRIsSignaled(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event._L_2fVerse_2eorg_2fRestricted_2fsticky__event_2fsticky__event_Lt_R_N_RGetAwaitCount (Underlying native function: _L_2fVerse_2eorg_2fRestricted_2fsticky__event_2fsticky__event_Lt_R_N_RGetAwaitCount 0x6d33d28)
	int64_t L2fVerse2eorg2fRestricted2fstickyevent2fstickyeventLtRNRGetAwaitCount(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event._L_2fVerse_2eorg_2fRestricted_2fsticky__event_2fsticky__event_Lt_R_N_RClearSignal (Underlying native function: _L_2fVerse_2eorg_2fRestricted_2fsticky__event_2fsticky__event_Lt_R_N_RClearSignal 0x6d33d20)
	void L2fVerse2eorg2fRestricted2fstickyevent2fstickyeventLtRNRClearSignal(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event.Await (Has no native function)
	class UConcurrency_task* Await(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

