// AnimBlueprintGeneratedClass /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C
// Size: 0x2301
class URidingPlayerLayerAnimBP_C : public UFortValetPassengerAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x870 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x878 (0x1c)
	unsigned char unreflected_894[0x4]; // 0x894 (0x4) 
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x898 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x8a0 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0x8a8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0x8c8 (0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose2; // 0x988 (0x100)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend; // 0xa88 (0xe0)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose6; // 0xb68 (0x28)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone4; // 0xb90 (0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace; // 0xcb8 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0xcd8 (0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0xcf8 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose5; // 0xdf8 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool7; // 0xe20 (0x48)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose4; // 0xe68 (0x28)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone1; // 0xe90 (0xa8)
	struct FAnimNode_Slot AnimGraphNodeSlot1; // 0xf38 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0xf80 (0x48)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace1; // 0xfc8 (0x118)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x10e0 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive; // 0x1150 (0xc8)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone3; // 0x1218 (0x128)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0x1340 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x1400 (0x20)
	struct FAnimNode_Slot AnimGraphNodeSlot; // 0x1420 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool6; // 0x1468 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x14b0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x14f8 (0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x1540 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose3; // 0x1640 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x1668 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x1690 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x16d8 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x1748 (0x48)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone; // 0x1790 (0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x1838 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x1880 (0x48)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x18c8 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x18f0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x1938 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x1980 (0x48)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace; // 0x19c8 (0x118)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x1ae0 (0x28)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone2; // 0x1b08 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone1; // 0x1c30 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone; // 0x1d58 (0x128)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x1e80 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0x1ea0 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0x1f60 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x2020 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x2040 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x2100 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x21c0 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x2280 (0x20)
	struct FRotator MatchRootYaw; // 0x22a0 (0x18)
	bool IsTargeting; // 0x22b8 (0x1)
	unsigned char unreflected_22b9[0x7]; // 0x22b9 (0x7) 
	class AFortPlayerPawn* FortPlayer; // 0x22c0 (0x8)
	double Timer; // 0x22c8 (0x8)
	bool ShouldTransitionToRiding; // 0x22d0 (0x1)
	unsigned char unreflected_22d1[0x7]; // 0x22d1 (0x7) 
	double LowerBodyYaw; // 0x22d8 (0x8)
	bool IsRideMode; // 0x22e0 (0x1)
	bool IsSprinting; // 0x22e1 (0x1)
	bool IsStandingStill; // 0x22e2 (0x1)
	bool IsInCombat; // 0x22e3 (0x1)
	unsigned char unreflected_22e4[0x4]; // 0x22e4 (0x4) 
	class ANPC_Pawn_Wildlife_Parent_C* WildlifePawn; // 0x22e8 (0x8)
	bool IsSmackie; // 0x22f0 (0x1)
	unsigned char unreflected_22f1[0x7]; // 0x22f1 (0x7) 
	double Velocity; // 0x22f8 (0x8)
	bool IsNug; // 0x2300 (0x1)

	/* Functions */

	// Function /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleFinalPoseOverride (Has no native function)
	void VehicleFinalPoseOverride(struct FPoseLink& InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleFullBodyOverride (Has no native function)
	void VehicleFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleLowerBodyOverride (Has no native function)
	void VehicleLowerBodyOverride(struct FPoseLink& InPoseLowerBodyDefault, struct FPoseLink& InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleSplitBodyOverride (Has no native function)
	void VehicleSplitBodyOverride(struct FPoseLink& InPoseSplitBody, struct FPoseLink& InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace& TurnInPlace, struct FPoseLink& InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D1B22730415169A7290CBFAD6C915976 (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphRidingPlayerLayerAnimBPAnimGraphNodeBlendListByBoolD1B22730415169A7290CBFAD6C915976(); // (BlueprintEvent)

	// Function /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_RotateRootBone_D73766CE4BF0C956278D7FA8259A40CA (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphRidingPlayerLayerAnimBPAnimGraphNodeRotateRootBoneD73766CE4BF0C956278D7FA8259A40CA(); // (BlueprintEvent)

	// Function /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.BlueprintUpdateAnimation (Has no native function)
	void BlueprintUpdateAnimation(float& DeltaTimeX); // (Event | Public | BlueprintEvent)

	// Function /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.ExecuteUbergraph_RidingPlayerLayerAnimBP (Has no native function)
	void ExecuteUbergraphRidingPlayerLayerAnimBP(int& EntryPoint, bool& CallFuncIsValidReturnValue, class URiderComponent*& CallFuncGetComponentByClassReturnValue, struct FVector& CallFuncGetVelocityReturnValue, class UCreatureBaseRidableComponent_C*& K2NodeDynamicCastAsCreatureBaseRidableComponent, bool& K2NodeDynamicCastbSuccess, double& CallFuncVSizeReturnValue, class AActor*& CallFuncGetOwnerReturnValue, class ANPC_Pawn_Wildlife_Parent_C*& K2NodeDynamicCastAsNPCPawnWildlifeParent, bool& K2NodeDynamicCastbSuccess1, float& K2NodeEventDeltaTimeX, class AActor*& CallFuncGetOwningActorReturnValue, bool& CallFuncIsValidReturnValue1, class AFortPlayerPawn*& K2NodeDynamicCastAsFortPlayerPawn, bool& K2NodeDynamicCastbSuccess2, double& CallFuncGetWorldDeltaSecondsReturnValue, double& CallFuncSubtractDoubleDoubleReturnValue, bool& CallFuncLessEqualDoubleDoubleReturnValue, bool& CallFuncLessEqualDoubleDoubleReturnValue1, struct FRotator& CallFuncGetBaseAimRotationReturnValue, double& CallFuncMultiplyDoubleDoubleReturnValue, float& CallFuncBreakRotatorRoll, float& CallFuncBreakRotatorPitch, float& CallFuncBreakRotatorYaw, double& CallFuncSelectFloatReturnValue, struct FRotator& CallFuncGetBaseAimRotationReturnValue1, float& CallFuncBreakRotatorRoll1, float& CallFuncBreakRotatorPitch1, float& CallFuncBreakRotatorYaw1, double& CallFuncSubtractDoubleDoubleReturnValue1, float& CallFuncNormalizeAxisReturnValue, bool& CallFuncHasCurrentMontageReturnValue, bool& CallFuncBooleanORReturnValue, bool& CallFuncNotPreBoolReturnValue, bool& CallFuncBooleanORReturnValue1, bool& CallFuncBooleanANDReturnValue, bool& CallFuncBooleanORReturnValue2, struct FTransform& CallFuncGetSocketTransformReturnValue, struct FRotator& CallFuncTransformRotationReturnValue, float& CallFuncBreakRotatorRoll2, float& CallFuncBreakRotatorPitch2, float& CallFuncBreakRotatorYaw2, bool& CallFuncNotPreBoolReturnValue1, double& CallFuncSubtractDoubleDoubleReturnValue2, struct FRotator& CallFuncMakeRotatorReturnValue, bool& CallFuncGreaterEqualDoubleDoubleReturnValue, bool& CallFuncLessEqualDoubleDoubleReturnValue2, bool& CallFuncGreaterDoubleDoubleReturnValue, bool& CallFuncBooleanORReturnValue3, class ANPC_Pawn_Irwin_Simple_Smackie_C*& K2NodeDynamicCastAsNPCPawnIrwinSimpleSmackie, bool& K2NodeDynamicCastbSuccess3, class ANPC_Pawn_Irwin_Prey_Nug_C*& K2NodeDynamicCastAsNPCPawnIrwinPreyNug, bool& K2NodeDynamicCastbSuccess4, bool& CallFuncIsValidReturnValue2, bool& CallFuncIsValidReturnValue3, bool& CallFuncIsValidReturnValue4, bool& CallFuncIsValidReturnValue5, bool& CallFuncBooleanANDReturnValue1, double& CallFuncSubtractDoubleDoubleAImplicitCast, float& K2NodeStructMemberSetYawImplicitCast, double& CallFuncSubtractDoubleDoubleBImplicitCast, float& CallFuncNormalizeAxisAngleImplicitCast, double& K2NodeVariableSetLowerBodyYawImplicitCast, double& CallFuncSubtractDoubleDoubleAImplicitCast1, float& CallFuncMakeRotatorYawImplicitCast); // (Final | 0x00008000 | HasDefaults)
};

