// Class /Script/ControlRig.RigHierarchy
// Size: 0x320
class URigHierarchy : public UObject
{
	unsigned char unreflected_28[0x60]; // 0x28 (0x60) 
	uint16_t TopologyVersion; // 0x88 (0x2)
	uint16_t MetadataVersion; // 0x8a (0x2)
	uint16_t MetadataTagVersion; // 0x8c (0x2)
	bool bEnableDirtyPropagation; // 0x8e (0x1)
	unsigned char unreflected_8f[0x71]; // 0x8f (0x71) 
	int TransformStackIndex; // 0x100 (0x4)
	unsigned char unreflected_104[0x6c]; // 0x104 (0x6c) 
	class URigHierarchyController* HierarchyController; // 0x170 (0x8)
	unsigned char unreflected_178[0x58]; // 0x178 (0x58) 
	struct TMap<struct FRigElementKey*, struct FRigElementKey*> PreviousNameMap; // 0x1d0 (0x50)
	unsigned char unreflected_220[0x80]; // 0x220 (0x80) 
	class URigHierarchy* HierarchyForCacheValidation; // 0x2a0 (0x8)
	unsigned char padding_2a8[0x78]; // 0x2a8 (0x78)

	/* Functions */

	// Function /Script/ControlRig.RigHierarchy.UnsetCurveValueByIndex (Underlying native function: UnsetCurveValueByIndex 0x7a635b4)
	void UnsetCurveValueByIndex(int& InElementIndex, bool& bSetupUndo); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/ControlRig.RigHierarchy.UnsetCurveValue (Underlying native function: UnsetCurveValue 0x7a63490)
	void UnsetCurveValue(struct FRigElementKey*& InKey, bool& bSetupUndo); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/ControlRig.RigHierarchy.SwitchToWorldSpace (Underlying native function: SwitchToWorldSpace 0x7a63380)
	bool SwitchToWorldSpace(struct FRigElementKey*& InChild, bool& bInitial, bool& bAffectChildren); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/ControlRig.RigHierarchy.SwitchToParent (Underlying native function: SwitchToParent 0x7a63228)
