// Class /Script/FortniteUI.SidebarSocialTagListBase
// Size: 0x460
class USidebarSocialTagListBase : public UCommonActivatableWidget
{
	bool bAreTagsSelectable; // 0x3a8 (0x1)
	unsigned char unreflected_3a9[0x17]; // 0x3a9 (0x17) 
	bool bTagsSupportMultiSelection; // 0x3c0 (0x1)
	unsigned char unreflected_3c1[0x7]; // 0x3c1 (0x7) 
	class USocialTagWidget* SidebarSocialTagWidget1; // 0x3c8 (0x8)
	class USocialTagWidget* SidebarSocialTagWidget2; // 0x3d0 (0x8)
	class USocialTagWidget* SidebarSocialTagWidget3; // 0x3d8 (0x8)
	bool bShowCategoryCustomization; // 0x3e0 (0x1)
	unsigned char padding_3e1[0x7f]; // 0x3e1 (0x7f)
};

