// Class /Script/FortniteUI.SidebarTagsEditorHeaderWidget
// Size: 0x4a8
class USidebarTagsEditorHeaderWidget : public UCommonActivatableWidget
{
	class UFortSocialAvatarIcon* AvatarSocialAvatarIcon; // 0x3a8 (0x8)
	class USocialNameTextBlock* TextSocialName; // 0x3b0 (0x8)
	class UCommonRichTextBlock* RichTextPlatformNames; // 0x3b8 (0x8)
	class USidebarSocialTagListBase* SidebarSocialTagList; // 0x3c0 (0x8)
	class UCommonButtonBase* AddButton1; // 0x3c8 (0x8)
	class UCommonButtonBase* AddButton2; // 0x3d0 (0x8)
	class UCommonButtonBase* AddButton3; // 0x3d8 (0x8)
	class UBorder* BorderOnlineStatusIndicator; // 0x3e0 (0x8)
	class UBorder* BorderOnlineStatusOutline; // 0x3e8 (0x8)
	unsigned char unreflected_3f0[0xb0]; // 0x3f0 (0xb0) 
	double DebounceSetTagsDurationSeconds; // 0x4a0 (0x8)
};

