// VerseClass /EpicGamesSimulation/_Verse/VNI/EpicGamesSimulation.Simulation_team
// Size: 0xa8
class USimulation_team : public UVerseTeam
{
	unsigned char unreflected_28[0x10]; // 0x28 (0x10) 
	unsigned char verse0x5274733BL2fEpicGames2ecom2fSimulation2fteamNRAddPlayerLNplayerR_38[0x10]; // 0x38 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_48[0x10]; // 0x48 (0x10) 
	unsigned char verse0x03A455D9L2fEpicGames2ecom2fSimulation2fteamNREmpty_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8325FA58L2fEpicGames2ecom2fSimulation2fteamNRGetPlayers_28[0x10]; // 0x28 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_38[0x10]; // 0x38 (0x10) 
	unsigned char verse0xC73C4045L2fEpicGames2ecom2fSimulation2fteamNRRemovePlayerLNplayerR_48[0x10]; // 0x48 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_58[0x50]; // 0x58 (0x50)

	/* Functions */

	// Function /EpicGamesSimulation/_Verse/VNI/EpicGamesSimulation.Simulation_team._L_2fEpicGames_2ecom_2fSimulation_2fteam_N_RRemovePlayer_L_Nplayer_R (Underlying native function: _L_2fEpicGames_2ecom_2fSimulation_2fteam_N_RRemovePlayer_L_Nplayer_R 0x7051a90)
	void L2fEpicGames2ecom2fSimulation2fteamNRRemovePlayerLNplayerR(class USimulation_player*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /EpicGamesSimulation/_Verse/VNI/EpicGamesSimulation.Simulation_team._L_2fEpicGames_2ecom_2fSimulation_2fteam_N_RGetPlayers (Underlying native function: _L_2fEpicGames_2ecom_2fSimulation_2fteam_N_RGetPlayers 0x7051a88)
	struct TArray<class USimulation_player*> L2fEpicGames2ecom2fSimulation2fteamNRGetPlayers(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /EpicGamesSimulation/_Verse/VNI/EpicGamesSimulation.Simulation_team._L_2fEpicGames_2ecom_2fSimulation_2fteam_N_REmpty (Underlying native function: _L_2fEpicGames_2ecom_2fSimulation_2fteam_N_REmpty 0x7051a80)
	void L2fEpicGames2ecom2fSimulation2fteamNREmpty(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /EpicGamesSimulation/_Verse/VNI/EpicGamesSimulation.Simulation_team._L_2fEpicGames_2ecom_2fSimulation_2fteam_N_RAddPlayer_L_Nplayer_R (Underlying native function: _L_2fEpicGames_2ecom_2fSimulation_2fteam_N_RAddPlayer_L_Nplayer_R 0x7051a78)
	void L2fEpicGames2ecom2fSimulation2fteamNRAddPlayerLNplayerR(class USimulation_player*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /EpicGamesSimulation/_Verse/VNI/EpicGamesSimulation.Simulation_team.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /EpicGamesSimulation/_Verse/VNI/EpicGamesSimulation.Simulation_team.$Block (Has no native function)
	void $Block(); // ()

	// Function /EpicGamesSimulation/_Verse/VNI/EpicGamesSimulation.Simulation_team.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

