// Class /Script/UMG.SizeBox
// Size: 0x198
class USizeBox : public UContentWidget
{
	unsigned char unreflected_160[0x10]; // 0x160 (0x10) 
	float WidthOverride; // 0x170 (0x4)
	float HeightOverride; // 0x174 (0x4)
	float MinDesiredWidth; // 0x178 (0x4)
	float MinDesiredHeight; // 0x17c (0x4)
	float MaxDesiredWidth; // 0x180 (0x4)
	float MaxDesiredHeight; // 0x184 (0x4)
	float MinAspectRatio; // 0x188 (0x4)
	float MaxAspectRatio; // 0x18c (0x4)
	unsigned char bOverrideWidthOverride; // 0x190 (0x1)
	unsigned char bOverrideHeightOverride; // 0x190 (0x1)
	unsigned char bOverrideMinDesiredWidth; // 0x190 (0x1)
	unsigned char bOverrideMinDesiredHeight; // 0x190 (0x1)
	unsigned char bOverrideMaxDesiredWidth; // 0x190 (0x1)
	unsigned char bOverrideMaxDesiredHeight; // 0x190 (0x1)
	unsigned char bOverrideMinAspectRatio; // 0x190 (0x1)
	unsigned char bOverrideMaxAspectRatio; // 0x190 (0x1)
	unsigned char padding_191[0x7]; // 0x191 (0x7)

	/* Functions */

	// Function /Script/UMG.SizeBox.SetWidthOverride (Underlying native function: SetWidthOverride 0x24d22e0)
	void SetWidthOverride(float& InWidthOverride); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.SetMinDesiredWidth (Underlying native function: SetMinDesiredWidth 0x2254d70)
	void SetMinDesiredWidth(float& InMinDesiredWidth); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.SetMinDesiredHeight (Underlying native function: SetMinDesiredHeight 0x246268c)
	void SetMinDesiredHeight(float& InMinDesiredHeight); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.SetMinAspectRatio (Underlying native function: SetMinAspectRatio 0x9b0f744)
	void SetMinAspectRatio(float& InMinAspectRatio); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.SetMaxDesiredWidth (Underlying native function: SetMaxDesiredWidth 0x24da36c)
	void SetMaxDesiredWidth(float& InMaxDesiredWidth); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.SetMaxDesiredHeight (Underlying native function: SetMaxDesiredHeight 0x9b0f4b4)
	void SetMaxDesiredHeight(float& InMaxDesiredHeight); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.SetMaxAspectRatio (Underlying native function: SetMaxAspectRatio 0x9b0f430)
	void SetMaxAspectRatio(float& InMaxAspectRatio); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.SetHeightOverride (Underlying native function: SetHeightOverride 0x25a5b5c)
	void SetHeightOverride(float& InHeightOverride); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.ClearWidthOverride (Underlying native function: ClearWidthOverride 0x9b0a2b8)
	void ClearWidthOverride(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.ClearMinDesiredWidth (Underlying native function: ClearMinDesiredWidth 0x9b0a27c)
	void ClearMinDesiredWidth(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.ClearMinDesiredHeight (Underlying native function: ClearMinDesiredHeight 0x9b0a268)
	void ClearMinDesiredHeight(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.ClearMinAspectRatio (Underlying native function: ClearMinAspectRatio 0x9b0a254)
	void ClearMinAspectRatio(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.ClearMaxDesiredWidth (Underlying native function: ClearMaxDesiredWidth 0x9b0a218)
	void ClearMaxDesiredWidth(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.ClearMaxDesiredHeight (Underlying native function: ClearMaxDesiredHeight 0x2fcc550)
	void ClearMaxDesiredHeight(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.ClearMaxAspectRatio (Underlying native function: ClearMaxAspectRatio 0x9b0a204)
	void ClearMaxAspectRatio(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/UMG.SizeBox.ClearHeightOverride (Underlying native function: ClearHeightOverride 0x27c9530)
	void ClearHeightOverride(); // (Final | Native | Public | BlueprintCallable)
};

