// Class /Script/Engine.SkeletalMeshComponent
// Size: 0xf90
class USkeletalMeshComponent : public USkinnedMeshComponent
{
	unsigned char AnimBlueprintGeneratedClass_8b0[0x8]; // 0x8b0 (0x8) (UNHANDLED PROPERTY TYPE: ClassPtrProperty UID: 0)
	class UClass* AnimClass; // 0x8b8 (0x8)
	class UAnimInstance* AnimScriptInstance; // 0x8c0 (0x8)
	class UAnimInstance* PostProcessAnimInstance; // 0x8c8 (0x8)
	struct FSingleAnimationPlayData AnimationData; // 0x8d0 (0x18)
	unsigned char unreflected_8e8[0x10]; // 0x8e8 (0x10) 
	struct FVector RootBoneTranslation; // 0x8f8 (0x18)
	struct FVector LineCheckBoundsScale; // 0x910 (0x18)
	unsigned char unreflected_928[0x30]; // 0x928 (0x30) 
	struct TArray<class UAnimInstance*> LinkedInstances; // 0x958 (0x10)
	struct TArray<struct FTransform> CachedBoneSpaceTransforms; // 0x968 (0x10)
	struct TArray<struct FTransform> CachedComponentSpaceTransforms; // 0x978 (0x10)
	unsigned char unreflected_988[0xb0]; // 0x988 (0xb0) 
	float GlobalAnimRateScale; // 0xa38 (0x4)
	struct TEnumAsByte<EKinematicBonesUpdateToPhysics> KinematicBonesUpdateType; // 0xa3c (0x1)
	struct TEnumAsByte<EPhysicsTransformUpdateMode> PhysicsTransformUpdateMode; // 0xa3d (0x1)
	unsigned char unreflected_a3e[0x1]; // 0xa3e (0x1) 
	struct TEnumAsByte<EAnimationMode> AnimationMode; // 0xa3f (0x1)
	unsigned char unreflected_a40[0x1]; // 0xa40 (0x1) 
	unsigned char bDisablePostProcessBlueprint; // 0xa41 (0x1)
	unsigned char bUpdateOverlapsOnAnimationFinalize; // 0xa41 (0x1)
	unsigned char bHasValidBodies; // 0xa41 (0x1)
	unsigned char bBlendPhysics; // 0xa41 (0x1)
	unsigned char bEnablePhysicsOnDedicatedServer; // 0xa41 (0x1)
	unsigned char bUpdateMeshWhenKinematic; // 0xa41 (0x1)
	unsigned char bUpdateJointsFromAnimation; // 0xa42 (0x1)
	unsigned char bAllowClothActors; // 0xa42 (0x1)
	unsigned char bDisableClothSimulation; // 0xa42 (0x1)
	unsigned char unreflected_a43[0x5]; // 0xa43 (0x5) 
	unsigned char bDisableRigidBodyAnimNode; // 0xa48 (0x1)
	unsigned char bAllowAnimCurveEvaluation; // 0xa48 (0x1)
	unsigned char bDisableAnimCurves; // 0xa48 (0x1)
	unsigned char bCollideWithEnvironment; // 0xa48 (0x1)
	unsigned char bCollideWithAttachedChildren; // 0xa48 (0x1)
	unsigned char bForceCollisionUpdate; // 0xa49 (0x1)
	unsigned char bLocalSpaceSimulation; // 0xa49 (0x1)
	unsigned char bResetAfterTeleport; // 0xa49 (0x1)
	unsigned char bDeferKinematicBoneUpdate; // 0xa49 (0x1)
	unsigned char bNoSkeletonUpdate; // 0xa49 (0x1)
	unsigned char bPauseAnims; // 0xa49 (0x1)
	unsigned char bUseRefPoseOnInitAnim; // 0xa49 (0x1)
	unsigned char bEnablePerPolyCollision; // 0xa4a (0x1)
	unsigned char bForceRefpose; // 0xa4a (0x1)
	unsigned char bOnlyAllowAutonomousTickPose; // 0xa4a (0x1)
	unsigned char bIsAutonomousTickPose; // 0xa4a (0x1)
	unsigned char bOldForceRefPose; // 0xa4a (0x1)
	unsigned char bShowPrePhysBones; // 0xa4a (0x1)
	unsigned char bRequiredBonesUpToDate; // 0xa4a (0x1)
	unsigned char bAnimTreeInitialised; // 0xa4a (0x1)
	unsigned char bIncludeComponentLocationIntoBounds; // 0xa4b (0x1)
	unsigned char bEnableLineCheckWithBounds; // 0xa4b (0x1)
	unsigned char bPropagateCurvesToFollowers; // 0xa4b (0x1)
	unsigned char bSkipKinematicUpdateWhenInterpolating; // 0xa4b (0x1)
	unsigned char bSkipBoundsUpdateWhenInterpolating; // 0xa4b (0x1)
	unsigned char bNeedsQueuedAnimEventsDispatched; // 0xa4b (0x1)
	unsigned char unreflected_a4c[0x2]; // 0xa4c (0x2) 
	uint16_t CachedAnimCurveUidVersion; // 0xa4e (0x2)
	float ClothBlendWeight; // 0xa50 (0x4)
	bool bWaitForParallelClothTask; // 0xa54 (0x1)
	unsigned char unreflected_a55[0x3]; // 0xa55 (0x3) 
	struct TArray<struct FName> DisallowedAnimCurves; // 0xa58 (0x10)
	class UBodySetup* BodySetup; // 0xa68 (0x8)
	unsigned char unreflected_a70[0x4]; // 0xa70 (0x4) 
	float ClothMaxDistanceScale; // 0xa74 (0x4)
	struct FMulticastInlineDelegate OnConstraintBroken; // 0xa78 (0x10)
	struct FMulticastInlineDelegate OnPlasticDeformation; // 0xa88 (0x10)
	class UClass* ClothingSimulationFactory; // 0xa98 (0x8)
	unsigned char unreflected_aa0[0xf8]; // 0xaa0 (0xf8) 
	float TeleportDistanceThreshold; // 0xb98 (0x4)
	float TeleportRotationThreshold; // 0xb9c (0x4)
	unsigned char unreflected_ba0[0x8]; // 0xba0 (0x8) 
	uint32_t LastPoseTickFrame; // 0xba8 (0x4)
	unsigned char unreflected_bac[0x94]; // 0xbac (0x94) 
	class UClothingSimulationInteractor* ClothingInteractor; // 0xc40 (0x8)
	unsigned char unreflected_c48[0xc8]; // 0xc48 (0xc8) 
	struct FMulticastInlineDelegate OnAnimInitialized; // 0xd10 (0x10)
	unsigned char padding_d20[0x270]; // 0xd20 (0x270)

	/* Functions */

	// Function /Script/Engine.SkeletalMeshComponent.UnlinkAnimClassLayers (Underlying native function: UnlinkAnimClassLayers 0x9d0df90)
	void UnlinkAnimClassLayers(class UClass*& InClass); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/Engine.SkeletalMeshComponent.UnbindClothFromLeaderPoseComponent (Underlying native function: UnbindClothFromLeaderPoseComponent 0x9d0df14)
	void UnbindClothFromLeaderPoseComponent(bool& bRestoreSimulationSpace); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/Engine.SkeletalMeshComponent.ToggleDisablePostProcessBlueprint (Underlying native function: ToggleDisablePostProcessBlueprint 0x9d0df00)
	void ToggleDisablePostProcessBlueprint(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/Engine.SkeletalMeshComponent.TermBodiesBelow (Underlying native function: TermBodiesBelow 0x9d0de80)
