// AnimBlueprintGeneratedClass /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C
// Size: 0x1cd0
class USlidingLayerAnimBP_C : public UFortSlidingLayerAnimInstance
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0x4d0 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0x4d8 (0x40)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0x518 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0x520 (0x8)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose8; // 0x528 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose7; // 0x5e8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot6; // 0x6a8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0x6c8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot5; // 0x788 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0x7a8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0x868 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0x888 (0xc0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive5; // 0x948 (0xd0)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0xa18 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer6; // 0xa38 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0xaa8 (0x48)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose; // 0xaf0 (0x10)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer5; // 0xb00 (0x70)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive4; // 0xb70 (0xd0)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0xc40 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0xc60 (0xc0)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone1; // 0xd20 (0xa8)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult7; // 0xdc8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult6; // 0xdf0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult5; // 0xe18 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult4; // 0xe40 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult3; // 0xe68 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult2; // 0xe90 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0xeb8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0xee0 (0x28)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0xf08 (0x48)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive3; // 0xf50 (0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x1020 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer4; // 0x1068 (0x70)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive2; // 0x10d8 (0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer3; // 0x11a8 (0x70)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x1218 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult3; // 0x1260 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer2; // 0x1280 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult2; // 0x12f0 (0x20)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive1; // 0x1310 (0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x13e0 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x1428 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x1498 (0x20)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive; // 0x14b8 (0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x1588 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x15d0 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x1640 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x1660 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x1728 (0x100)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x1828 (0x48)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x1870 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x1898 (0x28)
	struct FAnimNode_RotateRootBone AnimGraphNodeRotateRootBone; // 0x18c0 (0xa8)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x1968 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x1a28 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x1ae8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x1b08 (0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x1bc8 (0x48)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x1c10 (0x20)
	bool IsKneeSliding; // 0x1c30 (0x1)
	bool bKneeSlideNotebTransitionFullBodySprinting; // 0x1c31 (0x1)
	unsigned char unreflected_1c32[0x6]; // 0x1c32 (0x6) 
	struct FRotator KneeSlideLowerBodyInitialRot0; // 0x1c38 (0x18)
	struct FRotator KneeSlideLowerBodyInitialRotSmooth0; // 0x1c50 (0x18)
	class AFortPlayerPawn* FortPlayerPawn0; // 0x1c68 (0x8)
	class UFortPlayerAnimInstance* FortPlayerAnimInstance; // 0x1c70 (0x8)
	double DeltaTime; // 0x1c78 (0x8)
	double KneeSlideLowerBodyYawOffset; // 0x1c80 (0x8)
	double KneeSlideRootYawOffset0; // 0x1c88 (0x8)
	double VelocityAimYawDelta0; // 0x1c90 (0x8)
	double KneeSlideSlopeAngle0; // 0x1c98 (0x8)
	double KneeSlideSlopeYaw0; // 0x1ca0 (0x8)
	double KneeSlideSlopeYawMinusRootRot0; // 0x1ca8 (0x8)
	bool TransitionToKneeSlide; // 0x1cb0 (0x1)
	unsigned char unreflected_1cb1[0x7]; // 0x1cb1 (0x7) 
	double KneeSlideForwardVectorVelocityDelta0; // 0x1cb8 (0x8)
	bool InitiatedSlideUpHill; // 0x1cc0 (0x1)
	bool BypassEntry0; // 0x1cc1 (0x1)
	unsigned char unreflected_1cc2[0x6]; // 0x1cc2 (0x6) 
	double SpineTweakLean0; // 0x1cc8 (0x8)

	/* Functions */

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_AimOffset (Has no native function)
	void MovementModeAimOffset(struct FPoseLink& InAimOffsetsPose, struct FPoseLink& InSourcePosePreAimOffsets, struct FPoseLink& MovementModeAimOffset); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_FinalPoseOverride (Has no native function)
	void MovementModeFinalPoseOverride(struct FPoseLink& InFinalPose, struct FPoseLink& MovementModeFinalPoseOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_FullBodyOverride (Has no native function)
	void MovementModeFullBodyOverride(struct FPoseLink& InputPoseFullBody, struct FPoseLink& MovementModeFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_SourcePose (Has no native function)
	void MovementModeSourcePose(struct FPoseLink& InSourcePoseBase, struct FPoseLink& MovementModeSourcePose); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_LowerBodyOverride (Has no native function)
	void MovementModeLowerBodyOverride(struct FPoseLink& InLowerBodyPose, struct FPoseLink& InSourcePose, struct FPoseLink& InSourcePosePreUpperBodySlot, struct FPoseLink& MovementModeLowerBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_LocomotionAdditives (Has no native function)
	void MovementModeLocomotionAdditives(struct FPoseLink& InLocomotionAdditivesPose, struct FPoseLink& MovementModeLocomotionAdditives); // (HasOutParms | BlueprintCallable)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.BlueprintUpdateAnimation (Has no native function)
	void BlueprintUpdateAnimation(float& DeltaTimeX); // (Event | Public | BlueprintEvent)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.BlueprintInitializeAnimation (Has no native function)
	void BlueprintInitializeAnimation(); // (Event | Public | BlueprintEvent)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SlidingLayerAnimBP_AnimGraphNode_ApplyMeshSpaceAdditive_CA45D1154A0385BF8F15FBB40CA66AD6 (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphSlidingLayerAnimBPAnimGraphNodeApplyMeshSpaceAdditiveCA45D1154A0385BF8F15FBB40CA66AD6(); // (BlueprintEvent)

	// Function /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SlidingLayerAnimBP.SlidingLayerAnimBP_C.ExecuteUbergraph_SlidingLayerAnimBP (Has no native function)
	void ExecuteUbergraphSlidingLayerAnimBP(int& EntryPoint, float& K2NodeEventDeltaTimeX, double& CallFuncAbsReturnValue, double& CallFuncNormalizeToRangeReturnValue, double& CallFuncSubtractDoubleDoubleReturnValue, double& CallFuncAbsAImplicitCast, float& K2NodeStructMemberSetAlphaImplicitCast); // (Final | 0x00008000)
};

