// Class /Script/LauncherSocialDefaults.SocialStyleDataAsset
// Size: 0x9af0
class USocialStyleDataAsset : public UDataAsset
{
	class USocialFontStyleDataAsset* SmallFontStyle; // 0x30 (0x8)
	class USocialFontStyleDataAsset* NormalFontStyle; // 0x38 (0x8)
	class USocialFontStyleDataAsset* LargeFontStyle; // 0x40 (0x8)
	class USocialFontStyleDataAsset* ChatFontStyle; // 0x48 (0x8)
	class USocialListStyleDataAsset* SocialListStyle; // 0x50 (0x8)
	class USocialListMarginsDataAsset* SocialListMargins; // 0x58 (0x8)
	class USocialChatStyleDataAsset* ChatStyle; // 0x60 (0x8)
	class USocialChatChromeStyleDataAsset* ChatChromeStyle; // 0x68 (0x8)
	class USocialChatChromeMarginsDataAsset* ChatChromeMargins; // 0x70 (0x8)
	class USocialChatChromeColorSchemeDataAsset* ChatChromeColorScheme; // 0x78 (0x8)
	class UChatColorSchemeDataAsset* ChatColorScheme; // 0x80 (0x8)
	class USocialSoundSchemaDataAsset* SoundSchema; // 0x88 (0x8)
	class USocialActionButtonStyleDataAsset* ActionButtonStyle; // 0x90 (0x8)
	class USocialCheckBoxStyleDataAsset* CheckBoxStyle; // 0x98 (0x8)
	class USocialRadioBoxStyleDataAsset* RadioBoxStyle; // 0xa0 (0x8)
	class USocialScrollBarStyleDataAsset* ScrollBoxStyle; // 0xa8 (0x8)
	class USocialChatMarkupStyleDataAsset* MarkupStyle; // 0xb0 (0x8)
	class USocialProfanityDataAsset* ProfanityDataAsset; // 0xb8 (0x8)
	unsigned char padding_c0[0x9a30]; // 0xc0 (0x9a30)
};

