// Class /Script/Engine.SplineComponent
// Size: 0x640
class USplineComponent : public UPrimitiveComponent
{
	struct FSplineCurves SplineCurves; // 0x540 (0x70)
	struct FInterpCurveVector SplineInfo; // 0x5b0 (0x18)
	struct FInterpCurveQuat SplineRotInfo; // 0x5c8 (0x18)
	struct FInterpCurveVector SplineScaleInfo; // 0x5e0 (0x18)
	struct FInterpCurveFloat SplineReparamTable; // 0x5f8 (0x18)
	bool bAllowSplineEditingPerInstance; // 0x610 (0x1)
	unsigned char unreflected_611[0x3]; // 0x611 (0x3) 
	int ReparamStepsPerSegment; // 0x614 (0x4)
	float Duration; // 0x618 (0x4)
	bool bStationaryEndpoints; // 0x61c (0x1)
	bool bSplineHasBeenEdited; // 0x61d (0x1)
	bool bModifiedByConstructionScript; // 0x61e (0x1)
	bool bInputSplinePointsToConstructionScript; // 0x61f (0x1)
	bool bDrawDebug; // 0x620 (0x1)
	bool bClosedLoop; // 0x621 (0x1)
	bool bLoopPositionOverride; // 0x622 (0x1)
	unsigned char unreflected_623[0x1]; // 0x623 (0x1) 
	float LoopPosition; // 0x624 (0x4)
	struct FVector DefaultUpVector; // 0x628 (0x18)

	/* Functions */

	// Function /Script/Engine.SplineComponent.UpdateSpline (Underlying native function: UpdateSpline 0x9d2e4dc)
	void UpdateSpline(); // (Native | Public | BlueprintCallable)

	// Function /Script/Engine.SplineComponent.SetWorldLocationAtSplinePoint (Underlying native function: SetWorldLocationAtSplinePoint 0x9d2e314)
	void SetWorldLocationAtSplinePoint(int& PointIndex, struct FVector& InLocation); // (Final | Native | Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /Script/Engine.SplineComponent.SetUpVectorAtSplinePoint (Underlying native function: SetUpVectorAtSplinePoint 0x9d2e138)
	void SetUpVectorAtSplinePoint(int& PointIndex, struct FVector& InUpVector, struct TEnumAsByte<ESplineCoordinateSpace>& CoordinateSpace, bool& bUpdateSpline); // (Final | Native | Public | HasOutParms | HasDefaults | BlueprintCallable)

