// VerseClass /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container
// Size: 0x128
class UTags_tag_container : public UVerseGameplayTagContainerBase
{
	unsigned char verse0x2B191198L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRAddLNtagR_38[0x10]; // 0x38 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_48[0x10]; // 0x48 (0x10) 
	unsigned char verse0xCFB5D729L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRAddLNKtagR_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_68[0x10]; // 0x68 (0x10) 
	unsigned char verse0x64E4995FL2fVerse2eorg2fSimulation2fTags2ftagcontainerNRAddLNtagcontainerR_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_88[0x30]; // 0x88 (0x30) 
	unsigned char verse0x5DCAADF9L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRNum_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x4D2BD89CL2fVerse2eorg2fSimulation2fTags2ftagcontainerNRRemoveLNKtagR_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_78[0x10]; // 0x78 (0x10) 
	unsigned char verse0x431CFAB6L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRRemoveLNtagcontainerR_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8D50B5CFL2fVerse2eorg2fSimulation2fTags2ftagcontainerNRRemoveLNtagR_48[0x10]; // 0x48 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_58[0x40]; // 0x58 (0x40) 
	unsigned char verse0x01C6626FL2fVerse2eorg2fSimulation2fTags2ftagcontainerNRReset_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7955A9D1L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRResetWithSlackLNintR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b8[0x10]; // 0xb8 (0x10) 
	unsigned char verse0xE22D7C25L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasLNtagR_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_d8[0x30]; // 0xd8 (0x30) 
	unsigned char verse0xAD983923L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasAllLNKtagR_108[0x10]; // 0x108 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB388B27BL2fVerse2eorg2fSimulation2fTags2ftagviewNRHasAllExactLNKtagR_118[0x10]; // 0x118 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x59FE2A56L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasAnyLNKtagR_e8[0x10]; // 0xe8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x544A0333L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasAnyExactLNKtagR_f8[0x10]; // 0xf8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7003C03AL2fVerse2eorg2fSimulation2fTags2ftagviewNRHasExactLNtagR_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_e8[0x40]; // 0xe8 (0x40)

	/* Functions */

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R 0x6d4c3d4)
	void L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRResetWithSlackLNintR(int64_t& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset 0x6d4c3dc)
	void L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRReset(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R 0x528c200)
	void L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRRemoveLNtagR(class UTags_tag*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R 0x528c210)
	void L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRRemoveLNtagcontainerR(class UTags_tag_container*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R 0x528c1f0)
	void L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRRemoveLNKtagR(struct TArray<class UTags_tag*>& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum 0x6d4c3cc)
	int64_t L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRNum(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasExact_L_Ntag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasExact_L_Ntag_R 0x528c260)
	void L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasExactLNtagR(class UTags_tag*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAnyExact_L_N_Ktag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAnyExact_L_N_Ktag_R 0x528c240)
	void L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasAnyExactLNKtagR(struct TArray<class UTags_tag*>& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R 0x528c250)
	void L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasAnyLNKtagR(struct TArray<class UTags_tag*>& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAllExact_L_N_Ktag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAllExact_L_N_Ktag_R 0x528c220)
	void L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasAllExactLNKtagR(struct TArray<class UTags_tag*>& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R 0x528c230)
	void L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasAllLNKtagR(struct TArray<class UTags_tag*>& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R 0x528c270)
	void L2fVerse2eorg2fSimulation2fTags2ftagviewNRHasLNtagR(class UTags_tag*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R 0x528c1e0)
	void L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRAddLNtagcontainerR(class UTags_tag_container*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R 0x528c1c0)
	void L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRAddLNKtagR(struct TArray<class UTags_tag*>& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R (Underlying native function: _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R 0x528c1d0)
	void L2fVerse2eorg2fSimulation2fTags2ftagcontainerNRAddLNtagR(class UTags_tag*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

