// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GoToAndAttackTask_L_Nfort__threat__info_R
// Size: 0x280
class Utask_CompanionAI_companion_ai$GoToAndAttackTask_L_Nfort__threat__info_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct FVerseAIBase_fort_threat_info verse0xB2CDDD72Argument; // 0x150 (0x30)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x180 (0x1)
	unsigned char unreflected_181[0x7]; // 0x181 (0x7) 
	unsigned char $Callee1_188[0x10]; // 0x188 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_198[0x10]; // 0x198 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	int64_t $AsyncBeginCount3; // 0x1a8 (0x8)
	class UConcurrency_task* $AsyncTask4; // 0x1b0 (0x8)
	unsigned char $AsyncTaskClass5_1b8[0x10]; // 0x1b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult6; // 0x1c8 (0x1)
	unsigned char unreflected_1c9[0x7]; // 0x1c9 (0x7) 
	int64_t $AsyncResult7; // 0x1d0 (0x8)
	int64_t $AsyncBeginCount8; // 0x1d8 (0x8)
	class UObject* verse0x91E0A2A2NPCActions2; // 0x1e0 (0x8)
	unsigned char $ExprResultStack9_1e8[0x8]; // 0x1e8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x000000004; // 0x1f0 (0x8)
	class UConcurrency_task* $AsyncTask10; // 0x1f8 (0x8)
	unsigned char $AsyncTaskClass11_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult12; // 0x210 (0x8)
	class UObject* verse0x88C4894FNPCMovement5; // 0x218 (0x8)
	unsigned char $ExprResultStack13_220[0x8]; // 0x220 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x000000007; // 0x228 (0x8)
	class UConcurrency_task* $AsyncTask14; // 0x230 (0x8)
	unsigned char $AsyncTaskClass15_238[0x10]; // 0x238 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult16; // 0x248 (0x1)
	unsigned char unreflected_249[0x7]; // 0x249 (0x7) 
	int64_t $AsyncResult17; // 0x250 (0x8)
	enum EVerseTrue $InvokeSureResultDummy18; // 0x258 (0x1)
	unsigned char unreflected_259[0x7]; // 0x259 (0x7) 
	unsigned char $Callee19_260[0x10]; // 0x260 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult20_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GoToAndAttackTask_L_Nfort__threat__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

