// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R
// Size: 0x338
class Utask_CompanionAI_companion_ai$LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_Lvector3_Mfloat_Mfloat_R verse0xB2CDDD72Argument; // 0x150 (0x28)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x178 (0x1)
	unsigned char unreflected_179[0x7]; // 0x179 (0x7) 
	unsigned char $Callee1_180[0x10]; // 0x180 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions2; // 0x1a0 (0x8)
	unsigned char $ExprResultStack3_1a8[0x8]; // 0x1a8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	struct FSpatialMath_vector3 verse0x68BA2569RandomOffset2; // 0x1b0 (0x18)
	double $ExprResultStack4; // 0x1c8 (0x8)
	unsigned char $Callee5_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Ltype_7b_2d1_2e000000e_2b03_7d_Mtype_7b1_2e000000e_2b03_7d_R $ExprResult6; // 0x1e0 (0x10)
	double $ExprResultStack7; // 0x1f0 (0x8)
	unsigned char $Callee8_1f8[0x10]; // 0x1f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Ltype_7b_2d1_2e000000e_2b03_7d_Mtype_7b1_2e000000e_2b03_7d_R $ExprResult9; // 0x208 (0x10)
	double $ExprResultStack10; // 0x218 (0x8)
	unsigned char $Callee11_220[0x10]; // 0x220 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Ltype_7b5_2e000000e_2b01_7d_Mtype_7b2_2e000000e_2b02_7d_R $ExprResult12; // 0x230 (0x10)
	int64_t $AsyncBeginCount13; // 0x240 (0x8)
	class UObject* verse0x000000003; // 0x248 (0x8)
	class UConcurrency_task* $AsyncTask14; // 0x250 (0x8)
	unsigned char $AsyncTaskClass15_258[0x10]; // 0x258 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack16; // 0x268 (0x18)
	unsigned char $Callee17_280[0x10]; // 0x280 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult18; // 0x290 (0x30)
	int64_t $AsyncResult19; // 0x2c0 (0x8)
	class UConcurrency_task* $AsyncTask20; // 0x2c8 (0x8)
	unsigned char $AsyncTaskClass21_2d0[0x10]; // 0x2d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	double $ExprResultStack22; // 0x2e0 (0x8)
	unsigned char $Callee23_2e8[0x10]; // 0x2e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lfloat_Mfloat_R $ExprResult24; // 0x2f8 (0x10)
	int64_t $AsyncResult25; // 0x308 (0x8)
	enum EVerseTrue $InvokeSureResultDummy26; // 0x310 (0x1)
	unsigned char unreflected_311[0x7]; // 0x311 (0x7) 
	unsigned char $Callee27_318[0x10]; // 0x318 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult28_328[0x10]; // 0x328 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

