// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$WaitForTargetInVehicle_L_Nfort__character_R
// Size: 0x200
class Utask_CompanionAI_companion_ai$WaitForTargetInVehicle_L_Nfort__character_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	class UObject* verse0xB2CDDD72Argument; // 0x150 (0x8)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x158 (0x1)
	unsigned char unreflected_159[0x7]; // 0x159 (0x7) 
	unsigned char $Callee1_160[0x10]; // 0x160 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_170[0x10]; // 0x170 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x4BB95041Vehicle3; // 0x180 (0x8)
	unsigned char $ExprResultStack3_188[0x8]; // 0x188 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee4_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lfort__character_Mtuple_L_R_R $ExprResult5; // 0x1a0 (0x10)
	struct Ftuple_L_R $ExprResult6; // 0x1b0 (0x1)
	unsigned char unreflected_1b1[0x7]; // 0x1b1 (0x7) 
	class UConcurrency_task* $AsyncTask7; // 0x1b8 (0x8)
	unsigned char $AsyncTaskClass8_1c0[0x10]; // 0x1c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult9; // 0x1d0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy10; // 0x1d8 (0x1)
	unsigned char unreflected_1d9[0x7]; // 0x1d9 (0x7) 
	unsigned char $Callee11_1e0[0x10]; // 0x1e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult12_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$WaitForTargetInVehicle_L_Nfort__character_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

