// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleBackToMeCommand_L_Nping__info_R
// Size: 0x4a8
class Utask_CompanionAI_companion_ai$HandleBackToMeCommand_L_Nping__info_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct FCompanionAI_ping_info verse0xB2CDDD72Argument; // 0x150 (0x38)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	unsigned char $Callee1_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UVerseEngine_Entity_entity* verse0xFD64D7AAEmitter2; // 0x1b0 (0x8)
	unsigned char $ExprResultStack3_1b8[0x8]; // 0x1b8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x963EC691Character2; // 0x1c0 (0x8)
	unsigned char $ExprResultStack4_1c8[0x8]; // 0x1c8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack5_1d0[0x8]; // 0x1d0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee6_1d8[0x10]; // 0x1d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lentity_Mtuple_L_R_R $ExprResult7; // 0x1e8 (0x10)
	struct Ftuple_L_R $ExprResult8; // 0x1f8 (0x1)
	unsigned char unreflected_1f9[0x7]; // 0x1f9 (0x7) 
	class UObject* verse0xDD9A6D5CCharacterAI2; // 0x200 (0x8)
	unsigned char $ExprResultStack9_208[0x8]; // 0x208 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee10_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult11; // 0x220 (0x1)
	unsigned char unreflected_221[0x7]; // 0x221 (0x7) 
	class UObject* verse0x3AC8A3C4VehicleOwner3; // 0x228 (0x8)
	unsigned char $ExprResultStack12_230[0x8]; // 0x230 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee13_238[0x10]; // 0x238 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lfort__character_Mtuple_L_R_R $ExprResult14; // 0x248 (0x10)
	struct Ftuple_L_R $ExprResult15; // 0x258 (0x1)
	unsigned char unreflected_259[0x7]; // 0x259 (0x7) 
	class UObject* verse0x6BA70ECEVehicleAI3; // 0x260 (0x8)
	unsigned char $ExprResultStack16_268[0x8]; // 0x268 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee17_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lfort__character_Mtuple_L_R_R $ExprResult18; // 0x280 (0x10)
	struct Ftuple_L_R $ExprResult19; // 0x290 (0x1)
	unsigned char unreflected_291[0x7]; // 0x291 (0x7) 
	unsigned char InvokeResultDummy20_298[0x10]; // 0x298 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack21_2a8[0x11]; // 0x2a8 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_2b9[0x7]; // 0x2b9 (0x7) 
	unsigned char $ExprResult22_2c0[0x10]; // 0x2c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult23_2d0[0x10]; // 0x2d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char verse0x7EBDC403HasReachedPosition2; // 0x2e0 (0x1)
	unsigned char unreflected_2e1[0x7]; // 0x2e1 (0x7) 
	class UConcurrency_task* $AsyncTask24; // 0x2e8 (0x8)
	unsigned char $AsyncTaskClass25_2f0[0x10]; // 0x2f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_M_Qfort__character_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_R $ExprResult26; // 0x300 (0x40)
	struct FSpatialMath_vector3 $ExprResult27; // 0x340 (0x18)
	unsigned char $ExprResult28_358[0x8]; // 0x358 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult29_360[0x11]; // 0x360 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_371[0x7]; // 0x371 (0x7) 
	struct FVerseAIBase_navigation_request_parameters $ExprResult30; // 0x378 (0x10)
	int64_t $AsyncResult31; // 0x388 (0x8)
	unsigned char $ExprResultStack32_390[0x2]; // 0x390 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_392[0x6]; // 0x392 (0x6) 
	class UObject* verse0x91E0A2A2NPCActions7; // 0x398 (0x8)
	unsigned char $ExprResultStack33_3a0[0x8]; // 0x3a0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x684D9F77IsFollowingEnabled7; // 0x3a8 (0x1)
	unsigned char unreflected_3a9[0x7]; // 0x3a9 (0x7) 
	class UObject* verse0x000000008; // 0x3b0 (0x8)
	unsigned char $Callee34_3b8[0x10]; // 0x3b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult35; // 0x3c8 (0x1)
	unsigned char $ExprResultStack36_3c9[0x2]; // 0x3c9 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_3cb[0x5]; // 0x3cb (0x5) 
	int64_t $AsyncBeginCount37; // 0x3d0 (0x8)
	class UConcurrency_task* $AsyncTask38; // 0x3d8 (0x8)
	unsigned char $AsyncTaskClass39_3e0[0x10]; // 0x3e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lfort__character_Mfloat_R $ExprResult40; // 0x3f0 (0x10)
	int64_t $AsyncResult41; // 0x400 (0x8)
	class UConcurrency_task* $AsyncTask42; // 0x408 (0x8)
	unsigned char $AsyncTaskClass43_410[0x10]; // 0x410 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult44; // 0x420 (0x1)
	unsigned char unreflected_421[0x7]; // 0x421 (0x7) 
	int64_t $AsyncResult45; // 0x428 (0x8)
	class UConcurrency_task* $AsyncTask46; // 0x430 (0x8)
	unsigned char $AsyncTaskClass47_438[0x10]; // 0x438 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult48; // 0x448 (0x8)
	enum EVerseTrue $InvokeSureResultDummy49; // 0x450 (0x1)
	unsigned char unreflected_451[0x7]; // 0x451 (0x7) 
	unsigned char $Callee50_458[0x10]; // 0x458 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult51_468[0x10]; // 0x468 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0xB4DBB24FPingActions12; // 0x478 (0x8)
	unsigned char $ExprResultStack52_480[0x8]; // 0x480 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x0000000013; // 0x488 (0x8)
	enum EVerseTrue $InvokeSureResultDummy53; // 0x490 (0x1)
	unsigned char unreflected_491[0x7]; // 0x491 (0x7) 
	unsigned char $Callee54_498[0x10]; // 0x498 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleBackToMeCommand_L_Nping__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

