// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleObstacleTask_L_N_Qentity_R
// Size: 0x378
class Utask_CompanionAI_companion_ai$HandleObstacleTask_L_N_Qentity_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	unsigned char verse0xB2CDDD72Argument_150[0x8]; // 0x150 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x158 (0x1)
	unsigned char unreflected_159[0x7]; // 0x159 (0x7) 
	unsigned char $Callee1_160[0x10]; // 0x160 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_170[0x10]; // 0x170 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char verse0x39C5E53EObstacleInfo1_180[0x29]; // 0x180 (0x29) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_1a9[0x7]; // 0x1a9 (0x7) 
	class UConcurrency_task* $AsyncTask3; // 0x1b0 (0x8)
	unsigned char $AsyncTaskClass4_1b8[0x10]; // 0x1b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult5; // 0x1c8 (0x1)
	unsigned char unreflected_1c9[0x7]; // 0x1c9 (0x7) 
	int64_t $AsyncResult6; // 0x1d0 (0x8)
	int64_t $AsyncBeginCount7; // 0x1d8 (0x8)
	struct FVerseAIBase_fort_obstacle_info verse0x82A44C52Obstacle4; // 0x1e0 (0x28)
	unsigned char $ExprResultStack8_208[0x29]; // 0x208 (0x29) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_231[0x7]; // 0x231 (0x7) 
	class UVerseEngine_Entity_entity* verse0xBD80729ACurrentTarget5; // 0x238 (0x8)
	unsigned char $ExprResultStack9_240[0x8]; // 0x240 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack10_248[0x2]; // 0x248 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack11; // 0x24a (0x1)
	unsigned char unreflected_24b[0x5]; // 0x24b (0x5) 
	unsigned char $Callee12_250[0x10]; // 0x250 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lfort__obstacle__info_Mentity_R $ExprResult13; // 0x260 (0x30)
	class UConcurrency_task* $AsyncTask14; // 0x290 (0x8)
	unsigned char $AsyncTaskClass15_298[0x10]; // 0x298 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult16; // 0x2a8 (0x8)
	unsigned char $AsyncTaskClass17_2b0[0x10]; // 0x2b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions7; // 0x2c0 (0x8)
	unsigned char $ExprResultStack18_2c8[0x8]; // 0x2c8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x000000009; // 0x2d0 (0x8)
	unsigned char $AsyncTaskClass19_2d8[0x10]; // 0x2d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $AsyncTaskClass20_2e8[0x10]; // 0x2e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult21_2f8[0x29]; // 0x2f8 (0x29) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_321[0x7]; // 0x321 (0x7) 
	class UConcurrency_task* $AsyncTask22; // 0x328 (0x8)
	unsigned char $AsyncTaskClass23_330[0x10]; // 0x330 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult24; // 0x340 (0x1)
	unsigned char unreflected_341[0x7]; // 0x341 (0x7) 
	int64_t $AsyncResult25; // 0x348 (0x8)
	enum EVerseTrue $InvokeSureResultDummy26; // 0x350 (0x1)
	unsigned char unreflected_351[0x7]; // 0x351 (0x7) 
	unsigned char $Callee27_358[0x10]; // 0x358 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult28_368[0x10]; // 0x368 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleObstacleTask_L_N_Qentity_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

