// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$LookAtOrAttackTarget
// Size: 0x3e8
class Utask_CompanionAI_companion_ai$LookAtOrAttackTarget : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x151 (0x1)
	unsigned char unreflected_152[0x6]; // 0x152 (0x6) 
	unsigned char $Callee1_158[0x10]; // 0x158 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char verse0x1EB80E5BThreatInfo1_178[0x31]; // 0x178 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_1a9[0x7]; // 0x1a9 (0x7) 
	class UConcurrency_task* $AsyncTask3; // 0x1b0 (0x8)
	unsigned char $AsyncTaskClass4_1b8[0x10]; // 0x1b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult5; // 0x1c8 (0x1)
	unsigned char unreflected_1c9[0x7]; // 0x1c9 (0x7) 
	int64_t $AsyncResult6; // 0x1d0 (0x8)
	struct FVerseAIBase_fort_threat_info verse0x26CBBAEBCurrentThreatInfo3; // 0x1d8 (0x30)
	unsigned char $ExprResultStack7_208[0x31]; // 0x208 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_239[0x7]; // 0x239 (0x7) 
	int64_t $AsyncBeginCount8; // 0x240 (0x8)
	unsigned char $ExprResult9_248[0x31]; // 0x248 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_279[0x7]; // 0x279 (0x7) 
	class UConcurrency_task* $AsyncTask10; // 0x280 (0x8)
	unsigned char $AsyncTaskClass11_288[0x10]; // 0x288 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult12; // 0x298 (0x1)
	unsigned char unreflected_299[0x7]; // 0x299 (0x7) 
	int64_t $AsyncResult13; // 0x2a0 (0x8)
	unsigned char $ExprResult14_2a8[0x31]; // 0x2a8 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_2d9[0x7]; // 0x2d9 (0x7) 
	class UConcurrency_task* $AsyncTask15; // 0x2e0 (0x8)
	unsigned char $AsyncTaskClass16_2e8[0x10]; // 0x2e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult17; // 0x2f8 (0x1)
	unsigned char unreflected_2f9[0x7]; // 0x2f9 (0x7) 
	int64_t $AsyncResult18; // 0x300 (0x8)
	unsigned char $ExprResultStack19_308[0x2]; // 0x308 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack20_30a[0x2]; // 0x30a (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_30c[0x4]; // 0x30c (0x4) 
	class UConcurrency_task* $AsyncTask21; // 0x310 (0x8)
	unsigned char $AsyncTaskClass22_318[0x10]; // 0x318 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult23; // 0x328 (0x8)
	class UObject* verse0x91E0A2A2NPCActions6; // 0x330 (0x8)
	unsigned char $ExprResultStack24_338[0x8]; // 0x338 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	int64_t $AsyncBeginCount25; // 0x340 (0x8)
	class UConcurrency_task* $AsyncTask26; // 0x348 (0x8)
	unsigned char $AsyncTaskClass27_350[0x10]; // 0x350 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult28; // 0x360 (0x1)
	unsigned char unreflected_361[0x7]; // 0x361 (0x7) 
	int64_t $AsyncResult29; // 0x368 (0x8)
	class UObject* verse0x000000007; // 0x370 (0x8)
	class UConcurrency_task* $AsyncTask30; // 0x378 (0x8)
	unsigned char $AsyncTaskClass31_380[0x10]; // 0x380 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack32; // 0x390 (0x18)
	unsigned char $Callee33_3a8[0x10]; // 0x3a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult34; // 0x3b8 (0x8)
	enum EVerseTrue $InvokeSureResultDummy35; // 0x3c0 (0x1)
	unsigned char unreflected_3c1[0x7]; // 0x3c1 (0x7) 
	unsigned char $Callee36_3c8[0x10]; // 0x3c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult37_3d8[0x10]; // 0x3d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$LookAtOrAttackTarget.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

