// VerseClass /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$SelectFightingStance_L_Nfort__threat__info_R
// Size: 0x398
class Utask_VerseArchetypes_sniper_ai$SelectFightingStance_L_Nfort__threat__info_R : public UConcurrency_task
{
	class UVerseArchetypes_sniper_ai* Self; // 0x148 (0x8)
	struct FVerseAIBase_fort_threat_info verse0xB2CDDD72Argument; // 0x150 (0x30)
	class UObject* verse0x88C4894FNPCMovement1; // 0x180 (0x8)
	unsigned char $ExprResultStack0_188[0x8]; // 0x188 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x2E1D28B3Inventory1; // 0x190 (0x8)
	unsigned char $ExprResultStack1_198[0x8]; // 0x198 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions1; // 0x1a0 (0x8)
	unsigned char $ExprResultStack2_1a8[0x8]; // 0x1a8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	struct FVerseAIBase_fort_item_descriptor verse0xE0E78A95CurrentWeapon3; // 0x1b0 (0x18)
	class UObject* verse0x000000004; // 0x1c8 (0x8)
	unsigned char $ExprResultStack3_1d0[0x19]; // 0x1d0 (0x19) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_1e9[0x7]; // 0x1e9 (0x7) 
	unsigned char $Callee4_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult5; // 0x200 (0x1)
	unsigned char $ExprResultStack6_201[0x2]; // 0x201 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack7; // 0x203 (0x1)
	unsigned char unreflected_204[0x4]; // 0x204 (0x4) 
	unsigned char $Callee8_208[0x10]; // 0x208 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lfort__item__descriptor_Mfort__item__tag_M_QExactTag_Nlogic_20_3d_20_2e_2e_2e_R $ExprResult9; // 0x218 (0x28)
	struct Ftuple_Lfort__item__descriptor_Mfort__item__tag_R verse0x000000007; // 0x240 (0x20)
	unsigned char $ExprResult10_260[0x2]; // 0x260 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_262[0x6]; // 0x262 (0x6) 
	int64_t $AsyncBeginCount11; // 0x268 (0x8)
	class UConcurrency_task* $AsyncTask12; // 0x270 (0x8)
	unsigned char $AsyncTaskClass13_278[0x10]; // 0x278 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult14; // 0x288 (0x8)
	class UObject* verse0x000000008; // 0x290 (0x8)
	class UConcurrency_task* $AsyncTask15; // 0x298 (0x8)
	unsigned char $AsyncTaskClass16_2a0[0x10]; // 0x2a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult17; // 0x2b0 (0x1)
	unsigned char unreflected_2b1[0x7]; // 0x2b1 (0x7) 
	int64_t $AsyncResult18; // 0x2b8 (0x8)
	class UConcurrency_task* $AsyncTask19; // 0x2c0 (0x8)
	unsigned char $AsyncTaskClass20_2c8[0x10]; // 0x2c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult21; // 0x2d8 (0x8)
	class UVerse_event* verse0x000000009; // 0x2e0 (0x8)
	class UConcurrency_task* $AsyncTask22; // 0x2e8 (0x8)
	unsigned char $AsyncTaskClass23_2f0[0x10]; // 0x2f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult24; // 0x300 (0x1)
	unsigned char unreflected_301[0x7]; // 0x301 (0x7) 
	int64_t $AsyncResult25; // 0x308 (0x8)
	class UObject* verse0x0000000011; // 0x310 (0x8)
	class UConcurrency_task* $AsyncTask26; // 0x318 (0x8)
	unsigned char $AsyncTaskClass27_320[0x10]; // 0x320 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult28; // 0x330 (0x8)
	class UObject* verse0x0000000012; // 0x338 (0x8)
	class UConcurrency_task* $AsyncTask29; // 0x340 (0x8)
	unsigned char $AsyncTaskClass30_348[0x10]; // 0x348 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult31; // 0x358 (0x1)
	unsigned char unreflected_359[0x7]; // 0x359 (0x7) 
	int64_t $AsyncResult32; // 0x360 (0x8)
	class UVerse_event* verse0x0000000013; // 0x368 (0x8)
	class UConcurrency_task* $AsyncTask33; // 0x370 (0x8)
	unsigned char $AsyncTaskClass34_378[0x10]; // 0x378 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult35; // 0x388 (0x1)
	unsigned char unreflected_389[0x7]; // 0x389 (0x7) 
	int64_t $AsyncResult36; // 0x390 (0x8)

	/* Functions */

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$SelectFightingStance_L_Nfort__threat__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

