// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$ReviveCommand_L_Nfort__character_R
// Size: 0x328
class Utask_CompanionAI_companion_ai$ReviveCommand_L_Nfort__character_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	class UObject* verse0xB2CDDD72Argument; // 0x150 (0x8)
	unsigned char RetVal; // 0x158 (0x1)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x159 (0x1)
	unsigned char unreflected_15a[0x6]; // 0x15a (0x6) 
	unsigned char $Callee1_160[0x10]; // 0x160 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_170[0x10]; // 0x170 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x000000003; // 0x180 (0x8)
	unsigned char $ExprResultStack3_188[0x2]; // 0x188 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_18a[0x6]; // 0x18a (0x6) 
	unsigned char $Callee4_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult5; // 0x1a0 (0x1)
	unsigned char unreflected_1a1[0x7]; // 0x1a1 (0x7) 
	class UObject* verse0x91E0A2A2NPCActions2; // 0x1a8 (0x8)
	unsigned char $ExprResultStack6_1b0[0x8]; // 0x1b0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	int64_t $AsyncBeginCount7; // 0x1b8 (0x8)
	class UConcurrency_task* $AsyncTask8; // 0x1c0 (0x8)
	unsigned char $AsyncTaskClass9_1c8[0x10]; // 0x1c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult10; // 0x1d8 (0x1)
	unsigned char unreflected_1d9[0x7]; // 0x1d9 (0x7) 
	int64_t $AsyncResult11; // 0x1e0 (0x8)
	unsigned char verse0x7EBDC403HasReachedPosition4; // 0x1e8 (0x1)
	unsigned char unreflected_1e9[0x7]; // 0x1e9 (0x7) 
	class UConcurrency_task* $AsyncTask12; // 0x1f0 (0x8)
	unsigned char $AsyncTaskClass13_1f8[0x10]; // 0x1f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_M_Qfort__character_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_R $ExprResult14; // 0x208 (0x40)
	struct FSpatialMath_vector3 $ExprResult15; // 0x248 (0x18)
	unsigned char $ExprResult16_260[0x8]; // 0x260 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult17_268[0x11]; // 0x268 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_279[0x7]; // 0x279 (0x7) 
	struct FVerseAIBase_navigation_request_parameters $ExprResult18; // 0x280 (0x10)
	int64_t $AsyncResult19; // 0x290 (0x8)
	unsigned char $ExprResultStack20_298[0x2]; // 0x298 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	enum VerseAIBase_action_result verse0x40FB4916ReviveResult4; // 0x29a (0x1)
	unsigned char unreflected_29b[0x5]; // 0x29b (0x5) 
	class UObject* verse0x000000007; // 0x2a0 (0x8)
	unsigned char $AsyncTaskClass21_2a8[0x10]; // 0x2a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char InvokeResultDummy22_2b8[0x10]; // 0x2b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack23_2c8[0x11]; // 0x2c8 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_2d9[0x7]; // 0x2d9 (0x7) 
	unsigned char $ExprResult24_2e0[0x10]; // 0x2e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult25_2f0[0x10]; // 0x2f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy26; // 0x300 (0x1)
	unsigned char unreflected_301[0x7]; // 0x301 (0x7) 
	unsigned char $Callee27_308[0x10]; // 0x308 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult28_318[0x10]; // 0x318 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$ReviveCommand_L_Nfort__character_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

