// VerseClass /VerseBasicGameplay/_Verse/VNI/VerseBasicGameplay.task_VerseBasicGameplay_PlayerManager_basic_player_manager_impl$BeginWaitingForEvents
// Size: 0x2a8
class Utask_VerseBasicGameplay_PlayerManager_basic_player_manager_impl$BeginWaitingForEvents : public UConcurrency_task
{
	class UVerseBasicGameplay_PlayerManager_basic_player_manager_impl* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	int64_t $AsyncBeginCount0; // 0x158 (0x8)
	int64_t $AsyncEndCount1; // 0x160 (0x8)
	enum EVerseTrue $ExprResult2; // 0x168 (0x1)
	unsigned char unreflected_169[0x7]; // 0x169 (0x7) 
	class USimulation_player* verse0x31268F5CPlayerAdded1; // 0x170 (0x8)
	class USimulation_player_component* verse0x000000002; // 0x178 (0x8)
	class UPlayspace_playspace_component* verse0x000000003; // 0x180 (0x8)
	class UConcurrency_task* $AsyncTask3; // 0x188 (0x8)
	unsigned char $AsyncTaskClass4_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult5; // 0x1a0 (0x1)
	unsigned char unreflected_1a1[0x7]; // 0x1a1 (0x7) 
	int64_t $AsyncResult6; // 0x1a8 (0x8)
	unsigned char $Callee7_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult8; // 0x1c0 (0x1)
	unsigned char unreflected_1c1[0x7]; // 0x1c1 (0x7) 
	class USimulation_player_multicast_delegate* verse0x8C908304MulticastDelegate4; // 0x1c8 (0x8)
	unsigned char $FallibleType9_1d0[0x8]; // 0x1d0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class USimulation_player_multicast_delegate* verse0x000000005; // 0x1d8 (0x8)
	enum EVerseTrue $InvokeSureResultDummy10; // 0x1e0 (0x1)
	unsigned char unreflected_1e1[0x7]; // 0x1e1 (0x7) 
	unsigned char $Callee11_1e8[0x10]; // 0x1e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult12_1f8[0x10]; // 0x1f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	enum EVerseTrue $ExprResult13; // 0x208 (0x1)
	unsigned char unreflected_209[0x7]; // 0x209 (0x7) 
	class USimulation_player* verse0x0B5DEACAPlayerRemoved6; // 0x210 (0x8)
	class USimulation_player_component* verse0x000000007; // 0x218 (0x8)
	class UPlayspace_playspace_component* verse0x000000008; // 0x220 (0x8)
	class UConcurrency_task* $AsyncTask14; // 0x228 (0x8)
	unsigned char $AsyncTaskClass15_230[0x10]; // 0x230 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult16; // 0x240 (0x1)
	unsigned char unreflected_241[0x7]; // 0x241 (0x7) 
	int64_t $AsyncResult17; // 0x248 (0x8)
	unsigned char $Callee18_250[0x10]; // 0x250 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult19; // 0x260 (0x1)
	unsigned char unreflected_261[0x7]; // 0x261 (0x7) 
	class USimulation_player_multicast_delegate* verse0x8C908304MulticastDelegate9; // 0x268 (0x8)
	unsigned char $FallibleType20_270[0x8]; // 0x270 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class USimulation_player_multicast_delegate* verse0x0000000010; // 0x278 (0x8)
	enum EVerseTrue $InvokeSureResultDummy21; // 0x280 (0x1)
	unsigned char unreflected_281[0x7]; // 0x281 (0x7) 
	unsigned char $Callee22_288[0x10]; // 0x288 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult23_298[0x10]; // 0x298 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)

	/* Functions */

	// Function /VerseBasicGameplay/_Verse/VNI/VerseBasicGameplay.task_VerseBasicGameplay_PlayerManager_basic_player_manager_impl$BeginWaitingForEvents.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

