// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_creature$OnBegin
// Size: 0x368
class Utask_CompanionAI_companion_creature$OnBegin : public UConcurrency_task
{
	class UCompanionAI_companion_creature* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	class UObject* verse0x963EC691Character1; // 0x158 (0x8)
	unsigned char $ExprResultStack0_160[0x8]; // 0x160 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee1_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult2; // 0x178 (0x1)
	unsigned char unreflected_179[0x7]; // 0x179 (0x7) 
	class UObject* verse0xB4DBB24FPingActions1; // 0x180 (0x8)
	unsigned char $ExprResultStack3_188[0x8]; // 0x188 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee4_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x93780F55CreatureActions1; // 0x1a0 (0x8)
	unsigned char $ExprResultStack5_1a8[0x8]; // 0x1a8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee6_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0xCA7BB203AIMovement1; // 0x1c0 (0x8)
	unsigned char $ExprResultStack7_1c8[0x8]; // 0x1c8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee8_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UGame_Abilities_ability_component* verse0x0ACF1B4FAbilityCpnt1; // 0x1e0 (0x8)
	unsigned char $ExprResultStack9_1e8[0x8]; // 0x1e8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee10_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult11_200[0x8]; // 0x200 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult12_208[0x8]; // 0x208 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult13_210[0x8]; // 0x210 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult14_218[0x8]; // 0x218 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UConcurrency_task* $AsyncTask15; // 0x220 (0x8)
	unsigned char $AsyncTaskClass16_228[0x10]; // 0x228 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult17; // 0x238 (0x1)
	unsigned char unreflected_239[0x7]; // 0x239 (0x7) 
	int64_t $AsyncResult18; // 0x240 (0x8)
	unsigned char verse0x39263057WarningMsg2_248[0x10]; // 0x248 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UDiagnostics_log* verse0x000000003; // 0x258 (0x8)
	enum EVerseTrue $InvokeSureResultDummy19; // 0x260 (0x1)
	unsigned char unreflected_261[0x7]; // 0x261 (0x7) 
	unsigned char $Callee20_268[0x10]; // 0x268 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R $ExprResult21; // 0x278 (0x18)
	unsigned char $ExprResult22_290[0x2]; // 0x290 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy23; // 0x292 (0x1)
	unsigned char unreflected_293[0x5]; // 0x293 (0x5) 
	unsigned char $Callee24_298[0x10]; // 0x298 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R $ExprResult25; // 0x2a8 (0x40)
	struct Ftuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R verse0x000000004; // 0x2e8 (0x40)
	unsigned char $ExprResult26_328[0x19]; // 0x328 (0x19) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_341[0x7]; // 0x341 (0x7) 
	unsigned char $ExprResult27_348[0x9]; // 0x348 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_351[0x7]; // 0x351 (0x7) 
	unsigned char $ExprResultDummy28_358[0x10]; // 0x358 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_creature$OnBegin.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

