// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$WaitForCharacterMovement_L_Nfort__character_M_Nfloat_R
// Size: 0x300
class Utask_CompanionAI_companion_ai$WaitForCharacterMovement_L_Nfort__character_M_Nfloat_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_Lfort__character_Mfloat_R verse0xB2CDDD72Argument; // 0x150 (0x10)
	struct FSpatialMath_vector3 verse0x455F599AReferencePosition1; // 0x160 (0x18)
	unsigned char unreflected_178[0x8]; // 0x178 (0x8) 
	struct FSpatialMath_transform $ExprResult0; // 0x180 (0x60)
	class UObject* verse0x000000002; // 0x1e0 (0x8)
	unsigned char $Callee1_1e8[0x10]; // 0x1e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult2; // 0x1f8 (0x1)
	unsigned char unreflected_1f9[0x7]; // 0x1f9 (0x7) 
	double verse0x525BA815DistanceFromReferencePosition3; // 0x200 (0x8)
	unsigned char $Callee3_208[0x10]; // 0x208 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult4; // 0x218 (0x30)
	unsigned char unreflected_248[0x8]; // 0x248 (0x8) 
	struct FSpatialMath_transform $ExprResult5; // 0x250 (0x60)
	class UObject* verse0x000000004; // 0x2b0 (0x8)
	unsigned char $Callee6_2b8[0x10]; // 0x2b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult7; // 0x2c8 (0x1)
	unsigned char unreflected_2c9[0x7]; // 0x2c9 (0x7) 
	unsigned char $ExprResultStack8_2d0[0x9]; // 0x2d0 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_2d9[0x7]; // 0x2d9 (0x7) 
	class UConcurrency_task* $AsyncTask9; // 0x2e0 (0x8)
	unsigned char $AsyncTaskClass10_2e8[0x10]; // 0x2e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult11; // 0x2f8 (0x8)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$WaitForCharacterMovement_L_Nfort__character_M_Nfloat_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

