// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$CrouchUntilHit
// Size: 0x220
class Utask_CompanionAI_companion_ai$CrouchUntilHit : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x151 (0x1)
	unsigned char unreflected_152[0x6]; // 0x152 (0x6) 
	unsigned char $Callee1_158[0x10]; // 0x158 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	int64_t $AsyncBeginCount3; // 0x178 (0x8)
	class UConcurrency_task* $AsyncTask4; // 0x180 (0x8)
	unsigned char $AsyncTaskClass5_188[0x10]; // 0x188 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult6; // 0x198 (0x1)
	unsigned char unreflected_199[0x7]; // 0x199 (0x7) 
	int64_t $AsyncResult7; // 0x1a0 (0x8)
	class UConcurrency_task* $AsyncTask8; // 0x1a8 (0x8)
	unsigned char $AsyncTaskClass9_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult10; // 0x1c0 (0x1)
	unsigned char unreflected_1c1[0x7]; // 0x1c1 (0x7) 
	int64_t $AsyncResult11; // 0x1c8 (0x8)
	class UConcurrency_task* $AsyncTask12; // 0x1d0 (0x8)
	unsigned char $AsyncTaskClass13_1d8[0x10]; // 0x1d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult14; // 0x1e8 (0x1)
	unsigned char unreflected_1e9[0x7]; // 0x1e9 (0x7) 
	int64_t $AsyncResult15; // 0x1f0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy16; // 0x1f8 (0x1)
	unsigned char unreflected_1f9[0x7]; // 0x1f9 (0x7) 
	unsigned char $Callee17_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult18_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$CrouchUntilHit.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

