// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GetNewObstacle
// Size: 0x223
class Utask_CompanionAI_companion_ai$GetNewObstacle : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	unsigned char RetVal_158[0x29]; // 0x158 (0x29) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x000000001_181[0x2]; // 0x181 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_183[0x5]; // 0x183 (0x5) 
	class UObject* verse0x00C33D6CObstaclePerception3; // 0x188 (0x8)
	unsigned char $ExprResultStack0_190[0x8]; // 0x190 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	struct FVerseAIBase_fort_obstacle_info verse0x39C5E53EObstacleInfo4; // 0x198 (0x28)
	class UObject* verse0x000000005; // 0x1c0 (0x8)
	class UObject* verse0x000000006; // 0x1c8 (0x8)
	unsigned char $Callee1_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult2; // 0x1e0 (0x1)
	unsigned char unreflected_1e1[0x7]; // 0x1e1 (0x7) 
	unsigned char $ExprResult3_1e8[0x10]; // 0x1e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	class UConcurrency_task* $AsyncTask4; // 0x1f8 (0x8)
	unsigned char $AsyncTaskClass5_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult6; // 0x210 (0x1)
	unsigned char unreflected_211[0x7]; // 0x211 (0x7) 
	int64_t $AsyncResult7; // 0x218 (0x8)
	unsigned char $ExprResult8; // 0x220 (0x1)
	unsigned char $ExprResultStack9_221[0x2]; // 0x221 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GetNewObstacle.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

