// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleGoTo_L_Nping__info_R
// Size: 0x6e0
class Utask_CompanionAI_companion_ai$HandleGoTo_L_Nping__info_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct FCompanionAI_ping_info verse0xB2CDDD72Argument; // 0x150 (0x38)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	unsigned char $Callee1_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	int64_t $AsyncBeginCount3; // 0x1b0 (0x8)
	class UConcurrency_task* $AsyncTask4; // 0x1b8 (0x8)
	unsigned char $AsyncTaskClass5_1c0[0x10]; // 0x1c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult6; // 0x1d0 (0x8)
	unsigned char InvokeResultDummy7_1d8[0x10]; // 0x1d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack8_1e8[0x11]; // 0x1e8 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_1f9[0x7]; // 0x1f9 (0x7) 
	unsigned char $ExprResult9_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult10_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	class UVerseEngine_Entity_entity* verse0x459049A1Target3; // 0x220 (0x8)
	unsigned char $ExprResultStack11_228[0x8]; // 0x228 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UConcurrency_task* $AsyncTask12; // 0x230 (0x8)
	unsigned char $AsyncTaskClass13_238[0x10]; // 0x238 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_M_Qfort__character_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_R $ExprResult14; // 0x248 (0x40)
	unsigned char $ExprResultStack15_288[0x8]; // 0x288 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee16_290[0x10]; // 0x290 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lentity_Mtuple_L_R_R $ExprResult17; // 0x2a0 (0x10)
	struct Ftuple_L_R $ExprResult18; // 0x2b0 (0x1)
	unsigned char unreflected_2b1[0x7]; // 0x2b1 (0x7) 
	unsigned char $ExprResult19_2b8[0x11]; // 0x2b8 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_2c9[0x7]; // 0x2c9 (0x7) 
	struct FVerseAIBase_navigation_request_parameters $ExprResult20; // 0x2d0 (0x10)
	int64_t $AsyncResult21; // 0x2e0 (0x8)
	unsigned char InvokeResultDummy22_2e8[0x10]; // 0x2e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack23_2f8[0x11]; // 0x2f8 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_309[0x7]; // 0x309 (0x7) 
	unsigned char $ExprResult24_310[0x10]; // 0x310 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult25_320[0x10]; // 0x320 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char InvokeResultDummy26_330[0x10]; // 0x330 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack27_340[0x11]; // 0x340 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_351[0x7]; // 0x351 (0x7) 
	unsigned char $ExprResult28_358[0x10]; // 0x358 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult29_368[0x10]; // 0x368 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char InvokeResultDummy30_378[0x10]; // 0x378 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack31_388[0x11]; // 0x388 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_399[0x7]; // 0x399 (0x7) 
	unsigned char $ExprResult32_3a0[0x10]; // 0x3a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult33_3b0[0x10]; // 0x3b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	int64_t $AsyncBeginCount34; // 0x3c0 (0x8)
	class UConcurrency_task* $AsyncTask35; // 0x3c8 (0x8)
	unsigned char $AsyncTaskClass36_3d0[0x10]; // 0x3d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_M_Qfort__character_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult37; // 0x3e0 (0x40)
	struct Ftuple_Lvector3_M_Qfalse_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_R verse0x000000005; // 0x420 (0x38)
	unsigned char $ExprResult38_458[0x2]; // 0x458 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_45a[0x6]; // 0x45a (0x6) 
	unsigned char $ExprResult39_460[0x11]; // 0x460 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_471[0x7]; // 0x471 (0x7) 
	struct FVerseAIBase_navigation_request_parameters $ExprResult40; // 0x478 (0x10)
	unsigned char $ExprResult41_488[0x8]; // 0x488 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x000000006_490[0x2]; // 0x490 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult42; // 0x492 (0x1)
	unsigned char $ExprResultStack43_493[0x2]; // 0x493 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_495[0x3]; // 0x495 (0x3) 
	int64_t $AsyncResult44; // 0x498 (0x8)
	class UConcurrency_task* $AsyncTask45; // 0x4a0 (0x8)
	unsigned char $AsyncTaskClass46_4a8[0x10]; // 0x4a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult47; // 0x4b8 (0x8)
	unsigned char $ExprResultStack48_4c0[0x2]; // 0x4c0 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_4c2[0x6]; // 0x4c2 (0x6) 
	class UConcurrency_task* $AsyncTask49; // 0x4c8 (0x8)
	unsigned char $AsyncTaskClass50_4d0[0x10]; // 0x4d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_M_Qfort__character_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult51; // 0x4e0 (0x40)
	struct Ftuple_Lvector3_M_Qfalse_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_R verse0x000000009; // 0x520 (0x38)
	unsigned char $ExprResult52_558[0x2]; // 0x558 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_55a[0x6]; // 0x55a (0x6) 
	unsigned char $ExprResult53_560[0x11]; // 0x560 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_571[0x7]; // 0x571 (0x7) 
	struct FVerseAIBase_navigation_request_parameters $ExprResult54; // 0x578 (0x10)
	unsigned char $ExprResult55_588[0x8]; // 0x588 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x0000000010_590[0x2]; // 0x590 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult56; // 0x592 (0x1)
	unsigned char $ExprResultStack57_593[0x2]; // 0x593 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_595[0x3]; // 0x595 (0x3) 
	int64_t $AsyncResult58; // 0x598 (0x8)
	class UConcurrency_task* $AsyncTask59; // 0x5a0 (0x8)
	unsigned char $AsyncTaskClass60_5a8[0x10]; // 0x5a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult61; // 0x5b8 (0x8)
	class UConcurrency_task* $AsyncTask62; // 0x5c0 (0x8)
	unsigned char $AsyncTaskClass63_5c8[0x10]; // 0x5c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_M_Qfort__character_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult64; // 0x5d8 (0x40)
	struct Ftuple_Lvector3_M_Qfalse_Mlogic_M_QNavigationParameters_Nnavigation__request__parameters_R verse0x0000000013; // 0x618 (0x38)
	unsigned char $ExprResult65_650[0x2]; // 0x650 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_652[0x6]; // 0x652 (0x6) 
	unsigned char $ExprResult66_658[0x11]; // 0x658 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_669[0x7]; // 0x669 (0x7) 
	struct FVerseAIBase_navigation_request_parameters $ExprResult67; // 0x670 (0x10)
	unsigned char $ExprResult68_680[0x8]; // 0x680 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x0000000014_688[0x2]; // 0x688 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult69; // 0x68a (0x1)
	unsigned char $ExprResultStack70_68b[0x2]; // 0x68b (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_68d[0x3]; // 0x68d (0x3) 
	int64_t $AsyncResult71; // 0x690 (0x8)
	class UConcurrency_task* $AsyncTask72; // 0x698 (0x8)
	unsigned char $AsyncTaskClass73_6a0[0x10]; // 0x6a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult74; // 0x6b0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy75; // 0x6b8 (0x1)
	unsigned char unreflected_6b9[0x7]; // 0x6b9 (0x7) 
	unsigned char $Callee76_6c0[0x10]; // 0x6c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult77_6d0[0x10]; // 0x6d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleGoTo_L_Nping__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

