// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_creature$GameLoop
// Size: 0x739
class Utask_CompanionAI_companion_creature$GameLoop : public UConcurrency_task
{
	class UCompanionAI_companion_creature* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	class UObject* verse0xCA7BB203AIMovement2; // 0x158 (0x8)
	unsigned char $ExprResultStack0_160[0x8]; // 0x160 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x963EC691Character2; // 0x168 (0x8)
	unsigned char $ExprResultStack1_170[0x8]; // 0x170 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee2_178[0x10]; // 0x178 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult3; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	struct FSpatialMath_vector3 verse0xFE3AE8F0OriginalPosition2; // 0x190 (0x18)
	unsigned char unreflected_1a8[0x8]; // 0x1a8 (0x8) 
	struct FSpatialMath_transform $ExprResult4; // 0x1b0 (0x60)
	class UObject* verse0x000000003; // 0x210 (0x8)
	unsigned char $Callee5_218[0x10]; // 0x218 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult6; // 0x228 (0x1)
	unsigned char unreflected_229[0x7]; // 0x229 (0x7) 
	class UGame_Abilities_gameplay_ability_asset* verse0xC4B561B1HowlAbility2; // 0x230 (0x8)
	unsigned char $Callee7_238[0x10]; // 0x238 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult8_248[0x10]; // 0x248 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UGame_Abilities_gameplay_ability_asset* verse0x7F5D3678MeleeAttackAbility2; // 0x258 (0x8)
	unsigned char $Callee9_260[0x10]; // 0x260 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult10_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UConcurrency_task* $AsyncTask11; // 0x280 (0x8)
	unsigned char $AsyncTaskClass12_288[0x10]; // 0x288 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult13; // 0x298 (0x8)
	class UGame_Abilities_ability_component* verse0x0C7EF844AbilitySystem5; // 0x2a0 (0x8)
	unsigned char $ExprResultStack14_2a8[0x8]; // 0x2a8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UGame_Abilities_ability_component* verse0x000000007; // 0x2b0 (0x8)
	unsigned char $InvokeSureResultDummy15; // 0x2b8 (0x1)
	unsigned char unreflected_2b9[0x7]; // 0x2b9 (0x7) 
	unsigned char $Callee16_2c0[0x10]; // 0x2c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UClass* $ExprResult17; // 0x2d0 (0x8)
	class UGame_Abilities_gameplay_ability_asset* verse0x000000008; // 0x2d8 (0x8)
	unsigned char $Callee18_2e0[0x10]; // 0x2e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult19; // 0x2f0 (0x1)
	unsigned char unreflected_2f1[0x7]; // 0x2f1 (0x7) 
	class UObject* verse0x000000009; // 0x2f8 (0x8)
	unsigned char $AsyncTaskClass20_300[0x10]; // 0x300 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lnavigation__target_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult21; // 0x310 (0x20)
	class UVerseAIBase_navigation_target* $ExprResultStack23; // 0x330 (0x8)
	unsigned char $Callee24_338[0x10]; // 0x338 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack25; // 0x348 (0x18)
	unsigned char $Callee26_360[0x10]; // 0x360 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult27; // 0x370 (0x30)
	struct FSpatialMath_vector3 $ExprResult28; // 0x3a0 (0x18)
	unsigned char $ExprResult29_3b8[0x11]; // 0x3b8 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_3c9[0x7]; // 0x3c9 (0x7) 
	class UObject* verse0x0000000010; // 0x3d0 (0x8)
	unsigned char $AsyncTaskClass30_3d8[0x10]; // 0x3d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lnavigation__target_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult31; // 0x3e8 (0x20)
	class UVerseAIBase_navigation_target* $ExprResultStack33; // 0x408 (0x8)
	unsigned char $Callee34_410[0x10]; // 0x410 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack35; // 0x420 (0x18)
	unsigned char $Callee36_438[0x10]; // 0x438 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult37; // 0x448 (0x30)
	struct FSpatialMath_vector3 $ExprResult38; // 0x478 (0x18)
	unsigned char $ExprResult39_490[0x11]; // 0x490 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_4a1[0x7]; // 0x4a1 (0x7) 
	class UGame_Abilities_ability_component* verse0x0C7EF844AbilitySystem11; // 0x4a8 (0x8)
	unsigned char $ExprResultStack40_4b0[0x8]; // 0x4b0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UGame_Abilities_ability_component* verse0x0000000013; // 0x4b8 (0x8)
	unsigned char $InvokeSureResultDummy41; // 0x4c0 (0x1)
	unsigned char unreflected_4c1[0x7]; // 0x4c1 (0x7) 
	unsigned char $Callee42_4c8[0x10]; // 0x4c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UClass* $ExprResult43; // 0x4d8 (0x8)
	class UGame_Abilities_gameplay_ability_asset* verse0x0000000014; // 0x4e0 (0x8)
	unsigned char $Callee44_4e8[0x10]; // 0x4e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult45; // 0x4f8 (0x1)
	unsigned char unreflected_4f9[0x7]; // 0x4f9 (0x7) 
	class UObject* verse0x0000000015; // 0x500 (0x8)
	unsigned char $AsyncTaskClass46_508[0x10]; // 0x508 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lnavigation__target_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult47; // 0x518 (0x20)
	class UVerseAIBase_navigation_target* $ExprResultStack49; // 0x538 (0x8)
	unsigned char $Callee50_540[0x10]; // 0x540 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack51; // 0x550 (0x18)
	unsigned char $Callee52_568[0x10]; // 0x568 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult53; // 0x578 (0x30)
	struct FSpatialMath_vector3 $ExprResult54; // 0x5a8 (0x18)
	unsigned char $ExprResult55_5c0[0x11]; // 0x5c0 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_5d1[0x7]; // 0x5d1 (0x7) 
	unsigned char $AsyncTaskClass56_5d8[0x10]; // 0x5d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x0000000016; // 0x5e8 (0x8)
	unsigned char $AsyncTaskClass57_5f0[0x10]; // 0x5f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lnavigation__target_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult58; // 0x600 (0x20)
	class UVerseAIBase_navigation_target* $ExprResultStack60; // 0x620 (0x8)
	unsigned char $Callee61_628[0x10]; // 0x628 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack62; // 0x638 (0x18)
	unsigned char $Callee63_650[0x10]; // 0x650 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult64; // 0x660 (0x30)
	struct FSpatialMath_vector3 $ExprResult65; // 0x690 (0x18)
	unsigned char $ExprResult66_6a8[0x11]; // 0x6a8 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_6b9[0x7]; // 0x6b9 (0x7) 
	class UObject* verse0x93780F55CreatureActions17; // 0x6c0 (0x8)
	unsigned char $ExprResultStack67_6c8[0x8]; // 0x6c8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UDiagnostics_log* verse0x0000000019; // 0x6d0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy68; // 0x6d8 (0x1)
	unsigned char unreflected_6d9[0x7]; // 0x6d9 (0x7) 
	unsigned char $Callee69_6e0[0x10]; // 0x6e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R $ExprResult70; // 0x6f0 (0x18)
	unsigned char $ExprResult71_708[0x10]; // 0x708 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResult72_718[0x2]; // 0x718 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_71a[0x6]; // 0x71a (0x6) 
	class UObject* verse0x0000000020; // 0x720 (0x8)
	unsigned char $AsyncTaskClass73_728[0x10]; // 0x728 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult74; // 0x738 (0x1)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_creature$GameLoop.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms | HasDefaults)
};

