// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$CrouchService
// Size: 0x1b8
class Utask_CompanionAI_companion_ai$CrouchService : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	class UObject* verse0x88C4894FNPCMovement1; // 0x158 (0x8)
	unsigned char $ExprResultStack0_160[0x8]; // 0x160 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UConcurrency_task* $AsyncTask1; // 0x168 (0x8)
	unsigned char $AsyncTaskClass2_170[0x10]; // 0x170 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult3; // 0x180 (0x8)
	class UObject* verse0x000000003; // 0x188 (0x8)
	unsigned char $AsyncTaskClass4_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult5; // 0x1a0 (0x1)
	unsigned char unreflected_1a1[0x7]; // 0x1a1 (0x7) 
	unsigned char $AsyncTaskClass6_1a8[0x10]; // 0x1a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$CrouchService.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

