// VerseClass /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$LookAtThreat_L_Nfort__threat__info_R
// Size: 0x208
class Utask_VerseArchetypes_sniper_ai$LookAtThreat_L_Nfort__threat__info_R : public UConcurrency_task
{
	class UVerseArchetypes_sniper_ai* Self; // 0x148 (0x8)
	struct FVerseAIBase_fort_threat_info verse0xB2CDDD72Argument; // 0x150 (0x30)
	class UObject* verse0x91E0A2A2NPCActions1; // 0x180 (0x8)
	unsigned char $ExprResultStack0_188[0x8]; // 0x188 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	int64_t $AsyncBeginCount1; // 0x190 (0x8)
	class UObject* verse0x000000003; // 0x198 (0x8)
	class UConcurrency_task* $AsyncTask2; // 0x1a0 (0x8)
	unsigned char $AsyncTaskClass3_1a8[0x10]; // 0x1a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack4; // 0x1b8 (0x18)
	unsigned char $Callee5_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult6; // 0x1e0 (0x8)
	class UConcurrency_task* $AsyncTask7; // 0x1e8 (0x8)
	unsigned char $AsyncTaskClass8_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult9; // 0x200 (0x8)

	/* Functions */

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$LookAtThreat_L_Nfort__threat__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

