// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleReviveCommand_L_Nping__info_R
// Size: 0x2f8
class Utask_CompanionAI_companion_ai$HandleReviveCommand_L_Nping__info_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct FCompanionAI_ping_info verse0xB2CDDD72Argument; // 0x150 (0x38)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	unsigned char $Callee1_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char verse0xC5DFEEC1PlayDeclineCommandAnim1; // 0x1b0 (0x1)
	unsigned char unreflected_1b1[0x7]; // 0x1b1 (0x7) 
	class UVerseEngine_Entity_entity* verse0xFD64D7AAEmitter2; // 0x1b8 (0x8)
	unsigned char $ExprResultStack3_1c0[0x8]; // 0x1c0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x6B4100B8EmitterCharacter3; // 0x1c8 (0x8)
	unsigned char $ExprResultStack4_1d0[0x8]; // 0x1d0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack5_1d8[0x8]; // 0x1d8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee6_1e0[0x10]; // 0x1e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lentity_Mtuple_L_R_R $ExprResult7; // 0x1f0 (0x10)
	struct Ftuple_L_R $ExprResult8; // 0x200 (0x1)
	unsigned char verse0xC96E9091HasRevivedEmitter4; // 0x201 (0x1)
	unsigned char unreflected_202[0x6]; // 0x202 (0x6) 
	class UConcurrency_task* $AsyncTask9; // 0x208 (0x8)
	unsigned char $AsyncTaskClass10_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult11; // 0x220 (0x8)
	unsigned char $ExprResultStack12_228[0x2]; // 0x228 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_22a[0x6]; // 0x22a (0x6) 
	struct TArray<class UObject*> verse0xBFBCE682TeamMembers4; // 0x230 (0x10)
	unsigned char $Callee13_240[0x10]; // 0x240 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lfort__character_Mtuple_L_R_R $ExprResult14; // 0x250 (0x10)
	struct Ftuple_L_R $ExprResult15; // 0x260 (0x1)
	unsigned char unreflected_261[0x7]; // 0x261 (0x7) 
	int64_t $ForIndex16; // 0x268 (0x8)
	int64_t $ForLength17; // 0x270 (0x8)
	class UObject* verse0xAE35E375TeamMember9; // 0x278 (0x8)
	unsigned char verse0x87226150HasRevivedTeamMember11; // 0x280 (0x1)
	unsigned char unreflected_281[0x7]; // 0x281 (0x7) 
	unsigned char $AsyncTaskClass18_288[0x10]; // 0x288 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultStack19_298[0x2]; // 0x298 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_29a[0x6]; // 0x29a (0x6) 
	class UObject* verse0xB4DBB24FPingActions14; // 0x2a0 (0x8)
	unsigned char $ExprResultStack20_2a8[0x8]; // 0x2a8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x0000000015; // 0x2b0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy21; // 0x2b8 (0x1)
	unsigned char unreflected_2b9[0x7]; // 0x2b9 (0x7) 
	unsigned char $Callee22_2c0[0x10]; // 0x2c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy23; // 0x2d0 (0x1)
	unsigned char unreflected_2d1[0x7]; // 0x2d1 (0x7) 
	unsigned char $Callee24_2d8[0x10]; // 0x2d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult25_2e8[0x10]; // 0x2e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleReviveCommand_L_Nping__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

