// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$SetLeashPosition_L_Nvector3_M_Nfloat_M_Nentity_R
// Size: 0x430
class Utask_CompanionAI_companion_ai$SetLeashPosition_L_Nvector3_M_Nfloat_M_Nentity_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_Lvector3_Mfloat_Mentity_R verse0xB2CDDD72Argument; // 0x150 (0x28)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x178 (0x1)
	unsigned char unreflected_179[0x7]; // 0x179 (0x7) 
	unsigned char $Callee1_180[0x10]; // 0x180 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> verse0xFFC68BC5Array2; // 0x1a0 (0x10)
	unsigned char $Callee3_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct TArray<struct TArray<>> $ExprResult4; // 0x1c0 (0x10)
	struct TArray<> verse0xFFC68BC5Array3; // 0x1d0 (0x10)
	struct Ftuple_L_Kchar_M_Kchar_R verse0x000000004; // 0x1e0 (0x20)
	unsigned char $ExprResult5_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultStack6_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $Callee7_220[0x10]; // 0x220 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultDummy8_230[0x10]; // 0x230 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultDummy9_240[0x10]; // 0x240 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<struct TArray<>> $ForResult10; // 0x250 (0x10)
	int64_t $ForIndex11; // 0x260 (0x8)
	int64_t $ForLength12; // 0x268 (0x8)
	unsigned char verse0xFB88B569Item6_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> $ExprResult13; // 0x280 (0x10)
	unsigned char verse0xFFC68BC5Array7_290[0x10]; // 0x290 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> $ForResult14; // 0x2a0 (0x10)
	int64_t $ForIndex15; // 0x2b0 (0x8)
	int64_t $ForLength16; // 0x2b8 (0x8)
	unsigned char verse0xFB88B569Item9; // 0x2c0 (0x1)
	unsigned char unreflected_2c1[0x7]; // 0x2c1 (0x7) 
	unsigned char $ExprResult17_2c8[0x10]; // 0x2c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ForResult18_2d8[0x10]; // 0x2d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	int64_t $ForIndex19; // 0x2e8 (0x8)
	int64_t $ForLength20; // 0x2f0 (0x8)
	unsigned char verse0xFB88B569Item11_2f8[0x10]; // 0x2f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult21; // 0x308 (0x1)
	unsigned char unreflected_309[0x7]; // 0x309 (0x7) 
	int64_t $AsyncBeginCount22; // 0x310 (0x8)
	class UConcurrency_task* $AsyncTask23; // 0x318 (0x8)
	unsigned char $AsyncTaskClass24_320[0x10]; // 0x320 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mfloat_Mcolor_R $ExprResult25; // 0x330 (0x38)
	int64_t $AsyncResult26; // 0x368 (0x8)
	class UObject* verse0x88C4894FNPCMovement12; // 0x370 (0x8)
	unsigned char $ExprResultStack27_378[0x8]; // 0x378 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x0000000013; // 0x380 (0x8)
	enum EVerseTrue $InvokeSureResultDummy28; // 0x388 (0x1)
	unsigned char unreflected_389[0x7]; // 0x389 (0x7) 
	unsigned char $Callee29_390[0x10]; // 0x390 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mtype_7b1_2e000000e_2b02_7d_Mfloat_R $ExprResult30; // 0x3a0 (0x28)
	class UObject* verse0x0000000015; // 0x3c8 (0x8)
	enum EVerseTrue $InvokeSureResultDummy31; // 0x3d0 (0x1)
	unsigned char unreflected_3d1[0x7]; // 0x3d1 (0x7) 
	unsigned char $Callee32_3d8[0x10]; // 0x3d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UConcurrency_task* $AsyncTask33; // 0x3e8 (0x8)
	unsigned char $AsyncTaskClass34_3f0[0x10]; // 0x3f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult35; // 0x400 (0x8)
	enum EVerseTrue $InvokeSureResultDummy36; // 0x408 (0x1)
	unsigned char unreflected_409[0x7]; // 0x409 (0x7) 
	unsigned char $Callee37_410[0x10]; // 0x410 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult38_420[0x10]; // 0x420 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$SetLeashPosition_L_Nvector3_M_Nfloat_M_Nentity_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

