// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleGoToCommand_L_Nping__info_R
// Size: 0x570
class Utask_CompanionAI_companion_ai$HandleGoToCommand_L_Nping__info_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct FCompanionAI_ping_info verse0xB2CDDD72Argument; // 0x150 (0x38)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	unsigned char $Callee1_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UVerseEngine_Entity_entity* verse0xFD64D7AAEmitter2; // 0x1b0 (0x8)
	unsigned char $ExprResultStack3_1b8[0x8]; // 0x1b8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	int64_t $AsyncBeginCount4; // 0x1c0 (0x8)
	class UConcurrency_task* $AsyncTask5; // 0x1c8 (0x8)
	unsigned char $AsyncTaskClass6_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mfloat_Mentity_R $ExprResult7; // 0x1e0 (0x28)
	int64_t $AsyncResult8; // 0x208 (0x8)
	class UConcurrency_task* $AsyncTask9; // 0x210 (0x8)
	unsigned char $AsyncTaskClass10_218[0x10]; // 0x218 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult11; // 0x228 (0x8)
	unsigned char verse0x1EB80E5BThreatInfo3_230[0x31]; // 0x230 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_261[0x7]; // 0x261 (0x7) 
	unsigned char $AsyncTaskClass12_268[0x10]; // 0x268 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult13; // 0x278 (0x1)
	unsigned char unreflected_279[0x7]; // 0x279 (0x7) 
	int64_t $AsyncBeginCount14; // 0x280 (0x8)
	unsigned char $ExprResult15_288[0x31]; // 0x288 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_2b9[0x7]; // 0x2b9 (0x7) 
	class UConcurrency_task* $AsyncTask16; // 0x2c0 (0x8)
	unsigned char $AsyncTaskClass17_2c8[0x10]; // 0x2c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult18; // 0x2d8 (0x1)
	unsigned char unreflected_2d9[0x7]; // 0x2d9 (0x7) 
	int64_t $AsyncResult19; // 0x2e0 (0x8)
	unsigned char $ExprResult20_2e8[0x31]; // 0x2e8 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_319[0x7]; // 0x319 (0x7) 
	class UConcurrency_task* $AsyncTask21; // 0x320 (0x8)
	unsigned char $AsyncTaskClass22_328[0x10]; // 0x328 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult23; // 0x338 (0x1)
	unsigned char unreflected_339[0x7]; // 0x339 (0x7) 
	int64_t $AsyncResult24; // 0x340 (0x8)
	struct FVerseAIBase_fort_threat_info verse0xD4ED8431Threat4; // 0x348 (0x30)
	unsigned char $ExprResultStack25_378[0x31]; // 0x378 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack26_3a9[0x2]; // 0x3a9 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack27_3ab[0x2]; // 0x3ab (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_3ad[0x3]; // 0x3ad (0x3) 
	class UConcurrency_task* $AsyncTask28; // 0x3b0 (0x8)
	unsigned char $AsyncTaskClass29_3b8[0x10]; // 0x3b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult30; // 0x3c8 (0x8)
	unsigned char $ExprResultStack31_3d0[0x31]; // 0x3d0 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_401[0x7]; // 0x401 (0x7) 
	unsigned char $AsyncTaskClass32_408[0x10]; // 0x408 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult33; // 0x418 (0x1)
	unsigned char unreflected_419[0x7]; // 0x419 (0x7) 
	unsigned char $AsyncTaskClass34_420[0x10]; // 0x420 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mtype_7b0_2e500000_7d_Mtype_7b1_2e500000_7d_R $ExprResult35; // 0x430 (0x28)
	unsigned char $ExprResultStack36_458[0x9]; // 0x458 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_461[0x7]; // 0x461 (0x7) 
	double $ExprResultStack37; // 0x468 (0x8)
	unsigned char $Callee38_470[0x10]; // 0x470 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult39; // 0x480 (0x30)
	struct FSpatialMath_transform $ExprResult40; // 0x4b0 (0x60)
	class UObject* verse0x0000000010; // 0x510 (0x8)
	unsigned char $ExprResultStack41_518[0x8]; // 0x518 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee42_520[0x10]; // 0x520 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult43; // 0x530 (0x1)
	unsigned char unreflected_531[0x7]; // 0x531 (0x7) 
	unsigned char $Callee44_538[0x10]; // 0x538 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult45; // 0x548 (0x1)
	enum EVerseTrue $InvokeSureResultDummy46; // 0x549 (0x1)
	unsigned char unreflected_54a[0x6]; // 0x54a (0x6) 
	unsigned char $Callee47_550[0x10]; // 0x550 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult48_560[0x10]; // 0x560 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleGoToCommand_L_Nping__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

