// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$ShootTargetService_L_Nfloat_R
// Size: 0x518
class Utask_CompanionAI_companion_ai$ShootTargetService_L_Nfloat_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	double verse0xB2CDDD72Argument; // 0x150 (0x8)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x158 (0x1)
	unsigned char unreflected_159[0x7]; // 0x159 (0x7) 
	unsigned char $Callee1_160[0x10]; // 0x160 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_170[0x10]; // 0x170 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UConcurrency_task* $AsyncTask3; // 0x180 (0x8)
	unsigned char $AsyncTaskClass4_188[0x10]; // 0x188 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult5; // 0x198 (0x8)
	struct FVerseAIBase_fort_threat_info verse0x1EB80E5BThreatInfo3; // 0x1a0 (0x30)
	class UObject* verse0x000000004; // 0x1d0 (0x8)
	unsigned char $ExprResultStack6_1d8[0x8]; // 0x1d8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack7_1e0[0x31]; // 0x1e0 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_211[0x7]; // 0x211 (0x7) 
	unsigned char $Callee8_218[0x10]; // 0x218 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult9; // 0x228 (0x1)
	unsigned char unreflected_229[0x7]; // 0x229 (0x7) 
	int64_t $AsyncBeginCount10; // 0x230 (0x8)
	class UConcurrency_task* $AsyncTask11; // 0x238 (0x8)
	unsigned char $AsyncTaskClass12_240[0x10]; // 0x240 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult13; // 0x250 (0x1)
	unsigned char unreflected_251[0x7]; // 0x251 (0x7) 
	int64_t $AsyncResult14; // 0x258 (0x8)
	class UConcurrency_task* $AsyncTask15; // 0x260 (0x8)
	unsigned char $AsyncTaskClass16_268[0x10]; // 0x268 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult17; // 0x278 (0x1)
	unsigned char unreflected_279[0x7]; // 0x279 (0x7) 
	int64_t $AsyncResult18; // 0x280 (0x8)
	class UObject* verse0x91E0A2A2NPCActions6; // 0x288 (0x8)
	unsigned char $ExprResultStack19_290[0x8]; // 0x290 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack20_298[0x2]; // 0x298 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack21_29a[0x2]; // 0x29a (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_29c[0x4]; // 0x29c (0x4) 
	struct FSpatialMath_vector3 verse0x96EC8CCEDestination6; // 0x2a0 (0x18)
	class UObject* verse0x000000007; // 0x2b8 (0x8)
	unsigned char $ExprResultStack22_2c0[0x8]; // 0x2c0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack23_2c8[0x19]; // 0x2c8 (0x19) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_2e1[0x7]; // 0x2e1 (0x7) 
	unsigned char $Callee24_2e8[0x10]; // 0x2e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult25; // 0x2f8 (0x1)
	unsigned char unreflected_2f9[0x7]; // 0x2f9 (0x7) 
	unsigned char $ExprResultStack26_300[0x9]; // 0x300 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_309[0x7]; // 0x309 (0x7) 
	double $ExprResultStack27; // 0x310 (0x8)
	unsigned char $Callee28_318[0x10]; // 0x318 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult29; // 0x328 (0x30)
	unsigned char unreflected_358[0x8]; // 0x358 (0x8) 
	struct FSpatialMath_transform $ExprResult30; // 0x360 (0x60)
	class UObject* verse0x000000008; // 0x3c0 (0x8)
	unsigned char $ExprResultStack31_3c8[0x8]; // 0x3c8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee32_3d0[0x10]; // 0x3d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult33; // 0x3e0 (0x1)
	unsigned char unreflected_3e1[0x7]; // 0x3e1 (0x7) 
	unsigned char $Callee34_3e8[0x10]; // 0x3e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult35; // 0x3f8 (0x1)
	unsigned char unreflected_3f9[0x7]; // 0x3f9 (0x7) 
	unsigned char $ExprResultStack36_400[0x9]; // 0x400 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_409[0x7]; // 0x409 (0x7) 
	double $ExprResultStack37; // 0x410 (0x8)
	unsigned char $Callee38_418[0x10]; // 0x418 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult39; // 0x428 (0x30)
	struct FSpatialMath_vector3 $ExprResultStack40; // 0x458 (0x18)
	unsigned char $Callee41_470[0x10]; // 0x470 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy42; // 0x480 (0x1)
	unsigned char unreflected_481[0x7]; // 0x481 (0x7) 
	unsigned char $Callee43_488[0x10]; // 0x488 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult44_498[0x10]; // 0x498 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x000000009; // 0x4a8 (0x8)
	class UConcurrency_task* $AsyncTask45; // 0x4b0 (0x8)
	unsigned char $AsyncTaskClass46_4b8[0x10]; // 0x4b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult47; // 0x4c8 (0x8)
	unsigned char $AsyncTaskClass48_4d0[0x10]; // 0x4d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $AsyncTaskClass49_4e0[0x10]; // 0x4e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult50; // 0x4f0 (0x1)
	enum EVerseTrue $InvokeSureResultDummy51; // 0x4f1 (0x1)
	unsigned char unreflected_4f2[0x6]; // 0x4f2 (0x6) 
	unsigned char $Callee52_4f8[0x10]; // 0x4f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult53_508[0x10]; // 0x508 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$ShootTargetService_L_Nfloat_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

