// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$WaitForDamage
// Size: 0x270
class Utask_CompanionAI_companion_ai$WaitForDamage : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x151 (0x1)
	unsigned char unreflected_152[0x6]; // 0x152 (0x6) 
	unsigned char $Callee1_158[0x10]; // 0x158 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x963EC691Character2; // 0x178 (0x8)
	unsigned char $ExprResultStack3_180[0x8]; // 0x180 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee4_188[0x10]; // 0x188 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult5; // 0x198 (0x1)
	unsigned char unreflected_199[0x7]; // 0x199 (0x7) 
	int64_t $AsyncBeginCount6; // 0x1a0 (0x8)
	class UObject* verse0x000000004; // 0x1a8 (0x8)
	class UObject* verse0x000000005; // 0x1b0 (0x8)
	unsigned char $Callee7_1b8[0x10]; // 0x1b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult8; // 0x1c8 (0x1)
	unsigned char unreflected_1c9[0x7]; // 0x1c9 (0x7) 
	class UConcurrency_task* $AsyncTask9; // 0x1d0 (0x8)
	unsigned char $AsyncTaskClass10_1d8[0x10]; // 0x1d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult11; // 0x1e8 (0x1)
	unsigned char unreflected_1e9[0x7]; // 0x1e9 (0x7) 
	int64_t $AsyncResult12; // 0x1f0 (0x8)
	class UObject* verse0x000000006; // 0x1f8 (0x8)
	class UObject* verse0x000000007; // 0x200 (0x8)
	unsigned char $Callee13_208[0x10]; // 0x208 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult14; // 0x218 (0x1)
	unsigned char unreflected_219[0x7]; // 0x219 (0x7) 
	class UConcurrency_task* $AsyncTask15; // 0x220 (0x8)
	unsigned char $AsyncTaskClass16_228[0x10]; // 0x228 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult17; // 0x238 (0x1)
	unsigned char unreflected_239[0x7]; // 0x239 (0x7) 
	int64_t $AsyncResult18; // 0x240 (0x8)
	enum EVerseTrue $InvokeSureResultDummy19; // 0x248 (0x1)
	unsigned char unreflected_249[0x7]; // 0x249 (0x7) 
	unsigned char $Callee20_250[0x10]; // 0x250 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult21_260[0x10]; // 0x260 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$WaitForDamage.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

