// VerseClass /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.task_Game_Abilities_gameplay_ability$ActivateAbilityAsync
// Size: 0x1b8
class Utask_Game_Abilities_gameplay_ability$ActivateAbilityAsync : public UConcurrency_task
{
	class UGame_Abilities_gameplay_ability* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	int64_t $AsyncBeginCount0; // 0x158 (0x8)
	class UConcurrency_task* $AsyncTask1; // 0x160 (0x8)
	unsigned char $AsyncTaskClass2_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult3; // 0x178 (0x1)
	unsigned char unreflected_179[0x7]; // 0x179 (0x7) 
	int64_t $AsyncResult4; // 0x180 (0x8)
	class UVerse_event* verse0x000000001; // 0x188 (0x8)
	class UConcurrency_task* $AsyncTask5; // 0x190 (0x8)
	unsigned char $AsyncTaskClass6_198[0x10]; // 0x198 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult7; // 0x1a8 (0x1)
	unsigned char unreflected_1a9[0x7]; // 0x1a9 (0x7) 
	int64_t $AsyncResult8; // 0x1b0 (0x8)

	/* Functions */

	// Function /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.task_Game_Abilities_gameplay_ability$ActivateAbilityAsync.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

