// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleHoldPositionCommand_L_Nping__info_R
// Size: 0x330
class Utask_CompanionAI_companion_ai$HandleHoldPositionCommand_L_Nping__info_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct FCompanionAI_ping_info verse0xB2CDDD72Argument; // 0x150 (0x38)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	unsigned char $Callee1_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct FSpatialMath_vector3 verse0x60C61594CurrentPosition1; // 0x1b0 (0x18)
	unsigned char unreflected_1c8[0x8]; // 0x1c8 (0x8) 
	struct FSpatialMath_transform $ExprResult3; // 0x1d0 (0x60)
	class UObject* verse0x000000003; // 0x230 (0x8)
	unsigned char $ExprResultStack4_238[0x8]; // 0x238 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee5_240[0x10]; // 0x240 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult6; // 0x250 (0x1)
	unsigned char unreflected_251[0x7]; // 0x251 (0x7) 
	unsigned char $Callee7_258[0x10]; // 0x258 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult8; // 0x268 (0x1)
	unsigned char unreflected_269[0x7]; // 0x269 (0x7) 
	class UVerseEngine_Entity_entity* verse0xFD64D7AAEmitter4; // 0x270 (0x8)
	unsigned char $ExprResultStack9_278[0x8]; // 0x278 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	int64_t $AsyncBeginCount10; // 0x280 (0x8)
	class UConcurrency_task* $AsyncTask11; // 0x288 (0x8)
	unsigned char $AsyncTaskClass12_290[0x10]; // 0x290 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mfloat_Mentity_R $ExprResult13; // 0x2a0 (0x28)
	int64_t $AsyncResult14; // 0x2c8 (0x8)
	class UConcurrency_task* $AsyncTask15; // 0x2d0 (0x8)
	unsigned char $AsyncTaskClass16_2d8[0x10]; // 0x2d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult17; // 0x2e8 (0x1)
	unsigned char unreflected_2e9[0x7]; // 0x2e9 (0x7) 
	int64_t $AsyncResult18; // 0x2f0 (0x8)
	unsigned char $AsyncTaskClass19_2f8[0x10]; // 0x2f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult20; // 0x308 (0x1)
	enum EVerseTrue $InvokeSureResultDummy21; // 0x309 (0x1)
	unsigned char unreflected_30a[0x6]; // 0x30a (0x6) 
	unsigned char $Callee22_310[0x10]; // 0x310 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult23_320[0x10]; // 0x320 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleHoldPositionCommand_L_Nping__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

