// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GetNewTargetPerception
// Size: 0x233
class Utask_CompanionAI_companion_ai$GetNewTargetPerception : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	unsigned char RetVal_158[0x31]; // 0x158 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x000000001_189[0x2]; // 0x189 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_18b[0x5]; // 0x18b (0x5) 
	class UObject* verse0x0F05355DThreatPerception3; // 0x190 (0x8)
	unsigned char $ExprResultStack0_198[0x8]; // 0x198 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	struct FVerseAIBase_fort_threat_info verse0x1EB80E5BThreatInfo4; // 0x1a0 (0x30)
	class UObject* verse0x000000005; // 0x1d0 (0x8)
	class UObject* verse0x000000006; // 0x1d8 (0x8)
	unsigned char $Callee1_1e0[0x10]; // 0x1e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult2; // 0x1f0 (0x1)
	unsigned char unreflected_1f1[0x7]; // 0x1f1 (0x7) 
	unsigned char $ExprResult3_1f8[0x10]; // 0x1f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	class UConcurrency_task* $AsyncTask4; // 0x208 (0x8)
	unsigned char $AsyncTaskClass5_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult6; // 0x220 (0x1)
	unsigned char unreflected_221[0x7]; // 0x221 (0x7) 
	int64_t $AsyncResult7; // 0x228 (0x8)
	unsigned char $ExprResult8; // 0x230 (0x1)
	unsigned char $ExprResultStack9_231[0x2]; // 0x231 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GetNewTargetPerception.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

