// VerseClass /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$RunGameplayLogic
// Size: 0x531
class Utask_VerseArchetypes_sniper_ai$RunGameplayLogic : public UConcurrency_task
{
	class UVerseArchetypes_sniper_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	class UObject* verse0x0F05355DThreatPerception1; // 0x158 (0x8)
	unsigned char $ExprResultStack0_160[0x8]; // 0x160 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x1EB80E5BThreatInfo1_168[0x31]; // 0x168 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_199[0x7]; // 0x199 (0x7) 
	struct FVerseAIBase_fort_threat_info $ExprResult1; // 0x1a0 (0x30)
	class UObject* verse0x000000002; // 0x1d0 (0x8)
	unsigned char $ExprResultStack2_1d8[0x31]; // 0x1d8 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_209[0x7]; // 0x209 (0x7) 
	unsigned char $Callee3_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult4; // 0x220 (0x1)
	unsigned char unreflected_221[0x7]; // 0x221 (0x7) 
	struct FVerseAIBase_fort_threat_info verse0x2CFDBF0ACurrentThreat4; // 0x228 (0x30)
	unsigned char $ExprResultStack5_258[0x31]; // 0x258 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_289[0x7]; // 0x289 (0x7) 
	int64_t $AsyncBeginCount6; // 0x290 (0x8)
	class UConcurrency_task* $AsyncTask7; // 0x298 (0x8)
	unsigned char $AsyncTaskClass8_2a0[0x10]; // 0x2a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult9; // 0x2b0 (0x8)
	struct FVerseAIBase_fort_threat_info verse0xEBCD492ANewThreatInfo5; // 0x2b8 (0x30)
	class UObject* verse0x000000006; // 0x2e8 (0x8)
	class UObject* verse0x000000007; // 0x2f0 (0x8)
	unsigned char $Callee10_2f8[0x10]; // 0x2f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult11; // 0x308 (0x1)
	unsigned char unreflected_309[0x7]; // 0x309 (0x7) 
	unsigned char $ExprResult12_310[0x10]; // 0x310 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	class UConcurrency_task* $AsyncTask13; // 0x320 (0x8)
	unsigned char $AsyncTaskClass14_328[0x10]; // 0x328 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult15; // 0x338 (0x1)
	unsigned char unreflected_339[0x7]; // 0x339 (0x7) 
	int64_t $AsyncResult16; // 0x340 (0x8)
	unsigned char $ExprResult17_348[0x31]; // 0x348 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_379[0x7]; // 0x379 (0x7) 
	struct FVerseAIBase_fort_threat_info verse0xE0991445UpdatedThreatInfo8; // 0x380 (0x30)
	class UObject* verse0x000000009; // 0x3b0 (0x8)
	class UObject* verse0x0000000010; // 0x3b8 (0x8)
	unsigned char $Callee18_3c0[0x10]; // 0x3c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult19; // 0x3d0 (0x1)
	unsigned char unreflected_3d1[0x7]; // 0x3d1 (0x7) 
	unsigned char $ExprResult20_3d8[0x10]; // 0x3d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	class UConcurrency_task* $AsyncTask21; // 0x3e8 (0x8)
	unsigned char $AsyncTaskClass22_3f0[0x10]; // 0x3f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult23; // 0x400 (0x1)
	unsigned char unreflected_401[0x7]; // 0x401 (0x7) 
	int64_t $AsyncResult24; // 0x408 (0x8)
	unsigned char $ExprResult25_410[0x31]; // 0x410 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_441[0x7]; // 0x441 (0x7) 
	class UConcurrency_task* $AsyncTask26; // 0x448 (0x8)
	unsigned char $AsyncTaskClass27_450[0x10]; // 0x450 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult28; // 0x460 (0x1)
	unsigned char unreflected_461[0x7]; // 0x461 (0x7) 
	int64_t $AsyncResult29; // 0x468 (0x8)
	struct FVerseAIBase_fort_threat_info verse0xEBCD492ANewThreatInfo12; // 0x470 (0x30)
	class UObject* verse0x0000000013; // 0x4a0 (0x8)
	class UObject* verse0x0000000014; // 0x4a8 (0x8)
	unsigned char $Callee30_4b0[0x10]; // 0x4b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult31; // 0x4c0 (0x1)
	unsigned char unreflected_4c1[0x7]; // 0x4c1 (0x7) 
	unsigned char $ExprResult32_4c8[0x10]; // 0x4c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	class UConcurrency_task* $AsyncTask33; // 0x4d8 (0x8)
	unsigned char $AsyncTaskClass34_4e0[0x10]; // 0x4e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult35; // 0x4f0 (0x1)
	unsigned char unreflected_4f1[0x7]; // 0x4f1 (0x7) 
	int64_t $AsyncResult36; // 0x4f8 (0x8)
	unsigned char $ExprResult37_500[0x31]; // 0x500 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)

	/* Functions */

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$RunGameplayLogic.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

