// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleNPCCommand_L_Nping__info_R
// Size: 0x610
class Utask_CompanionAI_companion_ai$HandleNPCCommand_L_Nping__info_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct FCompanionAI_ping_info verse0xB2CDDD72Argument; // 0x150 (0x38)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	unsigned char $Callee1_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> verse0xFFC68BC5Array2; // 0x1b0 (0x10)
	unsigned char $Callee3_1c0[0x10]; // 0x1c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct TArray<struct TArray<>> $ExprResult4; // 0x1d0 (0x10)
	struct TArray<> verse0xFFC68BC5Array3; // 0x1e0 (0x10)
	struct Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R verse0x000000004; // 0x1f0 (0x40)
	unsigned char $ExprResult5_230[0x10]; // 0x230 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultStack6_240[0x10]; // 0x240 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $Callee7_250[0x10]; // 0x250 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultStack8_260[0x10]; // 0x260 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $Callee9_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult10_280[0x10]; // 0x280 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultStack11_290[0x10]; // 0x290 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $Callee12_2a0[0x10]; // 0x2a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultStack13_2b0[0x10]; // 0x2b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $Callee14_2c0[0x10]; // 0x2c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultDummy15_2d0[0x10]; // 0x2d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultDummy16_2e0[0x10]; // 0x2e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultDummy17_2f0[0x10]; // 0x2f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultDummy18_300[0x10]; // 0x300 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<struct TArray<>> $ForResult19; // 0x310 (0x10)
	int64_t $ForIndex20; // 0x320 (0x8)
	int64_t $ForLength21; // 0x328 (0x8)
	unsigned char verse0xFB88B569Item6_330[0x10]; // 0x330 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> $ExprResult22; // 0x340 (0x10)
	unsigned char verse0xFFC68BC5Array7_350[0x10]; // 0x350 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> $ForResult23; // 0x360 (0x10)
	int64_t $ForIndex24; // 0x370 (0x8)
	int64_t $ForLength25; // 0x378 (0x8)
	unsigned char verse0xFB88B569Item9; // 0x380 (0x1)
	unsigned char unreflected_381[0x7]; // 0x381 (0x7) 
	unsigned char $ExprResult26_388[0x10]; // 0x388 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ForResult27_398[0x10]; // 0x398 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	int64_t $ForIndex28; // 0x3a8 (0x8)
	int64_t $ForLength29; // 0x3b0 (0x8)
	unsigned char verse0xFB88B569Item11_3b8[0x10]; // 0x3b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult30; // 0x3c8 (0x1)
	unsigned char unreflected_3c9[0x7]; // 0x3c9 (0x7) 
	unsigned char InvokeResultDummy31_3d0[0x10]; // 0x3d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack32_3e0[0x11]; // 0x3e0 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_3f1[0x7]; // 0x3f1 (0x7) 
	unsigned char $ExprResult33_3f8[0x10]; // 0x3f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult34_408[0x10]; // 0x408 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	class UConcurrency_task* $AsyncTask35; // 0x418 (0x8)
	unsigned char $AsyncTaskClass36_420[0x10]; // 0x420 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult37; // 0x430 (0x8)
	unsigned char InvokeResultDummy38_438[0x10]; // 0x438 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack39_448[0x11]; // 0x448 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_459[0x7]; // 0x459 (0x7) 
	unsigned char $ExprResult40_460[0x10]; // 0x460 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult41_470[0x10]; // 0x470 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $AsyncTaskClass42_480[0x10]; // 0x480 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char InvokeResultDummy43_490[0x10]; // 0x490 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack44_4a0[0x11]; // 0x4a0 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_4b1[0x7]; // 0x4b1 (0x7) 
	unsigned char $ExprResult45_4b8[0x10]; // 0x4b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult46_4c8[0x10]; // 0x4c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $AsyncTaskClass47_4d8[0x10]; // 0x4d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char InvokeResultDummy48_4e8[0x10]; // 0x4e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack49_4f8[0x11]; // 0x4f8 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_509[0x7]; // 0x509 (0x7) 
	unsigned char $ExprResult50_510[0x10]; // 0x510 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult51_520[0x10]; // 0x520 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $AsyncTaskClass52_530[0x10]; // 0x530 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char InvokeResultDummy53_540[0x10]; // 0x540 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack54_550[0x11]; // 0x550 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_561[0x7]; // 0x561 (0x7) 
	unsigned char $ExprResult55_568[0x10]; // 0x568 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult56_578[0x10]; // 0x578 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions17; // 0x588 (0x8)
	unsigned char $ExprResultStack57_590[0x8]; // 0x590 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x0000000019; // 0x598 (0x8)
	unsigned char $AsyncTaskClass58_5a0[0x10]; // 0x5a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult59; // 0x5b0 (0x1)
	unsigned char unreflected_5b1[0x7]; // 0x5b1 (0x7) 
	class UObject* verse0xB4DBB24FPingActions20; // 0x5b8 (0x8)
	unsigned char $ExprResultStack60_5c0[0x8]; // 0x5c0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x0000000021; // 0x5c8 (0x8)
	enum EVerseTrue $InvokeSureResultDummy61; // 0x5d0 (0x1)
	unsigned char unreflected_5d1[0x7]; // 0x5d1 (0x7) 
	unsigned char $Callee62_5d8[0x10]; // 0x5d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy63; // 0x5e8 (0x1)
	unsigned char unreflected_5e9[0x7]; // 0x5e9 (0x7) 
	unsigned char $Callee64_5f0[0x10]; // 0x5f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult65_600[0x10]; // 0x600 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$HandleNPCCommand_L_Nping__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

