// VerseClass /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$UseSniperWeapon_L_Nfort__threat__info_R
// Size: 0x230
class Utask_VerseArchetypes_sniper_ai$UseSniperWeapon_L_Nfort__threat__info_R : public UConcurrency_task
{
	class UVerseArchetypes_sniper_ai* Self; // 0x148 (0x8)
	struct FVerseAIBase_fort_threat_info verse0xB2CDDD72Argument; // 0x150 (0x30)
	class UObject* verse0xF161303FWeaponActions1; // 0x180 (0x8)
	unsigned char $ExprResultStack0_188[0x8]; // 0x188 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UConcurrency_task* $AsyncTask1; // 0x190 (0x8)
	unsigned char $AsyncTaskClass2_198[0x10]; // 0x198 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult3; // 0x1a8 (0x8)
	unsigned char verse0x00D31F3DHasReload2; // 0x1b0 (0x1)
	unsigned char unreflected_1b1[0x7]; // 0x1b1 (0x7) 
	class UObject* verse0x000000003; // 0x1b8 (0x8)
	unsigned char $Callee4_1c0[0x10]; // 0x1c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult5; // 0x1d0 (0x1)
	unsigned char $ExprResultStack6_1d1[0x2]; // 0x1d1 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_1d3[0x5]; // 0x1d3 (0x5) 
	unsigned char $AsyncTaskClass7_1d8[0x10]; // 0x1d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultStack8_1e8[0x2]; // 0x1e8 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x007EAE9BHasFired5; // 0x1ea (0x1)
	unsigned char unreflected_1eb[0x5]; // 0x1eb (0x5) 
	class UObject* verse0x000000006; // 0x1f0 (0x8)
	unsigned char $Callee9_1f8[0x10]; // 0x1f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult10; // 0x208 (0x1)
	unsigned char $ExprResultStack11_209[0x2]; // 0x209 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_20b[0x5]; // 0x20b (0x5) 
	unsigned char $AsyncTaskClass12_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $AsyncTaskClass13_220[0x10]; // 0x220 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)

	/* Functions */

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$UseSniperWeapon_L_Nfort__threat__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

