// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$LookAtThreatTask
// Size: 0x320
class Utask_CompanionAI_companion_ai$LookAtThreatTask : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	enum EVerseTrue $InvokeSureResultDummy0; // 0x151 (0x1)
	unsigned char unreflected_152[0x6]; // 0x152 (0x6) 
	unsigned char $Callee1_158[0x10]; // 0x158 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult2_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions3; // 0x178 (0x8)
	unsigned char $ExprResultStack3_180[0x8]; // 0x180 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	struct FVerseAIBase_fort_threat_info verse0x1EB80E5BThreatInfo3; // 0x188 (0x30)
	class UObject* verse0x000000004; // 0x1b8 (0x8)
	unsigned char $ExprResultStack4_1c0[0x8]; // 0x1c0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack5_1c8[0x31]; // 0x1c8 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_1f9[0x7]; // 0x1f9 (0x7) 
	unsigned char $Callee6_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult7; // 0x210 (0x1)
	unsigned char unreflected_211[0x7]; // 0x211 (0x7) 
	int64_t $AsyncBeginCount8; // 0x218 (0x8)
	class UConcurrency_task* $AsyncTask9; // 0x220 (0x8)
	unsigned char $AsyncTaskClass10_228[0x10]; // 0x228 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult11; // 0x238 (0x1)
	unsigned char unreflected_239[0x7]; // 0x239 (0x7) 
	int64_t $AsyncResult12; // 0x240 (0x8)
	class UConcurrency_task* $AsyncTask13; // 0x248 (0x8)
	unsigned char $AsyncTaskClass14_250[0x10]; // 0x250 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult15; // 0x260 (0x1)
	unsigned char unreflected_261[0x7]; // 0x261 (0x7) 
	int64_t $AsyncResult16; // 0x268 (0x8)
	class UObject* verse0x000000006; // 0x270 (0x8)
	class UConcurrency_task* $AsyncTask17; // 0x278 (0x8)
	unsigned char $AsyncTaskClass18_280[0x10]; // 0x280 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack19; // 0x290 (0x18)
	unsigned char $Callee20_2a8[0x10]; // 0x2a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult21; // 0x2b8 (0x8)
	unsigned char $AsyncTaskClass22_2c0[0x10]; // 0x2c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UConcurrency_task* $AsyncTask23; // 0x2d0 (0x8)
	unsigned char $AsyncTaskClass24_2d8[0x10]; // 0x2d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult25; // 0x2e8 (0x1)
	unsigned char unreflected_2e9[0x7]; // 0x2e9 (0x7) 
	int64_t $AsyncResult26; // 0x2f0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy27; // 0x2f8 (0x1)
	unsigned char unreflected_2f9[0x7]; // 0x2f9 (0x7) 
	unsigned char $Callee28_300[0x10]; // 0x300 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult29_310[0x10]; // 0x310 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$LookAtThreatTask.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

