// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R
// Size: 0x2d9
class Utask_CompanionAI_companion_ai$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_Lvector3_Mfloat_Mcolor_R verse0xB2CDDD72Argument; // 0x150 (0x38)
	unsigned char $ExprResultStack0_188[0x2]; // 0x188 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack1_18a[0x2]; // 0x18a (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy2; // 0x18c (0x1)
	unsigned char unreflected_18d[0x3]; // 0x18d (0x3) 
	unsigned char $Callee3_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_M_QParams_Nsphere__draw__params_R $ExprResult4; // 0x1a0 (0x68)
	unsigned char $ExprResult5_208[0x49]; // 0x208 (0x49) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_251[0x7]; // 0x251 (0x7) 
	struct FVGameplayRst_DebugDraw_sphere_draw_params $ExprResult6; // 0x258 (0x48)
	class UConcurrency_task* $AsyncTask7; // 0x2a0 (0x8)
	unsigned char $AsyncTaskClass8_2a8[0x10]; // 0x2a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult9; // 0x2b8 (0x8)
	enum EVerseTrue $InvokeSureResultDummy10; // 0x2c0 (0x1)
	unsigned char unreflected_2c1[0x7]; // 0x2c1 (0x7) 
	unsigned char $Callee11_2c8[0x10]; // 0x2c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult12; // 0x2d8 (0x1)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

