// VerseClass /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$TryToAttackThreat_L_Nfort__threat__info_R
// Size: 0x238
class Utask_VerseArchetypes_sniper_ai$TryToAttackThreat_L_Nfort__threat__info_R : public UConcurrency_task
{
	class UVerseArchetypes_sniper_ai* Self; // 0x148 (0x8)
	struct FVerseAIBase_fort_threat_info verse0xB2CDDD72Argument; // 0x150 (0x30)
	unsigned char $ExprResultStack0_180[0x2]; // 0x180 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_182[0x6]; // 0x182 (0x6) 
	int64_t $AsyncBeginCount1; // 0x188 (0x8)
	class UConcurrency_task* $AsyncTask2; // 0x190 (0x8)
	unsigned char $AsyncTaskClass3_198[0x10]; // 0x198 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult4; // 0x1a8 (0x8)
	unsigned char verse0x7D46D6F7HasChangedOfWeapon2; // 0x1b0 (0x1)
	unsigned char unreflected_1b1[0x7]; // 0x1b1 (0x7) 
	unsigned char $Callee5_1b8[0x10]; // 0x1b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultStack6_1c8[0x2]; // 0x1c8 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_1ca[0x6]; // 0x1ca (0x6) 
	class UVerse_event* verse0x000000004; // 0x1d0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy7; // 0x1d8 (0x1)
	unsigned char unreflected_1d9[0x7]; // 0x1d9 (0x7) 
	unsigned char $Callee8_1e0[0x10]; // 0x1e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult9_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	struct Ftuple_L_R $ExprResult10; // 0x200 (0x1)
	unsigned char unreflected_201[0x7]; // 0x201 (0x7) 
	class UConcurrency_task* $AsyncTask11; // 0x208 (0x8)
	unsigned char $AsyncTaskClass12_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult13; // 0x220 (0x8)
	unsigned char $AsyncTaskClass14_228[0x10]; // 0x228 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)

	/* Functions */

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$TryToAttackThreat_L_Nfort__threat__info_R.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

