// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$TacticalSprintService
// Size: 0x198
class Utask_CompanionAI_companion_ai$TacticalSprintService : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	class UObject* verse0x88C4894FNPCMovement1; // 0x158 (0x8)
	unsigned char $ExprResultStack0_160[0x8]; // 0x160 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x000000002; // 0x168 (0x8)
	class UConcurrency_task* $AsyncTask1; // 0x170 (0x8)
	unsigned char $AsyncTaskClass2_178[0x10]; // 0x178 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult3; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	int64_t $AsyncResult4; // 0x190 (0x8)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$TacticalSprintService.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

