// VerseClass /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$OnBegin
// Size: 0xab0
class Utask_VerseArchetypes_sniper_ai$OnBegin : public UConcurrency_task
{
	class UVerseArchetypes_sniper_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	class UObject* verse0xF80AEC27FortCharacter1; // 0x158 (0x8)
	unsigned char $ExprResultStack0_160[0x8]; // 0x160 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee1_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult2; // 0x178 (0x1)
	unsigned char unreflected_179[0x7]; // 0x179 (0x7) 
	class UObject* verse0x88C4894FNPCMovement1; // 0x180 (0x8)
	unsigned char $ExprResultStack3_188[0x8]; // 0x188 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee4_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x2E1D28B3Inventory1; // 0x1a0 (0x8)
	unsigned char $ExprResultStack5_1a8[0x8]; // 0x1a8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee6_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x0F05355DThreatPerception1; // 0x1c0 (0x8)
	unsigned char $ExprResultStack7_1c8[0x8]; // 0x1c8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee8_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions1; // 0x1e0 (0x8)
	unsigned char $ExprResultStack9_1e8[0x8]; // 0x1e8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee10_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0xF161303FWeaponActions1; // 0x200 (0x8)
	unsigned char $ExprResultStack11_208[0x8]; // 0x208 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee12_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult13_220[0x8]; // 0x220 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult14_228[0x8]; // 0x228 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult15_230[0x8]; // 0x230 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult16_238[0x8]; // 0x238 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult17_240[0x8]; // 0x240 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	int64_t verse0xD3E63614CallbackId1; // 0x248 (0x8)
	class UObject* verse0x000000002; // 0x250 (0x8)
	unsigned char $Callee18_258[0x10]; // 0x258 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult19_268[0x9]; // 0x268 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_271[0x7]; // 0x271 (0x7) 
	struct FSpatialMath_vector3 verse0x51FFEC24InitialPosition1; // 0x278 (0x18)
	struct FSpatialMath_transform $ExprResult20; // 0x290 (0x60)
	class UObject* verse0x000000003; // 0x2f0 (0x8)
	unsigned char $Callee21_2f8[0x10]; // 0x2f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult22; // 0x308 (0x1)
	unsigned char unreflected_309[0x7]; // 0x309 (0x7) 
	class UObject* verse0x000000004; // 0x310 (0x8)
	enum EVerseTrue $InvokeSureResultDummy23; // 0x318 (0x1)
	unsigned char unreflected_319[0x7]; // 0x319 (0x7) 
	unsigned char $Callee24_320[0x10]; // 0x320 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mfloat_Mfloat_R $ExprResult25; // 0x330 (0x28)
	unsigned char verse0x3FD225ACBestLongRangeWeapon1_358[0x21]; // 0x358 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x000000005_379[0x2]; // 0x379 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult26; // 0x37b (0x1)
	unsigned char $ExprResultStack27_37c[0x2]; // 0x37c (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_37e[0x2]; // 0x37e (0x2) 
	unsigned char verse0x60979DCABestShortRangeWeapon1_380[0x21]; // 0x380 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x000000007_3a1[0x2]; // 0x3a1 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult28; // 0x3a3 (0x1)
	unsigned char $ExprResultStack29_3a4[0x2]; // 0x3a4 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_3a6[0x2]; // 0x3a6 (0x2) 
	struct TArray<struct FVerseAIBase_fort_item_descriptor> $ForIterable30; // 0x3a8 (0x10)
	class UObject* verse0x0000000011; // 0x3b8 (0x8)
	unsigned char $Callee31_3c0[0x10]; // 0x3c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult32; // 0x3d0 (0x1)
	unsigned char unreflected_3d1[0x7]; // 0x3d1 (0x7) 
	int64_t $ForIndex33; // 0x3d8 (0x8)
	int64_t $ForLength34; // 0x3e0 (0x8)
	struct FVerseAIBase_fort_item_descriptor verse0xFB88B569Item12; // 0x3e8 (0x18)
	struct FVerseAIBase_fort_weapon_descriptor verse0x18F7B1AEWeapon15; // 0x400 (0x18)
	class UObject* verse0x0000000016; // 0x418 (0x8)
	unsigned char $ExprResultStack35_420[0x19]; // 0x420 (0x19) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_439[0x7]; // 0x439 (0x7) 
	unsigned char $Callee36_440[0x10]; // 0x440 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UVerseAIBase_fort_melee_weapon_tag* $FallibleType37; // 0x450 (0x8)
	unsigned char $FallibleType38_458[0x8]; // 0x458 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack39_460[0x21]; // 0x460 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_481[0x7]; // 0x481 (0x7) 
	unsigned char $ExprResultStack40_488[0x9]; // 0x488 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_491[0x7]; // 0x491 (0x7) 
	unsigned char $ExprResultStack41_498[0x21]; // 0x498 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_4b9[0x7]; // 0x4b9 (0x7) 
	unsigned char $ExprResult42_4c0[0x21]; // 0x4c0 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_4e1[0x7]; // 0x4e1 (0x7) 
	struct Ftuple_Lfort__weapon__descriptor_Mfort__item__tag_R $ExprResult43; // 0x4e8 (0x20)
	unsigned char $ExprResultStack44_508[0x21]; // 0x508 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_529[0x7]; // 0x529 (0x7) 
	unsigned char $ExprResultStack45_530[0x9]; // 0x530 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_539[0x7]; // 0x539 (0x7) 
	unsigned char $ExprResultStack46_540[0x21]; // 0x540 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_561[0x7]; // 0x561 (0x7) 
	unsigned char $ExprResult47_568[0x21]; // 0x568 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_589[0x7]; // 0x589 (0x7) 
	struct Ftuple_Lfort__weapon__descriptor_Mfort__item__tag_R $ExprResult48; // 0x590 (0x20)
	struct Ftuple_Lfort__weapon__descriptor_Mfort__item__tag_R verse0xAF1CE4ACWeaponTuple21; // 0x5b0 (0x20)
	unsigned char $ExprResultStack49_5d0[0x21]; // 0x5d0 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy50; // 0x5f1 (0x1)
	unsigned char unreflected_5f2[0x6]; // 0x5f2 (0x6) 
	unsigned char $Callee51_5f8[0x10]; // 0x5f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult52_608[0x10]; // 0x608 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> verse0xFFC68BC5Array22; // 0x618 (0x10)
	unsigned char $Callee53_628[0x10]; // 0x628 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct TArray<struct TArray<>> $ExprResult54; // 0x638 (0x10)
	struct TArray<> verse0xFFC68BC5Array23; // 0x648 (0x10)
	struct Ftuple_L_Kchar_M_Kchar_R verse0x0000000024; // 0x658 (0x20)
	unsigned char $ExprResult55_678[0x10]; // 0x678 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultStack56_688[0x10]; // 0x688 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $Callee57_698[0x10]; // 0x698 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultStack58_6a8[0x10]; // 0x6a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $Callee59_6b8[0x10]; // 0x6b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultDummy60_6c8[0x10]; // 0x6c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultDummy61_6d8[0x10]; // 0x6d8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<struct TArray<>> $ForResult62; // 0x6e8 (0x10)
	int64_t $ForIndex63; // 0x6f8 (0x8)
	int64_t $ForLength64; // 0x700 (0x8)
	unsigned char verse0xFB88B569Item26_708[0x10]; // 0x708 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> $ExprResult65; // 0x718 (0x10)
	unsigned char verse0xFFC68BC5Array27_728[0x10]; // 0x728 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> $ForResult66; // 0x738 (0x10)
	int64_t $ForIndex67; // 0x748 (0x8)
	int64_t $ForLength68; // 0x750 (0x8)
	unsigned char verse0xFB88B569Item29; // 0x758 (0x1)
	unsigned char unreflected_759[0x7]; // 0x759 (0x7) 
	unsigned char $ExprResult69_760[0x10]; // 0x760 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ForResult70_770[0x10]; // 0x770 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	int64_t $ForIndex71; // 0x780 (0x8)
	int64_t $ForLength72; // 0x788 (0x8)
	unsigned char verse0xFB88B569Item31_790[0x10]; // 0x790 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult73; // 0x7a0 (0x1)
	enum EVerseTrue $InvokeSureResultDummy74; // 0x7a1 (0x1)
	unsigned char unreflected_7a2[0x6]; // 0x7a2 (0x6) 
	unsigned char $Callee75_7a8[0x10]; // 0x7a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult76_7b8[0x10]; // 0x7b8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct Ftuple_Lfort__weapon__descriptor_Mfort__item__tag_R verse0xAF1CE4ACWeaponTuple34; // 0x7c8 (0x20)
	unsigned char $ExprResultStack77_7e8[0x21]; // 0x7e8 (0x21) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy78; // 0x809 (0x1)
	unsigned char unreflected_80a[0x6]; // 0x80a (0x6) 
	unsigned char $Callee79_810[0x10]; // 0x810 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult80_820[0x10]; // 0x820 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> verse0xFFC68BC5Array35; // 0x830 (0x10)
	unsigned char $Callee81_840[0x10]; // 0x840 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct TArray<struct TArray<>> $ExprResult82; // 0x850 (0x10)
	struct TArray<> verse0xFFC68BC5Array36; // 0x860 (0x10)
	struct Ftuple_L_Kchar_M_Kchar_R verse0x0000000037; // 0x870 (0x20)
	unsigned char $ExprResult83_890[0x10]; // 0x890 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultStack84_8a0[0x10]; // 0x8a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $Callee85_8b0[0x10]; // 0x8b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultStack86_8c0[0x10]; // 0x8c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $Callee87_8d0[0x10]; // 0x8d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResultDummy88_8e0[0x10]; // 0x8e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	unsigned char $ExprResultDummy89_8f0[0x10]; // 0x8f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<struct TArray<>> $ForResult90; // 0x900 (0x10)
	int64_t $ForIndex91; // 0x910 (0x8)
	int64_t $ForLength92; // 0x918 (0x8)
	unsigned char verse0xFB88B569Item39_920[0x10]; // 0x920 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> $ExprResult93; // 0x930 (0x10)
	unsigned char verse0xFFC68BC5Array40_940[0x10]; // 0x940 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	struct TArray<> $ForResult94; // 0x950 (0x10)
	int64_t $ForIndex95; // 0x960 (0x8)
	int64_t $ForLength96; // 0x968 (0x8)
	unsigned char verse0xFB88B569Item42; // 0x970 (0x1)
	unsigned char unreflected_971[0x7]; // 0x971 (0x7) 
	unsigned char $ExprResult97_978[0x10]; // 0x978 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ForResult98_988[0x10]; // 0x988 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	int64_t $ForIndex99; // 0x998 (0x8)
	int64_t $ForLength100; // 0x9a0 (0x8)
	unsigned char verse0xFB88B569Item44_9a8[0x10]; // 0x9a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult101; // 0x9b8 (0x1)
	enum EVerseTrue $InvokeSureResultDummy102; // 0x9b9 (0x1)
	unsigned char unreflected_9ba[0x6]; // 0x9ba (0x6) 
	unsigned char $Callee103_9c0[0x10]; // 0x9c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult104_9d0[0x10]; // 0x9d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x0000000047; // 0x9e0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy105; // 0x9e8 (0x1)
	unsigned char unreflected_9e9[0x7]; // 0x9e9 (0x7) 
	unsigned char $Callee106_9f0[0x10]; // 0x9f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x0000000048; // 0xa00 (0x8)
	enum EVerseTrue $InvokeSureResultDummy107; // 0xa08 (0x1)
	unsigned char unreflected_a09[0x7]; // 0xa09 (0x7) 
	unsigned char $Callee108_a10[0x10]; // 0xa10 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x0000000049; // 0xa20 (0x8)
	enum EVerseTrue $InvokeSureResultDummy109; // 0xa28 (0x1)
	unsigned char unreflected_a29[0x7]; // 0xa29 (0x7) 
	unsigned char $Callee110_a30[0x10]; // 0xa30 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x0000000050; // 0xa40 (0x8)
	enum EVerseTrue $InvokeSureResultDummy111; // 0xa48 (0x1)
	unsigned char unreflected_a49[0x7]; // 0xa49 (0x7) 
	unsigned char $Callee112_a50[0x10]; // 0xa50 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UConcurrency_task* $AsyncTask113; // 0xa60 (0x8)
	unsigned char $AsyncTaskClass114_a68[0x10]; // 0xa68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult115; // 0xa78 (0x1)
	unsigned char unreflected_a79[0x7]; // 0xa79 (0x7) 
	int64_t $AsyncResult116; // 0xa80 (0x8)
	enum EVerseTrue $InvokeSureResultDummy117; // 0xa88 (0x1)
	unsigned char unreflected_a89[0x7]; // 0xa89 (0x7) 
	unsigned char $Callee118_a90[0x10]; // 0xa90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult119_aa0[0x10]; // 0xaa0 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$OnBegin.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

