// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GetThreat
// Size: 0x21c
class Utask_CompanionAI_companion_ai$GetThreat : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	unsigned char RetVal_158[0x31]; // 0x158 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x000000001_189[0x2]; // 0x189 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_18b[0x5]; // 0x18b (0x5) 
	struct FVerseAIBase_fort_threat_info verse0x1EB80E5BThreatInfo3; // 0x190 (0x30)
	class UObject* verse0x000000004; // 0x1c0 (0x8)
	unsigned char $ExprResultStack0_1c8[0x8]; // 0x1c8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack1_1d0[0x31]; // 0x1d0 (0x31) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_201[0x7]; // 0x201 (0x7) 
	unsigned char $Callee2_208[0x10]; // 0x208 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult3; // 0x218 (0x1)
	unsigned char $ExprResult4; // 0x219 (0x1)
	unsigned char $ExprResultStack5_21a[0x2]; // 0x21a (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GetThreat.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

