// VerseClass /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$PatrolAround
// Size: 0x1f0
class Utask_VerseArchetypes_sniper_ai$PatrolAround : public UConcurrency_task
{
	class UVerseArchetypes_sniper_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	class UObject* verse0x88C4894FNPCMovement1; // 0x158 (0x8)
	unsigned char $ExprResultStack0_160[0x8]; // 0x160 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	int64_t $AsyncBeginCount1; // 0x168 (0x8)
	class UObject* verse0x000000002; // 0x170 (0x8)
	class UConcurrency_task* $AsyncTask2; // 0x178 (0x8)
	unsigned char $AsyncTaskClass3_180[0x10]; // 0x180 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult4; // 0x190 (0x1)
	unsigned char unreflected_191[0x7]; // 0x191 (0x7) 
	int64_t $AsyncResult5; // 0x198 (0x8)
	class UObject* verse0x000000004; // 0x1a0 (0x8)
	class UConcurrency_task* $AsyncTask6; // 0x1a8 (0x8)
	unsigned char $AsyncTaskClass7_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult8_1c0[0x11]; // 0x1c0 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_1d1[0x7]; // 0x1d1 (0x7) 
	int64_t $AsyncResult9; // 0x1d8 (0x8)
	unsigned char $AsyncTaskClass10_1e0[0x10]; // 0x1e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)

	/* Functions */

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_sniper_ai$PatrolAround.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

