// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GameLoop
// Size: 0x4e0
class Utask_CompanionAI_companion_ai$GameLoop : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	unsigned char InvokeResultDummy0_158[0x10]; // 0x158 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResultStack1_168[0x11]; // 0x168 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_179[0x7]; // 0x179 (0x7) 
	unsigned char $ExprResult2_180[0x10]; // 0x180 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	unsigned char $ExprResult3; // 0x190 (0x1)
	unsigned char unreflected_191[0x7]; // 0x191 (0x7) 
	class UObject* verse0x000000003; // 0x198 (0x8)
	unsigned char $ExprResultStack4_1a0[0x8]; // 0x1a0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee5_1a8[0x10]; // 0x1a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult6; // 0x1b8 (0x1)
	unsigned char unreflected_1b9[0x7]; // 0x1b9 (0x7) 
	unsigned char $ExprResult7_1c0[0x10]; // 0x1c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseDynamicProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions2; // 0x1d0 (0x8)
	unsigned char $ExprResultStack8_1d8[0x8]; // 0x1d8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x000000005; // 0x1e0 (0x8)
	class UConcurrency_task* $AsyncTask9; // 0x1e8 (0x8)
	unsigned char $AsyncTaskClass10_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult11; // 0x200 (0x1)
	unsigned char unreflected_201[0x7]; // 0x201 (0x7) 
	int64_t $AsyncResult12; // 0x208 (0x8)
	unsigned char verse0x01443115PingInfo1_210[0x39]; // 0x210 (0x39) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x000000006_249[0x2]; // 0x249 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult13; // 0x24b (0x1)
	unsigned char $ExprResultStack14_24c[0x2]; // 0x24c (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_24e[0x2]; // 0x24e (0x2) 
	class UObject* verse0xB4DBB24FPingActions8; // 0x250 (0x8)
	unsigned char $ExprResultStack15_258[0x8]; // 0x258 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions8; // 0x260 (0x8)
	unsigned char $ExprResultStack16_268[0x8]; // 0x268 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UObject* verse0x000000009; // 0x270 (0x8)
	class UObject* verse0x0000000010; // 0x278 (0x8)
	unsigned char $Callee17_280[0x10]; // 0x280 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult18; // 0x290 (0x1)
	unsigned char unreflected_291[0x7]; // 0x291 (0x7) 
	class UObject* $InvokeSureResultDummy19; // 0x298 (0x8)
	unsigned char $Callee20_2a0[0x10]; // 0x2a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x0000000011; // 0x2b0 (0x8)
	class UObject* verse0x0000000012; // 0x2b8 (0x8)
	unsigned char $Callee21_2c0[0x10]; // 0x2c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult22; // 0x2d0 (0x1)
	unsigned char unreflected_2d1[0x7]; // 0x2d1 (0x7) 
	class UObject* $InvokeSureResultDummy23; // 0x2d8 (0x8)
	unsigned char $Callee24_2e0[0x10]; // 0x2e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FCompanionAI_ping_info verse0x78680F6DCurrentCommand14; // 0x2f0 (0x38)
	unsigned char $ExprResultStack25_328[0x39]; // 0x328 (0x39) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_361[0x7]; // 0x361 (0x7) 
	int64_t $AsyncBeginCount26; // 0x368 (0x8)
	unsigned char $ExprResult27_370[0x39]; // 0x370 (0x39) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_3a9[0x7]; // 0x3a9 (0x7) 
	class UObject* verse0x0000000015; // 0x3b0 (0x8)
	class UConcurrency_task* $AsyncTask28; // 0x3b8 (0x8)
	unsigned char $AsyncTaskClass29_3c0[0x10]; // 0x3c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult30; // 0x3d0 (0x1)
	unsigned char unreflected_3d1[0x7]; // 0x3d1 (0x7) 
	int64_t $AsyncResult31; // 0x3d8 (0x8)
	class UConcurrency_task* $AsyncTask32; // 0x3e0 (0x8)
	unsigned char $AsyncTaskClass33_3e8[0x10]; // 0x3e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult34; // 0x3f8 (0x8)
	unsigned char $ExprResult35_400[0x39]; // 0x400 (0x39) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x0000000017_439[0x2]; // 0x439 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult36; // 0x43b (0x1)
	unsigned char $ExprResultStack37_43c[0x2]; // 0x43c (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_43e[0x2]; // 0x43e (0x2) 
	class UObject* verse0x0000000020; // 0x440 (0x8)
	class UConcurrency_task* $AsyncTask38; // 0x448 (0x8)
	unsigned char $AsyncTaskClass39_450[0x10]; // 0x450 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult40; // 0x460 (0x1)
	unsigned char unreflected_461[0x7]; // 0x461 (0x7) 
	int64_t $AsyncResult41; // 0x468 (0x8)
	unsigned char $ExprResult42_470[0x39]; // 0x470 (0x39) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_4a9[0x7]; // 0x4a9 (0x7) 
	class UObject* verse0x0000000021; // 0x4b0 (0x8)
	class UConcurrency_task* $AsyncTask43; // 0x4b8 (0x8)
	unsigned char $AsyncTaskClass44_4c0[0x10]; // 0x4c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult45; // 0x4d0 (0x1)
	unsigned char unreflected_4d1[0x7]; // 0x4d1 (0x7) 
	int64_t $AsyncResult46; // 0x4d8 (0x8)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GameLoop.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

