// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$OnBegin
// Size: 0x390
class Utask_CompanionAI_companion_ai$OnBegin : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	class UObject* verse0x88C4894FNPCMovement1; // 0x158 (0x8)
	unsigned char $ExprResultStack0_160[0x8]; // 0x160 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee1_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0xB4DBB24FPingActions1; // 0x178 (0x8)
	unsigned char $ExprResultStack2_180[0x8]; // 0x180 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee3_188[0x10]; // 0x188 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions1; // 0x198 (0x8)
	unsigned char $ExprResultStack4_1a0[0x8]; // 0x1a0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee5_1a8[0x10]; // 0x1a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0xF161303FWeaponActions1; // 0x1b8 (0x8)
	unsigned char $ExprResultStack6_1c0[0x8]; // 0x1c0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee7_1c8[0x10]; // 0x1c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x0F05355DThreatPerception1; // 0x1d8 (0x8)
	unsigned char $ExprResultStack8_1e0[0x8]; // 0x1e0 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee9_1e8[0x10]; // 0x1e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x00C33D6CObstaclePerception1; // 0x1f8 (0x8)
	unsigned char $ExprResultStack10_200[0x8]; // 0x200 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee11_208[0x10]; // 0x208 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult12_218[0x8]; // 0x218 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult13_220[0x8]; // 0x220 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult14_228[0x8]; // 0x228 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult15_230[0x8]; // 0x230 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult16_238[0x8]; // 0x238 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResult17_240[0x8]; // 0x240 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	class UConcurrency_task* $AsyncTask18; // 0x248 (0x8)
	unsigned char $AsyncTaskClass19_250[0x10]; // 0x250 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult20; // 0x260 (0x1)
	unsigned char unreflected_261[0x7]; // 0x261 (0x7) 
	int64_t $AsyncResult21; // 0x268 (0x8)
	unsigned char verse0x39263057WarningMsg2_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UDiagnostics_log* verse0x000000003; // 0x280 (0x8)
	enum EVerseTrue $InvokeSureResultDummy22; // 0x288 (0x1)
	unsigned char unreflected_289[0x7]; // 0x289 (0x7) 
	unsigned char $Callee23_290[0x10]; // 0x290 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R $ExprResult24; // 0x2a0 (0x18)
	unsigned char $ExprResult25_2b8[0x2]; // 0x2b8 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	enum EVerseTrue $InvokeSureResultDummy26; // 0x2ba (0x1)
	unsigned char unreflected_2bb[0x5]; // 0x2bb (0x5) 
	unsigned char $Callee27_2c0[0x10]; // 0x2c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R $ExprResult28; // 0x2d0 (0x40)
	struct Ftuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R verse0x000000004; // 0x310 (0x40)
	unsigned char $ExprResult29_350[0x19]; // 0x350 (0x19) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_369[0x7]; // 0x369 (0x7) 
	unsigned char $ExprResult30_370[0x9]; // 0x370 (0x9) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_379[0x7]; // 0x379 (0x7) 
	unsigned char $ExprResultDummy31_380[0x10]; // 0x380 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$OnBegin.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

