// VerseClass /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GetObstacle
// Size: 0x204
class Utask_CompanionAI_companion_ai$GetObstacle : public UConcurrency_task
{
	class UCompanionAI_companion_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	unsigned char RetVal_158[0x29]; // 0x158 (0x29) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0x000000001_181[0x2]; // 0x181 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_183[0x5]; // 0x183 (0x5) 
	struct FVerseAIBase_fort_obstacle_info verse0x39C5E53EObstacleInfo3; // 0x188 (0x28)
	class UObject* verse0x000000004; // 0x1b0 (0x8)
	unsigned char $ExprResultStack0_1b8[0x8]; // 0x1b8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $ExprResultStack1_1c0[0x29]; // 0x1c0 (0x29) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_1e9[0x7]; // 0x1e9 (0x7) 
	unsigned char $Callee2_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult3; // 0x200 (0x1)
	unsigned char $ExprResult4; // 0x201 (0x1)
	unsigned char $ExprResultStack5_202[0x2]; // 0x202 (0x2) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)

	/* Functions */

	// Function /CompanionAI/_Verse/VNI/CompanionAI.task_CompanionAI_companion_ai$GetObstacle.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms)
};

