// VerseClass /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_template_ai$OnBegin
// Size: 0x8a9
class Utask_VerseArchetypes_template_ai$OnBegin : public UConcurrency_task
{
	class UVerseArchetypes_template_ai* Self; // 0x148 (0x8)
	struct Ftuple_L_R verse0xB2CDDD72Argument; // 0x150 (0x1)
	unsigned char unreflected_151[0x7]; // 0x151 (0x7) 
	class UObject* verse0xF80AEC27FortCharacter1; // 0x158 (0x8)
	unsigned char $ExprResultStack0_160[0x8]; // 0x160 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee1_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult2; // 0x178 (0x1)
	unsigned char unreflected_179[0x7]; // 0x179 (0x7) 
	class UObject* verse0x000000002; // 0x180 (0x8)
	enum EVerseTrue $InvokeSureResultDummy3; // 0x188 (0x1)
	unsigned char unreflected_189[0x7]; // 0x189 (0x7) 
	unsigned char $Callee4_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x000000003; // 0x1a0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy5; // 0x1a8 (0x1)
	unsigned char unreflected_1a9[0x7]; // 0x1a9 (0x7) 
	unsigned char $Callee6_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x000000004; // 0x1c0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy7; // 0x1c8 (0x1)
	unsigned char unreflected_1c9[0x7]; // 0x1c9 (0x7) 
	unsigned char $Callee8_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x000000005; // 0x1e0 (0x8)
	enum EVerseTrue $InvokeSureResultDummy9; // 0x1e8 (0x1)
	unsigned char unreflected_1e9[0x7]; // 0x1e9 (0x7) 
	unsigned char $Callee10_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x9F6FC7A8OnDamageEvent1; // 0x200 (0x8)
	class UObject* verse0x000000006; // 0x208 (0x8)
	class UObject* verse0x000000007; // 0x210 (0x8)
	unsigned char $Callee11_218[0x10]; // 0x218 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult12; // 0x228 (0x1)
	unsigned char unreflected_229[0x7]; // 0x229 (0x7) 
	unsigned char $Callee13_230[0x10]; // 0x230 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0xE9552CF3OnHealedEvent1; // 0x240 (0x8)
	class UObject* verse0x000000008; // 0x248 (0x8)
	class UObject* verse0x000000009; // 0x250 (0x8)
	unsigned char $Callee14_258[0x10]; // 0x258 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult15; // 0x268 (0x1)
	unsigned char unreflected_269[0x7]; // 0x269 (0x7) 
	unsigned char $Callee16_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x88C4894FNPCMovement10; // 0x280 (0x8)
	unsigned char $ExprResultStack17_288[0x8]; // 0x288 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee18_290[0x10]; // 0x290 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	class UObject* verse0x91E0A2A2NPCActions10; // 0x2a0 (0x8)
	unsigned char $ExprResultStack19_2a8[0x8]; // 0x2a8 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char $Callee20_2b0[0x10]; // 0x2b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 verse0xFE3AE8F0OriginalPosition10; // 0x2c0 (0x18)
	unsigned char unreflected_2d8[0x8]; // 0x2d8 (0x8) 
	struct FSpatialMath_transform $ExprResult21; // 0x2e0 (0x60)
	class UObject* verse0x0000000011; // 0x340 (0x8)
	unsigned char $Callee22_348[0x10]; // 0x348 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult23; // 0x358 (0x1)
	enum EVerseTrue $InvokeSureResultDummy24; // 0x359 (0x1)
	unsigned char unreflected_35a[0x6]; // 0x35a (0x6) 
	unsigned char $Callee25_360[0x10]; // 0x360 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult26_370[0x10]; // 0x370 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x0000000013; // 0x380 (0x8)
	class UConcurrency_task* $AsyncTask27; // 0x388 (0x8)
	unsigned char $AsyncTaskClass28_390[0x10]; // 0x390 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lnavigation__target_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult29; // 0x3a0 (0x20)
	class UVerseAIBase_navigation_target* $ExprResultStack31; // 0x3c0 (0x8)
	unsigned char $Callee32_3c8[0x10]; // 0x3c8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack33; // 0x3d8 (0x18)
	unsigned char $Callee34_3f0[0x10]; // 0x3f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult35; // 0x400 (0x30)
	struct FSpatialMath_vector3 $ExprResult36; // 0x430 (0x18)
	unsigned char $ExprResult37_448[0x11]; // 0x448 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_459[0x7]; // 0x459 (0x7) 
	int64_t $AsyncResult38; // 0x460 (0x8)
	class UObject* verse0x0000000014; // 0x468 (0x8)
	unsigned char $AsyncTaskClass39_470[0x10]; // 0x470 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult40; // 0x480 (0x1)
	enum EVerseTrue $InvokeSureResultDummy41; // 0x481 (0x1)
	unsigned char unreflected_482[0x6]; // 0x482 (0x6) 
	unsigned char $Callee42_488[0x10]; // 0x488 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult43_498[0x10]; // 0x498 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x0000000015; // 0x4a8 (0x8)
	unsigned char $AsyncTaskClass44_4b0[0x10]; // 0x4b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lnavigation__target_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult45; // 0x4c0 (0x20)
	class UVerseAIBase_navigation_target* $ExprResultStack47; // 0x4e0 (0x8)
	unsigned char $Callee48_4e8[0x10]; // 0x4e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack49; // 0x4f8 (0x18)
	unsigned char $Callee50_510[0x10]; // 0x510 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult51; // 0x520 (0x30)
	struct FSpatialMath_vector3 $ExprResult52; // 0x550 (0x18)
	unsigned char $ExprResult53_568[0x11]; // 0x568 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_579[0x7]; // 0x579 (0x7) 
	int64_t $AsyncBeginCount54; // 0x580 (0x8)
	class UObject* verse0x0000000016; // 0x588 (0x8)
	class UConcurrency_task* $AsyncTask55; // 0x590 (0x8)
	unsigned char $AsyncTaskClass56_598[0x10]; // 0x598 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	int64_t $AsyncResult57; // 0x5a8 (0x8)
	class UObject* verse0x0000000018; // 0x5b0 (0x8)
	class UConcurrency_task* $AsyncTask58; // 0x5b8 (0x8)
	unsigned char $AsyncTaskClass59_5c0[0x10]; // 0x5c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult60; // 0x5d0 (0x1)
	unsigned char unreflected_5d1[0x7]; // 0x5d1 (0x7) 
	int64_t $AsyncResult61; // 0x5d8 (0x8)
	enum EVerseTrue $InvokeSureResultDummy62; // 0x5e0 (0x1)
	unsigned char unreflected_5e1[0x7]; // 0x5e1 (0x7) 
	unsigned char $Callee63_5e8[0x10]; // 0x5e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult64_5f8[0x10]; // 0x5f8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x0000000019; // 0x608 (0x8)
	class UConcurrency_task* $AsyncTask65; // 0x610 (0x8)
	unsigned char $AsyncTaskClass66_618[0x10]; // 0x618 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult67; // 0x628 (0x1)
	unsigned char unreflected_629[0x7]; // 0x629 (0x7) 
	int64_t $AsyncResult68; // 0x630 (0x8)
	class UObject* verse0x0000000020; // 0x638 (0x8)
	class UConcurrency_task* $AsyncTask69; // 0x640 (0x8)
	unsigned char $AsyncTaskClass70_648[0x10]; // 0x648 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lnavigation__target_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult71; // 0x658 (0x20)
	class UVerseAIBase_navigation_target* $ExprResultStack73; // 0x678 (0x8)
	unsigned char $Callee74_680[0x10]; // 0x680 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack75; // 0x690 (0x18)
	unsigned char $Callee76_6a8[0x10]; // 0x6a8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult77; // 0x6b8 (0x30)
	struct FSpatialMath_vector3 $ExprResult78; // 0x6e8 (0x18)
	unsigned char $ExprResult79_700[0x11]; // 0x700 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_711[0x7]; // 0x711 (0x7) 
	int64_t $AsyncResult80; // 0x718 (0x8)
	enum EVerseTrue $InvokeSureResultDummy81; // 0x720 (0x1)
	unsigned char unreflected_721[0x7]; // 0x721 (0x7) 
	unsigned char $Callee82_728[0x10]; // 0x728 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char $ExprResult83_738[0x10]; // 0x738 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	class UObject* verse0x0000000021; // 0x748 (0x8)
	class UConcurrency_task* $AsyncTask84; // 0x750 (0x8)
	unsigned char $AsyncTaskClass85_758[0x10]; // 0x758 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult86; // 0x768 (0x1)
	unsigned char unreflected_769[0x7]; // 0x769 (0x7) 
	int64_t $AsyncResult87; // 0x770 (0x8)
	class UObject* verse0x0000000022; // 0x778 (0x8)
	class UConcurrency_task* $AsyncTask88; // 0x780 (0x8)
	unsigned char $AsyncTaskClass89_788[0x10]; // 0x788 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lnavigation__target_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R $ExprResult90; // 0x798 (0x20)
	class UVerseAIBase_navigation_target* $ExprResultStack92; // 0x7b8 (0x8)
	unsigned char $Callee93_7c0[0x10]; // 0x7c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct FSpatialMath_vector3 $ExprResultStack94; // 0x7d0 (0x18)
	unsigned char $Callee95_7e8[0x10]; // 0x7e8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_Lvector3_Mvector3_R $ExprResult96; // 0x7f8 (0x30)
	struct FSpatialMath_vector3 $ExprResult97; // 0x828 (0x18)
	unsigned char $ExprResult98_840[0x11]; // 0x840 (0x11) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char unreflected_851[0x7]; // 0x851 (0x7) 
	int64_t $AsyncResult99; // 0x858 (0x8)
	class UObject* verse0x0000000024; // 0x860 (0x8)
	enum EVerseTrue $InvokeSureResultDummy100; // 0x868 (0x1)
	unsigned char unreflected_869[0x7]; // 0x869 (0x7) 
	unsigned char $Callee101_870[0x10]; // 0x870 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult102; // 0x880 (0x1)
	unsigned char unreflected_881[0x7]; // 0x881 (0x7) 
	class UObject* verse0x0000000025; // 0x888 (0x8)
	enum EVerseTrue $InvokeSureResultDummy103; // 0x890 (0x1)
	unsigned char unreflected_891[0x7]; // 0x891 (0x7) 
	unsigned char $Callee104_898[0x10]; // 0x898 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	struct Ftuple_L_R $ExprResult105; // 0x8a8 (0x1)

	/* Functions */

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.task_VerseArchetypes_template_ai$OnBegin.Update (Has no native function)
	int64_t Update(); // (Public | HasOutParms | HasDefaults)
};

