// VerseClass /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_editable_text_base
// Size: 0xf8
class UUI_editable_text_base : public UUI_widget
{
	unsigned char unreflected_98[0x40]; // 0x98 (0x40) 
	unsigned char verse0xEDB05B46DefaultText_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	enum UI_text_justification verse0x616A37A2DefaultJustification; // 0xe8 (0x1)
	unsigned char unreflected_e9[0x7]; // 0xe9 (0x7) 
	class UObject* verse0xF7213661OnTextCommitted; // 0xf0 (0x8)
	unsigned char verse0x3755D3E6L2fFortnite2ecom2fUI2feditabletextbaseNRGetJustification_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6C045C58L2fFortnite2ecom2fUI2feditabletextbaseNRGetText_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE38F8680L2fFortnite2ecom2fUI2feditabletextbaseNRSetJustificationLNtextjustificationR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3BAC5E54L2fFortnite2ecom2fUI2feditabletextbaseNRSetTextLNKcharR_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_a8[0x50]; // 0xa8 (0x50)

	/* Functions */

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_editable_text_base._L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_RSetText_L_N_Kchar_R (Underlying native function: _L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_RSetText_L_N_Kchar_R 0x70b332c)
	void L2fFortnite2ecom2fUI2feditabletextbaseNRSetTextLNKcharR(); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_editable_text_base._L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_RSetJustification_L_Ntext__justification_R (Underlying native function: _L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_RSetJustification_L_Ntext__justification_R 0x52e7580)
	void L2fFortnite2ecom2fUI2feditabletextbaseNRSetJustificationLNtextjustificationR(enum UI_text_justification& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_editable_text_base._L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_RGetText (Underlying native function: _L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_RGetText 0x70b3324)
	void L2fFortnite2ecom2fUI2feditabletextbaseNRGetText(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_editable_text_base._L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_RGetJustification (Underlying native function: _L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_RGetJustification 0x52e7570)
	enum UI_text_justification L2fFortnite2ecom2fUI2feditabletextbaseNRGetJustification(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_editable_text_base.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_editable_text_base.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_editable_text_base.$InitCDO (Has no native function)
	void $InitCDO(); // (HasDefaults)
};

