// VerseClass /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal
// Size: 0xf0
class UUI_text_block_internal : public UUI_widget
{
	unsigned char unreflected_98[0x40]; // 0x98 (0x40) 
	unsigned char verse0xEDB05B46DefaultText_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	enum UI_text_justification verse0x616A37A2DefaultJustification; // 0xe8 (0x1)
	unsigned char verse0x347226C0L2fEpicGames2ecom2fTemporary2fUI2ftextblockinternalNRGetJustification_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x260DB920L2fEpicGames2ecom2fTemporary2fUI2ftextblockinternalNRGetText_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7DB26916L2fEpicGames2ecom2fTemporary2fUI2ftextblockinternalNRSetJustificationLNtextjustificationR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6B58E98BL2fEpicGames2ecom2fTemporary2fUI2ftextblockinternalNRSetTextLNKcharR_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_a8[0x48]; // 0xa8 (0x48)

	/* Functions */

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal._L_2fEpicGames_2ecom_2fTemporary_2fUI_2ftext__block__internal_N_RSetText_L_N_Kchar_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2ftext__block__internal_N_RSetText_L_N_Kchar_R 0x70b332c)
	void L2fEpicGames2ecom2fTemporary2fUI2ftextblockinternalNRSetTextLNKcharR(); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal._L_2fEpicGames_2ecom_2fTemporary_2fUI_2ftext__block__internal_N_RSetJustification_L_Ntext__justification_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2ftext__block__internal_N_RSetJustification_L_Ntext__justification_R 0x52e7580)
	void L2fEpicGames2ecom2fTemporary2fUI2ftextblockinternalNRSetJustificationLNtextjustificationR(enum UI_text_justification& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal._L_2fEpicGames_2ecom_2fTemporary_2fUI_2ftext__block__internal_N_RGetText (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2ftext__block__internal_N_RGetText 0x70b3324)
	void L2fEpicGames2ecom2fTemporary2fUI2ftextblockinternalNRGetText(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal._L_2fEpicGames_2ecom_2fTemporary_2fUI_2ftext__block__internal_N_RGetJustification (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2ftext__block__internal_N_RGetJustification 0x52e7570)
	enum UI_text_justification L2fEpicGames2ecom2fTemporary2fUI2ftextblockinternalNRGetJustification(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal.$InitCDO (Has no native function)
	void $InitCDO(); // (HasDefaults)
};

