// VerseClass /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_text_block
// Size: 0xf0
class UUI_text_block : public UUI_widget
{
	unsigned char unreflected_98[0x40]; // 0x98 (0x40) 
	unsigned char verse0xEDB05B46DefaultText_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseStringProperty UID: 0)
	enum UI_text_justification verse0x616A37A2DefaultJustification; // 0xe8 (0x1)
	unsigned char verse0x87B2E0F1L2fFortnite2ecom2fUI2ftextblockNRGetJustification_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA647FAFCL2fFortnite2ecom2fUI2ftextblockNRGetText_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xCB7B14C0L2fFortnite2ecom2fUI2ftextblockNRSetJustificationLNtextjustificationR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7855DB65L2fFortnite2ecom2fUI2ftextblockNRSetTextLNKcharR_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_a8[0x48]; // 0xa8 (0x48)

	/* Functions */

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetText_L_N_Kchar_R (Underlying native function: _L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetText_L_N_Kchar_R 0x70b332c)
	void L2fFortnite2ecom2fUI2ftextblockNRSetTextLNKcharR(); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetJustification_L_Ntext__justification_R (Underlying native function: _L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetJustification_L_Ntext__justification_R 0x52e7580)
	void L2fFortnite2ecom2fUI2ftextblockNRSetJustificationLNtextjustificationR(enum UI_text_justification& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetText (Underlying native function: _L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetText 0x70b3324)
	void L2fFortnite2ecom2fUI2ftextblockNRGetText(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetJustification (Underlying native function: _L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetJustification 0x52e7570)
	enum UI_text_justification L2fFortnite2ecom2fUI2ftextblockNRGetJustification(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_text_block.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_text_block.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.UI_text_block.$InitCDO (Has no native function)
	void $InitCDO(); // (HasDefaults)
};

