// VerseClass /VerseUI/_Verse/VNI/VerseUI.UI_canvas
// Size: 0xe8
class UUI_canvas : public UUI_widget
{
	unsigned char unreflected_98[0x40]; // 0x98 (0x40) 
	struct TArray<struct FUI_canvas_slot> verse0x5AE077E0Slots; // 0xd8 (0x10)
	unsigned char verse0xE10E3FA4L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNpositionedcanvasslotR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xDDD0DE92L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNpositionedsizedcanvasslotR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9F17D489L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNcanvasslotR_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_a8[0x20]; // 0xa8 (0x20) 
	unsigned char verse0x421EABFDL2fEpicGames2ecom2fTemporary2fUI2fcanvasNRRemoveWidgetLNwidgetR_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_d8[0x10]; // 0xd8 (0x10)

	/* Functions */

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_canvas._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R 0x70b3304)
	void L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRRemoveWidgetLNwidgetR(class UUI_widget*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_canvas._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R 0x70b32ec)
	void L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNcanvasslotR(struct FUI_canvas_slot& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_canvas._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Npositioned__sized__canvas__slot_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Npositioned__sized__canvas__slot_R 0x70b32fc)
	void L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNpositionedsizedcanvasslotR(struct FUI_positioned_sized_canvas_slot& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_canvas._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Npositioned__canvas__slot_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Npositioned__canvas__slot_R 0x70b32f4)
	void L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNpositionedcanvasslotR(struct FUI_positioned_canvas_slot& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_canvas.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_canvas.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_canvas.$InitCDO (Has no native function)
	void $InitCDO(struct TArray<struct FUI_canvas_slot>& $ExprResult0, struct TArray<enum EVerseFalse>& verse0xFFC68BC5Array1, struct TArray<struct FUI_canvas_slot>& $ForResult1, int64_t& $ForIndex2, int64_t& $ForLength3, enum EVerseFalse& verse0xFB88B569Item3, unsigned char& $ExprResult4); // (HasDefaults)
};

