// VerseClass /VerseUI/_Verse/VNI/VerseUI.UI_widget
// Size: 0x98
class UUI_widget : public UVerseWidgetNativeBase
{
	unsigned char unreflected_38[0x40]; // 0x38 (0x40) 
	unsigned char verse0x97A11C10L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRGetParentWidget_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x12309FFFL2fEpicGames2ecom2fTemporary2fUI2fwidgetNRGetRootWidget_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xF12B4CC9L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRGetVisibility_48[0x10]; // 0x48 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_58[0x10]; // 0x58 (0x10) 
	unsigned char verse0xA7AA54A3L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRIsEnabled_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xAC82A494L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRSetEnabledLNlogicR_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x452A6C7DL2fEpicGames2ecom2fTemporary2fUI2fwidgetNRSetVisibilityLNwidgetvisibilityR_38[0x10]; // 0x38 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_48[0x50]; // 0x48 (0x50)

	/* Functions */

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_widget._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R 0x70b334c)
	void L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRSetVisibilityLNwidgetvisibilityR(enum UI_widget_visibility& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_widget._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R 0x70b3344)
	void L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRSetEnabledLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_widget._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled 0x70b333c)
	unsigned char L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRIsEnabled(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_widget._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility 0x70b3334)
	enum UI_widget_visibility L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRGetVisibility(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_widget._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget 0x52e75b0)
	void L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRGetRootWidget(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_widget._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget 0x52e75a0)
	void L2fEpicGames2ecom2fTemporary2fUI2fwidgetNRGetParentWidget(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_widget.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_widget.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseUI/_Verse/VNI/VerseUI.UI_widget.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

