// VerseClass /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl
// Size: 0xd0
class UVehicles_fort_vehicle_impl : public UVerseFortniteActorWrapper
{
	unsigned char unreflected_48[0x80]; // 0x48 (0x80) 
	class UVerseEngine_subscribable_event* verse0x4996425DDamagedEventInternal; // 0xc8 (0x8)
	unsigned char verse0xBCC8CFC8L2fFortnite2ecom2fGame2fdamageableNRDamageLNdamageargsR_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x919B3D8BL2fFortnite2ecom2fGame2fdamageableNRDamageLNfloatR_48[0x10]; // 0x48 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_58[0x10]; // 0x58 (0x10) 
	unsigned char verse0x7782AD90L2fFortnite2ecom2fGame2fdamageableNRDamagedEvent_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x641F6E2BL2fFortnite2ecom2fGame2fhealthfulNRGetHealth_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_88[0x10]; // 0x88 (0x10) 
	unsigned char verse0x3244305DL2fFortnite2ecom2fGame2fhealthfulNRGetMaxHealth_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xF2F0AAD0L2fFortnite2ecom2fGame2fhealthfulNRSetHealthLNfloatR_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_98[0x10]; // 0x98 (0x10) 
	unsigned char verse0x339B570DL2fFortnite2ecom2fGame2fhealthfulNRSetMaxHealthLNfloatR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6B57E438L2fFortnite2ecom2fGame2fpositionalNRGetTransform_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_c8[0x8]; // 0xc8 (0x8)

	/* Functions */

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R 0x52d3b20)
	void L2fFortnite2ecom2fGame2fhealthfulNRSetMaxHealthLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R 0x52d3b00)
	void L2fFortnite2ecom2fGame2fhealthfulNRSetHealthLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform 0x52d3b40)
	struct FSpatialMath_transform L2fFortnite2ecom2fGame2fpositionalNRGetTransform(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth 0x52d3ae0)
	double L2fFortnite2ecom2fGame2fhealthfulNRGetMaxHealth(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth 0x52d3ac0)
	double L2fFortnite2ecom2fGame2fhealthfulNRGetHealth(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fGame2fdamageableNRDamagedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R 0x52d3a80)
	void L2fFortnite2ecom2fGame2fdamageableNRDamageLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R (Underlying native function: _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R 0x52d3a60)
	void L2fFortnite2ecom2fGame2fdamageableNRDamageLNdamageargsR(struct FGame_damage_args& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseFortnite/_Verse/VNI/VerseFortnite.Vehicles_fort_vehicle_impl.$InitCDO (Has no native function)
	void $InitCDO(class UVerseEngine_subscribable_event*& $ExprResult0, uint64_t& $InstancingGraph1); // (HasDefaults)
};

