// VerseClass /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component
// Size: 0x130
class UVerseMovement_movement_component : public UVerseMovementComponentBase
{
	unsigned char unreflected_90[0x70]; // 0x90 (0x70) 
	unsigned char verse0x09E834C8L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRAddAngularImpulseLNvector3R_100[0x10]; // 0x100 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7995CBACL2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRAddImpulseLNvector3R_f0[0x10]; // 0xf0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_100[0x20]; // 0x100 (0x20) 
	unsigned char verse0xF91671FFL2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRDisableInputLNplayercomponentR_120[0x10]; // 0x120 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9D5237F3L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNREnableInputLNplayercomponentR_110[0x10]; // 0x110 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA1CC94F9L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetConfigLNmoveconfigR_b0[0x10]; // 0xb0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xDD1E1C78L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetConfigLNmoveconfigassetR_a0[0x10]; // 0xa0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xDDD0E1FAL2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetEnabledLNlogicR_90[0x10]; // 0x90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_a0[0x20]; // 0xa0 (0x20) 
	unsigned char verse0xF92F8A2FL2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetPositionLNvector3R_c0[0x10]; // 0xc0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xCD9EB304L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetRotationLNrotationR_d0[0x10]; // 0xd0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x897A3BB6L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetVelocityLNvector3R_e0[0x10]; // 0xe0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_f0[0x40]; // 0xf0 (0x40)

	/* Functions */

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetVelocity_L_Nvector3_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetVelocity_L_Nvector3_R 0x70c96c4)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetVelocityLNvector3R(struct FSpatialMath_vector3& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetRotation_L_Nrotation_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetRotation_L_Nrotation_R 0x70c96bc)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetRotationLNrotationR(struct FVerseRotation& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetPosition_L_Nvector3_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetPosition_L_Nvector3_R 0x70c96b4)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetPositionLNvector3R(struct FSpatialMath_vector3& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetEnabled_L_Nlogic_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetEnabled_L_Nlogic_R 0x70c96ac)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetEnabledLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config__asset_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config__asset_R 0x70c96a4)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetConfigLNmoveconfigassetR(class UVerseMovement_move_config_asset*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config_R 0x70c969c)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRSetConfigLNmoveconfigR(struct FVerseMovement_move_config& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_REnableInput_L_Nplayer__component_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_REnableInput_L_Nplayer__component_R 0x70c9694)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNREnableInputLNplayercomponentR(class USimulation_player_component*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RDisableInput_L_Nplayer__component_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RDisableInput_L_Nplayer__component_R 0x70c968c)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRDisableInputLNplayercomponentR(class USimulation_player_component*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RAddImpulse_L_Nvector3_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RAddImpulse_L_Nvector3_R 0x70c9684)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRAddImpulseLNvector3R(struct FSpatialMath_vector3& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component._L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RAddAngularImpulse_L_Nvector3_R (Underlying native function: _L_2fVerse_2eorg_2fEngine_2fVerseMovement_2fmovement__component_N_RAddAngularImpulse_L_Nvector3_R 0x70c967c)
	void L2fVerse2eorg2fEngine2fVerseMovement2fmovementcomponentNRAddAngularImpulseLNvector3R(struct FSpatialMath_vector3& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_movement_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

