// VerseClass /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity
// Size: 0xe0
class UVerseEngine_Entity_entity : public UObject
{
	unsigned char verse0x8EB797F7L2fVerse2eorg2fVerseEngine2fEntity2fentityNRAddComponentLNanyR_28[0x10]; // 0x28 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_38[0x60]; // 0x38 (0x60) 
	unsigned char verse0xD0A22E5CL2fVerse2eorg2fVerseEngine2fEntity2fentityNRDestroy_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB0560B20L2fVerse2eorg2fVerseEngine2fEntity2fentityNREnsureComponentsLNKtypeLanyM20componentRR_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_68[0x10]; // 0x68 (0x10) 
	unsigned char verse0x1930099AL2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetAllComponentsOfTypeLNanyR_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6AA0C0B6L2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetComponentOfTypeLNanyR_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_78[0x40]; // 0x78 (0x40) 
	unsigned char verse0x13AF8BC4L2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetFullname_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xFD2C7399L2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetName_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3E989E95L2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetOrCreateComponentOfTypeLNanyR_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD0F6E406L2fVerse2eorg2fVerseEngine2fEntity2fentityNRHasComponentsLNKtypeLanyM20componentRR_48[0x10]; // 0x48 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_58[0x70]; // 0x58 (0x70) 
	unsigned char verse0xF9F147A4L2fVerse2eorg2fVerseEngine2fEntity2fentityNRIsEqualLNentityR_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6CDE1760L2fVerse2eorg2fVerseEngine2fEntity2fentityNRRemoveComponentLNcomponentR_38[0x10]; // 0x38 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_48[0x98]; // 0x48 (0x98)

	/* Functions */

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R (Underlying native function: _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R 0x6d31a34)
	unsigned char L2fVerse2eorg2fVerseEngine2fEntity2fentityNRRemoveComponentLNcomponentR(class UEntityComponent*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R (Underlying native function: _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R 0x6d31a2c)
	unsigned char L2fVerse2eorg2fVerseEngine2fEntity2fentityNRIsEqualLNentityR(class UVerseEngine_Entity_entity*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ktype_Lany_M_20component_R_R (Has no native function)
	void L2fVerse2eorg2fVerseEngine2fEntity2fentityNRHasComponentsLNKtypeLanyM20componentRR(struct TArray<class UClass*>& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_Nany_R (Underlying native function: _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_Nany_R 0x6d31a24)
	void L2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetOrCreateComponentOfTypeLNanyR(class UClass*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName (Underlying native function: _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName 0x6d31a1c)
	void L2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetName(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname (Underlying native function: _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname 0x6d31a14)
	void L2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetFullname(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_Nany_R (Underlying native function: _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_Nany_R 0x6d31a0c)
	void L2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetComponentOfTypeLNanyR(class UClass*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_Nany_R (Underlying native function: _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_Nany_R 0x6d31a04)
	struct TArray<class UEntityComponent*> L2fVerse2eorg2fVerseEngine2fEntity2fentityNRGetAllComponentsOfTypeLNanyR(class UClass*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ktype_Lany_M_20component_R_R (Has no native function)
	void L2fVerse2eorg2fVerseEngine2fEntity2fentityNREnsureComponentsLNKtypeLanyM20componentRR(struct TArray<class UClass*>& verse0xB2CDDD72Argument, int64_t& $ForIndex0, int64_t& $ForLength1, class UClass*& verse0xF655308EComponentClass4, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy (Underlying native function: _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy 0x6d319fc)
	unsigned char L2fVerse2eorg2fVerseEngine2fEntity2fentityNRDestroy(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_Nany_R (Underlying native function: _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_Nany_R 0x6d319f4)
	void L2fVerse2eorg2fVerseEngine2fEntity2fentityNRAddComponentLNanyR(class UClass*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_entity.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

