// VerseClass /VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental_date_time_ticks
// Size: 0x70
class UVerseExperimental_date_time_ticks : public UObject
{
	int64_t verse0x8DE5F121NanosecondsPerTick; // 0x28 (0x8)
	int64_t verse0x358147B9TicksPerDay; // 0x30 (0x8)
	int64_t verse0x5C0949D3TicksPerHour; // 0x38 (0x8)
	int64_t verse0x59DFB831TicksPerMicrosecond; // 0x40 (0x8)
	int64_t verse0xD20E16AFTicksPerMillisecond; // 0x48 (0x8)
	int64_t verse0x4420B794TicksPerMinute; // 0x50 (0x8)
	int64_t verse0x3E0178E0TicksPerSecond; // 0x58 (0x8)
	int64_t verse0xA7911900TicksPerWeek; // 0x60 (0x8)
	int64_t verse0xE371C089TicksPerYear; // 0x68 (0x8)

	/* Functions */

	// Function /VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental_date_time_ticks.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

