// VerseClass /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component
// Size: 0x158
class UVerseNPC_inventory_component : public UInventoryComponentBase
{
	unsigned char verse0x55D5AF48L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRAddItemToInventoryLNfortinventoryitemassetMNintR_90[0x10]; // 0x90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_a0[0x10]; // 0xa0 (0x10) 
	unsigned char verse0x011710B3L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRDropItemLNfortitemdescriptorR_b0[0x10]; // 0xb0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_c0[0x10]; // 0xc0 (0x10) 
	unsigned char verse0xCAF8BDA2L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNREquipWeaponLNfortitemdescriptorR_d0[0x10]; // 0xd0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7388F5F7L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRGetAllItems_a0[0x10]; // 0xa0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b0[0x10]; // 0xb0 (0x10) 
	unsigned char verse0x5EDD40A0L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRGetCurrentWeapon_c0[0x10]; // 0xc0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_d0[0x20]; // 0xd0 (0x20) 
	unsigned char verse0x353458B7L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRGetWeaponDescriptorLNfortitemdescriptorR_f0[0x10]; // 0xf0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7247ECB0L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRIsWeaponEquippedLNfortitemdescriptorR_e0[0x10]; // 0xe0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_f0[0x10]; // 0xf0 (0x10) 
	unsigned char verse0x677C715FL2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRRegisterUseSuggestedWeaponCallbackLNfortitemdescriptorTlogicR_100[0x10]; // 0x100 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x52D1687AL2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRUnregisterUseSuggestedWeaponCallbackLNintR_110[0x10]; // 0x110 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_120[0x38]; // 0x120 (0x38)

	/* Functions */

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R 0x7219f7c)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRUnregisterUseSuggestedWeaponCallbackLNintR(int64_t& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R 0x5321a70)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRRegisterUseSuggestedWeaponCallbackLNfortitemdescriptorTlogicR(); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R 0x5321a60)
	unsigned char L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRIsWeaponEquippedLNfortitemdescriptorR(struct FVerseAIBase_fort_item_descriptor& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R 0x5321a50)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRGetWeaponDescriptorLNfortitemdescriptorR(struct FVerseAIBase_fort_item_descriptor& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon 0x7219f74)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRGetCurrentWeapon(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems 0x5321a40)
	struct TArray<struct FVerseAIBase_fort_item_descriptor> L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRGetAllItems(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R 0x5321a30)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNREquipWeaponLNfortitemdescriptorR(struct FVerseAIBase_fort_item_descriptor& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R 0x5321a20)
	unsigned char L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRDropItemLNfortitemdescriptorR(struct FVerseAIBase_fort_item_descriptor& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R 0x5321a10)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortinventoryinterfaceNRAddItemToInventoryLNfortinventoryitemassetMNintR(struct Ftuple_Lfort__inventory__item__asset_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_inventory_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

