// VerseClass /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component
// Size: 0x378
class UVerseNPC_npc_component : public UVerseAIBase_ai_component
{
	unsigned char unreflected_e0[0x278]; // 0xe0 (0x278) 
	class UVerseEngine_subscribable_event* verse0xE0E8A985CurrentThreatChangedEventInternal; // 0x358 (0x8)
	class UVerseEngine_subscribable_event* verse0x12343732CurrentThreatStatusChangedEventInternal; // 0x360 (0x8)
	class UVerseEngine_subscribable_event* verse0xB7573589ObstacleChangedEventInternal; // 0x368 (0x8)
	class UVerseEngine_subscribable_event* verse0x1F8E9B61BestObjectToLootChangedEventInternal; // 0x370 (0x8)
	unsigned char verse0x30C16AC0L2fFortnite2ecom2fAI2fVerseAIBase2ffortaimovementinterfaceNRGetCurrentDestination_310[0x10]; // 0x310 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB3598294NavigateToLNnavigationtargetMNnavigationrequestparametersR_320[0x10]; // 0x320 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xCB653246L2fFortnite2ecom2fAI2fVerseAIBase2ffortaimovementinterfaceNRStopNavigation_330[0x10]; // 0x330 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x075D6F58L2fFortnite2ecom2fAI2fVerseAIBase2ffortlootperceptioninterfaceNRBestObjectTolootChangedEvent_2d0[0x10]; // 0x2d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6C1D2881L2fFortnite2ecom2fAI2fVerseAIBase2ffortlootperceptioninterfaceNRGetBestObjectToLoot_2c0[0x10]; // 0x2c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x7421E7C0AttackObstacleLNfortobstacleinfoR_220[0x10]; // 0x220 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x276F9F03AttackThreatLNfortthreatinfoR_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA043FAF9IdleLNfloatR_1c0[0x10]; // 0x1c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1d0[0x20]; // 0x1d0 (0x20) 
	unsigned char verse0xC907A4E0LookAtLNvector3R_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3C8F838BLootObjectLNfortlootinfoR_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9765CB04PlayRandomEmote_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE661986AReviveLNfortcharacterR_1e0[0x10]; // 0x1e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE4D0BB73Crouch_130[0x10]; // 0x130 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_140[0x30]; // 0x140 (0x30) 
	unsigned char verse0x91E44EAAJump_170[0x10]; // 0x170 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x514829C1MoveInRangeToAttack_120[0x10]; // 0x120 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_130[0x80]; // 0x130 (0x80) 
	unsigned char verse0xBF43B604L2fFortnite2ecom2fAI2fVerseAIBase2ffortnpcmovementinterfaceNRResetLeash_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA16334B2RoamAroundLNnavigationrequestparametersR_110[0x10]; // 0x110 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_120[0x80]; // 0x120 (0x80) 
	unsigned char verse0x66BC399FL2fFortnite2ecom2fAI2fVerseAIBase2ffortnpcmovementinterfaceNRSetLeashPositionLNvector3MNfloatMNfloatR_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD27C8306Slide_180[0x10]; // 0x180 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x19F8ABA1Sprint_150[0x10]; // 0x150 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_160[0x30]; // 0x160 (0x30) 
	unsigned char verse0xB8336456L2fFortnite2ecom2fAI2fVerseAIBase2ffortnpcmovementinterfaceNRStandUp_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xCB7DDA42TacticalSprint_160[0x10]; // 0x160 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD59E8F01Walk_140[0x10]; // 0x140 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_150[0x150]; // 0x150 (0x150) 
	unsigned char verse0x47C9249EL2fFortnite2ecom2fAI2fVerseAIBase2ffortobstacleperceptioninterfaceNRGetObstacleInfo_2a0[0x10]; // 0x2a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE7FD7E10L2fFortnite2ecom2fAI2fVerseAIBase2ffortobstacleperceptioninterfaceNRObstacleChangedEvent_2b0[0x10]; // 0x2b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xFCAF49DCL2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRCurrentThreatChangedEvent_280[0x10]; // 0x280 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x49668C09L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRCurrentThreatStatusChangedEvent_290[0x10]; // 0x290 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x83990954L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRForgetThreatLNfortthreatinfoR_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x4EF5F14AL2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRGetCurrentThreatInfo_230[0x10]; // 0x230 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_240[0x20]; // 0x240 (0x20) 
	unsigned char verse0x37601346L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRGetOrCreateThreatInfoLNfortcharacterMNlogicR_260[0x10]; // 0x260 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x265EC7F8L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRGetThreatInfoLNfortcharacterR_250[0x10]; // 0x250 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x77D2ED1EL2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRGetThreatsInfo_240[0x10]; // 0x240 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_250[0x90]; // 0x250 (0x90) 
	unsigned char verse0x96D81014L2fFortnite2ecom2fAI2fVerseAIBase2ffortweaponactionsinterfaceNRFire_2e0[0x10]; // 0x2e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_2f0[0x10]; // 0x2f0 (0x10) 
	unsigned char verse0x3B37FA9BL2fFortnite2ecom2fAI2fVerseAIBase2ffortweaponactionsinterfaceNRMeleeAttack_300[0x10]; // 0x300 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x48209BC3L2fFortnite2ecom2fAI2fVerseAIBase2ffortweaponactionsinterfaceNRReload_2f0[0x10]; // 0x2f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_300[0x78]; // 0x300 (0x78)

	/* Functions */

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.Walk (Has no native function)
	class UConcurrency_task* Walk(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.TacticalSprint (Has no native function)
	class UConcurrency_task* TacticalSprint(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__ai__movement__interface_N_RStopNavigation (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__ai__movement__interface_N_RStopNavigation 0x5318e10)
	enum VerseAIBase_action_result L2fFortnite2ecom2fAI2fVerseAIBase2ffortaimovementinterfaceNRStopNavigation(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__npc__movement__interface_N_RStandUp (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__npc__movement__interface_N_RStandUp 0x72129fc)
	enum VerseAIBase_action_result L2fFortnite2ecom2fAI2fVerseAIBase2ffortnpcmovementinterfaceNRStandUp(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.Sprint (Has no native function)
	class UConcurrency_task* Sprint(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.Slide (Has no native function)
	class UConcurrency_task* Slide(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__npc__movement__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__npc__movement__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R 0x72129f4)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortnpcmovementinterfaceNRSetLeashPositionLNvector3MNfloatMNfloatR(struct Ftuple_Lvector3_Mfloat_Mfloat_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.RoamAround_L_Nnavigation__request__parameters_R (Has no native function)
	void RoamAroundLNnavigationrequestparametersR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, ); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.Revive_L_Nfort__character_R (Has no native function)
	class UConcurrency_task* ReviveLNfortcharacterR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, class UObject*& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__npc__movement__interface_N_RResetLeash (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__npc__movement__interface_N_RResetLeash 0x72129ec)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortnpcmovementinterfaceNRResetLeash(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload 0x7212a3c)
	unsigned char L2fFortnite2ecom2fAI2fVerseAIBase2ffortweaponactionsinterfaceNRReload(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.PlayRandomEmote (Has no native function)
	class UConcurrency_task* PlayRandomEmote(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fAI2fVerseAIBase2ffortobstacleperceptioninterfaceNRObstacleChangedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.NavigateTo_L_Nnavigation__target_M_Nnavigation__request__parameters_R (Has no native function)
	class UConcurrency_task* NavigateToLNnavigationtargetMNnavigationrequestparametersR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_Lnavigation__target_M_QNavigationParameters_Nnavigation__request__parameters_20_3d_20_2e_2e_2e_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.MoveInRangeToAttack (Has no native function)
	class UConcurrency_task* MoveInRangeToAttack(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack 0x7212a34)
	unsigned char L2fFortnite2ecom2fAI2fVerseAIBase2ffortweaponactionsinterfaceNRMeleeAttack(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.LootObject_L_Nfort__loot__info_R (Has no native function)
	class UConcurrency_task* LootObjectLNfortlootinfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FVerseAIBase_fort_loot_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.LookAt_L_Nvector3_R (Has no native function)
	class UConcurrency_task* LookAtLNvector3R(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FSpatialMath_vector3& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.Jump (Has no native function)
	class UConcurrency_task* Jump(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.Idle_L_Nfloat_R (Has no native function)
	class UConcurrency_task* IdleLNfloatR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, double& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatsInfo (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatsInfo 0x5318e20)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRGetThreatsInfo(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatInfo_L_Nfort__character_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatInfo_L_Nfort__character_R 0x7212a24)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRGetThreatInfoLNfortcharacterR(class UObject*& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetOrCreateThreatInfo_L_Nfort__character_M_Nlogic_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetOrCreateThreatInfo_L_Nfort__character_M_Nlogic_R 0x7212a1c)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRGetOrCreateThreatInfoLNfortcharacterMNlogicR(struct Ftuple_Lfort__character_Mlogic_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo 0x7212a04)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortobstacleperceptioninterfaceNRGetObstacleInfo(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo 0x7212a14)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRGetCurrentThreatInfo(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__ai__movement__interface_N_RGetCurrentDestination (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__ai__movement__interface_N_RGetCurrentDestination 0x5318e00)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortaimovementinterfaceNRGetCurrentDestination(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot 0x72129e4)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortlootperceptioninterfaceNRGetBestObjectToLoot(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R 0x7212a0c)
	void L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRForgetThreatLNfortthreatinfoR(struct FVerseAIBase_fort_threat_info& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire (Underlying native function: _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire 0x7212a2c)
	unsigned char L2fFortnite2ecom2fAI2fVerseAIBase2ffortweaponactionsinterfaceNRFire(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRCurrentThreatStatusChangedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fAI2fVerseAIBase2ffortthreatperceptioninterfaceNRCurrentThreatChangedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.Crouch (Has no native function)
	class UConcurrency_task* Crouch(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent (Has no native function)
	class UObject* L2fFortnite2ecom2fAI2fVerseAIBase2ffortlootperceptioninterfaceNRBestObjectTolootChangedEvent(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.AttackThreat_L_Nfort__threat__info_R (Has no native function)
	class UConcurrency_task* AttackThreatLNfortthreatinfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FVerseAIBase_fort_threat_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.AttackObstacle_L_Nfort__obstacle__info_R (Has no native function)
	class UConcurrency_task* AttackObstacleLNfortobstacleinfoR(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct FVerseAIBase_fort_obstacle_info& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_npc_component.$InitCDO (Has no native function)
	void $InitCDO(class UVerseEngine_subscribable_event*& $ExprResult0, uint64_t& $InstancingGraph1, class UVerseEngine_subscribable_event*& $ExprResult2, uint64_t& $InstancingGraph3, class UVerseEngine_subscribable_event*& $ExprResult4, uint64_t& $InstancingGraph5, class UVerseEngine_subscribable_event*& $ExprResult6, uint64_t& $InstancingGraph7); // (HasDefaults)
};

