// VerseClass /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai
// Size: 0x1a0
class UVerseArchetypes_template_ai : public UVerseAIBase_ai_behavior
{
	double verse0xFB573059InitialHealth; // 0x110 (0x8)
	double verse0x058B2B11InitialShield; // 0x118 (0x8)
	class UDiagnostics_log* verse0xF524C2ACLogger; // 0x120 (0x8)
	unsigned char verse0x4222121EDebugDisplay; // 0x128 (0x1)
	unsigned char unreflected_129[0x7]; // 0x129 (0x7) 
	struct FColors_color verse0x71320F52DebugScreenColor; // 0x130 (0x18)
	double verse0x2D4D6684DebugScreenDuration; // 0x148 (0x8)
	unsigned char verse0xA21D77C6L2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNRLogAndDisplayOnScreenLNKcharR_150[0x10]; // 0x150 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x536AA531L2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNROnDamageLNanyRNvoid_160[0x10]; // 0x160 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x83F8AFB5L2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNROnDamageLNdamageresultR_170[0x10]; // 0x170 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3D5496FCL2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNROnHealedLNanyRNvoid_180[0x10]; // 0x180 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8ED40B58L2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNROnHealedLNhealingresultR_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)

	/* Functions */

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai._L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2ftemplate__ai_N_ROnHealed_L_Nhealing__result_R (Has no native function)
	void L2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNROnHealedLNhealingresultR(struct FGame_healing_result& verse0xB2CDDD72Argument, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai._L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2ftemplate__ai_N_ROnHealed_L_Nany_R_Nvoid (Has no native function)
	void L2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNROnHealedLNanyRNvoid(); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai._L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2ftemplate__ai_N_ROnDamage_L_Ndamage__result_R (Has no native function)
	void L2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNROnDamageLNdamageresultR(struct FGame_damage_result& verse0xB2CDDD72Argument, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai._L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2ftemplate__ai_N_ROnDamage_L_Nany_R_Nvoid (Has no native function)
	void L2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNROnDamageLNanyRNvoid(); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai.OnBegin (Has no native function)
	class UConcurrency_task* OnBegin(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai._L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2ftemplate__ai_N_RLogAndDisplayOnScreen_L_N_Kchar_R (Has no native function)
	void L2fFortnite2ecom2fAI2fVerseArchetypes2ftemplateaiNRLogAndDisplayOnScreenLNKcharR(); // (Public | HasDefaults | BlueprintCallable)

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseArchetypes/_Verse/VNI/VerseArchetypes.VerseArchetypes_template_ai.$InitCDO (Has no native function)
	void $InitCDO(class UDiagnostics_log*& $ExprResult0, uint64_t& $InstancingGraph1); // (HasDefaults)
};

