// VerseClass /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component
// Size: 0x130
class UVGameplayRst_Transform_rotation_component : public UEntityActorRotationComponent
{
	unsigned char unreflected_90[0x10]; // 0x90 (0x10) 
	unsigned char verse0xFF3DE201L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRApplyAdditionalRotationLNrotationR_a0[0x10]; // 0xa0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8EB6E346L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRSetForwardVectorFromXYLNvector3MNvector3R_b0[0x10]; // 0xb0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x23A37F37L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRSetRotationLNrotationR_90[0x10]; // 0x90 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_a0[0x30]; // 0xa0 (0x30) 
	unsigned char verse0xB949A9F7L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRForwardVector_d0[0x10]; // 0xd0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_e0[0x10]; // 0xe0 (0x10) 
	unsigned char verse0x8320D012L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRightVector_f0[0x10]; // 0xf0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9112A39DL2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRotation_c0[0x10]; // 0xc0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_d0[0x10]; // 0xd0 (0x10) 
	unsigned char verse0x9DD169CDL2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRUpVector_e0[0x10]; // 0xe0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_f0[0x40]; // 0xf0 (0x40)

	/* Functions */

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRUpVector(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetRotation_L_Nrotation_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetRotation_L_Nrotation_R 0x707f888)
	void L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRSetRotationLNrotationR(struct FVerseRotation& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetForwardVectorFromXY_L_Nvector3_M_Nvector3_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetForwardVectorFromXY_L_Nvector3_M_Nvector3_R 0x707f880)
	void L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRSetForwardVectorFromXYLNvector3MNvector3R(struct Ftuple_Lvector3_Mvector3_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRotation (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRotation 0x707f8a8)
	struct FVerseRotation L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRotation(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRightVector(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRForwardVector(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RApplyAdditionalRotation_L_Nrotation_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RApplyAdditionalRotation_L_Nrotation_R 0x707f878)
	void L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRApplyAdditionalRotationLNrotationR(struct FVerseRotation& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Transform_rotation_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

