// VerseClass /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component
// Size: 0x130
class UVGameplayRst_Geometry_fixed_mesh_component : public UEntityActorStaticMeshRenderComponent
{
	unsigned char unreflected_a8[0x70]; // 0xa8 (0x70) 
	unsigned char verse0xAEB3C75BL2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRIsVisible_118[0x10]; // 0x118 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3AE27127L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetAsRootComponentLNlogicMNlogicR_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x2CD00368L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetDefaultStaticMeshLNdefaultmeshtypeR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x265158B6L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetEnableCollisionLNcollisiontypeR_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_d8[0x10]; // 0xd8 (0x10) 
	unsigned char verse0x64535383L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetMaterialLNmaterialR_e8[0x10]; // 0xe8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xD0BC9610L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetMaterialAtIndexLNmaterialMNintR_f8[0x10]; // 0xf8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB4297053L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetStaticMeshLNstaticmeshR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b8[0x50]; // 0xb8 (0x50) 
	unsigned char verse0x774D897AL2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetVisibilityLNlogicR_108[0x10]; // 0x108 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_118[0x18]; // 0x118 (0x18)

	/* Functions */

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component._L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetVisibility_L_Nlogic_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetVisibility_L_Nlogic_R 0x709dd60)
	void L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetVisibilityLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component._L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetStaticMesh_L_Nstatic__mesh_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetStaticMesh_L_Nstatic__mesh_R 0x709dd58)
	void L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetStaticMeshLNstaticmeshR(class UAssets_static_mesh*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component._L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMaterialAtIndex_L_Nmaterial_M_Nint_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMaterialAtIndex_L_Nmaterial_M_Nint_R 0x709dd48)
	void L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetMaterialAtIndexLNmaterialMNintR(struct Ftuple_Lmaterial_Mint_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component._L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMaterial_L_Nmaterial_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMaterial_L_Nmaterial_R 0x709dd50)
	void L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetMaterialLNmaterialR(class UAssets_material*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component._L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetEnableCollision_L_Ncollision__type_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetEnableCollision_L_Ncollision__type_R 0x709dd40)
	void L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetEnableCollisionLNcollisiontypeR(enum VGameplayRst_Geometry_collision_type& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component._L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetDefaultStaticMesh_L_Ndefault__mesh__type_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetDefaultStaticMesh_L_Ndefault__mesh__type_R 0x709dd38)
	void L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetDefaultStaticMeshLNdefaultmeshtypeR(enum VGameplayRst_Geometry_default_mesh_type& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component._L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetAsRootComponent_L_Nlogic_M_Nlogic_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetAsRootComponent_L_Nlogic_M_Nlogic_R 0x709dd30)
	void L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRSetAsRootComponentLNlogicMNlogicR(struct Ftuple_Llogic_Mlogic_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component._L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RIsVisible (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RIsVisible 0x709dd28)
	unsigned char L2fVerse2eorg2fVGameplayRst2fGeometry2ffixedmeshcomponentNRIsVisible(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

