// VerseClass /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model
// Size: 0xd8
class UVGameplayRst_GameObjects_immutable_model : public UObject
{
	class UVerseEngine_Entity_entity* verse0xC79F2B5DInternalObject; // 0x28 (0x8)
	class UVGameplayRst_Physics_collision_component* verse0x42159B8DCollisionComp; // 0x30 (0x8)
	class UVGameplayRst_Geometry_fixed_mesh_component* verse0xA6788863MeshComp; // 0x38 (0x8)
	class UVGameplayRst_Transform_position_component* verse0x325D2C22PositionComp; // 0x40 (0x8)
	class UVGameplayRst_Transform_rotation_component* verse0xF3C6D2D3RotationComp; // 0x48 (0x8)
	class UVGameplayRst_Transform_scale_component* verse0x1A7B631AScaleComp; // 0x50 (0x8)
	unsigned char verse0x20322D5CL2fVerse2eorg2fVGameplayRst2fGameObjects2fimmutablemodelNRGetTransform_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xDA03C5FAL2fVerse2eorg2fVGameplayRst2fGameObjects2fimmutablemodelNRIsVisible_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x03717667L2fVerse2eorg2fVGameplayRst2fTransform2fpositionableNRGetPosition_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB949A9F7L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRForwardVector_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8320D012L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRightVector_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9112A39DL2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRotation_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9DD169CDL2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRUpVector_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x44D08A7CL2fVerse2eorg2fVGameplayRst2fTransform2fscalableNRGetScale_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)

	/* Functions */

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRUpVector(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRotation (Has no native function)
	struct FVerseRotation L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRotation(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRightVector(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fimmutable__model_N_RIsVisible (Has no native function)
	unsigned char L2fVerse2eorg2fVGameplayRst2fGameObjects2fimmutablemodelNRIsVisible(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fimmutable__model_N_RGetTransform (Has no native function)
	struct FSpatialMath_transform L2fVerse2eorg2fVGameplayRst2fGameObjects2fimmutablemodelNRGetTransform(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2fscalableNRGetScale(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2fpositionableNRGetPosition(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRForwardVector(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model.$Block (Has no native function)
	void $Block(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_immutable_model.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

