// VerseClass /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component
// Size: 0x138
class UVGameplayRst_Lights_point_light_component : public UPointLightComponentBase
{
	unsigned char unreflected_98[0x90]; // 0x98 (0x90) 
	unsigned char verse0xDB46ECDBL2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetAttenuationRadius_128[0x10]; // 0x128 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xF750F02EL2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetColor_f8[0x10]; // 0xf8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xBB77601FL2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetIntensity_e8[0x10]; // 0xe8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_f8[0x20]; // 0xf8 (0x20) 
	unsigned char verse0xAF04BD6CL2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetSourceLength_118[0x10]; // 0x118 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x17473B69L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetSourceRadius_108[0x10]; // 0x108 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9A3F991FL2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetAttenuationRadiusLNfloatR_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB1A2B2B7L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetColorLNcolorR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xBF80146BL2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetIntensityLNfloatR_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_a8[0x20]; // 0xa8 (0x20) 
	unsigned char verse0x071FF47DL2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetSourceLengthLNfloatR_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x484B18A8L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetSourceRadiusLNfloatR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_c8[0x70]; // 0xc8 (0x70)

	/* Functions */

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetSourceRadius_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetSourceRadius_L_Nfloat_R 0x709de28)
	void L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetSourceRadiusLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetSourceLength_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetSourceLength_L_Nfloat_R 0x709de20)
	void L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetSourceLengthLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetIntensity_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetIntensity_L_Nfloat_R 0x709de18)
	void L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetIntensityLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetColor_L_Ncolor_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetColor_L_Ncolor_R 0x709de10)
	void L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetColorLNcolorR(struct FColors_color& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetAttenuationRadius_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetAttenuationRadius_L_Nfloat_R 0x709de08)
	void L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRSetAttenuationRadiusLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetSourceRadius (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetSourceRadius 0x709de00)
	double L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetSourceRadius(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetSourceLength (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetSourceLength 0x709ddf8)
	double L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetSourceLength(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetIntensity (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetIntensity 0x709ddf0)
	double L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetIntensity(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetColor (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetColor 0x709dde8)
	struct FColors_color L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetColor(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetAttenuationRadius (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetAttenuationRadius 0x709dde0)
	double L2fVerse2eorg2fVGameplayRst2fLights2fpointlightcomponentNRGetAttenuationRadius(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_point_light_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

