// VerseClass /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component
// Size: 0x2c8
class UVGameplayRst_Physics_collision_component : public UEntityActorCollisionComponent
{
	unsigned char unreflected_100[0xd0]; // 0x100 (0xd0) 
	unsigned char verse0x8F6AA2E3L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetCollisionProfileName_1d0[0x10]; // 0x1d0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1e0[0xb0]; // 0x1e0 (0xb0) 
	unsigned char verse0xBBF48134L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetCollisionShapeMode_290[0x10]; // 0x290 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB37F8890L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetEnabled_120[0x10]; // 0x120 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_130[0x40]; // 0x130 (0x40) 
	unsigned char verse0xA8BC7475L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetGravityEnabled_170[0x10]; // 0x170 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_180[0x70]; // 0x180 (0x70) 
	unsigned char verse0x68E48A7AL2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetMovable_1f0[0x10]; // 0x1f0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x6E928C19L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetSendHitEventsOnCollide_190[0x10]; // 0x190 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1a0[0x10]; // 0x1a0 (0x10) 
	unsigned char verse0x6016499EL2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetSendOverlapEvents_1b0[0x10]; // 0x1b0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1c0[0x50]; // 0x1c0 (0x50) 
	unsigned char verse0x38201582L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetUseContinuousCollisionDetection_210[0x10]; // 0x210 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_220[0x40]; // 0x220 (0x40) 
	unsigned char verse0x41241E63L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetBoxCollisionShapeModeLNvector3R_260[0x10]; // 0x260 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE4563361L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetCapsuleCollisionShapeModeLNfloatMNfloatR_270[0x10]; // 0x270 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x651477CFL2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetCollisionProfileNameLNKcharR_1c0[0x10]; // 0x1c0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1d0[0x60]; // 0x1d0 (0x60) 
	unsigned char verse0xEBE5EE12L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetCustomDegreeOfFreedomConstrainLNvector3R_230[0x10]; // 0x230 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x44E41EDEL2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetDegreeOfFreedomContraintLNdofmovementmodeR_220[0x10]; // 0x220 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x568A1965L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetEnabledLNlogicR_110[0x10]; // 0x110 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_120[0x40]; // 0x120 (0x40) 
	unsigned char verse0xE41FB43EL2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetGravityEnabledLNlogicR_160[0x10]; // 0x160 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_170[0xe0]; // 0x170 (0xe0) 
	unsigned char verse0xF2C2DBA0L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetMeshCollisionShapeModeLNstaticmeshR_250[0x10]; // 0x250 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x12565597L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetMeshCollisionShapeMode_240[0x10]; // 0x240 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xC63A047CL2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetMovableLNlogicR_1e0[0x10]; // 0x1e0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x29A50530L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetSendHitEventsOnCollideLNlogicR_180[0x10]; // 0x180 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_190[0x10]; // 0x190 (0x10) 
	unsigned char verse0xB20B50B9L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetSendOverlapEventsLNlogicR_1a0[0x10]; // 0x1a0 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_1b0[0xd0]; // 0x1b0 (0xd0) 
	unsigned char verse0x236A1AA6L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetSphereCollisionShapeModeLNfloatR_280[0x10]; // 0x280 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x83693EA8L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetUseContinuousCollisionDetectionLNlogicR_200[0x10]; // 0x200 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x0947A18AWaitBeginOverlap_140[0x10]; // 0x140 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xCE395CCBWaitEndOverlap_150[0x10]; // 0x150 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE0DC0F6AWaitHit_130[0x10]; // 0x130 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_140[0x188]; // 0x140 (0x188)

	/* Functions */

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component.WaitHit (Has no native function)
	class UConcurrency_task* WaitHit(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component.WaitEndOverlap (Has no native function)
	class UConcurrency_task* WaitEndOverlap(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component.WaitBeginOverlap (Has no native function)
	class UConcurrency_task* WaitBeginOverlap(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R 0x709df40)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetUseContinuousCollisionDetectionLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R 0x709df38)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetSphereCollisionShapeModeLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R 0x709df30)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetSendOverlapEventsLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R 0x709df28)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetSendHitEventsOnCollideLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R 0x709df20)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetMovableLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode 0x709df18)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetMeshCollisionShapeMode(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nstatic__mesh_R 0x709df10)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetMeshCollisionShapeModeLNstaticmeshR(class UAssets_static_mesh*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R 0x709df08)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetGravityEnabledLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R 0x709dd68)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetEnabledLNlogicR(unsigned char& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R 0x709df00)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetDegreeOfFreedomContraintLNdofmovementmodeR(enum VGameplayRst_Physics_dof_movement_mode& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R 0x709def8)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetCustomDegreeOfFreedomConstrainLNvector3R(struct FSpatialMath_vector3& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R 0x709def0)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetCollisionProfileNameLNKcharR(); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R 0x709dee8)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetCapsuleCollisionShapeModeLNfloatMNfloatR(struct Ftuple_Lfloat_Mfloat_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R 0x709dee0)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRSetBoxCollisionShapeModeLNvector3R(struct FSpatialMath_vector3& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection 0x709ded8)
	unsigned char L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetUseContinuousCollisionDetection(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents 0x709ded0)
	unsigned char L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetSendOverlapEvents(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide 0x709dec8)
	unsigned char L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetSendHitEventsOnCollide(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable 0x709dec0)
	unsigned char L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetMovable(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled 0x709deb8)
	unsigned char L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetGravityEnabled(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled 0x709deb0)
	unsigned char L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetEnabled(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode 0x709dea8)
	enum VGameplayRst_Physics_collision_shape_mode L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetCollisionShapeMode(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component._L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName 0x709dea0)
	void L2fVerse2eorg2fVGameplayRst2fPhysics2fcollisioncomponentNRGetCollisionProfileName(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_collision_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

