// VerseClass /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component
// Size: 0x130
class UVGameplayRst_Components_dynamic_activation_component : public UEntityDynamicActivationComponent
{
	unsigned char verse0x281F1350L2fVerse2eorg2fVGameplayRst2fComponents2fdynamicactivationcomponentNRBeginTransitionLNfloatMNactivationstateR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_c8[0x10]; // 0xc8 (0x10) 
	unsigned char verse0x053E5642L2fVerse2eorg2fVGameplayRst2fComponents2fdynamicactivationcomponentNRLinkComponentLNcomponentR_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB04BDE6CL2fVerse2eorg2fVGameplayRst2fComponents2fdynamicactivationcomponentNRReset_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_d8[0x10]; // 0xd8 (0x10) 
	unsigned char verse0x0CBA748CL2fVerse2eorg2fVGameplayRst2fComponents2fdynamicactivationcomponentNRUnlinkComponentLNcomponentR_e8[0x10]; // 0xe8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA7099383WaitForTransitionBegin_f8[0x10]; // 0xf8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x25AD5386WaitForTransitionComplete_108[0x10]; // 0x108 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_118[0x18]; // 0x118 (0x18)

	/* Functions */

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component.WaitForTransitionComplete (Has no native function)
	class UConcurrency_task* WaitForTransitionComplete(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component.WaitForTransitionBegin (Has no native function)
	class UConcurrency_task* WaitForTransitionBegin(class UConcurrency_task*& verse0xC1E81372CallingTask, int64_t& verse0xA3A00DDBCallerResumeState, int64_t& verse0x2AC0E4D8CallerCancelState, struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component._L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RUnlinkComponent_L_Ncomponent_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RUnlinkComponent_L_Ncomponent_R 0x709dc40)
	void L2fVerse2eorg2fVGameplayRst2fComponents2fdynamicactivationcomponentNRUnlinkComponentLNcomponentR(class UEntityComponent*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component._L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RReset (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RReset 0x709dc38)
	void L2fVerse2eorg2fVGameplayRst2fComponents2fdynamicactivationcomponentNRReset(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component._L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RLinkComponent_L_Ncomponent_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RLinkComponent_L_Ncomponent_R 0x709dc30)
	void L2fVerse2eorg2fVGameplayRst2fComponents2fdynamicactivationcomponentNRLinkComponentLNcomponentR(class UEntityComponent*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component._L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RBeginTransition_L_Nfloat_M_Nactivation__state_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RBeginTransition_L_Nfloat_M_Nactivation__state_R 0x709dc28)
	void L2fVerse2eorg2fVGameplayRst2fComponents2fdynamicactivationcomponentNRBeginTransitionLNfloatMNactivationstateR(struct Ftuple_Lfloat_Mactivation__state_R& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

