// VerseClass /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model
// Size: 0x188
class UVGameplayRst_GameObjects_model : public UObject
{
	class UVerseEngine_Entity_entity* verse0xC79F2B5DInternalObject; // 0x28 (0x8)
	class UVGameplayRst_Physics_collision_component* verse0x42159B8DCollisionComp; // 0x30 (0x8)
	class UVGameplayRst_Geometry_fixed_mesh_component* verse0xA6788863MeshComp; // 0x38 (0x8)
	class UVGameplayRst_Transform_position_component* verse0x325D2C22PositionComp; // 0x40 (0x8)
	class UVGameplayRst_Transform_rotation_component* verse0xF3C6D2D3RotationComp; // 0x48 (0x8)
	class UVGameplayRst_Transform_scale_component* verse0x1A7B631AScaleComp; // 0x50 (0x8)
	unsigned char verse0x048467CDL2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRDestroy_58[0x10]; // 0x58 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x4B7F2FFBL2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRDisableCollision_68[0x10]; // 0x68 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x208AE447L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNREnableCollision_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA178E855L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRGetTransform_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x18521038L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRHide_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xA7F38BA4L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRIsVisible_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xBCE4A2FFL2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRSetTransformLNtransformR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x168833B8L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRShow_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xFF83FBB4L2fVerse2eorg2fVGameplayRst2fTransform2fmutablepositionableNRSetPositionLNvector3R_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xFF3DE201L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRApplyAdditionalRotationLNrotationR_e8[0x10]; // 0xe8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8EB6E346L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRSetForwardVectorFromXYLNvector3MNvector3R_f8[0x10]; // 0xf8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x23A37F37L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRSetRotationLNrotationR_108[0x10]; // 0x108 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE0EAAB2EL2fVerse2eorg2fVGameplayRst2fTransform2fmutablescalableNRSetScaleLNvector3R_118[0x10]; // 0x118 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x03717667L2fVerse2eorg2fVGameplayRst2fTransform2fpositionableNRGetPosition_128[0x10]; // 0x128 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xB949A9F7L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRForwardVector_138[0x10]; // 0x138 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x8320D012L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRightVector_148[0x10]; // 0x148 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9112A39DL2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRotation_158[0x10]; // 0x158 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9DD169CDL2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRUpVector_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x44D08A7CL2fVerse2eorg2fVGameplayRst2fTransform2fscalableNRGetScale_178[0x10]; // 0x178 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)

	/* Functions */

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRUpVector(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fmodel_N_RShow (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRShow(struct Ftuple_L_R& verse0xB2CDDD72Argument, class UVGameplayRst_Geometry_fixed_mesh_component*& verse0x000000002, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fmodel_N_RSetTransform_L_Ntransform_R (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRSetTransformLNtransformR(struct FSpatialMath_transform& verse0xB2CDDD72Argument, class UVGameplayRst_Transform_position_component*& verse0x000000002, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fTransform2fmutablescalableNRSetScaleLNvector3R(struct FSpatialMath_vector3& verse0xB2CDDD72Argument, class UVGameplayRst_Transform_scale_component*& verse0x000000001, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetRotation_L_Nrotation_R (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRSetRotationLNrotationR(struct FVerseRotation& verse0xB2CDDD72Argument, class UVGameplayRst_Transform_rotation_component*& verse0x000000001, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fTransform2fmutablepositionableNRSetPositionLNvector3R(struct FSpatialMath_vector3& verse0xB2CDDD72Argument, class UVGameplayRst_Transform_position_component*& verse0x000000001, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetForwardVectorFromXY_L_Nvector3_M_Nvector3_R (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRSetForwardVectorFromXYLNvector3MNvector3R(struct Ftuple_Lvector3_Mvector3_R& verse0xB2CDDD72Argument, class UVGameplayRst_Transform_rotation_component*& verse0x000000001, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRotation (Has no native function)
	struct FVerseRotation L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRotation(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRRightVector(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fmodel_N_RIsVisible (Has no native function)
	unsigned char L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRIsVisible(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fmodel_N_RHide (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRHide(struct Ftuple_L_R& verse0xB2CDDD72Argument, class UVGameplayRst_Geometry_fixed_mesh_component*& verse0x000000002, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fmodel_N_RGetTransform (Has no native function)
	struct FSpatialMath_transform L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRGetTransform(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2fscalableNRGetScale(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2fpositionableNRGetPosition(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector (Has no native function)
	struct FSpatialMath_vector3 L2fVerse2eorg2fVGameplayRst2fTransform2frotatableNRForwardVector(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Public | HasOutParms | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fmodel_N_REnableCollision (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNREnableCollision(struct Ftuple_L_R& verse0xB2CDDD72Argument, class UVGameplayRst_Physics_collision_component*& verse0x000000001, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fmodel_N_RDisableCollision (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRDisableCollision(struct Ftuple_L_R& verse0xB2CDDD72Argument, class UVGameplayRst_Physics_collision_component*& verse0x000000001, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fGameObjects_2fmodel_N_RDestroy (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fGameObjects2fmodelNRDestroy(struct Ftuple_L_R& verse0xB2CDDD72Argument, class UVerseEngine_Entity_entity*& verse0x000000002, unsigned char& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model._L_2fVerse_2eorg_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RApplyAdditionalRotation_L_Nrotation_R (Has no native function)
	void L2fVerse2eorg2fVGameplayRst2fTransform2fmutablerotatableNRApplyAdditionalRotationLNrotationR(struct FVerseRotation& verse0xB2CDDD72Argument, class UVGameplayRst_Transform_rotation_component*& verse0x000000001, enum EVerseTrue& $InvokeSureResultDummy0, ); // (Public | HasDefaults | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model.$Block (Has no native function)
	void $Block(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects_model.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

