// VerseClass /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component
// Size: 0x178
class UVGameplayRst_Lights_spot_light_component : public USpotLightComponentBase
{
	unsigned char unreflected_98[0xd0]; // 0x98 (0xd0) 
	unsigned char verse0x4CCAEE72L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetAttenuationRadius_168[0x10]; // 0x168 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x350D4D79L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetColor_118[0x10]; // 0x118 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_128[0x20]; // 0x128 (0x20) 
	unsigned char verse0x3B2B6CF2L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetInnerConeAngle_148[0x10]; // 0x148 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xCC357273L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetIntensity_108[0x10]; // 0x108 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_118[0x40]; // 0x118 (0x40) 
	unsigned char verse0xFA0CD9F7L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetOuterConeAngle_158[0x10]; // 0x158 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9FEF472BL2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetSourceLength_138[0x10]; // 0x138 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x27ACC12EL2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetSourceRadius_128[0x10]; // 0x128 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xC8795B59L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetAttenuationRadiusLNfloatR_f8[0x10]; // 0xf8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x3BE532EFL2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetColorLNcolorR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_b8[0x20]; // 0xb8 (0x20) 
	unsigned char verse0x1745B220L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetInnerConeAngleLNfloatR_d8[0x10]; // 0xd8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xFEA85A42L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetIntensityLNfloatR_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_a8[0x40]; // 0xa8 (0x40) 
	unsigned char verse0x5BBD4CD5L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetOuterConeAngleLNfloatR_e8[0x10]; // 0xe8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xE1894C44L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetSourceLengthLNfloatR_c8[0x10]; // 0xc8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xAEDDA091L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetSourceRadiusLNfloatR_b8[0x10]; // 0xb8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_c8[0xb0]; // 0xc8 (0xb0)

	/* Functions */

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetSourceRadius_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetSourceRadius_L_Nfloat_R 0x709de98)
	void L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetSourceRadiusLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetSourceLength_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetSourceLength_L_Nfloat_R 0x709de90)
	void L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetSourceLengthLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetOuterConeAngle_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetOuterConeAngle_L_Nfloat_R 0x709de88)
	void L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetOuterConeAngleLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetIntensity_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetIntensity_L_Nfloat_R 0x709de80)
	void L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetIntensityLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetInnerConeAngle_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetInnerConeAngle_L_Nfloat_R 0x709de78)
	void L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetInnerConeAngleLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetColor_L_Ncolor_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetColor_L_Ncolor_R 0x709de70)
	void L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetColorLNcolorR(struct FColors_color& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetAttenuationRadius_L_Nfloat_R (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RSetAttenuationRadius_L_Nfloat_R 0x709de68)
	void L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRSetAttenuationRadiusLNfloatR(double& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetSourceRadius (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetSourceRadius 0x709de60)
	double L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetSourceRadius(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetSourceLength (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetSourceLength 0x709de58)
	double L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetSourceLength(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetOuterConeAngle (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetOuterConeAngle 0x709de50)
	double L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetOuterConeAngle(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetIntensity (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetIntensity 0x709de48)
	double L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetIntensity(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetInnerConeAngle (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetInnerConeAngle 0x709de40)
	double L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetInnerConeAngle(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetColor (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetColor 0x709de38)
	struct FColors_color L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetColor(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component._L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetAttenuationRadius (Underlying native function: _L_2fVerse_2eorg_2fVGameplayRst_2fLights_2fspot__light__component_N_RGetAttenuationRadius 0x709de30)
	double L2fVerse2eorg2fVGameplayRst2fLights2fspotlightcomponentNRGetAttenuationRadius(struct Ftuple_L_R& verse0xB2CDDD72Argument); // (Native | Public | HasOutParms | BlueprintCallable)

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component.$Block (Has no native function)
	void $Block(); // ()

	// Function /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Lights_spot_light_component.$InitCDO (Has no native function)
	void $InitCDO(); // ()
};

