// Class /Script/HeadMountedDisplay.VRNotificationsComponent
// Size: 0x150
class UVRNotificationsComponent : public UActorComponent
{
	struct FMulticastInlineDelegate HMDTrackingInitializingAndNeedsHMDToBeTrackedDelegate; // 0xa0 (0x10)
	struct FMulticastInlineDelegate HMDTrackingInitializedDelegate; // 0xb0 (0x10)
	struct FMulticastInlineDelegate HMDRecenteredDelegate; // 0xc0 (0x10)
	struct FMulticastInlineDelegate HMDLostDelegate; // 0xd0 (0x10)
	struct FMulticastInlineDelegate HMDReconnectedDelegate; // 0xe0 (0x10)
	struct FMulticastInlineDelegate HMDConnectCanceledDelegate; // 0xf0 (0x10)
	struct FMulticastInlineDelegate HMDPutOnHeadDelegate; // 0x100 (0x10)
	struct FMulticastInlineDelegate HMDRemovedFromHeadDelegate; // 0x110 (0x10)
	struct FMulticastInlineDelegate VRControllerRecenteredDelegate; // 0x120 (0x10)
	struct FMulticastInlineDelegate XRTrackingOriginChangedDelegate; // 0x130 (0x10)
	struct FMulticastInlineDelegate XRPlayAreaChangedDelegate; // 0x140 (0x10)
};

