// Class /Script/FortniteGame.WeaponHitNotifyAudioBank
// Size: 0x90
class UWeaponHitNotifyAudioBank : public UDataAsset
{
	class USoundBase* SoundBody; // 0x30 (0x8)
	class USoundBase* SoundCrit; // 0x38 (0x8)
	class USoundBase* SoundShield; // 0x40 (0x8)
	class USoundBase* SoundDeath; // 0x48 (0x8)
	class USoundBase* SoundDeathCrit; // 0x50 (0x8)
	class USoundBase* SoundBodyReceive; // 0x58 (0x8)
	class USoundBase* SoundShieldReceive; // 0x60 (0x8)
	class USoundBase* SoundCritReceive; // 0x68 (0x8)
	class USoundBase* SoundDeathReceive; // 0x70 (0x8)
	class USoundBase* SoundDeathCritReceive; // 0x78 (0x8)
	class USoundBase* SoundFallReceive; // 0x80 (0x8)
	class USoundBase* SoundFallDeathReceive; // 0x88 (0x8)
};

