// Class /Script/UMG.WidgetBlueprintGeneratedClass
// Size: 0x400
class UWidgetBlueprintGeneratedClass : public UBlueprintGeneratedClass
{
	class UWidgetTree* WidgetTree; // 0x380 (0x8)
	struct TArray<class UWidgetBlueprintGeneratedClassExtension*> Extensions; // 0x388 (0x10)
	struct TArray<struct FFieldNotificationId> FieldNotifyNames; // 0x398 (0x10)
	unsigned char unreflected_3a8[0x4]; // 0x3a8 (0x4) 
	unsigned char bClassRequiresNativeTick; // 0x3ac (0x1)
	unsigned char unreflected_3ad[0x3]; // 0x3ad (0x3) 
	struct TArray<struct FDelegateRuntimeBinding> Bindings; // 0x3b0 (0x10)
	struct TArray<class UWidgetAnimation*> Animations; // 0x3c0 (0x10)
	struct TArray<struct FName> NamedSlots; // 0x3d0 (0x10)
	struct TArray<struct FName> AvailableNamedSlots; // 0x3e0 (0x10)
	struct TArray<struct FName> InstanceNamedSlots; // 0x3f0 (0x10)
};

