// AnimBlueprintGeneratedClass /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C
// Size: 0x5770
class UWolfRidingPlayerLayerAnimBP_C : public UFortVehicleLayerAnimInstance_Riding
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0xac0 (0x8)
	struct FAnimBlueprintGeneratedMutableData AnimBlueprintMutables; // 0xac8 (0xa8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionPropertyAccess; // 0xb70 (0x8)
	struct FAnimSubsystemInstance* AnimBlueprintExtensionBase; // 0xb78 (0x8)
	struct FAnimNode_Root AnimGraphNodeRoot4; // 0xb80 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose6; // 0xba0 (0xc0)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone6; // 0xc60 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone5; // 0xd88 (0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace1; // 0xeb0 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace1; // 0xed0 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer9; // 0xef0 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive5; // 0xf60 (0xc8)
	struct FAnimNode_Root AnimGraphNodeRoot3; // 0x1028 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose5; // 0x1048 (0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose2; // 0x1108 (0x100)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNodeLocalToComponentSpace; // 0x1208 (0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNodeComponentToLocalSpace; // 0x1228 (0x20)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool17; // 0x1248 (0x48)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone4; // 0x1290 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone3; // 0x13b8 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone2; // 0x14e0 (0x128)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone1; // 0x1608 (0x128)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult62; // 0x1730 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult61; // 0x1758 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult60; // 0x1780 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult59; // 0x17a8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult58; // 0x17d0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult57; // 0x17f8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult56; // 0x1820 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult55; // 0x1848 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult54; // 0x1870 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult53; // 0x1898 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult52; // 0x18c0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult51; // 0x18e8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult50; // 0x1910 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult49; // 0x1938 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult48; // 0x1960 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult47; // 0x1988 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult46; // 0x19b0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult45; // 0x19d8 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer43; // 0x1a00 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer42; // 0x1a48 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool16; // 0x1a90 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult41; // 0x1ad8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer41; // 0x1af8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer40; // 0x1b40 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool15; // 0x1b88 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult40; // 0x1bd0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer39; // 0x1bf0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer38; // 0x1c38 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool14; // 0x1c80 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer37; // 0x1cc8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool13; // 0x1d10 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult39; // 0x1d58 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer36; // 0x1d78 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult38; // 0x1dc0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer35; // 0x1de0 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer8; // 0x1e28 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive4; // 0x1e98 (0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool12; // 0x1f60 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer34; // 0x1fa8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult37; // 0x1ff0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer33; // 0x2010 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult36; // 0x2058 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult44; // 0x2078 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult43; // 0x20a0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult42; // 0x20c8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult41; // 0x20f0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult40; // 0x2118 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult39; // 0x2140 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult38; // 0x2168 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult37; // 0x2190 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer32; // 0x21b8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult35; // 0x2200 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer31; // 0x2220 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult34; // 0x2268 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer30; // 0x2288 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult33; // 0x22d0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer29; // 0x22f0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult32; // 0x2338 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult36; // 0x2358 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine9; // 0x2380 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult31; // 0x2448 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer28; // 0x2468 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult30; // 0x24b0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer27; // 0x24d0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult29; // 0x2518 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer26; // 0x2538 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult28; // 0x2580 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult35; // 0x25a0 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine8; // 0x25c8 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult27; // 0x2690 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer25; // 0x26b0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool11; // 0x26f8 (0x48)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult34; // 0x2740 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult33; // 0x2768 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer24; // 0x2790 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult26; // 0x27d8 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose2; // 0x27f8 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult25; // 0x2808 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine7; // 0x2828 (0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive3; // 0x28f0 (0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer23; // 0x29b8 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool10; // 0x2a00 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer7; // 0x2a48 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive2; // 0x2ab8 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer6; // 0x2b80 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult24; // 0x2bf0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer22; // 0x2c10 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult23; // 0x2c58 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine6; // 0x2c78 (0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend1; // 0x2d40 (0xe0)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose5; // 0x2e20 (0x28)
	struct FAnimNode_Inertialization AnimGraphNodeInertialization; // 0x2e48 (0x100)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace2; // 0x2f48 (0x118)
	struct FAnimNode_LayeredBoneBlend AnimGraphNodeLayeredBoneBlend; // 0x3060 (0xe0)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult32; // 0x3140 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult31; // 0x3168 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult30; // 0x3190 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose4; // 0x31b8 (0x28)
	struct FAnimNode_StateResult AnimGraphNodeStateResult22; // 0x31e0 (0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer5; // 0x3200 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult21; // 0x3270 (0x20)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose3; // 0x3290 (0x28)
	struct FAnimNode_StateResult AnimGraphNodeStateResult20; // 0x32b8 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine5; // 0x32d8 (0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose1; // 0x33a0 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose2; // 0x34a0 (0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNodeSaveCachedPose; // 0x34c8 (0x100)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose1; // 0x35c8 (0x28)
	struct FAnimNode_UseCachedPose AnimGraphNodeUseCachedPose; // 0x35f0 (0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive1; // 0x3618 (0xd0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace1; // 0x36e8 (0x118)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult29; // 0x3800 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult28; // 0x3828 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult27; // 0x3850 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult26; // 0x3878 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult25; // 0x38a0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult24; // 0x38c8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult23; // 0x38f0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult22; // 0x3918 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult21; // 0x3940 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult20; // 0x3968 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult19; // 0x3990 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult18; // 0x39b8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult17; // 0x39e0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult16; // 0x3a08 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult15; // 0x3a30 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult14; // 0x3a58 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult13; // 0x3a80 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult12; // 0x3aa8 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer21; // 0x3ad0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer20; // 0x3b18 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool9; // 0x3b60 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult19; // 0x3ba8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer19; // 0x3bc8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer18; // 0x3c10 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool8; // 0x3c58 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult18; // 0x3ca0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer17; // 0x3cc0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult17; // 0x3d08 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer16; // 0x3d28 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool7; // 0x3d70 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer15; // 0x3db8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult16; // 0x3e00 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult11; // 0x3e20 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult10; // 0x3e48 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult9; // 0x3e70 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult8; // 0x3e98 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult7; // 0x3ec0 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult6; // 0x3ee8 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult5; // 0x3f10 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult4; // 0x3f38 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer14; // 0x3f60 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult15; // 0x3fa8 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer13; // 0x3fc8 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult14; // 0x4010 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer12; // 0x4030 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult13; // 0x4078 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer11; // 0x4098 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult12; // 0x40e0 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult3; // 0x4100 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine4; // 0x4128 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult11; // 0x41f0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer10; // 0x4210 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult10; // 0x4258 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer9; // 0x4278 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult9; // 0x42c0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer8; // 0x42e0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult8; // 0x4328 (0x20)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult2; // 0x4348 (0x28)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine3; // 0x4370 (0xc8)
	struct FAnimNode_StateResult AnimGraphNodeStateResult7; // 0x4438 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer7; // 0x4458 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult6; // 0x44a0 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer6; // 0x44c0 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer5; // 0x4508 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer4; // 0x4550 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool6; // 0x4598 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool5; // 0x45e0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult5; // 0x4628 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer3; // 0x4648 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult4; // 0x4690 (0x20)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer2; // 0x46b0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool4; // 0x46f8 (0x48)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer1; // 0x4740 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool3; // 0x4788 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer4; // 0x47d0 (0x70)
	struct FAnimNode_StateResult AnimGraphNodeStateResult3; // 0x4840 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine2; // 0x4860 (0xc8)
	struct FAnimNode_ModifyBone AnimGraphNodeModifyBone; // 0x4928 (0x128)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive1; // 0x4a50 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer3; // 0x4b18 (0x70)
	struct FAnimNode_ApplyAdditive AnimGraphNodeApplyAdditive; // 0x4b88 (0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer2; // 0x4c50 (0x70)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose1; // 0x4cc0 (0x10)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool2; // 0x4cd0 (0x48)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool1; // 0x4d18 (0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer1; // 0x4d60 (0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNodeBlendSpacePlayer; // 0x4dd0 (0x70)
	struct FAnimNode_BlendListByBool AnimGraphNodeBlendListByBool; // 0x4e40 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult2; // 0x4e88 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine1; // 0x4ea8 (0xc8)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult1; // 0x4f70 (0x28)
	struct FAnimNode_TransitionResult AnimGraphNodeTransitionResult; // 0x4f98 (0x28)
	struct FAnimNode_SequencePlayer AnimGraphNodeSequencePlayer; // 0x4fc0 (0x48)
	struct FAnimNode_StateResult AnimGraphNodeStateResult1; // 0x5008 (0x20)
	struct FAnimNode_RefPose AnimGraphNodeIdentityPose; // 0x5028 (0x10)
	struct FAnimNode_StateResult AnimGraphNodeStateResult; // 0x5038 (0x20)
	struct FAnimNode_StateMachine AnimGraphNodeStateMachine; // 0x5058 (0xc8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNodeApplyMeshSpaceAdditive; // 0x5120 (0xd0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNodeRotationOffsetBlendSpace; // 0x51f0 (0x118)
	struct FAnimNode_Root AnimGraphNodeRoot2; // 0x5308 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose4; // 0x5328 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose3; // 0x53e8 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot1; // 0x54a8 (0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose2; // 0x54c8 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose1; // 0x5588 (0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNodeLinkedInputPose; // 0x5648 (0xc0)
	struct FAnimNode_Root AnimGraphNodeRoot; // 0x5708 (0x20)
	bool StateRuleMovingIdle; // 0x5728 (0x1)
	bool StateRuleIdleMoving; // 0x5729 (0x1)
	bool IsJumping; // 0x572a (0x1)
	bool StateRuleFallIdle; // 0x572b (0x1)
	bool IsFalling; // 0x572c (0x1)
	bool StateRuleFallMoving; // 0x572d (0x1)
	bool StateRuleJumpLandMoving; // 0x572e (0x1)
	bool IsSurfaceSwimming; // 0x572f (0x1)
	bool StateRuleSwimIdleSwimLoco; // 0x5730 (0x1)
	unsigned char unreflected_5731[0x7]; // 0x5731 (0x7) 
	double BodyRoll; // 0x5738 (0x8)
	double WolfSpeed2D; // 0x5740 (0x8)
	bool IsBoosting; // 0x5748 (0x1)
	bool PlayLandAdditive; // 0x5749 (0x1)
	bool IsMovingBackwards; // 0x574a (0x1)
	bool ShouldPlayStopBackwards; // 0x574b (0x1)
	bool IsTurninginPlace; // 0x574c (0x1)
	unsigned char unreflected_574d[0x3]; // 0x574d (0x3) 
	double TurninPlaceAngleDelta; // 0x5750 (0x8)
	bool WasTurningRight; // 0x5758 (0x1)
	unsigned char unreflected_5759[0x7]; // 0x5759 (0x7) 
	double TurninPlaceRotationSpeed; // 0x5760 (0x8)
	double BackwardsPlayRate; // 0x5768 (0x8)

	/* Functions */

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleFinalPoseOverride (Has no native function)
	void VehicleFinalPoseOverride(struct FPoseLink& InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleFullBodyOverride (Has no native function)
	void VehicleFullBodyOverride(struct FPoseLink& InPoseFullBody, struct FPoseLink& VehicleFullBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleLowerBodyOverride (Has no native function)
	void VehicleLowerBodyOverride(struct FPoseLink& InPoseLowerBodyDefault, struct FPoseLink& InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleSplitBodyOverride (Has no native function)
	void VehicleSplitBodyOverride(struct FPoseLink& InPoseSplitBody, struct FPoseLink& InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace& TurnInPlace, struct FPoseLink& InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // (HasOutParms | BlueprintCallable)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimGraph (Has no native function)
	void AnimGraph(struct FPoseLink& AnimGraph); // (HasOutParms | BlueprintCallable | BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.GetMainAnimBPData_Wolf (Has no native function)
	void GetMainAnimBPDataWolf(class UObject*& AnimInstance, class UGrandma_AnimBP_C*& K2NodeDynamicCastAsGrandmaAnimBP, bool& K2NodeDynamicCastbSuccess, bool& CallFuncIsValidReturnValue, double& K2NodeVariableSetBackwardsPlayRateImplicitCast, double& K2NodeVariableSetBodyRollImplicitCast, double& K2NodeVariableSetTurninPlaceRotationSpeedImplicitCast, double& K2NodeVariableSetTurninPlaceAngleDeltaImplicitCast, double& K2NodeVariableSetWolfSpeed2DImplicitCast); // (Public | BlueprintCallable | BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_0A1EFC344EF1A6E586A54FAEC4F5F766 (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphWolfRidingPlayerLayerAnimBPAnimGraphNodeSequencePlayer0A1EFC344EF1A6E586A54FAEC4F5F766(); // (BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_4EDCD4F04E8D5963547EB2BE1F10FA2D (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphWolfRidingPlayerLayerAnimBPAnimGraphNodeSequencePlayer4EDCD4F04E8D5963547EB2BE1F10FA2D(); // (BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D7C43EB141CFE2929E3D23914954FA93 (Has no native function)
	void EvaluateGraphExposedInputsExecuteUbergraphWolfRidingPlayerLayerAnimBPAnimGraphNodeBlendListByBoolD7C43EB141CFE2929E3D23914954FA93(); // (BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.BlueprintCollectRidableAnimBPData (Has no native function)
	void BlueprintCollectRidableAnimBPData(class UAnimInstance*& RidableAnimInstance); // (Event | Protected | BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.UpdateBoostPlayRate (Has no native function)
	void UpdateBoostPlayRate(); // (Event | Protected | BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.PlaceHandIKTargets (Has no native function)
	void PlaceHandIKTargets(); // (Event | Protected | BlueprintEvent)

	// Function /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.ExecuteUbergraph_WolfRidingPlayerLayerAnimBP (Has no native function)
	void ExecuteUbergraphWolfRidingPlayerLayerAnimBP(int& EntryPoint, bool& CallFuncGreaterDoubleDoubleReturnValue, double& CallFuncDivideDoubleDoubleReturnValue, class UAnimInstance*& K2NodeEventRidableAnimInstance, double& CallFuncMapRangeClampedReturnValue, float& K2NodeStructMemberSetFloatProperty24ImplicitCast, float& K2NodeStructMemberSetFloatProperty25ImplicitCast, float& K2NodeVariableSetBoostPlayRateImplicitCast); // (Final | 0x00008000)
};

