// Class /Script/FortniteGame.WorldTheme
// Size: 0x258
class UWorldTheme : public UDataAsset
{
	struct TArray<struct FTileGroupSelection> TileGroups; // 0x30 (0x10)
	class UWorldTileGroup* FillerTileGroup; // 0x40 (0x8)
	int MaxCircuitSize; // 0x48 (0x4)
	unsigned char unreflected_4c[0x4]; // 0x4c (0x4) 
	struct TWeakObjectPtr<class UWorld> BorderWorldI; // 0x50 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldIO; // 0x78 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldO; // 0xa0 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldOO; // 0xc8 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldOOO; // 0xf0 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldOOOO; // 0x118 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldS; // 0x140 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldSS; // 0x168 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldOS; // 0x190 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldSO; // 0x1b8 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldSOO; // 0x1e0 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldU; // 0x208 (0x28)
	struct TWeakObjectPtr<class UWorld> BorderWorldR; // 0x230 (0x28)
};

