// Class /Script/Engine.World
// Size: 0x8c8
class UWorld : public UObject
{
	unsigned char unreflected_28[0x8]; // 0x28 (0x8) 
	class ULevel* PersistentLevel; // 0x30 (0x8)
	class UNetDriver* NetDriver; // 0x38 (0x8)
	class ULineBatchComponent* LineBatcher; // 0x40 (0x8)
	class ULineBatchComponent* PersistentLineBatcher; // 0x48 (0x8)
	class ULineBatchComponent* ForegroundLineBatcher; // 0x50 (0x8)
	class AGameNetworkManager* NetworkManager; // 0x58 (0x8)
	class UPhysicsCollisionHandler* PhysicsCollisionHandler; // 0x60 (0x8)
	struct TArray<class UObject*> ExtraReferencedObjects; // 0x68 (0x10)
	struct TArray<class UObject*> PerModuleDataObjects; // 0x78 (0x10)
	struct TArray<class ULevelStreaming*> StreamingLevels; // 0x88 (0x10)
	struct FStreamingLevelsToConsider StreamingLevelsToConsider; // 0x98 (0x28)
	class AServerStreamingLevelsVisibility* ServerStreamingLevelsVisibility; // 0xc0 (0x8)
	struct FString StreamingLevelsPrefix; // 0xc8 (0x10)
	unsigned char unreflected_d8[0x8]; // 0xd8 (0x8) 
	class ULevel* CurrentLevelPendingVisibility; // 0xe0 (0x8)
	class ULevel* CurrentLevelPendingInvisibility; // 0xe8 (0x8)
	class UDemoNetDriver* DemoNetDriver; // 0xf0 (0x8)
	class AParticleEventManager* MyParticleEventManager; // 0xf8 (0x8)
	class APhysicsVolume* DefaultPhysicsVolume; // 0x100 (0x8)
	unsigned char unreflected_108[0x36]; // 0x108 (0x36) 
	unsigned char bAreConstraintsDirty; // 0x13e (0x1)
	unsigned char unreflected_13f[0x9]; // 0x13f (0x9) 
	class UNavigationSystemBase* NavigationSystem; // 0x148 (0x8)
	class AGameModeBase* AuthorityGameMode; // 0x150 (0x8)
	class AGameStateBase* GameState; // 0x158 (0x8)
	class UAISystemBase* AISystem; // 0x160 (0x8)
	class UAvoidanceManager* AvoidanceManager; // 0x168 (0x8)
	struct TArray<class ULevel*> Levels; // 0x170 (0x10)
	struct TArray<struct FLevelCollection> LevelCollections; // 0x180 (0x10)
	unsigned char unreflected_190[0x28]; // 0x190 (0x28) 
	class UGameInstance* OwningGameInstance; // 0x1b8 (0x8)
	struct TArray<class UMaterialParameterCollectionInstance*> ParameterCollectionInstances; // 0x1c0 (0x10)
	class UCanvas* CanvasForRenderingToTarget; // 0x1d0 (0x8)
	class UCanvas* CanvasForDrawMaterialToRenderTarget; // 0x1d8 (0x8)
	unsigned char unreflected_1e0[0x70]; // 0x1e0 (0x70) 
	class UPhysicsFieldComponent* PhysicsField; // 0x250 (0x8)
	uint32_t LWILastAssignedUID; // 0x258 (0x4)
	unsigned char unreflected_25c[0x4]; // 0x25c (0x4) 
	struct TSet<class UActorComponent*> ComponentsThatNeedPreEndOfFrameSync; // 0x260 (0x50)
	struct TArray<class UActorComponent*> ComponentsThatNeedEndOfFrameUpdate; // 0x2b0 (0x10)
	struct TArray<class UActorComponent*> ComponentsThatNeedEndOfFrameUpdateOnGameThread; // 0x2c0 (0x10)
	unsigned char unreflected_2d0[0x428]; // 0x2d0 (0x428) 
	class UWorldComposition* WorldComposition; // 0x6f8 (0x8)
	class UContentBundleManager* ContentBundleManager; // 0x700 (0x8)
	unsigned char unreflected_708[0xa8]; // 0x708 (0xa8) 
	struct FWorldPSCPool PSCPool; // 0x7b0 (0x58)
	unsigned char padding_808[0xc0]; // 0x808 (0xc0)

	/* Functions */

	// Function /Script/Engine.World.K2_GetWorldSettings (Underlying native function: K2_GetWorldSettings 0x9fd3ebc)
	class AWorldSettings* K2GetWorldSettings(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/Engine.World.HandleTimelineScrubbed (Underlying native function: HandleTimelineScrubbed 0x9fd3ea8)
	void HandleTimelineScrubbed(); // (Final | Native | Public)
};

