// WidgetBlueprintGeneratedClass /Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C
// Size: 0x358
class UXpBarToolTip_C : public UCommonUserWidget
{
	class UCommonTextBlock* CommonTextBlock0; // 0x290 (0x8)
	class UCommonTextBlock* CommonTextBlock2; // 0x298 (0x8)
	class UCommonTextBlock* CommonTextBlock29; // 0x2a0 (0x8)
	class UCommonTextBlock* CommonTextBlock30; // 0x2a8 (0x8)
	class UCommonTextBlock* CommonTextBlock31; // 0x2b0 (0x8)
	class UImage* Image0; // 0x2b8 (0x8)
	class UImage* Image1; // 0x2c0 (0x8)
	class UImage* Image2; // 0x2c8 (0x8)
	class UImage* Image3; // 0x2d0 (0x8)
	class UImage* Image5; // 0x2d8 (0x8)
	struct FText HeaderText; // 0x2e0 (0x18)
	struct FText CommanderXPText; // 0x2f8 (0x18)
	struct FText BoostXPText; // 0x310 (0x18)
	struct FText RestedXPText; // 0x328 (0x18)
	struct FText BodyText; // 0x340 (0x18)

	/* Functions */

	// Function /Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C.GetBodyText (Has no native function)
	struct FText GetBodyText(); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent | BlueprintPure)

	// Function /Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C.GetRestedXPText (Has no native function)
	struct FText GetRestedXPText(); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent | BlueprintPure)

	// Function /Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C.GetBoostXPText (Has no native function)
	struct FText GetBoostXPText(); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent | BlueprintPure)

	// Function /Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C.GetCommanderXPText (Has no native function)
	struct FText GetCommanderXPText(); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent | BlueprintPure)

	// Function /Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C.GetHeaderText (Has no native function)
	struct FText GetHeaderText(); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent | BlueprintPure)
};

